{
    "PageTitle": "car (traffic behavior view)",
    "FuncDef": "The car command configures traffic policing in a traffic behavior.\nThe undo car command deletes traffic policing from a traffic behavior. The car command configures traffic policing in a traffic behavior. The undo car command deletes traffic policing from a traffic behavior. By default, traffic policing is not configured in a traffic behavior. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "undo car",
        "car { cir <cir-value> [ kbps | mbps | gbps ] [ pir <pir-value> [ kbps | mbps | gbps ] ] } [ cbs <cbs-value> [ bytes | kbytes | mbytes ] pbs <pbs-value> [ bytes | kbytes | mbytes ] ] [ share ] [ mode { color-blind | color-aware } ] [ greenpass [ service-class <class> color <color> ] | yellow { discard | pass [ service-class <class> color <color> ] } | red { discard | pass [ service-class <class> color <color> ] } ]"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "cir <cir-value>",
            "Info": "Specifies the committed information rate (CIR), which is the guaranteed average transmission rate.\nThe value is an integer in the range from 24 to 400000000."
        },
        {
            "Parameters": "kbps",
            "Info": "Indicates that the rate is expressed in kbit/s.\n-"
        },
        {
            "Parameters": "mbps",
            "Info": "Indicates that the rate is expressed in Mbit/s.\n-"
        },
        {
            "Parameters": "gbps",
            "Info": "Indicates that the rate is expressed in Gbit/s.\n-"
        },
        {
            "Parameters": "pir <pir-value>",
            "Info": "Specifies the peak information rate (PIR), which is the maximum rate of traffic that can pass through an interface.\nThe value is an integer that ranges from 1 to 400000000."
        },
        {
            "Parameters": "cbs <cbs-value>",
            "Info": "Specifies the committed burst size (CBS), which is the average volume of burst traffic that can pass through an interface.\nThe value is an integer that ranges from 1 to 33554432."
        },
        {
            "Parameters": "bytes",
            "Info": "Indicates that the CBS is expressed in bytes.\n-"
        },
        {
            "Parameters": "kbytes",
            "Info": "Indicates that the CBS is expressed in kbytes.\n-"
        },
        {
            "Parameters": "mbytes",
            "Info": "Indicates that the CBS is expressed in mbytes.\n-"
        },
        {
            "Parameters": "pbs <pbs-value>",
            "Info": "Specifies the peak burst size (PBS), which is the maximum volume of burst traffic that can pass through an interface.\nThe value is an integer that ranges from 1 to 33554432."
        },
        {
            "Parameters": "share",
            "Info": "Indicates the level-1 shared CAR. If a traffic behavior is bound to a traffic classifier that contains multiple matching rules, all traffic matching the traffic classifier is restricted by the level-1 shared CAR.\n-"
        },
        {
            "Parameters": "mode",
            "Info": "Specifies the color mode for traffic policing.\n-"
        },
        {
            "Parameters": "color-blind",
            "Info": "Specifies the color-blind mode. In color-blind mode, the original packet color does not affect the traffic policing action.\n-"
        },
        {
            "Parameters": "green",
            "Info": "Specifies the action taken for packets if the packet rate is less than or equal to the CIR value.\nThe default value is pass."
        },
        {
            "Parameters": "pass",
            "Info": "Allows packets to pass through.\n-"
        },
        {
            "Parameters": "yellow",
            "Info": "Specifies the action taken for packets if the packet rate is greater than the CIR value and less than or equal to the PIR value.\nThe default value is pass."
        },
        {
            "Parameters": "discard",
            "Info": "Discards packets.\n-"
        },
        {
            "Parameters": "red",
            "Info": "Specifies the action taken for packets if the packet rate is greater than the PIR value.\nThe default value is discard."
        },
        {
            "Parameters": "color-aware",
            "Info": "Specifies the color-aware mode. In color-aware mode, the original packet color affects the traffic policing action.\n-"
        },
        {
            "Parameters": "service-class <class>",
            "Info": "Specifies the class of service (CoS).\nAssured Forwarding (AF): applies to key data services that require guaranteed bandwidth and low delay. Provides forwarding quality assurance for the traffic that does not exceed the bandwidth limit, and lowers the CoS for the traffic that exceeds the bandwidth limit and forwards the traffic instead of discarding the traffic.Best-Effort (BE): applies to best-effort services that do not require strict QoS guarantee. BE focuses only on reachability and does not have any requirements on other aspects. For example, traditional IP packet transmission is in BE mode.Expedited Forwarding (EF): indicates the highest QoS on a DiffServ network. It is used for services with low packet loss rate, low delay, and high bandwidth. In any case, the information traffic can obtain a rate equal to or higher than the configured rate.Class Selector (CS): indicates the class selection code. The CoS represented by CS is the same as that represented by IP Precedence.\nThe value can be af1, af2, af3, af4, be, cs6, cs7, or ef."
        },
        {
            "Parameters": "color <color>",
            "Info": "Specifies the color corresponding to the CoS.\nThe value can be:\nredgreenyellow"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier c1 type and",
            "[*HUAWEI-classifier-c1] if-match any",
            "[*HUAWEI-classifier-c1] quit",
            "[*HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] car cir 200000 kbps pir 2500000 kbps",
            "[*HUAWEI-behavior-b1] quit",
            "[*HUAWEI] traffic policy p1",
            "[*HUAWEI-trafficpolicy-p1] classifier c1 behavior b1",
            "[*HUAWEI-trafficpolicy-p1] quit",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] traffic-policy p1 inbound"
        ]
    ],
    "ExtraInfo": "Flow-based traffic policing controls traffic that matches traffic classification rules and discards the excess traffic to limit traffic within a proper range and to protect network resources.\nWhen data is sent from a high-speed link to a low-speed link, the bandwidth on the interface of the low-speed link is insufficient. As a result, a large number of packets are discarded. To solve this problem, configure traffic policing for outgoing traffic on the interface of the high-speed link. The interface then discards the packets whose rate exceeds the traffic policing rate so that the outgoing traffic rate is limited within a proper range. You can also configure traffic policing for incoming traffic on the interface of the low-speed link. The interface then discards the received packets whose rate exceeds the traffic policing rate.\nTraffic policing based on traffic policies controls rates of packets of different types."
}