{
    "PageTitle": "qos queue shaping",
    "FuncDef": "The qos queue shaping command enables traffic shaping for a queue on a specified interface and sets traffic shaping parameters.\nThe undo qos queue shaping command restores the default scheduling parameters of each queue on an interface. The qos queue shaping command enables traffic shaping for a queue on a specified interface and sets traffic shaping parameters. The undo qos queue shaping command restores the default scheduling parameters of each queue on an interface. The following table describes the default scheduling parameters on an interface.",
    "CLIs": [
        "qos queue <queue-index> shaping { percentcir <cir-percent-value> [ pir <pir-percent-value> ] | cir <cir-value> [ kbps | mbps | gbps ] [ cbs <cbs-value> [ bytes | kbytes | mbytes ] | pir <pir-value> [ kbps | mbps | gbps ] [ cbs <cbs-value> [ bytes | kbytes | mbytes ] pbs <pbs-value> [ bytes | kbytes | mbytes ] ] ] }",
        "undo qos queue <queue-index> shaping"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<queue-index>",
            "Info": "Specifies the queue index.\nThe value is an integer ranging from 0 to 7."
        },
        {
            "Parameters": "percent",
            "Info": "Specify the QoS queue shaping percent.\n-"
        },
        {
            "Parameters": "cir <cir-value>",
            "Info": "Specifies the absolute value of the committed information rate (CIR).\nThe value is an integer that ranges from 1 to 400000000."
        },
        {
            "Parameters": "cir <cir-percent-value>",
            "Info": "Specifies the percentage value of the CIR.\nThe value is an integer that ranges from 1 to 100. The default value is 100.\nThe CBS is calculated as follows: CBS = cir-percent-value x Maximum bandwidth of an interface x 8"
        },
        {
            "Parameters": "pir <pir-percent-value>",
            "Info": "Specifies the percentage value of the PIR.\nThe value is an integer that ranges from 1 to 100. The default value is 100, which is the same as cir-percent-value.\nThe PBS is calculated as follows: PBS = pir-percent-value x Maximum bandwidth of an interface x 8"
        },
        {
            "Parameters": "pir <pir-value>",
            "Info": "Specifies the absolute value of the peak information rate (PIR).\nThe value is an integer that ranges from 1 to 400000000."
        },
        {
            "Parameters": "kbps",
            "Info": "Indicates that the rate unit is kbit/s.\n-"
        },
        {
            "Parameters": "mbps",
            "Info": "Indicates that the rate unit is Mbit/s.\n-"
        },
        {
            "Parameters": "gbps",
            "Info": "Indicates that the rate unit is Gbit/s.\n-"
        },
        {
            "Parameters": "cbs <cbs-value>",
            "Info": "Specifies the absolute value of the committed burst size (CBS), which is the volume of committed burst traffic that can pass through an interface.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer that ranges from 1 to 8388608.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S:The value is an integer that ranges from 1 to 33554432."
        },
        {
            "Parameters": "bytes",
            "Info": "Indicates that the CBS is expressed in bytes.\n-"
        },
        {
            "Parameters": "kbytes",
            "Info": "Indicates that the CBS is expressed in Kbytes.\n-"
        },
        {
            "Parameters": "pbs <pbs-value>",
            "Info": "Specifies the absolute value of the peak burst size (PBS), which is the maximum volume of burst traffic that can pass through an interface.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer that ranges from 1 to 8388608.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S:The value is an integer that ranges from 1 to 33554432."
        },
        {
            "Parameters": "mbytes",
            "Info": "Indicates that the CBS is expressed in Mbytes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] qos queue 4 shaping cir 10000 kbps pir 20000 kbps"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] qos queue 4 shaping percent cir 50 pir 80"
        ]
    ],
    "ExtraInfo": "When the traffic rate of an interface on a downstream device is lower than that of the connected interface on the upstream device, traffic congestion may occur on the interface of the downstream device. You can configure traffic shaping for queues on the outbound interface of the upstream device and adjust the transmit rate of the interface.\nThe qos queue shaping command configures traffic shaping on packets of a specific service on an interface."
}