{
    "PageTitle": "bsr-policy",
    "FuncDef": "The bsr-policy command limits the range of valid bootstrap router (BSR) addresses, so that the Router discards messages received from the BSRs not in the specified address range, preventing BSR spoofing.\nThe undo bsr-policy command restores the default configuration. The bsr-policy command limits the range of valid bootstrap router (BSR) addresses, so that the Router discards messages received from the BSRs not in the specified address range, preventing BSR spoofing. The undo bsr-policy command restores the default configuration. By default, the range of valid BSR addresses is not limited, so that the Router considers messages received from all BSRs valid. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "bsr-policy { <basic-acl6-number> | acl6-name <acl6-name> }",
        "undo bsr-policy"
    ],
    "ParentView": [
        "IPv6 PIM view,VPN instance IPv6 PIM view"
    ],
    "ParaDef": [
        {
            "Parameters": "<basic-acl6-number>",
            "Info": "Specifies the number of a basic IPv6 ACL, which defines a policy for filtering BSR messages based on source addresses.\nThe value is an integer ranging from 2000 to 2999.\nThe value of this parameter must be the same as that of the acl6-number parameter specified in the acl ipv6 command."
        },
        {
            "Parameters": "acl6-name <acl6-name>",
            "Info": "Specifies the name of a named basic IPv6 ACL.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive).\nThe value of this parameter must be the same as that of the acl6-name parameter specified in the acl ipv6 command."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 name myacl6 basic",
            "[*HUAWEI-acl6-basic-myacl6] rule permit source 2001:DB8:2::2 64",
            "[*HUAWEI-acl6-basic-myacl6] quit",
            "[*HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] pim ipv6",
            "[*HUAWEI-pim6] bsr-policy acl6-name myacl6"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 2001",
            "[*HUAWEI-acl6-basic-2001] rule permit source 2001:DB8:2::2 64",
            "[*HUAWEI-acl6-basic-2001] quit",
            "[*HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] pim ipv6",
            "[*HUAWEI-pim] bsr-policy 2001"
        ]
    ],
    "ExtraInfo": ""
}