{
    "PageTitle": "c-rp policy (IPv6 PIM view)",
    "FuncDef": "The c-rp policy command limits the range of valid candidate-rendezvous point (C-RP) addresses and the range of multicast addresses served by a C-RP. The bootstrap router (BSR) drops C-RP messages that carry addresses not in the range of valid C-RP addresses.\nThe undo c-rp policy command restores the default configuration. The c-rp policy command limits the range of valid candidate-rendezvous point (C-RP) addresses and the range of multicast addresses served by a C-RP. The bootstrap router (BSR) drops C-RP messages that carry addresses not in the range of valid C-RP addresses. The undo c-rp policy command restores the default configuration. By default, the range of valid C-RP addresses and the range of multicast groups served by a C-RP are not limited. That is, the BSR considers all received C-RP messages valid. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "c-rp policy { <advanced-acl-number> | acl6-name <acl6-name> }",
        "undo c-rp policy"
    ],
    "ParentView": [
        "IPv6 PIM view,VPN instance IPv6 PIM view"
    ],
    "ParaDef": [
        {
            "Parameters": "<advanced-acl-number>",
            "Info": "Specifies the number of an advanced IPv6 ACL that defines the range of valid C-RP addresses and the range of groups served by a C-RP.\nThe value is an integer ranging from 3000 to 3999."
        },
        {
            "Parameters": "acl6-name <acl6-name>",
            "Info": "Specifies the name of a named IPv6 ACL.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported. The name must start with a letter or digit, and cannot contain only digits."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 name myacl6",
            "[*HUAWEI-acl6-advance-myacl6] rule permit ipv6 source 2001:db8:1::1 128 destination ff03::101 128",
            "[*HUAWEI-acl6-advance-myacl6] quit",
            "[*HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] pim ipv6",
            "[*HUAWEI-pim6] c-rp policy acl6-name myacl6"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 number 3100",
            "[*HUAWEI-acl6-advance-3100] rule permit ipv6 source 2001:db8:1::1 128 destination ff03::101 128",
            "[*HUAWEI-acl6-advance-3100] quit",
            "[*HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] pim ipv6",
            "[*HUAWEI-pim6] c-rp policy 3100"
        ]
    ],
    "ExtraInfo": ""
}