{
    "PageTitle": "display pim ipv6 routing-table (All views)",
    "FuncDef": "The display pim ipv6 routing-table command displays information about an IPv6 PIM routing table. The display pim ipv6 routing-table command displays information about an IPv6 PIM routing table. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display pim ipv6 { vpn-instance <vpn-instance-name> | all-instance } routing-table [ <groupAddr> [ mask <group-mask-length> ] | <srcAddr> [ mask <source-mask-length> ] | incoming-interface { { <iif-port-type> <iif-port-num> | <iif-port-name> } | register } | outgoing-interface { include | exclude | match } { { <oif-port-type> <oif-port-num> | <oif-port-name> } | register | none } | mode { ssm | sm } | flags { act | del | exprune | ext | loc | niif | nonbr | none | rpt | sg_rcvr | sgjoin | spt | swt | upchg | wc | excl } | fsm ] [ outgoing-interface-number [ <oif-number> ] ]",
        "display pim ipv6 { vpn-instance <vpn-instance-name> | all-instance } routing-table [ <groupAddr> [ mask <group-mask-length> ] ] { rpf-interface { <iif-port-type> <iif-port-num> | <iif-port-name> } } [ outgoing-interface { include | exclude | match } { { <oif-port-type> <oif-port-num> | <oif-port-name> } | none } | flags { wc | act | niif } | fsm ] [ outgoing-interface-number [ <oif-number> ] ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "all-instance",
            "Info": "Indicates all VPN instances.\n-"
        },
        {
            "Parameters": "<groupAddr>",
            "Info": "Specifies the IPv6 address of a multicast group.\nThe format is X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "mask <group-mask-length>",
            "Info": "Specifies the mask length of a multicast group.\nThe value is an integer that ranges from 0 to 128."
        },
        {
            "Parameters": "mask <source-mask-length>",
            "Info": "Specifies the mask length for a multicast source address.\nThe value is an integer. The mask length of the multicast source ranges from 0 to 128."
        },
        {
            "Parameters": "<srcAddr>",
            "Info": "Specifies the IPv6 address of a multicast source.\nThe format is X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "incoming-interface <iif-port-type> <iif-port-num>",
            "Info": "Displays the routing entry with a specified inbound interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "<iif-port-name>",
            "Info": "Displays the routing entry with a specified inbound interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "register",
            "Info": "Register interface.\n-"
        },
        {
            "Parameters": "outgoing-interface <oif-port-type> <oif-port-num>",
            "Info": "Displays the PIM routing entries with specified downstream interfaces.\nThe values of outgoing-interface are as follows:\nincludeexcludematch"
        },
        {
            "Parameters": "include",
            "Info": "Indicates all PIM routing entries that contain the specified outbound interface.\n-"
        },
        {
            "Parameters": "exclude",
            "Info": "Indicates all PIM routing entries that do not contain the specified outbound interface.\n-"
        },
        {
            "Parameters": "match",
            "Info": "Indicates the PIM routing entries that contain only the specified outbound interface.\n-"
        },
        {
            "Parameters": "<oif-port-name>",
            "Info": "Displays the PIM routing entries with specified downstream interfaces.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "none",
            "Info": "Indicates the PIM routing entry without the specified flag.\n-"
        },
        {
            "Parameters": "mode",
            "Info": "Indicates an IPv6 PIM mode.\n-"
        },
        {
            "Parameters": "ssm",
            "Info": "Displays routing entries of a specified source mode.\n-"
        },
        {
            "Parameters": "sm",
            "Info": "Displays routing entries in sparse mode.\n-"
        },
        {
            "Parameters": "flags",
            "Info": "Indicates the type of a routing entry.\nType of a routing entry:\nact: indicates that the multicast routing entry has received actual data.del: Multicast routing entries are to be deleted.exprune: indicates that the entry on the rendezvous point tree (RPT) is pruned and no receiver on the RPT is interested in the source.ext: indicates that a multicast routing entry contains the outbound interfaces contributed by other multicast routing protocols.loc: indicates the routing entry directly connected to the network segment of the multicast source.niif: indicates that the inbound interface of the multicast routing entry is not determined.nonbr: indicates that the upstream neighbor address (link-local address) towards the RP or source cannot be found.none: The outbound interface list is empty.rpt: indicates the routing entry on the RPT.sg_rcvr: indicates the local (S, G) receiver of S, and PIM is the owner of the downstream interface.sgjoin: The device is the local (S, G) receiver of S, but PIM is not the owner of the downstream interface.spt: indicates the routing entry on the SPT.swt: indicates the routing entry during the switchover to the SPT.upchg: indicates that the current entry is using the original upstream interface to forward data and is waiting for data to arrive from a new interface.wc: (*, G) entry;excl: indicates the (S, G) entry created when the device receives an IGMPv3 message in exclude mode.bgp: routing entries learned from Source Active A-D routes received by BGP;2bgp: BGP is ready to advertise Source Active A-D routes.frrchg: indicates that the current entry uses the backup upstream interface to forward data and is waiting for data from the master upstream interface."
        },
        {
            "Parameters": "act",
            "Info": "Indicates the multicast routing entry that has actual data.\n-"
        },
        {
            "Parameters": "del",
            "Info": "Indicates the multicast routes to be deleted.\n-"
        },
        {
            "Parameters": "exprune",
            "Info": "Routes which are ex-pruned.\n-"
        },
        {
            "Parameters": "ext",
            "Info": "Indicates the routing entry with one or more interfaces owned by other components.\n-"
        },
        {
            "Parameters": "loc",
            "Info": "Indicates the multicast routing entry on the directly connected network.\n-"
        },
        {
            "Parameters": "niif",
            "Info": "Indicates the routing entry without the inbound interface.\n-"
        },
        {
            "Parameters": "nonbr",
            "Info": "Indicates the neighbor mapping failure flag.\n-"
        },
        {
            "Parameters": "rpt",
            "Info": "Displays related routing information on the shared tree.\n-"
        },
        {
            "Parameters": "sg_rcvr",
            "Info": "Indicates the routes learned from (s, g) Aux Join messages.\n-"
        },
        {
            "Parameters": "sgjoin",
            "Info": "Routes with active (S, G) joins.\n-"
        },
        {
            "Parameters": "spt",
            "Info": "Displays routing information on the shortest path tree.\n-"
        },
        {
            "Parameters": "swt",
            "Info": "Indicates the routing entry that has been switched to the shortest path tree.\n-"
        },
        {
            "Parameters": "upchg",
            "Info": "Indicates the routing entry whose upstream interface is changed.\n-"
        },
        {
            "Parameters": "wc",
            "Info": "Indicates the routing entry with the wc flag.\n-"
        },
        {
            "Parameters": "excl",
            "Info": "Indicates the routing entry whose downstream interface is in the exclude state.\n-"
        },
        {
            "Parameters": "fsm",
            "Info": "Displays detailed information about the finite state machine (FSM).\n-"
        },
        {
            "Parameters": "outgoing-interface-number <oif-number>",
            "Info": "Displays the number of the outbound interfaces of IPv6 PIM routing entries.\n-"
        },
        {
            "Parameters": "rpf-interface",
            "Info": "Indicates the RPF interface of a PIM route.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display pim ipv6 all-instance routing-table mode sm outgoing-interface-number"
        ],
        [
            "<HUAWEI> display pim ipv6 all-instance routing-table backup-incoming-interface through-bgp"
        ],
        [
            "<HUAWEI> display pim ipv6 all-instance routing-table mode sm"
        ]
    ],
    "ExtraInfo": ""
}