{
    "PageTitle": "embedded-rp disable",
    "FuncDef": "The embedded-rp disable command disables the embedded-Rendezvous Point (RP) function.\nThe undo embedded-rp disable command enbles the embedded-RP function and restores the default setting. The embedded-rp disable command disables the embedded-Rendezvous Point (RP) function. The undo embedded-rp disable command enbles the embedded-RP function and restores the default setting. By default, the embedded-RP function is enabled and the default range of IPv6 multicast groups to which embedded-RP applies is FF70::/12. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "embedded-rp disable",
        "undo embedded-rp disable"
    ],
    "ParentView": [
        "IPv6 PIM view,VPN instance IPv6 PIM view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] pim ipv6",
            "[*HUAWEI-pim6] embedded-rp disable"
        ]
    ],
    "ExtraInfo": "Embedded-RP is a mode used by the router in the Any-Source Multicast (ASM) model to obtain an RP address, and is applicable to an IPv6 PIM-SM domain or between IPv6 PIM-SM domains. In this mode, an RP address is embedded in an IPv6 group address. When obtaining an IPv6 group address, the router can obtain the RP address to which the IPv6 group address corresponds. Embedded-RP allows IPv6 PIM-SM domains to learn RP information from each other even though Multicast Source Discovery Protocol (MSDP) does not support IPv6 networks.\nTo avoid inconsistent results of RP elections, an RP obtained in embedded-RP mode takes precedence over other RPs elected by using other mechanisms. The address range of IPv6 groups served by an RP obtained in embedded-RP mode is FF70::/12."
}