{
    "PageTitle": "spt-switch-threshold group-policy (IPv6)",
    "FuncDef": "The spt-switch-threshold group-policy command sets a multicast data forwarding rate threshold at which a receiver's designated router (DR) performs a switchover from the rendezvous point tree (RPT) to the shortest path tree (SPT).\nThe undo spt-switch-threshold group-policy command restores the default value. The spt-switch-threshold group-policy command sets a multicast data forwarding rate threshold at which a receiver's designated router (DR) performs a switchover from the rendezvous point tree (RPT) to the shortest path tree (SPT). The undo spt-switch-threshold group-policy command restores the default value. By default, a receiver's DR performs a switchover from the RPT to the SPT immediately after receiving the first multicast data packet. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "spt-switch-threshold <traffic-rate> group-policy { <basic-acl6-number> | acl6-name <acl6-name> } [ order <order-value> ]",
        "undo spt-switch-threshold [ <traffic-rate> ] group-policy { <basic-acl6-number> | acl6-name <acl6-name> }"
    ],
    "ParentView": [
        "IPv6 PIM view,VPN instance IPv6 PIM view"
    ],
    "ParaDef": [
        {
            "Parameters": "<traffic-rate>",
            "Info": "Specifies a multicast data forwarding rate threshold at which a receiver's DR performs a switchover from the RPT to the SPT.\nMulticast data forwarding rate = Number of multicast data bytes received in a period/Duration of the period (the duration can be specified using the timer spt-switch command).\nWhen the multicast data forwarding rate exceeds traffic-rate, the system performs a switchover from the RPT to the SPT. After the switchover is complete, the system does not switch traffic back to the RPT any more.\nThe value is an integer ranging from 1 to 4194304, in kbit/s."
        },
        {
            "Parameters": "<basic-acl6-number>",
            "Info": "Specify a basic ACL6.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "acl6-name <acl6-name>",
            "Info": "Specifies the name of a named basic IPv6 ACL.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported. The name must start with a letter or digit, and cannot contain only digits."
        },
        {
            "Parameters": "order <order-value>",
            "Info": "Specifies the order of an IPv6 ACL in the group policy.\nIf a multicast group matches more than one IPv6 ACL, the system determines the threshold to be used based on order-value of the IPv6 ACLs.\nThe value is an integer and is any value other than original one in the current group-policy list. If this parameter is not specified, the original IPv6 ACL order is used."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 2010",
            "[*HUAWEI-acl6-basic-2010] rule permit source ff02:: 96",
            "[*HUAWEI-acl6-basic-2010] quit",
            "[*HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] pim ipv6",
            "[*HUAWEI-pim6] spt-switch-threshold 100 group-policy 2010 order 1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 name myacl6 basic",
            "[*HUAWEI-acl6-basic-myacl6] rule permit source ff03::101 128",
            "[*HUAWEI-acl6-basic-myacl6] quit",
            "[*HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] pim ipv6",
            "[*HUAWEI-pim6] spt-switch-threshold 100 group-policy acl6-name myacl6 order 1"
        ]
    ],
    "ExtraInfo": ""
}