{
    "PageTitle": "spt-switch-threshold infinity group-policy",
    "FuncDef": "The spt-switch-threshold infinity group-policy command configures the range of multicast groups so that a DR on the group member side never triggers an SPT switchover.\nThe undo spt-switch-threshold infinity group-policy command restores the default configuration. The spt-switch-threshold infinity group-policy command configures the range of multicast groups so that a DR on the group member side never triggers an SPT switchover. The undo spt-switch-threshold infinity group-policy command restores the default configuration. By default, a receiver's DR performs a switchover from the RPT to the SPT immediately after receiving the first multicast data packet. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "spt-switch-threshold infinity group-policy { <basic-acl6-number> | acl6-name <acl6-name> } [ order <order-value> ]",
        "undo spt-switch-threshold infinity group-policy { <basic-acl6-number> | acl6-name <acl6-name> }"
    ],
    "ParentView": [
        "IPv6 PIM view,VPN instance IPv6 PIM view"
    ],
    "ParaDef": [
        {
            "Parameters": "<basic-acl6-number>",
            "Info": "Indicates that a basic ACL is applied.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "acl6-name <acl6-name>",
            "Info": "Specifies the name of a named basic IPv6 ACL.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        },
        {
            "Parameters": "order <order-value>",
            "Info": "Specifies the order of an IPv6 ACL in the group policy.\nIf a multicast group matches more than one IPv6 ACL, the system determines the threshold to be used based on order-value of the IPv6 ACLs.\nThe value is an integer and is any value other than original one in the current group-policy list. If this parameter is not specified, the original IPv6 ACL order is used."
        },
        {
            "Parameters": "group-policy",
            "Info": "Limits the range of multicast groups for which a multicast data forwarding rate threshold is effective.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 2010",
            "[*HUAWEI-acl6-basic-2010] rule permit source ff02:: 96",
            "[*HUAWEI-acl6-basic-2010] quit",
            "[*HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] pim ipv6",
            "[*HUAWEI-pim6] spt-switch-threshold infinity group-policy 2010"
        ]
    ],
    "ExtraInfo": ""
}