{
    "PageTitle": "vrrp vrid track admin-vrrp",
    "FuncDef": "The vrrp vrid track admin-vrrp command binds a common VRRP group to a management VRRP (mVRRP) backup group. After the binding is configured, the common VRRP group becomes a service VRRP group.\nThe undo vrrp vrid track admin-vrrp command removes the binding between a service VRRP group and an mVRRP group. After the binding is removed, the service VRRP group changes to a common VRRP group. The vrrp vrid track admin-vrrp command binds a common VRRP group to a management VRRP (mVRRP) backup group. After the binding is configured, the common VRRP group becomes a service VRRP group. The undo vrrp vrid track admin-vrrp command removes the binding between a service VRRP group and an mVRRP group. After the binding is removed, the service VRRP group changes to a common VRRP group. By default, no VRRP group is bound to an mVRRP group.",
    "CLIs": [
        "vrrp vrid <virtual-router-id1> trackadmin-vrrpinterface { <interface-name> | <interface-type> <interface-number> } vrid <virtual-router-id2> [ unflowdown ]",
        "undo vrrp vrid <virtual-router-id1> trackadmin-vrrp"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<virtual-router-id1>",
            "Info": "Specifies the ID of a common VRRP group.\nThe value is an integer ranging from 1 to 255.\nEach card supports a maximum of eight VRIDs.\nThe VRID on an interface must be unique, but different interfaces can be bound to VRRP groups with the same VRID. If the number of VRIDs is insufficient, bind different interfaces to VRRP groups with the same VRID.\nThe total number of virtual MAC addresses on VLANIF, Eth-Trunk, VBDIF, and NVE interfaces of the device cannot exceed the maximum number of VRIDs."
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Specifies the type and number of an interface on which an mVRRP group is configured.\n-"
        },
        {
            "Parameters": "vrid <virtual-router-id2>",
            "Info": "Specifies the ID of an mVRRP group.\nThe value is an integer ranging from 1 to 255.\nEach card supports a maximum of eight VRIDs.\nThe VRID on an interface must be unique, but different interfaces can be bound to VRRP groups with the same VRID. If the number of VRIDs is insufficient, bind different interfaces to VRRP groups with the same VRID.\nThe total number of virtual MAC addresses on VLANIF, Eth-Trunk, VBDIF, and NVE interfaces of the device cannot exceed the maximum number of VRIDs."
        },
        {
            "Parameters": "unflowdown",
            "Info": "Disables the flowdown function of the interface. A common VRRP group is bound to an mVRRP group in unflowdown mode.\nAfter the unflowdown function is configured for the mVRRP group that is in the Backup or Initialize state, the interface on which the bound service VRRP group is established will retain the Up state and the service VRRP group will enter the Backup or Initialize state.\nBy default, the flowdown mode is used.\nAfter the flowdown function is configured for the mVRRP group that is in the Backup or Initialize state, the interface on which the bound service VRRP group is established will go Down and the service VRRP group will enter the Initialize state.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1 track admin-vrrp interface 100GE 1/0/7.1 vrid 2"
        ]
    ],
    "ExtraInfo": "When multiple VRRP groups are configured on a single device to forward traffic, each VRRP group maintains its own state machine. This means that a large number of VRRP Advertisement packets are transmitted, consuming a lot of bandwidth and CPU resources. To reduce resource consumption, run the vrrp vrid track admin-vrrp command to bind a common VRRP group to an mVRRP group.\nVRRP groups can be bound to the mVRRP group in flowdown or unflowdown mode."
}