{
    "PageTitle": "vrrp vrid track interface",
    "FuncDef": "The vrrp vrid track interface command enables a VRRP group to track an interface.\nThe undo vrrp vrid track interface command disables a VRRP group from tracking an interface. The vrrp vrid track interface command enables a VRRP group to track an interface. The undo vrrp vrid track interface command disables a VRRP group from tracking an interface. By default, a VRRP group does not track an interface.",
    "CLIs": [
        "vrrp vrid <virtual-router-id> trackinterface { <interface-name> | <interface-type> <interface-number> } [ increase <value-increased> | reduce <value-reduced> ]",
        "undo vrrp vrid <virtual-router-id> trackinterface [ <interface-name> | <interface-type> <interface-number> ]"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<virtual-router-id>",
            "Info": "Specifies the ID of a VRRP group.\nThe value is an integer in the range 1 to 255. The minimum priority value is 1. By default, the priority decreases by 10 when a monitored VRRP6-disabled interface goes Down."
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Specifies the interface whose status is tracked by a VRRP group.\nA VRRP group can track Layer 2 and Layer 3 interfaces.\nIf the tracked interface is a Layer 2 interface, the VRRP group tracks the physical status of the Layer 2 interface and changes its own priority based on the tracked physical status.If the tracked interface is a Layer 3 interface, the VRRP group tracks the protocol status of the Layer 3 interface and changes its own priority based on the tracked protocol status.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of the monitored interface.\n-"
        },
        {
            "Parameters": "increase",
            "Info": "Increases the priority of the VRRP group.\n-"
        },
        {
            "Parameters": "<value-increased>",
            "Info": "Specifies the value by which the VRRP priority increases if the tracked interface becomes down. This parameter takes effect on both the master and backup devices in a VRRP group.\nThe value is an integer ranging from 1 to 255. As 255 is the priority of an IP address owner, the largest priority can be set to 254."
        },
        {
            "Parameters": "reduce",
            "Info": "Reduces the priority of the VRRP group.\n-"
        },
        {
            "Parameters": "<value-reduced>",
            "Info": "Specifies the value by which the VRRP priority reduces if the tracked interface becomes down. This parameter takes effect on both the master and backup devices in a VRRP group.\nThe value is an integer in the range 1 to 255. The minimum priority value is 1. By default, the priority decreases by 10 when a monitored VRRP6-disabled interface goes Down."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1 virtual-ip 10.1.1.1",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1 track interface 100GE 1/0/2 reduce 20"
        ]
    ],
    "ExtraInfo": "The master device cannot detect status changes of interfaces that are not in a VRRP group. If a VRRP-disabled interface connected to a network fails, the master device is unable to detect the fault and still forwards user packets through the failed interface, resulting in service interruptions.\nThe vrrp vrid track interface command can be used to configure a VRRP group to track a VRRP-disabled interface. If the device or the network-side interface fails, a VRRP group can be notified of the fault and perform a master/backup VRRP switchover. If the tracked interface goes Down, devices in the VRRP group increase or decrease VRRP priorities by a specified value and perform a master/backup VRRP switchover. The new master device will take over traffic.\nIf the tracked interface becomes Up, the original priorities of devices in a VRRP group will be restored."
}