{
    "PageTitle": "vrrp vrid holding-multiplier",
    "FuncDef": "The vrrp vrid holding-multiplier command sets a multiplier of the interval at which VRRP Advertisement packets are sent for the timeout period of a backup device in a VRRP backup group.\nThe undo vrrp vrid holding-multiplier command restores the default multiplier of the interval at which VRRP Advertisement packets are sent for the timeout period of a backup device in a VRRP backup group. The vrrp vrid holding-multiplier command sets a multiplier of the interval at which VRRP Advertisement packets are sent for the timeout period of a backup device in a VRRP backup group. The undo vrrp vrid holding-multiplier command restores the default multiplier of the interval at which VRRP Advertisement packets are sent for the timeout period of a backup device in a VRRP backup group. By default, the timeout period of a backup device in a VRRP backup group is three times the interval at which VRRP Advertisement packets are sent.",
    "CLIs": [
        "vrrp vrid <virtual-router-id> holding-multiplier <holding-multiplier-value>",
        "undo vrrp vrid <virtual-router-id> holding-multiplier [ <holding-multiplier-value> ]"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "holding-multiplier <holding-multiplier-value>",
            "Info": "Specifies a multiplier of the interval at which VRRP Advertisement packets are sent for the timeout period of a backup device in a VRRP backup group.\nThe value is an integer ranging from 3 to 10."
        },
        {
            "Parameters": "vrid <virtual-router-id>",
            "Info": "Specifies the ID of a VRRP group.\nThe value is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1 virtual-ip 10.10.10.10",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1 holding-multiplier 4"
        ]
    ],
    "ExtraInfo": "To set a multiplier of the interval at which VRRP Advertisement packets are sent for the timeout period of a backup device in a VRRP backup group, run the vrrp vrid holding-multiplier command."
}