{
    "PageTitle": "vrrp vrid timer advertise",
    "FuncDef": "The vrrp vrid timer advertise command sets an interval at which the master device sends a VRRP Advertisement packet.\nThe undo vrrp vrid timer advertise command restores the default interval. The vrrp vrid timer advertise command sets an interval at which the master device sends a VRRP Advertisement packet. The undo vrrp vrid timer advertise command restores the default interval. By default, the master device sends VRRP Advertisement packets at an interval of 1 second.",
    "CLIs": [
        "vrrp vrid <virtual-router-id> timeradvertise <advertise-interval>",
        "undo vrrp vrid <virtual-router-id> timeradvertise"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "advertise <advertise-interval>",
            "Info": "Specifies the interval at which the master device sends a VRRP Advertisement packet.\nThe value is an integer ranging from 1 to 255, in seconds."
        },
        {
            "Parameters": "vrid <virtual-router-id>",
            "Info": "Specifies the ID of a VRRP group.\nThe value is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ip address 10.1.1.1 24",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1 virtual-ip 10.1.1.111",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1 timer advertise 5"
        ]
    ],
    "ExtraInfo": "The master device in a VRRP group periodically sends VRRP Advertisement packets to the backup devices in the group to notify them of its status. You can run the vrrp vrid timer advertise command to set an interval at which the master device in the VRRP group sends a VRRP Advertisement packet.\nIf a backup device does not receive a VRRP Advertisement packet from the master device within a period three times the interval (As defined in relevant standards protocols: Interval specified by master-down-interval= (256 - priority)/256 + 3 x timer. According to the formula, the default interval specified by master-down-interval is about three times the interval specified by advertise-interval.) between sending VRRP Advertisement packets, the backup device considers the master device Down and preempts the Master state. If a backup device does not receive a VRRP Advertisement packet within a specified timeout period due to heavy network traffic or timer differences, a master/backup VRRP switchover is performed. To prevent this situation, configure a large interval at which the master device sends VRRP Advertisement packets."
}