{
    "PageTitle": "vrrp vrid preempt timer delay",
    "FuncDef": "The vrrp vrid preempt timer delay command sets a preemption delay for a device in a VRRP group.\nThe undo vrrp vrid preempt timer delay command restores the default preemption delay. The vrrp vrid preempt timer delay command sets a preemption delay for a device in a VRRP group. The undo vrrp vrid preempt timer delay command restores the default preemption delay. The default preemption delay is 5 seconds for a preemption caused by an interface Up event or  0 seconds (indicating immediate preemption) for a preemption caused by other reasons.",
    "CLIs": [
        "vrrp vrid <virtual-router-id> preempttimerdelay <delay-time>",
        "undo vrrp vrid <virtual-router-id> preempttimerdelay"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "delay <delay-time>",
            "Info": "Specifies the preempt delay.\nThe value is an integer ranging from 0 to 3600, in seconds."
        },
        {
            "Parameters": "vrid <virtual-router-id>",
            "Info": "Specifies the ID of a VRRP group.\nThe value is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ip address 10.1.1.1 24",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1 virtual-ip 10.1.1.111",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1 preempt timer delay 5"
        ]
    ],
    "ExtraInfo": "Set the preemption delay to 0 on the backup device to allow it to become a master device immediately after its priority changes; set the preemption delay to a non-0 value on the master device so that it can preempt the Master state after a specified delay if a master/backup VRRP switchover is performed. After the faulty master device in the VRRP group recovers, receives protocol packets, and has a lot of service configurations, the master device slowly delivers the VRRP forwarding table. An immediate traffic switchback leads to packet loss on the master device. To prevent packet loss, properly set a delay time in this situation."
}