{
    "PageTitle": "vrrp recover-delay (Interface view)",
    "FuncDef": "The vrrp recover-delay command sets a status recovery delay for all VRRP groups configured on a specified interface.\nThe undo vrrp recover-delay command restores the default setting. The vrrp recover-delay command sets a status recovery delay for all VRRP groups configured on a specified interface. The undo vrrp recover-delay command restores the default setting. By default, the status recovery delay is 0 seconds, indicating that VRRP group flapping is not suppressed.",
    "CLIs": [
        "vrrp recover-delay <delay-value>",
        "undo vrrp recover-delay"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<delay-value>",
            "Info": "Specifies a status recovery delay for all VRRP groups.\nThe value is an integer ranging from 0 to 3600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[~HUAWEI-100GE1/0/1] vrrp vrid 10 virtual-ip 10.10.10.10",
            "[*HUAWEI-100GE1/0/1] vrrp recover-delay 5"
        ]
    ],
    "ExtraInfo": "Frequent changes to the status of the interface on which a VRRP group resides result in the VRRP status frequently flapping. To prevent VRRP status flapping, run the vrrp recover-delay command to set a status recovery delay to suppress VRRP status flapping.\nWhen a device or board is restarted and a large number of services are configured, the backup device may not immediately receive protocol packets from the master device after the restart. As a result, the backup device becomes the master device because it does not receive protocol packets within a specified period, causing VRRP status flapping or the configured preemption delay to fail to take effect. To prevent this problem, run the vrrp recover-delay command to set a status recovery delay for the VRRP group."
}