{
    "PageTitle": "vrrp vrid track link-bfd",
    "FuncDef": "The vrrp vrid track link-bfd command sets a threshold for the number of link BFD sessions tracked by a VRRP group that go Down. When the number of link BFD sessions tracked by the VRRP group that go Down reaches or exceeds the specified threshold, the VRRP group performs a master/backup switchover.\nThe undo vrrp vrid track link-bfd command deletes the configured threshold. The vrrp vrid track link-bfd command sets a threshold for the number of link BFD sessions tracked by a VRRP group that go Down. When the number of link BFD sessions tracked by the VRRP group that go Down reaches or exceeds the specified threshold, the VRRP group performs a master/backup switchover. The undo vrrp vrid track link-bfd command deletes the configured threshold. By default, a VRRP group performs a master/backup VRRP switchover only when all link BFD sessions tracked by it go Down.",
    "CLIs": [
        "vrrp vrid <virtual-router-id> tracklink-bfd <down-number>",
        "undo vrrp vrid <virtual-router-id> tracklink-bfd"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<down-number>",
            "Info": "Specifies a threshold for the number of link BFD sessions tracked by a VRRP group that go Down.\nThe value is an integer ranging from 1 to 8."
        },
        {
            "Parameters": "vrid <virtual-router-id>",
            "Info": "Specifies the ID of a VRRP group.\nThe value is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ip address 10.10.10.6 24",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1 virtual-ip 10.10.10.185",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1 track link-bfd 2"
        ]
    ],
    "ExtraInfo": "If a VRRP group is bound to multiple link BFD sessions and the vrrp vrid track link-bfd command is not run, the VRRP group performs a master/backup VRRP switchover only when all link BFD sessions go Down. To improve network stability and reliability, run the vrrp vrid track link-bfd command to set a threshold for the number of link BFD sessions tracked by the VRRP group that go Down."
}