{
    "PageTitle": "vrrp vrid authentication-mode (Interface view)",
    "FuncDef": "The vrrp vrid authentication-mode command configures an authentication mode and key for a VRRP group.\nThe undo vrrp vrid authentication-mode command cancels authentication for a VRRP group. The vrrp vrid authentication-mode command configures an authentication mode and key for a VRRP group. The undo vrrp vrid authentication-mode command cancels authentication for a VRRP group. By default, a VRRP group does not authenticate packets.",
    "CLIs": [
        "vrrp vrid <virtual-router-id> authentication-mode { simple <key> | md5 <md5-key> }",
        "vrrp vrid <virtual-router-id> authentication-modesimple { plain <key> | cipher <cipher-key> }",
        "undo vrrp vrid <virtual-router-id> authentication-mode"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<virtual-router-id>",
            "Info": "Specifies the ID of a VRRP group.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "simple <key>",
            "Info": "Specifies the authentication key in simple authentication mode.\nTo prevent high security risks, you are advised to select the ciphertext mode. To ensure device security, change the password periodically.\nThe value is a string of 1 to 8 case-sensitive characters, spaces not supported.\nWhen double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "md5 <md5-key>",
            "Info": "Specifies the authentication key for HMAC-MD5 authentication.\nThe value is a string of 1 to 8 case-sensitive characters in plaintext or a string of 128 case-sensitive characters in ciphertext. The value can be letters or digits. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "plain <key>",
            "Info": "Indicates plaintext authentication.\nWhen configuring an authentication password, select the ciphertext mode. If you select the simple text mode, the password is saved as a simple text in the configuration file, which has a high risk. To ensure device security, change the password periodically.\nThe value is a string of 1 to 8 case-sensitive characters, spaces not supported.\nWhen double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "cipher <cipher-key>",
            "Info": "Specifies an authentication key for ciphertext authentication.\nThe value is a string of 1 to 8 case-sensitive characters in plaintext or a string of 1 to 128 case-sensitive characters in ciphertext. The value can be letters or digits. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ip address 10.10.10.9 24",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1 virtual-ip 10.10.10.10",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1 authentication-mode md5 YsH_2022"
        ]
    ],
    "ExtraInfo": "To help improve security of protocol packets, run the vrrp vrid authentication-mode command to configure an authentication mode and key for a specified VRRP group."
}