{
    "PageTitle": "vrrp vrid track ip route",
    "FuncDef": "The vrrp vrid track ip route command configures a VRRP group to track a specified route.\nThe undo vrrp vrid track ip route command disables a VRRP group from tracking a specified route. The vrrp vrid track ip route command configures a VRRP group to track a specified route. The undo vrrp vrid track ip route command disables a VRRP group from tracking a specified route. By default, a VRRP group tracks no route.",
    "CLIs": [
        "vrrp vrid <virtual-router-id> trackiproute <ip-address> { <mask-address> | <mask-length> } vpn-instance <vpn-instance-name> [ { reduce <value-reduced> | increase <increased-value> } ]",
        "vrrp vrid <virtual-router-id> trackiproute <ip-address> { <mask-address> | <mask-length> } [ { reduce <value-reduced> | increase <increased-value> } ]",
        "undo vrrp vrid <virtual-router-id> trackiproute <ip-address> { <mask-address> | <mask-length> } vpn-instance <vpn-instance-name>",
        "undo vrrp vrid <virtual-router-id> trackiproute [ <ip-address> { <mask-address> | <mask-length> } ]"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<virtual-router-id>",
            "Info": "Specifies the ID of a VRRP group.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies the destination IP address of a route to be tracked.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<mask-address>",
            "Info": "Specifies the destination IP address mask of a route to be tracked.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<mask-length>",
            "Info": "Specifies the length of the destination IP address mask of a route to be tracked.\nThe value is an integer ranging from 0 to 32."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "reduce <value-reduced>",
            "Info": "Indicates that the master device reduces its priority if the tracked route is withdrawn or becomes inactive.\nThe value is an integer ranging from 1 to 255. The default value is 10."
        },
        {
            "Parameters": "increase <increased-value>",
            "Info": "Specifies the value by which the master device's priority increases if the tracked route is withdrawn or becomes inactive.\nThe value is an integer ranging from 1 to 255. The default value is 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1 virtual-ip 10.1.1.1",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1 track ip route 10.2.1.0 24 reduce 20"
        ]
    ],
    "ExtraInfo": "To improve device reliability, two user gateways working in master/backup mode are connected to a network, and VRRP is enabled on these gateways to determine their master/backup status. If a VRRP group has been configured and an uplink route to a network becomes unreachable, access-side users still use the VRRP group to forward traffic along the uplink route, which causes user traffic loss.\nAssociation between a VRRP group and a route can prevent user traffic loss. A VRRP group can be configured to track the uplink route to a network. If the route is withdrawn or becomes inactive, the route management (RM) module notifies the VRRP group of the change. After receiving the notification, the VRRP group changes its master device's VRRP priority and performs a master/backup switchover."
}