{
    "PageTitle": "vrrp virtual-ip route-advertise disable",
    "FuncDef": "The vrrp virtual-ip route-advertise disable command disables a dynamic routing protocol from advertising the routes generated by the virtual IP address of a VRRP group.\nThe undo vrrp virtual-ip route-advertise disable command enables a dynamic routing protocol to advertise the routes generated by the virtual IP address of a VRRP group. The vrrp virtual-ip route-advertise disable command disables a dynamic routing protocol from advertising the routes generated by the virtual IP address of a VRRP group. The undo vrrp virtual-ip route-advertise disable command enables a dynamic routing protocol to advertise the routes generated by the virtual IP address of a VRRP group. By default, a dynamic routing protocol advertises the routes generated by the virtual IP address of a VRRP group.",
    "CLIs": [
        "vrrp virtual-ip route-advertise disable",
        "vrrp virtual-ip route-advertise disable { isis | ospf | rip }",
        "undo vrrp virtual-ip route-advertise disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "isis",
            "Info": "Disables IS-IS from advertising the routes generated by the virtual IP address of a VRRP group.\n-"
        },
        {
            "Parameters": "ospf",
            "Info": "Disables OSPF from advertising the routes generated by the virtual IP address of a VRRP group.\n-"
        },
        {
            "Parameters": "rip",
            "Info": "Disables RIP from advertising the routes generated by the virtual IP address of a VRRP group.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vrrp virtual-ip route-advertise disable"
        ]
    ],
    "ExtraInfo": "The direct routes generated by the virtual IP address of a VRRP group can be imported by a dynamic routing protocol. By default, this kind of route can be advertised by an IGP to the neighboring devices. On actual networks, there may be a large number of routes generated by the virtual IP address of a VRRP group. If all of the routes are imported and advertised to the neighboring devices by a dynamic routing protocol, heavy loads are imposed on some devices on the networks, which affects network performance. To resolve this issue, run the vrrp virtual-ip route-advertise disable command to disable an IGP from advertising the routes generated by the virtual IP address of the VRRP group.\nYou can specify a dynamic routing protocol as required."
}