{
    "PageTitle": "vrrp vrid fast-resume",
    "FuncDef": "The vrrp vrid fast-resume command enables rapid VRRP switchback.\nThe undo vrrp vrid fast-resume command disables rapid VRRP switchback. The vrrp vrid fast-resume command enables rapid VRRP switchback. The undo vrrp vrid fast-resume command disables rapid VRRP switchback. By default, rapid VRRP switchback is disabled.",
    "CLIs": [
        "vrrp vrid <virtual-router-id> fast-resume",
        "undo vrrp vrid <virtual-router-id> fast-resume"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<virtual-router-id>",
            "Info": "Specifies the ID of a VRRP group.\nThe value is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/7",
            "[~HUAWEI-100GE1/0/7] undo portswitch",
            "[*HUAWEI-100GE1/0/7] vrrp vrid 1 admin",
            "[*HUAWEI-100GE1/0/7] vrrp vrid 1 preempt timer delay 0",
            "[*HUAWEI-100GE1/0/7] vrrp vrid 1 fast-resume"
        ]
    ],
    "ExtraInfo": "When downstream links of devices in a VRRP group work in active/standby mode, upstream traffic is transmitted to the external network through the active link and the master device. If a device interface or link fails, the master device lowers the VRRP priority and switches to the Backup state. After the fault is rectified, the priority of the original master device exceeds that of the master device. However, the original master device still needs to receive protocol packets before reclaiming the master state. If the active/standby link switchover speed is faster than that of the master/backup VRRP switchover, the upstream traffic is lost. To solve the problem, run the vrrp vrid fast-resume command to configure the VRRP fast switchback function.\nWith the VRRP fast switchback function enabled, after the original master recovers, the priority of the VRRP group becomes higher than that of the existing master. In this case, the original device does not wait for VRRP protocol packets and directly preempts to be the master.\nThe VRRP fast switchback function takes effect only for mVRRP groups. In addition, the mVRRP groups must monitor the status of interfaces or other features in reduced mode."
}