{
    "PageTitle": "cmp-request rsa local-key-pair",
    "FuncDef": "The cmp-request rsa local-key-pair command configures the RSA key pair used for certificate application through CMPv2.\nThe undo cmp-request rsa local-key-pair command deletes the RSA key pair used for certificate application through CMPv2. The cmp-request rsa local-key-pair command configures the RSA key pair used for certificate application through CMPv2. The undo cmp-request rsa local-key-pair command deletes the RSA key pair used for certificate application through CMPv2. By default, the RSA key pair used to apply for certificate through CMPv2 is not configured.",
    "CLIs": [
        "cmp-request rsa local-key-pair <key-name> [ regenerate [ <key-bit> ] ]",
        "undo cmp-request rsa local-key-pair"
    ],
    "ParentView": [
        "PKI CMP session view"
    ],
    "ParaDef": [
        {
            "Parameters": "<key-name>",
            "Info": "Specifies the name of the RSA key pair.\nThe value is a string of 1 to 64 case-sensitive characters."
        },
        {
            "Parameters": "regenerate",
            "Info": "Indicates that the RSA key pair is updated together with certificate update.\n-"
        },
        {
            "Parameters": "<key-bit>",
            "Info": "Specifies the bits of the RSA key pair generated during the certificate update.\nThe value is an integer that ranges from 2048 to 4096 bit. The default value is 3072 bit."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pki rsa local-key-pair create test",
            "[~HUAWEI] pki cmp session test",
            "[*HUAWEI-pki-cmp-session-test] cmp-request rsa local-key-pair test regenerate 3072"
        ]
    ],
    "ExtraInfo": "When the CMPv2 is used to apply for certificate, the certificate request message sent by the PKI entity to CA must contain public key information. Therefore, you need to configure an RSA key pair for certificate application through CMPv2."
}