{
    "PageTitle": "cmp-request message-authentication-code",
    "FuncDef": "The cmp-request message-authentication-code command configures the reference value and secret value of the message authentication code (MAC).\nThe undo cmp-request message-authentication-code command deletes the reference value and secret value of the MAC. The cmp-request message-authentication-code command configures the reference value and secret value of the message authentication code (MAC). The undo cmp-request message-authentication-code command deletes the reference value and secret value of the MAC. By default, the reference value and secret value of the MAC are not configured.",
    "CLIs": [
        "cmp-request message-authentication-code <reference-value> [ <secret-value> ]",
        "undo cmp-request message-authentication-code"
    ],
    "ParentView": [
        "PKI CMP session view"
    ],
    "ParaDef": [
        {
            "Parameters": "<reference-value>",
            "Info": "Specifies the reference value of the MAC.\nThe value is a string of 1 to 128 case-sensitive characters without spaces or question marks (?). The character string can contain spaces if it is enclosed with double quotation marks (\"\")."
        },
        {
            "Parameters": "<secret-value>",
            "Info": "Specifies the secret value of the MAC.\nThe length of the plaintext ranges from 1 to 128. The length of the encrypted ciphertext ranges from 128 to 268. The value is a case-sensitive character string without question marks."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pki cmp session test",
            "[*HUAWEI-pki-cmp-session-test] cmp-request message-authentication-code YsHsjx_202206 YsHsjx_202206",
            "[*HUAWEI-pki-cmp-session-test] quit",
            "[~HUAWEI] pki cmp session test1",
            "[*HUAWEI-pki-cmp-session-test1] cmp-request message-authentication-code YsHsjx_202206"
        ]
    ],
    "ExtraInfo": ""
}