{
    "PageTitle": "enrollment-request signature message-digest-method",
    "FuncDef": "The enrollment-request signature message-digest-method command sets the message digest method of signature for the enrollment request.\nThe undo enrollment-request signature message-digest-method command restores the default message digest method. The enrollment-request signature message-digest-method command sets the message digest method of signature for the enrollment request. The undo enrollment-request signature message-digest-method command restores the default message digest method. By default, the message digest method of signature for the enrollment request is sha-256.",
    "CLIs": [
        "enrollment-request signature message-digest-method { md5 | sha1 | sha-256 | sha-384 | sha-512 | sm3 }",
        "undo enrollment-request signature message-digest-method"
    ],
    "ParentView": [
        "PKI domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "md5",
            "Info": "Sets the digest method used for the enrollment request packet of signed certificate to MD5.\n-"
        },
        {
            "Parameters": "sha1",
            "Info": "Sets the digest method used for the enrollment request packet of signed certificate to SHA1.\n-"
        },
        {
            "Parameters": "sha-256",
            "Info": "Sets the digest method used for the enrollment request packet of signed certificate to SHA2-256.\n-"
        },
        {
            "Parameters": "sha-384",
            "Info": "Sets the digest method used for the enrollment request packet of signed certificate to SHA2-384.\n-"
        },
        {
            "Parameters": "sha-512",
            "Info": "Sets the digest method used for the enrollment request packet of signed certificate to SHA2-512.\n-"
        },
        {
            "Parameters": "sm3",
            "Info": "Sets the digest method used for the enrollment request packet of signed certificate to SM3.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pki realm e",
            "[*HUAWEI-pki-realm-e] enrollment-request signature message-digest-method sha-384"
        ]
    ],
    "ExtraInfo": ""
}