{
    "PageTitle": "pki export rsa-key-pair",
    "FuncDef": "The pki export rsa-key-pair command exports the RSA key pair to the flash and allows the export of the associated certificate and certificate chain. The pki export rsa-key-pair command exports the RSA key pair to the flash and allows the export of the associated certificate and certificate chain.",
    "CLIs": [
        "pki export rsa-key-pair <keyname> [ and-certificate <certificate-name> ] { pem <filename> [ aes ] | pkcs12 <filename> } password <password>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<keyname>",
            "Info": "Specifies the name of the RSA key pair on the device.\nThe value must be an existing RSA key pair name."
        },
        {
            "Parameters": "and-certificate <certificate-name>",
            "Info": "Indicates that the certificate and certificate chain related to the RSA key pair are exported.\nThe value must be an existing certificate file name."
        },
        {
            "Parameters": "pem <filename>",
            "Info": "Indicates that the RSA key pair to be exported is in the PEM format and specifies the name of the file to be exported.\nThe value is a string of 1 to 64 case-insensitive characters without spaces and question marks (?)."
        },
        {
            "Parameters": "aes",
            "Info": "Sets the encryption algorithm to AES if a file is exported in the PEM format. The default value is AES.\n-"
        },
        {
            "Parameters": "pkcs12 <filename>",
            "Info": "Indicates that the RSA key pair to be exported is in the PKCS12 format and specifies the file name to be exported.\nThe value is a string of 1 to 64 case-insensitive characters without spaces and question marks (?)."
        },
        {
            "Parameters": "password <password>",
            "Info": "Specifies the encryption password for the RSA key pair file. This password is used when you import an RSA key pair file.\nThe value is a string of 6 to 32 case-sensitive characters without question marks (?).\nTo enhance security, a password must contain at least two types of the following characters: uppercase letters, lowercase letters, numerals, and special characters, such as exclamation points (!), at signs (@), number signs (#), dollar signs ($), and percent (%)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[HUAWEI] pki rsa local-key-pair create key1 exportable",
            "[HUAWEI] pki export rsa-key-pair key1 pem aaa.pem aes password YsHsjx_202206",
            "Warning: Exporting the key pair impose security risks, are you sure you want to export it? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "To transfer or back up the RSA key pair, run this command to generate a PEM or PKCS12 file that contains the RSA key pair (including the certificate and certificate chain) in the flash memory.\nBefore running this command, you can run the display pki rsa local-key-pair command to view information about the RSA key pair on the device."
}