{
    "PageTitle": "pki import rsa-key-pair",
    "FuncDef": "The pki import rsa-key-pair command imports the RSA key pair and the certificate to the device memory. The pki import rsa-key-pair command imports the RSA key pair and the certificate to the device memory.",
    "CLIs": [
        "pki import rsa-key-pair <keyname> [ exclude-cert ] { pem | pkcs12 } <filename> [ exportable ] [ password <password> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<keyname>",
            "Info": "Specifies the name of the RSA key pair on the device.\nThe value is a string of 1 to 64 case-sensitive characters without spaces or question marks (?). The character string can contain spaces if it is enclosed with double quotation marks (\"\")."
        },
        {
            "Parameters": "exclude-cert",
            "Info": "Indicates not importing the certificates in the file.\n-"
        },
        {
            "Parameters": "pem <filename>",
            "Info": "Indicates that the RSA key pair to be imported is in the PEM format and specifies the file name to store the RSA key pair.\nThe value must be an existing certificate file name that stores the RSA key pair and the certificate."
        },
        {
            "Parameters": "pkcs12 <filename>",
            "Info": "Indicates that the RSA key pair to be imported is in the PKCS12 format and specifies the file name to store the RSA key pair.\nThe value must be an existing certificate file name that stores the RSA key pair and the certificate."
        },
        {
            "Parameters": "exportable",
            "Info": "Indicates that the imported RSA key pair can be exported.\n-"
        },
        {
            "Parameters": "password <password>",
            "Info": "Specifies the decryption password of the RSA key pair, and the value must be the same as the password set when it was exported.\nThe value must be the name of an existing decryption password of the RSA key pair."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pki import rsa-key-pair key-1 pem aaa.pem exportable password YsHsjx_202206",
            "Warning: The file in the flash will be deleted. Please select 'N' if you want to keep it. Please select [Y/N]:y"
        ]
    ],
    "ExtraInfo": "Run this command to use the RSA key pair, certificates, or certificate chains generated by other entities. After the configuration, the imported RSA key pair can be referenced by the PKI module for operations such as signing. The certificates and certificate chains are used for authentication.\nWindows Server 2003 has a low processing performance. For the device to connect to a Windows Server 2003, the device cannot have too many entities configured or use a large-sized key pair.\nIf you do not know the format of the key pair you want to import, configure each format in turn and check whether the key pair is successfully imported."
}