{
    "PageTitle": "pki import sm2-key-pair",
    "FuncDef": "The pki import sm2-key-pair command imports the SM2 key pair to the device memory. The pki import sm2-key-pair command imports the SM2 key pair to the device memory.",
    "CLIs": [
        "pki import sm2-key-pair <keyname> der <filename> [ exportable ]",
        "pki import sm2-key-pair <keyname> pem <filename> [ exportable ] [ password <password> ]",
        "pki import sm2-key-pair <keyname> pem <filename> [ exportable ] signkey <signkey-name> [ certificate <certificate-name> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<keyname>",
            "Info": "Specifies the name of the SM2 key pair to be imported on the device.\nThe value is a string of 1 to 64 case-sensitive characters without spaces or question marks (?). The character string can contain spaces if it is enclosed with double quotation marks (\"\")."
        },
        {
            "Parameters": "der <filename>",
            "Info": "Specifies the format of the imported SM2 key pair as DER, and specifies the name of the file that stores the SM2 key pair.\nThe value must be an existing SM2 key pair name."
        },
        {
            "Parameters": "exportable",
            "Info": "Indicates that the imported SM2 key pair can be exported.\n-"
        },
        {
            "Parameters": "pem <filename>",
            "Info": "Specifies the format of the SM2 key pair to be imported as PEM, and specifies the name of the file that stores the SM2 key pair.\nThe value must be an existing SM2 key pair name."
        },
        {
            "Parameters": "password <password>",
            "Info": "Specifies the decryption password of the SM2 key pair. The decryption password is the same as the password configured using the pki export sm2-key-pair command.\nThe value must be the existing decryption password of the SM2 key pair file."
        },
        {
            "Parameters": "signkey <signkey-name>",
            "Info": "Specifies the name of a signature key pair.\nThe value is a string of 1 to 64 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "certificate <certificate-name>",
            "Info": "Specifies the file name of an encryption certificate.\nThe value is a string of 1 to 64 case-sensitive characters. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pki import sm2-key-pair key-1 pem aaa.pem exportable password YsHsjx_202206",
            "Warning: The file in the flash will be deleted. Please select 'N' if you want to keep it. Please select [Y/N]:y"
        ]
    ],
    "ExtraInfo": "Run this command to use the SM2 key pair, certificates, or certificate chains generated by other entities."
}