{
    "PageTitle": "pki export sm2-key-pair",
    "FuncDef": "The pki export sm2-key-pair command exports an SM2 key pair to the device storage. The pki export sm2-key-pair command exports an SM2 key pair to the device storage.",
    "CLIs": [
        "pki export sm2-key-pair <keyname> der <filename>",
        "pki export sm2-key-pair <keyname> pem <filename> [ password <password> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<keyname>",
            "Info": "Specifies the name of the SM2 key pair on the device.\nThe value must be an existing SM2 key pair name."
        },
        {
            "Parameters": "der <filename>",
            "Info": "Exports the SM2 key pair as a DER file and specifies the file name.\nThe value is a string of 1 to 64 case-insensitive characters without spaces and question marks (?)."
        },
        {
            "Parameters": "pem <filename>",
            "Info": "Exports the SM2 key pair as a PEM file and specifies the file name.\nThe value is a string of 1 to 64 case-insensitive characters without spaces and question marks (?)."
        },
        {
            "Parameters": "password <password>",
            "Info": "Specifies the password for the SM2 key pair file. This password is used when you import an SM2 key pair file.\nThe value is a string of 8 to 32 case-sensitive characters without question marks (?).\nFor security purposes, a password must meet the minimum strength requirements, that is, the password needs to contain at least three types of the following characters: uppercase letters, lowercase letters, numerals, and special characters, such as exclamation points (!), at signs (@), number signs (#), dollar signs ($), and percent signs (%)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pki sm2 local-key-pair create key-1 exportable",
            "[~HUAWEI] pki export sm2-key-pair key-1 pem aaa.pem password YsHsjx_202206",
            "Warning: Exporting the key pair impose security risks, are you sure you want to export it? [y/n]:y"
        ]
    ],
    "ExtraInfo": "To transfer or back up an SM2 key pair, run this command to generate a file containing the SM2 key pair in the device memory.\nBefore running this command, you can run the display pki sm2 local-key-pair public command to view information about the SM2 key pair on the device."
}