{
    "PageTitle": "pki import-certificate peer",
    "FuncDef": "The pki import-certificate peer command imports a certificate of the remote device to the device memory. The pki import-certificate peer command imports a certificate of the remote device to the device memory.",
    "CLIs": [
        "pki import-certificate peer <peer-name> { der | pem | pkcs12 } filename <filename> [ cert-name <cert-name> ] [ no-check-same-name ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "der",
            "Info": "Imports a certificate of the remote device in DER format.\n-"
        },
        {
            "Parameters": "pem",
            "Info": "Imports a certificate of the remote device in PEM format.\n-"
        },
        {
            "Parameters": "pkcs12",
            "Info": "Imports a certificate of the remote device in P12 format.\n-"
        },
        {
            "Parameters": "filename <filename>",
            "Info": "Imports a certificate of the remote device in file mode.\nThe value is an existing certificate name of the remote device."
        },
        {
            "Parameters": "cert-name <cert-name>",
            "Info": "Specifies the name of the peer certificate to be saved.\nThe value must be the name of an existing peer certificate. The value is a string of 1 to 64 characters."
        },
        {
            "Parameters": "peer <peer-name>",
            "Info": "Specifies the name of peer certificate.\nA certificate cannot be imported to multiple peers.\nThe value is a string of 1 to 32  case-insensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pki import-certificate peer abcd pem filename aa.pem",
            "Warning: The file in the flash will be deleted. Please select 'N' if you want to keep it. Please select [Y/N]:y"
        ]
    ],
    "ExtraInfo": "Where digital envelop authentication is used, configure the public key of the remote device. The public key can be obtained from the public and private key management module or certificate of the remote device."
}