{
    "PageTitle": "pki ldap-server-template",
    "FuncDef": "The pki ldap-server-template command configures the device to download the CA certificate, local certificate, or CRL through LDAP. The pki ldap-server-template command configures the device to download the CA certificate, local certificate, or CRL through LDAP.",
    "CLIs": [
        "pki ldap-server-template <template-name> attribute <attr-value> <save-name> dn <dn-value>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "attribute <attr-value>",
            "Info": "Specifies the attribute value used by the device to obtain a certificate or CRL from the LDAP server.\nThe value is a string of 1 to 64 case-sensitive characters."
        },
        {
            "Parameters": "<save-name>",
            "Info": "Specifies the name of a CA certificate, local certificate, or CRL saved on the flash of the device.\nThe value is a string of 1 to 64 case-sensitive characters, spaces not supported. The file name extension is .pem, .crt, .cer, or .crl."
        },
        {
            "Parameters": "dn <dn-value>",
            "Info": "Specifies the DN used by the device to obtain a certificate or CRL from the LDAP server.\nThe value is a string of 1 to 128 characters. It cannot contain spaces."
        },
        {
            "Parameters": "ldap-server-template <template-name>",
            "Info": "Specifies the name of an LDAP server template.\nThe value must be an existing LDAP server template name."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ldap-server template user1",
            "[*HUAWEI-ldap-user1] commit",
            "[*HUAWEI-ldap-user1] quit",
            "[~HUAWEI] pki ldap-server-template user1 attribute cACertificate;binary ca.cer dn admin"
        ]
    ],
    "ExtraInfo": "Note the following points when configuring a device to download a CA certificate, local certificate, or CRL through LDAP, the flash of the device has enough space for accommodating the CA certificate, local certificate, or CRL file to avoid downloading failed."
}