{
    "PageTitle": "rule (certificate-attribute-based access control policy view)",
    "FuncDef": "The rule command configures certificate attribute-based control rules.\nThe undo rule command cancels the configuration. The rule command configures certificate attribute-based control rules. The undo rule command cancels the configuration. By default, the certificate attribute-based control rules are not configured.",
    "CLIs": [
        "rule <id> { permit | deny } <group-name>",
        "undo rule { <id> | all }"
    ],
    "ParentView": [
        "Certificate-attribute-based access control policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "<id>",
            "Info": "Specifies the ID of a certificate attribute-based access control rule.\nThe value is an integer that ranges from 1 to 256."
        },
        {
            "Parameters": "permit",
            "Info": "Indicates that the certificates matching the attributes defined in the attribute group are considered valid and permitted.\n-"
        },
        {
            "Parameters": "deny",
            "Info": "Indicates that the certificates matching the attributes defined in the attribute group are considered invalid and denied.\n-"
        },
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of an attribute group.\nThe value must be the name of an existing attribute group."
        },
        {
            "Parameters": "all",
            "Info": "Indicates all certificate attribute-based access control rules.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pki certificate attribute-group mygroup",
            "[*HUAWEI-pki-attribute-mygroup] commit",
            "[~HUAWEI-pki-attribute-mygroup] quit",
            "[~HUAWEI] pki certificate access-control-policy name policy1",
            "[*HUAWEI-pki-access-policy1] rule 1 permit mygroup"
        ]
    ],
    "ExtraInfo": "After configuring certificate attribute rules in the attribute group, run this command to configure certificate attribute-based access control rules. As a result, certificates that meet specific conditions pass or fail the authentication.\nIf a certificate attribute-based access control policy has multiple control rules, the rules are ORed. If a certificate matches a control rule, the device takes the action defined in the rule on the certificate, and the rest of rules are skipped."
}