{
    "PageTitle": "source",
    "FuncDef": "The source command configures the source address used in TCP connection setup.\nThe undo source command restores the default setting. The source command configures the source address used in TCP connection setup. The undo source command restores the default setting. By default, the device uses an outbound interface's IP address as the source IP address used in TCP connection setup.",
    "CLIs": [
        "source { interface <interface-type> <interface-number> | <ipv4-address> | <ipv6-address> }",
        "source interface <interface-name>",
        "undo source"
    ],
    "ParentView": [
        "PKI CMP session view,PKI domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Specifies an interface's IP address as the source IP address used in TCP connection setup.\ninterface-type indicates the type of the interface.interface-number indicates the number of the interface.\n-"
        },
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the source address used in TCP connection setup.\nAn IPv4 address is in dotted decimal notation,"
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "whereas an IPv6 address is in colon-separated hexadecimal notation.\nThe CMP session view does not support the configuration of an IPv6 address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[HUAWEI] interface 100GE 1/0/1",
            "[HUAWEI-100GE1/0/1] ip address 10.136.2.25 24",
            "[HUAWEI-100GE1/0/1] quit",
            "[HUAWEI] pki realm abc",
            "[HUAWEI-pki-realm-abc] source interface 100GE 1/0/1"
        ]
    ],
    "ExtraInfo": "When the device establishes a TCP connection with the certificate server, you are advised to run the source command to specify the source address used to establish the TCP connection.\nIn a scenario with multiple outbound interfaces, when the interfaces for sending and receiving TCP packets are different, the IP address of the received TCP packet is different from that of the receiving interface. As a result, the device discards the received TCP packet, causing the TCP connection to be interrupted. In this case, you can run this command to specify the loopback interface address."
}