{
    "PageTitle": "display mld snooping group",
    "FuncDef": "The display mld snooping group command displays multicast group information dynamically learned on a specified interface. The display mld snooping group command displays multicast group information dynamically learned on a specified interface. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display mld snooping group interface { <interface-type> <interface-number> | <interface-name> } vlan <vlan-id> [ [ source-address <source-address> ] group-address <group-address> ]",
        "display mld snooping group"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-name>",
            "Info": "Displays dynamically learned multicast group information of a specified interface.\n-"
        },
        {
            "Parameters": "vlan <vlan-id>",
            "Info": "Displays dynamically learned multicast group information of a specified VLAN.\nThe value is an integer ranging from 1 to 4063."
        },
        {
            "Parameters": "source-address <source-address>",
            "Info": "Displays dynamically learned information about a multicast group to which a specified multicast source sends data.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "group-address <group-address>",
            "Info": "Displays dynamically learned information about a specified multicast group.\nThe value is a 32-digit hexadecimal number in X:X:X:X:X:X:X:X format. The value ranges from FF00:: to FFFF:FFFF:FFFF:FFFF:FFFF:FFFF:FFFF:FFFF."
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Displays dynamically learned multicast group information of a specified interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display mld snooping group interface 10ge 1/0/1 vlan 2 source-address 2001:db8:1::1 group-address ff33::1"
        ]
    ],
    "ExtraInfo": ""
}