{
    "PageTitle": "display mld snooping invalid-packet vlan",
    "FuncDef": "The display mld snooping invalid-packet vlan command displays statistics about invalid MLD messages received by the device of VLAN. The display mld snooping invalid-packet vlan command displays statistics about invalid MLD messages received by the device of VLAN. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display mld snooping invalid-packet vlan [ <vlanid> ] [ message-type { report | done | query | hello } ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<vlanid>",
            "Info": "Displays statistics about invalid MLD snooping messages received by the specified VLAN:\nIf vlan-id is not specified, statistics about invalid MLD snooping messages received by all VLANs are displayed.If vlan-id is specified, statistics about invalid MLD snooping messages received by the specified VLAN are displayed.\nThe value is an integer that ranges from 1 to 4094."
        },
        {
            "Parameters": "message-type",
            "Info": "Displays statistics about the specified type of invalid message.\n-"
        },
        {
            "Parameters": "report",
            "Info": "Displays statistics about invalid Report message.\n-"
        },
        {
            "Parameters": "done",
            "Info": "Displays statistics about invalid Done messages.\n-"
        },
        {
            "Parameters": "query",
            "Info": "Displays statistics about invalid Query message.\n-"
        },
        {
            "Parameters": "hello",
            "Info": "Displays statistics about invalid Hello messages.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display mld snooping invalid-packet vlan"
        ]
    ],
    "ExtraInfo": ""
}