{
    "PageTitle": "mld snooping enable (System view)",
    "FuncDef": "The mld snooping enable vlan command enables MLD snooping for VLANs.\nThe undo mld snooping enable vlan command disables MLD snooping for VLANs.\nThe mld snooping enable command enables MLD snooping.\nThe undo mld snooping enable command disables MLD snooping. The mld snooping enable vlan command enables MLD snooping for VLANs. The undo mld snooping enable vlan command disables MLD snooping for VLANs. The mld snooping enable command enables MLD snooping. The undo mld snooping enable command disables MLD snooping. By default, MLD snooping is disabled. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "mld snooping enable",
        "mld snooping enable vlan { <vlan-id1> [ to <vlan-id2> ] } &<1-10>",
        "undo mld snooping enable",
        "undo mld snooping enable vlan { all | { <vlan-id1> [ to <vlan-id2> ] } &<1-10> }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan <vlan-id1> to <vlan-id2>",
            "Info": "Specifies a VLAN or VLAN range for which MLD snooping is to be enabled. vlan-id1 and to vlan-id2 specify a VLAN range.\nvlan-id1 specifies the start VLAN ID.to vlan-id2 specifies the end VLAN ID. If to vlan-id2 is not specified, MLD snooping is enabled only for the VLAN specified by vlan-id1.\nThe value is an integer ranging from 1 to 4094.\nvlan-id2 must be greater than vlan-id1."
        },
        {
            "Parameters": "all",
            "Info": "Disables MLD snooping for all VLANs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mld snooping enable",
            "[*HUAWEI] vlan batch 2 to 10",
            "[*HUAWEI] mld snooping enable vlan 2 to 10"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mld snooping enable"
        ]
    ],
    "ExtraInfo": "MLD snooping runs on a Layer 2 device between a Layer 3 multicast device and user hosts. MLD snooping listens on multicast protocol messages exchanged between the Layer 3 device and user hosts to maintain forwarding entries of multicast packets. MLD snooping manages and controls forwarding of multicast data packets. Enabling MLD snooping is the prerequisite for implementing Layer 2 multicast. You can run this command to enable MLD snooping globally and in a VLAN."
}