{
    "PageTitle": "display fwm mac diag",
    "FuncDef": "The display fwm mac diag command displays information about the DB table, software table, and hardware table of MAC addresses learned by the device. The display fwm mac diag command displays information about the DB table, software table, and hardware table of MAC addresses learned by the device.",
    "CLIs": [
        "display fwm mac diag slot <slotid> chip <chipid> mac-address <mac-addr> bridge-domain <bdid>",
        "display fwm mac diag slot <slotid> chip <chipid> mac-address <mac-addr> vlan <vlanid>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "chip <chipid>",
            "Info": "Chip information.\nThe value is an integer ranging from 0 to 8."
        },
        {
            "Parameters": "mac-address <mac-addr>",
            "Info": "MAC address.\nThe value is in the format of H-H-H, in which each H is a hexadecimal number of 1 to 4 digits, such as 00e0 and fc01. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0. The MAC address cannot be set to FFFF-FFFF-FFFF."
        },
        {
            "Parameters": "bridge-domain <bdid>",
            "Info": "Bridge domain information.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer."
        },
        {
            "Parameters": "slot <slotid>",
            "Info": "Slot information.\nThe value is a string of 1 to 31 case-sensitive characters without spaces."
        },
        {
            "Parameters": "vlan <vlanid>",
            "Info": "VLAN information.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display fwm mac diag slot 1 chip 0 mac-address 00e0-fc12-3456 vlan 100",
            "[DB]:",
            "[FWM]:",
            "[ODA]:"
        ],
        [
            "<HUAWEI> display fwm mac diag slot 1 chip 0 mac-address 00e0-fc12-3456 bridge-domain 500",
            "[DB]:",
            "[FWM]:",
            "[ODA]:"
        ]
    ],
    "ExtraInfo": ""
}