{
    "PageTitle": "display mac-address dynamic",
    "FuncDef": "The display mac-address dynamic command displays information about dynamic MAC address entries. The display mac-address dynamic command displays information about dynamic MAC address entries.",
    "CLIs": [
        "display mac-address dynamic [ slot <slot-id> ] [ interface { <interface-type> <interface-number> | <interface-name> } ] [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface <interface-name>",
            "Info": "Specifies the interface name.\n-"
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the interface type.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the interface number.\n-"
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about dynamic MAC address entries.\n-"
        },
        {
            "Parameters": "slot <slot-id>",
            "Info": "Specifies the slot ID.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display mac-address dynamic"
        ]
    ],
    "ExtraInfo": "A MAC address table is an interface-based Layer 2 forwarding table. It stores information about MAC addresses learned by a device. A MAC address entry contains a MAC address, an interface on which a packet is forwarded to this MAC address, and a VLAN to which the specified interface belongs or a VSI to which the specified interface is bound. Before forwarding a packet, the device searches the MAC address table based on the destination MAC address of the packet and locates the outbound interface quickly. This facilitates packet forwarding and reduces broadcast traffic.\nDynamic MAC address entries: obtained by a device through source MAC address learning and will be aged based on the aging time.\nA MAC address table needs to be updated constantly to meet requirements for network changes. To view information about dynamic MAC address entries learned by a device, run the display mac-address dynamic command."
}