{
    "PageTitle": "display mac-address bridge-domain",
    "FuncDef": "The display mac-address bridge-domain command displays MAC address entries in a specified bridge domain (BD). The display mac-address bridge-domain command displays MAC address entries in a specified bridge domain (BD). This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display mac-address { <mac-address> bridge-domain <bd-id> | bridge-domain <bd-id> } [ verbose ]",
        "display mac-address static bridge-domain <bd-id> [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<mac-address>",
            "Info": "Displays an entry with a specified MAC address.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0. The MAC address cannot be set to FFFF-FFFF-FFFF or a multicast MAC address starting with 01."
        },
        {
            "Parameters": "<bd-id>",
            "Info": "Displays MAC address entries in a BD with a specified ID.\nThe value is an integer that ranges from 1 to 16777215."
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about MAC address entries in a BD with a specified ID.\n-"
        },
        {
            "Parameters": "static",
            "Info": "Displays static MAC address entries.\nThe static parameter configured in this command helps verify that a user device is correctly bound to an interface so that authorized users' communication can be ensured.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display  mac-address bridge-domain 10"
        ],
        [
            "<HUAWEI> display mac-address verbose"
        ]
    ],
    "ExtraInfo": ""
}