{
    "PageTitle": "mac-address update arp enable",
    "FuncDef": "The mac-address update arp enable command enables the MAC address-triggered ARP entry update function. That is, the Switch is enabled to update outbound interfaces in ARP entries when outbound interfaces in MAC address entries change.\nThe undo mac-address update arp enable command disables the MAC address-triggered ARP entry update function. The mac-address update arp enable command enables the MAC address-triggered ARP entry update function. That is, the Switch is enabled to update outbound interfaces in ARP entries when outbound interfaces in MAC address entries change. The undo mac-address update arp enable command disables the MAC address-triggered ARP entry update function. By default, the MAC address-triggered ARP entry update function is enabled. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "mac-address update arp enable",
        "undo mac-address update arp enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mac-address update arp enable"
        ]
    ],
    "ExtraInfo": "On the Ethernet, MAC address entries are used to guide Layer 2 data forwarding. The ARP entries that define the mapping between IP addresses and MAC addresses guide communication between devices on different network segments.\nThe outbound interface in a MAC address entry is updated by packets, whereas the outbound interface in an ARP entry is updated after the aging time is reached. In this case, the outbound interfaces in the MAC address entry and ARP entry may be different. To address this issue, run the mac-address update arp enable command to enable the Switch to update outbound interfaces in ARP entries when outbound interfaces in MAC address entries change.\nWhen the VM location is changed after MAC-ARP association is enabled and a gateway's MAC entries are updated upon receipt of Layer 2 user traffic, ARP entries and outbound interface information are updated as follows to accelerate Layer 3 traffic convergence:"
}