{
    "PageTitle": "mac-address flapping periodical trap",
    "FuncDef": "The mac-address flapping periodical trap enable command enables the function to periodically report MAC address flapping traps.\nThe undo mac-address flapping periodical trap enable command disables the function to periodically report MAC address flapping traps.\nThe mac-address flapping periodical trap interval command sets the interval at which MAC address flapping traps are reported.\nThe undo mac-address flapping periodical trap interval command restores the default value. The mac-address flapping periodical trap enable command enables the function to periodically report MAC address flapping traps. The undo mac-address flapping periodical trap enable command disables the function to periodically report MAC address flapping traps. The mac-address flapping periodical trap interval command sets the interval at which MAC address flapping traps are reported. The undo mac-address flapping periodical trap interval command restores the default value. By default, the function to periodically report MAC address flapping traps is disabled, the interval at which MAC address flapping traps are reported is 2 minutes.",
    "CLIs": [
        "mac-address flapping periodical trap enable",
        "mac-address flapping periodical trap interval <interval>",
        "undo mac-address flapping periodical trap enable",
        "undo mac-address flapping periodical trap interval [ <interval> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval <interval>",
            "Info": "Specifies the interval at which MAC address flapping traps are reported.\nThe value is an integer ranging from 2 to 30, in minutes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mac-address flapping periodical trap interval 5"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mac-address flapping periodical trap enable"
        ]
    ],
    "ExtraInfo": "Configuring global MAC address flapping detection helps to check whether MAC addresses flap. If MAC address flapping occurs, a trap is generated. By default, a trap is reported every 30 minutes. To timely check whether MAC address flapping occurs, run the mac-address flapping periodical trap enable command to enable the function to periodically report MAC address flapping traps.To timely check whether MAC address flapping occurs, run the mac-address flapping periodical trap interval interval command to set the interval at which MAC address flapping traps are reported."
}