{
    "PageTitle": "mac-address limit",
    "FuncDef": "The mac-address limit command sets a MAC address learning limit rule, including the maximum number of MAC addresses that a device can learn.\nThe undo mac-address limit command deletes MAC address learning limit rules. The mac-address limit command sets a MAC address learning limit rule, including the maximum number of MAC addresses that a device can learn. The undo mac-address limit command deletes MAC address learning limit rules. By default, a device can learn MAC addresses without limit. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "mac-address limit { maximum <max> | action { discard | forward } | alarm { enable | disable } }",
        "undo mac-address limit [ maximum <max> | action { discard | forward } | alarm { enable | disable } ]"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "maximum <max>",
            "Info": "Specifies the maximum number of MAC address entries that can be learned.\nThe value is an integer ranging from 0 to 130048.\nWhen the value is 0, the number of MAC addresses that can be learned is not set."
        },
        {
            "Parameters": "action",
            "Info": "Specifies an action to be taken when the number of MAC address entries in the MAC address table reaches the limit.\n-"
        },
        {
            "Parameters": "discard",
            "Info": "The packet with the source MAC address not contained in the MAC address table is discarded.\n-"
        },
        {
            "Parameters": "forward",
            "Info": "The packet with the source MAC address not contained in the MAC address table is forwarded but its MAC address is not recorded.\n-"
        },
        {
            "Parameters": "alarm",
            "Info": "Indicates whether an alarm is generated when the number of learned MAC addresses reaches the upper limit.\n-"
        },
        {
            "Parameters": "enable",
            "Info": "Indicates that an alarm is generated when the number of learned MAC addresses reaches the upper limit.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Indicates that no alarm is generated when the number of learned MAC addresses reaches the upper limit.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] mac-address limit action forward maximum 1000 alarm enable"
        ]
    ],
    "ExtraInfo": "On insecure networks, devices are prone to attacks using forged MAC addresses. The capacity of a MAC address table on a device is limited. A hacker can forge a great number of source MAC addresses to a device. Upon receipt, the device adds the MAC addresses to the dynamic MAC address table, resulting in a dynamic MAC address table overflow. As a result, the device cannot learn more source MAC addresses carried in valid packets.\nTo set a MAC address learning limit rule, run the mac-address limit command. This command helps control the number of access users. If the number of learned MAC addresses reaches the upper limit, the device can be configured to discard packets carrying new MAC addresses, which prevents MAC address attacks and improves network security."
}