{
    "PageTitle": "mac-address flapping",
    "FuncDef": "The mac-address flapping detection command configures global MAC address flapping detection.\nThe undo mac-address flapping detection command disables global MAC address flapping detection.\nThe mac-address flapping detection exclude command configures a whitelist for MAC address flapping detection.\nThe undo mac-address flapping detection exclude command deletes a whitelist for MAC address flapping detection.\nThe mac-address flapping aging-time command sets the aging time of flapping MAC addresses.\nThe undo mac-address flapping aging-time command restores the default aging time of flapping MAC addresses. The mac-address flapping detection command configures global MAC address flapping detection. The undo mac-address flapping detection command disables global MAC address flapping detection. The mac-address flapping detection exclude command configures a whitelist for MAC address flapping detection. The undo mac-address flapping detection exclude command deletes a whitelist for MAC address flapping detection. The mac-address flapping aging-time command sets the aging time of flapping MAC addresses. The undo mac-address flapping aging-time command restores the default aging time of flapping MAC addresses. By default, global MAC address flapping detection is configured, the security level is medium, the VLAN/BD whitelist for MAC address flapping detection is not configured, and the aging time of flapping MAC addresses is 300 seconds.",
    "CLIs": [
        "mac-address flapping detection [ security-level { low | middle | high } | security-threshold <flapCnt> ]",
        "mac-address flapping detection exclude vlan { { <vlan-id1> } [ to <vlan-id2> ] } &<1-10>",
        "mac-address flapping aging-time <aging-time>",
        "undo mac-address flapping detection [ security-level { low | middle | high } | security-threshold <flapCnt> ]",
        "undo mac-address flapping detection exclude vlan { { { <vlan-id1> } [ to <vlan-id2> ] } &<1-10> | all }",
        "undo mac-address flapping aging-time",
        "mac-address flapping detection exclude bridge-domain <bd-id1> [ to <bd-id2> ]",
        "undo mac-address flapping detection exclude bridge-domain { <bd-id1> [ to <bd-id2> ] | all }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "security-level",
            "Info": "Globally enables or disables MAC address flapping detection with a specific security level.\n-"
        },
        {
            "Parameters": "low",
            "Info": "Sets the security level of MAC address flapping detection to low. That is, the system considers that MAC address flapping occurs after MAC address flapping occurs 500 times.\n-"
        },
        {
            "Parameters": "middle",
            "Info": "Specifies a middle security level for MAC address flapping detection. Specifically, after MAC addresses change for 10 times, the system considers that MAC address flapping occurs.\n-"
        },
        {
            "Parameters": "high",
            "Info": "Specifies a high security level for MAC address flapping detection. Specifically, after MAC addresses change for 3 times, the system considers that MAC address flapping occurs.\n-"
        },
        {
            "Parameters": "security-threshold <flapCnt>",
            "Info": "Specifies the security threshold for MAC address flapping detection. The system considers that MAC address flapping occurs when a MAC address flaps between interfaces for the specified number of times.\nThe value is an integer ranging from 3 to 10000."
        },
        {
            "Parameters": "<vlan-id1>",
            "Info": "Specifies the start VLAN ID number in the VLAN whitelist.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "to",
            "Info": "Specifies the range.\n-"
        },
        {
            "Parameters": "<vlan-id2>",
            "Info": "Specifies the end VLAN ID in the VLAN whitelist. If vlanEnd is not specified, only the VLAN specified by vlanBgn is displayed in the whitelist.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "aging-time <aging-time>",
            "Info": "Specified the aging period of MAC address flapping entries.\nThe value is an integer ranging from 60 to 900 seconds."
        },
        {
            "Parameters": "all",
            "Info": "Deletes all VLANs where MAC address flapping detection is performed from the whitelist.\n-"
        },
        {
            "Parameters": "<bd-id1>",
            "Info": "Specifies the start BD ID in a BD whitelist.\n\nThe parameter bridge-domain is supported only on the CE6866, CE6860-HAM, CE6860-SAN, CE6866K, CE6885, CE8851-32CQ4BQ, CE8851-32CQ8DQ-P, CE8855, CE8850-HAM, CE8850-SAN, CE8851K, CE6863H, CE6863H-K, CE6881H and CE6881H-K.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 16777215."
        },
        {
            "Parameters": "<bd-id2>",
            "Info": "Specifies the end BD ID in a BD whitelist. If <bd-id2> is not specified, the whitelist contains only the BD specified by <bd-id1>.\n\nThe parameter bridge-domain is supported only on the CE6866, CE6860-HAM, CE6860-SAN, CE6866K, CE6885, CE8851-32CQ4BQ, CE8851-32CQ8DQ-P, CE8855, CE8850-HAM, CE8850-SAN, CE8851K, CE6863H, CE6863H-K, CE6881H and CE6881H-K.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 16777215."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mac-address flapping detection exclude vlan 5"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mac-address flapping detection security-level middle"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mac-address flapping detection security-threshold 200"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mac-address flapping detection exclude bridge-domain 5 to 10"
        ]
    ],
    "ExtraInfo": ""
}