{
    "PageTitle": "mac-address learning (Layer 2 interface view)",
    "FuncDef": "The mac-address learning disable command disables MAC address learning.\nThe undo mac-address learning disable command enables MAC address learning.\nThe mac-address learning priority command sets a MAC address learning priority on an interface.\nThe undo mac-address learning priority command restores the default MAC address learning priority on an interface. The mac-address learning disable command disables MAC address learning. The undo mac-address learning disable command enables MAC address learning. The mac-address learning priority command sets a MAC address learning priority on an interface. The undo mac-address learning priority command restores the default MAC address learning priority on an interface. By default, MAC address learning is enabled, the MAC address learning priority is 0.",
    "CLIs": [
        "mac-address learning disable [ action { discard | forward } ]",
        "mac-address learning priority <priority-id>",
        "undo mac-address learning priority",
        "undo mac-address learning disable"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,Layer 2 10GE interface view,Layer 2 200GE interface view,25GE-L2 view,400GE-L2 view,Layer 2 50GE interface view,Layer 2 Eth-Trunk interface view,Layer 2 GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "action",
            "Info": "Indicates an action that a Layer 2 interface takes when MAC address learning is disabled on the Layer 2 interface.\nBy default, a Layer 2 interface takes the forward action when MAC address learning is disabled on the Layer 2 interface.\nThis parameter indicates whether packets are forwarded when a Layer 2 interface does not need to learn MAC addresses.\n-"
        },
        {
            "Parameters": "discard",
            "Info": "Indicates that a Layer 2 interface discards packets with a newly learned MAC address after MAC address learning is disabled on the Layer 2 interface.\n-"
        },
        {
            "Parameters": "forward",
            "Info": "Indicates that a Layer 2 interface forwards packets with a newly learned MAC address but does not record MAC address entries after MAC address learning is disabled on the Layer 2 interface.\n-"
        },
        {
            "Parameters": "<priority-id>",
            "Info": "Specifies a MAC address learning priority on an interface.\nThe value is an integer that ranges from 0 to 3. A larger value indicates a higher priority."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] mac-address learning priority 3"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] mac-address learning disable"
        ]
    ],
    "ExtraInfo": "If a network is stable, MAC address learning can be disabled on an interface or in a VLAN to save space of the MAC address table.\nAfter MAC address learning is disabled on an interface or in a VLAN using the mac-address learning disable command, the device will not learn new MAC addresses from this interface, Bridge Domain (BD) or the interfaces in this VLAN.\nAfter MAC address learning is enabled, a device can receive Ethernet frames from other devices, parse the source MAC address of each frame, locate the interface that receives each frame, and add new entries to the MAC address table. After that, when receiving an Ethernet frame destined for the MAC address contained in the MAC address table, the device can search the MAC address table to locate the corresponding outbound interface. This reduces broadcast traffic.\nFor a device whose uplink interface connects to a server and downlink interface connects to user terminals, you can set the MAC address learning priority on the interface connecting the server to a larger value to prevent unauthorized users from intruding the device by forging the server's MAC address. After different MAC address learning priorities are configured on interfaces, if the interfaces learn the same MAC address entry, the MAC address entry learned by the interface with a higher priority overwrites the entry learned by the interface with a lower priority. This mechanism prevents the device from learning forged server MAC address from other interfaces, so that users can access the correct server and normally use network resources.\nIf interfaces have the same MAC address learning priority, you can run the mac-address learning priority allow-flapping command to disable MAC address entry overwriting on interfaces with the same priority. Both the mac-address learning priority and the mac-address learning priority allow-flapping commands help improve network security. The differences are as follows:"
}