{
    "PageTitle": "peer mac-address limit",
    "FuncDef": "The peer mac-address limit command configures a MAC address learning limit rule to control the maximum number of MAC addresses that can be learned from a remote VTEP of a static VXLAN tunnel.\nThe undo peer mac-address limit command cancels the configuration. The peer mac-address limit command configures a MAC address learning limit rule to control the maximum number of MAC addresses that can be learned from a remote VTEP of a static VXLAN tunnel. The undo peer mac-address limit command cancels the configuration. By default, no MAC address learning limit rule is configured for a remote VTEP of a static VXLAN tunnel. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <ip-address> mac-addresslimit { maximum <max> | action { discard | forward } | alarm { enable | disable } }",
        "source <sourceIP> peer <ip-address> mac-addresslimit { maximum <max> | action { discard | forward } | alarm { enable | disable } }",
        "undo peer <ip-address> mac-addresslimit [ maximum <max> | action { discard | forward } | alarm { enable | disable } ]",
        "undo source <sourceIP> peer <ip-address> mac-addresslimit [ maximum <max> | action { discard | forward } | alarm { enable | disable } ]",
        "undo peer <ip-address> mac-addresslimitall"
    ],
    "ParentView": [
        "NVE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies the IP address of a remote VTEP.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "maximum <max>",
            "Info": "Specifies the maximum number of MAC address entries that can be learned.\nThe value is an integer ranging from 1 to 32767."
        },
        {
            "Parameters": "action",
            "Info": "Specifies an action to be taken when the number of MAC address entries in the MAC address table reaches the limit.\n-"
        },
        {
            "Parameters": "discard",
            "Info": "Indicates that the packet with the source MAC address not contained in the MAC address table is discarded.\n-"
        },
        {
            "Parameters": "forward",
            "Info": "The packet with the source MAC address not contained in the MAC address table is forwarded but its MAC address is not recorded.\n-"
        },
        {
            "Parameters": "alarm",
            "Info": "Specifies whether an alarm is generated when the number of the MAC address entries in the MAC address table reaches the limit.\n-"
        },
        {
            "Parameters": "enable",
            "Info": "Indicates that the system generates an alarm when the number of MAC address entries reaches the limit.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Indicates that the system does not send an alarm when the number of MAC address entries reaches the limit.\n-"
        },
        {
            "Parameters": "source <sourceIP>",
            "Info": "Specifies the source IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "all",
            "Info": "Indicates the limit on all MAC addresses.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface nve 1",
            "[*HUAWEI-Nve1] vni 1 head-end peer-list 2.2.2.2",
            "[*HUAWEI-Nve1] peer 2.2.2.2 mac-address limit maximum 1000"
        ]
    ],
    "ExtraInfo": "A MAC address table has limited capacity. When the number of dynamically learned and stored MAC addresses reaches the upper limit of the MAC address table, a device fails to learn source MAC addresses from subsequent incoming packets. Attackers may use this vulnerability of the MAC address table to attack a device.\nTo protect the device against such attacks and control the access user quantity, run the peer mac-address limit command to limit the maximum number of MAC addresses that can be learned from a specified remote VTEP of a static VXLAN tunnel. When the maximum number of MAC addresses learned from the specified remote VTEP is reached, the device can discard subsequent packets and report an alarm as configured."
}