{
    "PageTitle": "reset mac-address",
    "FuncDef": "The reset mac-address command deletes dynamically learned MAC address entries on a device. The reset mac-address command deletes dynamically learned MAC address entries on a device.",
    "CLIs": [
        "reset mac-address [ <interface-type> <interface-number> | <interface-name> ]",
        "reset mac-address { { <interface-type> <interface-number> | <interface-name> } vlan <vlan-id> | vlan <vlan-id> [ <interface-type> <interface-number> | <interface-name> ] }",
        "reset mac-address <mac-address> [ vlan <vlan-id> ]",
        "reset mac-address bridge-domain <bd-id>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies an interface number.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the interface name.\n-"
        },
        {
            "Parameters": "<mac-address>",
            "Info": "Specifies a MAC address.\nThe value is a hexadecimal number in the format of H-H-H. H is a 4-bit hexadecimal number, such as 00e0 or fc01. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0."
        },
        {
            "Parameters": "vlan <vlan-id>",
            "Info": "Specifies a VLAN ID.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "bridge-domain <bd-id>",
            "Info": "Specifies the BD ID.\n\nOnly the CE6885, CE8851-32CQ4BQ, CE8851-32CQ8DQ-P, CE8855, CE8851K, CE8850-SAN, CE8850-HAM, CE6866, CE6866K, CE6860-SAN, CE6860-HAM, CE6863H, CE6863H-K, CE6881H, and CE6881H-K support this parameters.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer that ranges from 1 to 16777215."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset mac-address 100GE 1/0/1"
        ],
        [
            "<HUAWEI> reset mac-address 00e0-fc12-3456"
        ]
    ],
    "ExtraInfo": "To delete dynamically learned MAC address entries (entries to be deserted, for example), run the reset mac-address command."
}