{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "xmodem",
    "FuncDef": [
        "To copy a Cisco IOS image to a router using the ROM monitor and the Xmodem or Ymodem protocol, use the **xmodem** command in ROM monitor mode. "
    ],
    "CLIs": [
        "xmodem [ -c ] [ -y ] [ -e ] [ -f ] [ -r ] [ -x ] [ -s <data-rate> ] [ <filename> ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **-c** ",
            "Info": " (Optional) CRC-16 checksumming, which is more sophisticated and thorough than standard checksumming. "
        },
        {
            "Parameters": " **-y** ",
            "Info": " (Optional) Uses the Ymodem protocol for higher throughput. "
        },
        {
            "Parameters": " **-e** ",
            "Info": " (Optional) Erases the first partition in Flash memory before starting the download. This option is only valid for the Cisco 1600 series. "
        },
        {
            "Parameters": " **-f** ",
            "Info": " (Optional) Erases all of Flash memory before starting the download. This option is only valid for the Cisco 1600 series. "
        },
        {
            "Parameters": " **-r** ",
            "Info": " (Optional) Downloads the file to DRAM. The default is Flash memory. "
        },
        {
            "Parameters": " **-x** ",
            "Info": " (Optional) Do not execute Cisco IOS image on completion of the download. "
        },
        {
            "Parameters": " **-s** *data-rate* ",
            "Info": " (Optional) Sets the console port's data rate during file transfer. Values are **1200**, **2400**, **4800**, **9600**, **19200**, **38400**, and **115200 bps**. The default rate is specified in the configuration register. This option is only valid for the Cisco 1600 series. "
        },
        {
            "Parameters": " *filename* ",
            "Info": " (Optional) Filename to copy. This argument is ignored when the **-r** keyword is specified, because only one file can be copied to DRAM. On the Cisco 1600 series routers, files are loaded to the ROM for execution. "
        }
    ],
    "Examples": [
        [
            "The following example uses the xmodem -c <filename> ROM monitor command to copy the file named new-ios-image from a remote or local computer:",
            "```",
            "rommon > xmodem -c new-ios-image",
            "```",
            "```",
            "```",
            "```",
            "Do not start the sending program yet...",
            "```",
            "```",
            "File size Checksum File name",
            "```",
            "```",
            "1738244 bytes (0x1a8604) 0xdd25 george-admin/c3600-i-mz",
            "```",
            "```",
            "```",
            "```",
            "WARNING: All existing data in bootflash will be lost!",
            "```",
            "```",
            "Invoke this application only for disaster recovery.",
            "```",
            "```",
            "Do you wish to continue? y/n [ n ] : yes",
            "```",
            "```",
            "Ready to receive file new-ios-image ...",
            "```"
        ]
    ],
    "ExtraInfo": "The Cisco 3600 series routers does not support XBOOT functionality. If your Cisco IOS image is erased or damaged, you cannot load a new image over the network.Use the **xmodem** ROM monitor command to download a new system image to your router from a local personal computer (such as a PC, Mac, or UNIX workstation), or a remote computer over a modem connection, to the router's console port. The computer must have a terminal emulation application that supports these protocols.Cisco 3600 Series RoutersYour router must have enough DRAM to hold the file being transferred, even if you are copying to Flash memory. The image is copied to the first file in internal Flash memory. Any existing files in Flash memory are erased. There is no support for partitions or copying as a second file.Cisco 1600 Series RoutersIf you include the **-r** option, your router must have enough DRAM to hold the file being transferred. To run from Flash, an image must be positioned as the first file in Flash memory. If you are copying a new image to boot from Flash, erase all existing files first.![](/c/dam/en/us/td/i/templates/caut.gif)---**Caution** ![](/c/dam/en/us/td/i/templates/blank.gif)A modem connection from the telephone network to your console port introduces security issues that you should consider before enabling the connection. For example, remote users can dial in to your modem and access the router's configuration settings.---![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)If the file to be downloaded is not a valid router image, the copy operation is automatically terminated.---",
    "RelatedCmds": [
        {
            "cmd": " **copy xmodem:** ",
            "description": " Copies a Cisco IOS image from a local or remote computer (such as a PC, Macintosh, or UNIX workstation) to Flash memory on a Cisco 3600 series router using the Xmodem protocol. "
        },
        {
            "cmd": " **copy ymodem:** ",
            "description": " Copies a Cisco IOS image from a local or remote computer (such as a PC, Macintosh, or UNIX workstation) to Flash memory on a Cisco 3600 series router using the Ymodem protocol. "
        }
    ]
}