{
    "PageTitle": "ipv6 address eui-64",
    "FuncDef": "The ipv6 address eui-64 command configures an EUI-64 global unicast address for an interface.\nThe undo ipv6 address eui-64 command deletes the configuration. The ipv6 address eui-64 command configures an EUI-64 global unicast address for an interface. The undo ipv6 address eui-64 command deletes the configuration. By default, no EUI-64 global unicast address is configured for an interface. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 address { <ipv6-address> <prefix-length> | <ipv6-address/prefix-length> } eui-64 [ tag <tag-value> ]",
        "undo ipv6 address { <ipv6-address> <prefix-length> | <ipv6-address/prefix-length> } eui-64 [ tag <tag-value> ]"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,Loopback interface view,Tunnel interface view,VBDIF interface view,VLANIF interface view,Management interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address to be configured for the interface.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<prefix-length>",
            "Info": "Specifies the prefix length of an IPv6 address.\nThe value is an integer that ranges from 1 to 128. In the EUI-64 address format, the prefix length must be less than 64."
        },
        {
            "Parameters": "<ipv6-address/prefix-length>",
            "Info": "Specifies the IPv6 address and prefix length of an interface.\nIPv6 address/IPv6 address prefix length."
        },
        {
            "Parameters": "tag <tag-value>",
            "Info": "Specifies a tag.\n<1-4294967295>"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswich",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] ipv6 address 2001:db8:1::1 64 eui-64"
        ]
    ],
    "ExtraInfo": "In the IPv6 addressing scheme, every IPv6 unicast address needs an interface identifier. The interface identifier is unique, similar to a 48-bit MAC address.\nThe interface identifier of an IPv6 host address complies with the IEEE EUI-64 format. A 64-bit interface identifier is generated based on an existing MAC address; therefore, such an interface identifier is unique globally.\nIf the interface has been configured with a MAC address, the EUI-64 address is generated based on the MAC address of the interface, with FFFE added in the middle.\nIf the interface has not been configured with a MAC address, the EUI-64 address is generated based on the following rules:"
}