{
    "PageTitle": "ipv6 address anycast",
    "FuncDef": "The ipv6 address anycast command configures an anycast IPv6 address.\nThe undo ipv6 address anycast command deletes an anycast IPv6 address. The ipv6 address anycast command configures an anycast IPv6 address. The undo ipv6 address anycast command deletes an anycast IPv6 address. By default, anycast IPv6 addresses are not configured. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 address { <ipv6-address> <prefix-length> | <ipv6-address/prefix-length> } anycast [ tag <tag-value> ]",
        "undo ipv6 address { <ipv6-address> <prefix-length> | <ipv6-address/prefix-length> } anycast [ tag <tag-value> ]"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,Loopback interface view,Tunnel interface view,VBDIF interface view,VLANIF interface view,Management interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address to be configured for the interface.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<prefix-length>",
            "Info": "Specifies the prefix length of an IPv6 address.\nThe value is an integer that ranges from 1 to 128. In the EUI-64 address format, the prefix length must be less than 64."
        },
        {
            "Parameters": "<ipv6-address/prefix-length>",
            "Info": "Specifies the IPv6 address and prefix length of an interface.\nIPv6 address/IPv6 address prefix length."
        },
        {
            "Parameters": "tag <tag-value>",
            "Info": "Specifies a label value.\n<1-4294967295>"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] ipv6 address 2001:db8:5::10 124 anycast"
        ]
    ],
    "ExtraInfo": "An anycast address is used to identify a group of interfaces that are configured on different nodes. The packets that are sent to an anycast address are transmitted to an interface that is in the interface group identified by the anycast address and is closest to the source node. (The distance between an interface and the source node is calculated based on a routing protocol).\nWhen the 6to4 tunnel is used for communication between the 6to4 network and the native IPv6 network, you can configure an anycast address whose prefix is 2002:c058:6301/48 on the tunnel interface of the 6to4 relay router. If an anycast address is used, you need to configure the same address for the tunnel interfaces of all devices. In this manner, the number of addresses is reduced."
}