{
    "PageTitle": "bsr-policy(VPN instance PIM view/PIM view of a public network instance)",
    "FuncDef": "The bsr-policy command limits the range of valid bootstrap router (BSR) addresses, so that a Router discards messages received from the BSRs not in the specified address range, preventing BSR spoofing.\nThe undo bsr-policy command restores the default configuration. The bsr-policy command limits the range of valid bootstrap router (BSR) addresses, so that a Router discards messages received from the BSRs not in the specified address range, preventing BSR spoofing. The undo bsr-policy command restores the default configuration. By default, the range of valid BSR addresses is not limited, so that a Router considers messages received from all BSRs valid.",
    "CLIs": [
        "bsr-policy { <bsrPolicyAclNum> | acl-name <acl-name> }",
        "undo bsr-policy"
    ],
    "ParentView": [
        "VPN instance PIM view,PIM view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "<bsrPolicyAclNum>",
            "Info": "Specifies the number of a basic ACL, which defines a policy for filtering BSR messages based on source addresses.\nThe value is an integer ranging from 2000 to 2999.\nThe value of this parameter must be the same as that of the basic-acl-number parameter specified in the acl command."
        },
        {
            "Parameters": "acl-name <acl-name>",
            "Info": "Specifies the name of a named basic ACL.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported. The name must start with a letter or digit, and cannot contain only digits."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl number 2001",
            "[*HUAWEI-acl4-basic-2001] rule permit source 10.1.1.0 0.0.0.255",
            "[*HUAWEI-acl4-basic-2001] quit",
            "[*HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] bsr-policy 2001"
        ]
    ],
    "ExtraInfo": "On a PIM-SM network that uses the BSR mechanism, any Router can be configured as a candidate-bootstrap router (C-BSR) and participate in a BSR election. The winner of the BSR election is responsible for advertising RP information on the network. These mechanisms leave chances for BSR spoofing."
}