{
    "PageTitle": "c-rp",
    "FuncDef": "The c-rp command configures a candidate-rendezvous point (C-RP) on a Router, so that the Router can announce itself as a C-RP to the bootstrap router (BSR).\nThe undo c-rp command deletes a C-RP. The c-rp command configures a candidate-rendezvous point (C-RP) on a Router, so that the Router can announce itself as a C-RP to the bootstrap router (BSR). The undo c-rp command deletes a C-RP. By default, no C-RP is configured.",
    "CLIs": [
        "c-rp { <interface-type> <interface-number> | <port-name> } [ group-policy { <basic-acl-number> | acl-name <acl-name> } | priority <priority> | holdtime <hold-interval> | advertisement-interval <adv-interval> ]",
        "undo c-rp { <interface-type> <interface-number> | <port-name> }"
    ],
    "ParentView": [
        "VPN instance PIM view,PIM view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type and number of an interface. The IP address of the specified interface is advertised as the C-RP address.\nTo avoid frequent protocol changes caused by interface flapping, using loopback interfaces is recommended.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the type and number of an interface. The IP address of the specified interface is advertised as the C-RP address.\nTo avoid frequent protocol changes caused by interface flapping, using loopback interfaces is recommended.\n-"
        },
        {
            "Parameters": "<port-name>",
            "Info": "Specifies the name of an interface.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "group-policy <basic-acl-number>",
            "Info": "Specifies the range of multicast groups served by a C-RP. The range is restricted to the multicast groups permitted by a specified ACL. basic-acl-number specifies the number of a basic ACL that defines the service range of the advertised RP.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "acl-name <acl-name>",
            "Info": "Specifies the name of a named basic ACL.\nThe value is a string of 1 to 32 case-sensitive characters without spaces. The value must start with a letter or digit, and cannot contain only digits."
        },
        {
            "Parameters": "priority <priority>",
            "Info": "Specifies a priority value for a C-RP. A larger value indicates a lower C-RP priority.\nThe value is an integer ranging from 0 to 255. The default value is 0."
        },
        {
            "Parameters": "holdtime <hold-interval>",
            "Info": "Specifies a timeout period during which the BSR waits to receive an Advertisement message from a C-RP.\nThe value is an integer ranging from 1 to 65535, in seconds. The default value is 150 seconds."
        },
        {
            "Parameters": "advertisement-interval <adv-interval>",
            "Info": "Specifies an interval at which a C-RP sends Advertisement messages.\nThe value is an integer ranging from 1 to 65535, in seconds. The default value is 60 seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] acl number 2069",
            "[*HUAWEI-acl4-basic-2069] rule permit source 225.1.0.0 0.0.255.255",
            "[*HUAWEI-acl4-basic-2069] rule permit source 226.2.0.0 0.0.255.255",
            "[*HUAWEI-acl4-basic-2069] quit",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] c-rp 100GE 1/0/1 group-policy 2069 priority 10"
        ]
    ],
    "ExtraInfo": "An RP is the core of a PIM-SM network. Therefore, a C-RP must be able to communicate with other devices. It is recommended that you configure a C-RP on the backbone network device and reserve sufficient bandwidth between the device and other devices.\nThe rules for a C-RP to compete for an RP are as follows:"
}