{
    "PageTitle": "c-rp policy",
    "FuncDef": "The c-rp policy command limits the range of valid candidate-rendezvous point (C-RP) addresses and the range of multicast addresses served by a C-RP. The bootstrap router (BSR) drops C-RP messages that carry addresses not in the range of valid C-RP addresses.\nThe undo c-rp policy command restores the default configuration. The c-rp policy command limits the range of valid candidate-rendezvous point (C-RP) addresses and the range of multicast addresses served by a C-RP. The bootstrap router (BSR) drops C-RP messages that carry addresses not in the range of valid C-RP addresses. The undo c-rp policy command restores the default configuration. By default, the range of valid C-RP addresses and the range of multicast groups served by a C-RP are not limited. That is, the BSR considers all received C-RP messages valid.",
    "CLIs": [
        "c-rp policy { <policyNum> | acl-name <acl-name> }",
        "undo c-rp policy"
    ],
    "ParentView": [
        "VPN instance PIM view,PIM view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "<policyNum>",
            "Info": "Specifies the number of an advanced ACL that defines the filtering policy for the range of C-RP addresses and the range of group addresses served by a C-RP.\nThe value is an integer ranging from 3000 to 3999."
        },
        {
            "Parameters": "acl-name <acl-name>",
            "Info": "Specifies the name of a named ACL.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported. The name must start with a letter or digit, and cannot contain only digits."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl number 3100",
            "[*HUAWEI-acl4-advance-3100] rule permit ip source 1.1.1.1 0 destination 225.1.0.0 0.0.255.255",
            "[*HUAWEI-acl4-advance-3100] quit",
            "[*HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] c-rp policy 3100"
        ]
    ],
    "ExtraInfo": "On a PIM SM network that uses the BSR mechanism, any router can be configured as a C-RP, and serves the multicast groups in a specified address range. Each C-RP sends its information to the BSR in unicast mode. The BSR summarizes all received C-RP information as an RP-set, and floods it through BSR messages on the entire network. The local router then works out the RP to which a specific multicast group address range corresponds based on the RP-set.\nTo protect valid C-RPs from being spoofed, run the c-rp policy command to limit the range of valid C-RP addresses and the range of multicast group addresses served by a C-RP. You must configure the same filtering rule on each C-BSR because any C-BSR may become the BSR."
}