{
    "PageTitle": "pim ignore assert-state",
    "FuncDef": "The pim ignore assert-state command enables an interface to ignore the Assert state.\nThe undo pim ignore assert-state command restores the default configuration. The pim ignore assert-state command enables an interface to ignore the Assert state. The undo pim ignore assert-state command restores the default configuration. By default, an interface is not enabled to ignore the PIM Assert state.",
    "CLIs": [
        "pim ignore assert-state",
        "undo pim ignore assert-state"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] quit",
            "[*HUAWEI] vlan 1",
            "[*HUAWEI-vlan1] quit",
            "[*HUAWEI] interface Vlanif 1",
            "[*HUAWEI-Vlanif1] pim ignore assert-state"
        ]
    ],
    "ExtraInfo": "On a network with multiple devices, when one device receives multicast traffic from a downstream interface of a multicast group, other devices on the network are forwarding multicast traffic. In this case, the devices send PIM Assert messages to each other, and Assert election takes place. Each device sends an Assert message to select an optimal path. The corresponding interfaces of Assert losers are pruned from packet forwarding. When the Assert winner is blocked, the Assert loser's corresponding interface can forward traffic again only after the assert message times out. To prevent this problem, run the command to enable an interface to ignore the Assert state. An Assert election will then not be performed between the master and backup devices, preventing multicast traffic interruptions during the timeout period.In PIM-DM mode, this command can be configured but does not take effect."
}