{
    "PageTitle": "reset pim routing-table(User view)",
    "FuncDef": "The reset pim routing-table command clears PIM status information in PIM routing entries. The reset pim routing-table command clears PIM status information in PIM routing entries.",
    "CLIs": [
        "reset pim routing-table all",
        "reset pim vpn-instance <vpn-instance-name> routing-tableall",
        "reset pim routing-table group <groupAddr> mask { <group-mask-length> | <group-mask-addr> } source <sourceAddr>",
        "reset pim vpn-instance <vpn-instance-name> routing-tablegroup <groupAddr> mask { <group-mask-length> | <group-mask-addr> } source <sourceAddr>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance to which a PIM routing entry belongs. If this parameter is not specified, the command deletes PIM entries of the public network instance.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "all",
            "Info": "Indicates all routing entries.\n-"
        },
        {
            "Parameters": "group <groupAddr>",
            "Info": "Specifies the group address of a PIM routing entry.\nThe value ranges from 224.0.0.0 to 239.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "mask { <group-mask-length> | <group-mask-addr> }",
            "Info": "Specifies the mask length or mask address of a PIM routing entry group address.\nMask length: The value is an integer that ranges from 4 to 32.\nMask address: The value ranges from 240.0.0.0 to 255.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "source <sourceAddr>",
            "Info": "Specifies the source address of a PIM routing entry.\nThe value is in dotted decimal notation. If the specified PIM entry is an (*, G) entry, the source address is 0.0.0.0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset pim routing-table all"
        ]
    ],
    "ExtraInfo": "You can run this command to clear PIM status information in all PIM routing entries or a specified PIM routing entry. After this command is run, data forwarding of the corresponding PIM routing entry is stopped."
}