{
    "PageTitle": "rpf-prune-delay",
    "FuncDef": "The rpf-prune-delay command sets a delay in sending Prune messages to upstream devices, so that Prune messages are not sent immediately when a PIM-SM SPT or PIM-SSM route change occurs.\nThe undo rpf-prune-delay command restores the default configuration. The rpf-prune-delay command sets a delay in sending Prune messages to upstream devices, so that Prune messages are not sent immediately when a PIM-SM SPT or PIM-SSM route change occurs. The undo rpf-prune-delay command restores the default configuration. By default, no delay is set in sending Prune messages to upstream devices. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "rpf-prune-delay <delay-time> [ policy { <acl-number> | acl-name <acl-name> } ]",
        "undo rpf-prune-delay [ <delay-time> [ policy { <acl-number> | acl-name <acl-name> } ] ]"
    ],
    "ParentView": [
        "VPN instance PIM view,PIM view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "<delay-time>",
            "Info": "Sets a delay in sending Prune messages to upstream devices.\nThe value is an integer ranging from 1 to 300, in seconds."
        },
        {
            "Parameters": "policy",
            "Info": "Indicates a matching policy for multicast entries to be pruned.\n-"
        },
        {
            "Parameters": "<acl-number>",
            "Info": "Specifies an ACL number.\nThe value is an integer ranging from 2000 to 3999."
        },
        {
            "Parameters": "acl-name <acl-name>",
            "Info": "Specifies an ACL number.\nThe value is a string of 1 to 32 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] rpf-prune-delay 210"
        ]
    ],
    "ExtraInfo": ""
}