{
    "PageTitle": "rpf-switch-delay max-time",
    "FuncDef": "The rpf-switch-delay max-time command sets the maximum delay in delivering forwarding entries on the new link after a switchback in PIM-SM or PIM-SSM mode.\nThe undo rpf-switch-delay max-time command restores the default delay in delivering forwarding entries on the new link after a switchback in PIM-SM or PIM-SSM mode. The rpf-switch-delay max-time command sets the maximum delay in delivering forwarding entries on the new link after a switchback in PIM-SM or PIM-SSM mode. The undo rpf-switch-delay max-time command restores the default delay in delivering forwarding entries on the new link after a switchback in PIM-SM or PIM-SSM mode. By default, the maximum delay in delivering forwarding entries on a new link after a switchback is the default value. The default value is 350 seconds in PIM-SM mode and 150 seconds in PIM-SSM mode. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "rpf-switch-delay mode sm max-time <smTimeValue>",
        "rpf-switch-delay mode ssm max-time <ssmTimeValue>",
        "undo rpf-switch-delay mode sm max-time [ <smTimeValue> ]",
        "undo rpf-switch-delay mode ssm max-time [ <ssmTimeValue> ]"
    ],
    "ParentView": [
        "VPN instance PIM view,PIM view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "<smTimeValue>",
            "Info": "Specifies the maximum SM time, in seconds.\nThe value is an integer ranging from 1 to 1800, in seconds."
        },
        {
            "Parameters": "mode",
            "Info": "Indicates the PIM mode.\n-"
        },
        {
            "Parameters": "ssm",
            "Info": "Indicates the PIM-SSM mode.\n-"
        },
        {
            "Parameters": "<ssmTimeValue>",
            "Info": "Specifies the maximum SSM time, in seconds.\nThe value is an integer ranging from 1 to 1800, in seconds."
        },
        {
            "Parameters": "sm",
            "Info": "Indicates the PIM-SM mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] rpf-switch-delay mode ssm max-time 160"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] rpf-switch-delay mode sm max-time 360"
        ]
    ],
    "ExtraInfo": ""
}