{
    "PageTitle": "ssm-policy",
    "FuncDef": "The ssm-policy command sets the range of Source-Specific Multicast (SSM) group addresses.\nThe undo ssm-policy command restores the default configuration. The ssm-policy command sets the range of Source-Specific Multicast (SSM) group addresses. The undo ssm-policy command restores the default configuration. By default, the range of SSM group addresses is 232.0.0.0/8.",
    "CLIs": [
        "ssm-policy { <basic-acl-number> | acl-name <acl-name> }",
        "undo ssm-policy"
    ],
    "ParentView": [
        "VPN instance PIM view,PIM view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "<basic-acl-number>",
            "Info": "Specifies the number of the basic ACL that defines the range of SSM group addresses.\nThe value ranges from 2000 to 2999."
        },
        {
            "Parameters": "acl-name <acl-name>",
            "Info": "Specifies the name of a named basic ACL.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported. The name must start with a letter or digit, and cannot contain only digits."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl number 2000",
            "[*HUAWEI-acl4-basic-2000] rule permit source 232.1.0.0 0.0.255.255",
            "[*HUAWEI-acl4-basic-2000] quit",
            "[*HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] ssm-policy 2000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl name myacl basic",
            "[*HUAWEI-acl4-basic-myacl] rule permit source 232.1.0.0 0.0.255.255",
            "[*HUAWEI-acl4-basic-myacl] quit",
            "[*HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] ssm-policy acl-name myacl"
        ]
    ],
    "ExtraInfo": "The ssm-policy command specifies the range of PIM-SSM group addresses. All interfaces on which PIM-SM is enabled consider that multicast groups that belong to the address range are in PIM-SSM mode.\nWith the ssm-policy command configured, the SSM group address range can be beyond 232.0.0.0/8, and the valid multicast group address ranges from 224.0.1.0 to 239.255.255.255. The groups that are not in the SSM group address range all adopt the Any-Source Multicast (ASM) mode.\nThe SSM mode can be used in the following situations:"
}