{
    "PageTitle": "static-rp",
    "FuncDef": "The static-rp command configures a static rendezvous point (RP).\nThe undo static-rp command deletes the configuration. The static-rp command configures a static rendezvous point (RP). The undo static-rp command deletes the configuration. By default, no static RP is configured.",
    "CLIs": [
        "static-rp <rp-address> [ <basic-acl-number> | acl-name <acl-name> ] [ preferred ]",
        "undo static-rp <rp-address>"
    ],
    "ParentView": [
        "VPN instance PIM view,PIM view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "<rp-address>",
            "Info": "Specifies a static RP address.\nThe value is in dotted decimal notation. It must be a valid unicast IP address and cannot be configured as an address on the network segment 127.0.0.0/8."
        },
        {
            "Parameters": "<basic-acl-number>",
            "Info": "Specifies the name of a named basic ACL.\nThe value is an integer that ranges from 2000 to 2999."
        },
        {
            "Parameters": "acl-name <acl-name>",
            "Info": "Specifies the name of a named basic ACL.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported. The name must start with a letter or digit, and cannot contain only digits."
        },
        {
            "Parameters": "preferred",
            "Info": "Indicates that a static RP is preferred.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] acl number 2001",
            "[*HUAWEI-acl4-basic-2001] rule permit source 225.1.0.0 0.0.255.255",
            "[*HUAWEI-acl4-basic-2001] quit",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] static-rp 192.168.0.6 2001 preferred"
        ]
    ],
    "ExtraInfo": "When only one RP exists on a network, you can run the static-rp command to configure a static RP. Compared with dynamic RP election using the bootstrap router (BSR) mechanism, the static RP mechanism can reduce bandwidth occupied by messages exchanged between candidate-rendezvous points (C-RPs) and the BSR. To make the static RP work properly, you must run the static-rp command on all Routers."
}