{
    "PageTitle": "apply cost",
    "FuncDef": "The apply cost command sets the MED value for BGP routes or cost value for routes of other protocols.\nThe undo apply cost command cancels the configuration. The apply cost command sets the MED value for BGP routes or cost value for routes of other protocols. The undo apply cost command cancels the configuration. By default, no MED value is set for BGP routes nor cost value is set for routes of other protocols.",
    "CLIs": [
        "apply cost [ + | - ] <cost>",
        "apply cost inherit",
        "apply cost none",
        "undo apply cost"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "+",
            "Info": "Increases the route cost. If the link quality is poor or the link bandwidth is low, specify this parameter to increase the route cost, which helps control route selection.\nIf the MED of BGP routes or cost of non-BGP routes is greater than the maximum value (4294967295) after the adjustment, 4294967295 takes effect."
        },
        {
            "Parameters": "-",
            "Info": "Reduces the route cost. If the link quality is good or the link bandwidth is high, specify this parameter to reduce the route cost, which helps control route selection.\nIf the MED of BGP routes or cost of non-BGP routes is less than the minimum value (0) after the adjustment, 0 takes effect."
        },
        {
            "Parameters": "<cost>",
            "Info": "Specifies the route cost. To control route selection, adjust the route cost to prevent routing loops.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "inherit",
            "Info": "Inherits the original route cost.\nThis function applies to IGP routes, not to BGP routes.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Delete the MED value of BGP routes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy policy permit node 10",
            "[*HUAWEI-route-policy] apply cost 120"
        ]
    ],
    "ExtraInfo": "After the filtering conditions specified by if-match clauses are met, you can run the apply cost command to change the cost of the route to control the route selection sequence. After the cost of the routes to be matched is set, the cost of the routes imported by using the policy changes accordingly."
}