{
    "PageTitle": "apply extcommunity bandwidth",
    "FuncDef": "The apply extcommunity bandwidth command sets the bandwidth extended community attribute for routes.\nThe undo apply extcommunity bandwidth command deletes the bandwidth extended community attribute. The apply extcommunity bandwidth command sets the bandwidth extended community attribute for routes. The undo apply extcommunity bandwidth command deletes the bandwidth extended community attribute. By default, no bandwidth extended community attribute values are set for routes.",
    "CLIs": [
        "apply extcommunity bandwidth { <extCmntyString> | none }",
        "apply extcommunity bandwidth aggregate [ limit <bandwidth-value> ]",
        "apply extcommunity bandwidth aggregate-upstream [ limit <upstream-bandwidth> ]",
        "undo apply extcommunity bandwidth [ <extCmntyString> | none ]",
        "undo apply extcommunity bandwidth aggregate [ limit <bandwidth-value> ]",
        "undo apply extcommunity bandwidth aggregate-upstream [ limit <upstream-bandwidth> ]"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "<extCmntyString>",
            "Info": "Specifies the bandwidth extended community attribute value.\nThe value of the bandwidth extended community attribute consists of the AS number and bandwidth value. The format is AS number:bandwidth value, for example, 1:100, in which the AS number ranges from 1 to 65535, and the bandwidth value ranges from 1 to 4294967295."
        },
        {
            "Parameters": "none",
            "Info": "Clears the bandwidth extended community attribute of routes.\n-"
        },
        {
            "Parameters": "aggregate",
            "Info": "Indicates the aggregated bandwidth extended community attribute.\n-"
        },
        {
            "Parameters": "limit",
            "Info": "Indicates the maximum value of the aggregated bandwidth extended community attribute.\n-"
        },
        {
            "Parameters": "<bandwidth-value>",
            "Info": "Specifies the aggregated bandwidth.\nThe value is an integer ranging from 1 to 4294967295, in kbit/s."
        },
        {
            "Parameters": "aggregate-upstream",
            "Info": "Indicates the aggregated uplink bandwidth extended community attribute.\n-"
        },
        {
            "Parameters": "<upstream-bandwidth>",
            "Info": "Specifies the aggregated uplink bandwidth (kbit/s).\nThe value is an integer ranging from 1 to 4294967295, in kbit/s."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy aaa permit node 1",
            "[~HUAWEI-route-policy] apply extcommunity bandwidth 1:1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy aaa permit node 1",
            "[~HUAWEI-route-policy] apply extcommunity bandwidth aggregate limit 100"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy aaa permit node 1",
            "[~HUAWEI-route-policy] apply extcommunity bandwidth none"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy aaa permit node 1",
            "[~HUAWEI-route-policy] apply extcommunity bandwidth aggregate-upstream limit 100"
        ]
    ],
    "ExtraInfo": "After the apply extcommunity bandwidth command is run, the routes advertised by the device carry the bandwidth extended community attribute, which is used to identify sites. After the apply extcommunity bandwidth aggregate-upstream command is run, the routes advertised by the device carry the aggregated uplink bandwidth extended community attribute. BGP accumulates the uplink bandwidths of the routes for load balancing and uses the sum as the final result. If the final result is greater than the value of limit, the value of limit is used. Pay attention to the following points when using this command:\nRun the route-policy command first to enter the route-policy view.\nA route-policy can consist of multiple nodes. The relationship between different nodes is OR. The system checks each node in sequence based on the node sequence number. The later matched node overwrites the previous one."
}