{
    "PageTitle": "apply local-preference",
    "FuncDef": "The apply local-preference command sets the local preference (Local-Pref) for BGP routes.\nThe undo apply local-preference command cancels the configuration. The apply local-preference command sets the local preference (Local-Pref) for BGP routes. The undo apply local-preference command cancels the configuration. By default, for a locally generated route and route learned from an EBGP peer (such routes do not carry the Local-Pref attribute), the device uses 100 as the local preference of those routes during route selection; for a route learned from an IBGP peer (such a route carries the Local-Pref attribute), the device uses the carried Local-Pref attribute value as the local preference of the route.",
    "CLIs": [
        "apply local-preference [ + | - ] <preference>",
        "undo apply local-preference"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "+",
            "Info": "Increases the local preference of BGP routes, with the final local preference of a BGP route not greater than 4294967295. If a BGP route does not carry the Local-Pref attribute, the device uses 0 as the base local preference.\n-"
        },
        {
            "Parameters": "-",
            "Info": "Reduces the local preference of BGP routes, with the final local preference of a BGP route not smaller than 0. If a BGP route does not carry the Local-Pref attribute, the device uses 0 as the base local preference. In this case, the local preference of the BGP route is still 0 after the deduction.\n-"
        },
        {
            "Parameters": "<preference>",
            "Info": "Specifies the local preference of BGP routes.\nThe value is an integer ranging from 0 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy aaa permit node 10",
            "[*HUAWEI-route-policy] apply local-preference 130",
            "[*HUAWEI-route-policy] quit",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 200",
            "[*HUAWEI-bgp] peer 10.1.1.1 route-policy aaa import"
        ]
    ],
    "ExtraInfo": "The Local-Pref attribute is a proprietary attribute of BGP, used to determine the optimal route when traffic leaves an AS. When a BGP device obtains multiple routes with the same destination address but different next hops through IBGP peers, the route with the largest Local_Pref value is selected. The apply local-preference command sets only the local preference for BGP routes."
}