{
    "PageTitle": "apply community",
    "FuncDef": "The apply community command applies a BGP community attribute.\nThe undo apply community command deletes the configuration. The apply community command applies a BGP community attribute. The undo apply community command deletes the configuration. By default, no BGP community attributes are applied.",
    "CLIs": [
        "apply community none",
        "apply community { <cmntyValue> | <cmntyNum> | internet | no-advertise | no-export | no-export-subconfed } &<1-32> [ additive ]",
        "undo apply community"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "<cmntyValue>",
            "Info": "Specifies a community attribute, in the format of aa:nn.\naa and nn are integers, each ranging from 0 to 65535."
        },
        {
            "Parameters": "<cmntyNum>",
            "Info": "Specifies the community number.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "internet",
            "Info": "Indicates that the routes that match the filtering conditions can be sent to all peers. By default, all routes belong to the Internet community.\n-"
        },
        {
            "Parameters": "no-advertise",
            "Info": "Indicates that the routes that match the filtering conditions are not sent to any peer.\n-"
        },
        {
            "Parameters": "no-export",
            "Info": "Indicates that the routes that match the filtering conditions are sent to other sub-ASs but not to other ASs.\n-"
        },
        {
            "Parameters": "no-export-subconfed",
            "Info": "Indicates that the routes that match the filtering conditions are neither sent to other sub-ASs nor to other ASs.\n-"
        },
        {
            "Parameters": "additive",
            "Info": "Indicates that community attributes are added to the routes that match the filtering conditions.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Deletes all the community attributes of routes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip as-path-filter 8 permit ^10_",
            "[*HUAWEI] route-policy setcommunity permit node 16",
            "[*HUAWEI-route-policy] if-match as-path-filter 8",
            "[*HUAWEI-route-policy] apply community no-export"
        ]
    ],
    "ExtraInfo": "The community attribute, a private attribute of BGP, simplifies the application of routing policies and facilitates route maintenance and management. A community is a set of destination addresses with the same characteristics. These addresses have no physical boundary and are independent of their ASs. They share one or multiple community attributes, which can be changed or set using the apply community command."
}