{
    "PageTitle": "apply as-path most-recent",
    "FuncDef": "The apply as-path most-recent command sets the number of times that the most recent AS number is added to routes.\nThe undo apply as-path most-recent command cancels the configuration of the number of times that the most recent AS number is added to routes. The apply as-path most-recent command sets the number of times that the most recent AS number is added to routes. The undo apply as-path most-recent command cancels the configuration of the number of times that the most recent AS number is added to routes. By default, the number of times the most recent AS number is appended is not set.",
    "CLIs": [
        "apply as-path most-recent <most-recent-value>",
        "undo apply as-path most-recent [ <most-recent-value> ]"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "<most-recent-value>",
            "Info": "Specifies the number of times the most recent AS number is appended to the beginning of the AS path.\nThe value is an integer ranging from 0 to 32."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy policy permit node 10",
            "[*HUAWEI-route-policy] apply as-path most-recent 3"
        ]
    ],
    "ExtraInfo": "The AS_Path attribute is a private attribute of BGP. The apply as-path most-recent command is valid only for BGP routes. The AS_Path attribute records the numbers of all ASs that a route passes through from the local end to the destination in the vector order. The AS_Path attribute can be used to control route selection and prevent routing loops. If multiple routes to the same destination are available, BGP compares the AS_Path attributes of these routes and considers the route with the shortest AS_Path as the optimal route.\nBy using a routing policy to change the AS_Path attribute, you can control BGP route selection and the forwarding path of data traffic. If filtering conditions are specified using an if-match clause and the matching mode is permit, you can run the apply as-path most-recent command to append the most recent AS number in the existing AS path of each matched route to the beginning of the AS path for the specified number of times.\nYou can run the route-policy command to enter the route-policy view.\nA route-policy can consist of multiple nodes. The relationship between different nodes is OR. The system checks each node according to the node sequence number. If a route matches one node, the route matches the route-policy and is no longer matched against other nodes.\nEach node can consist of a group of if-match and apply clauses. The if-match clauses define the matching rules. The matching objects are some attributes of the routing information. The relationship between multiple if-match clauses for different attributes of a node is AND. A route passes the matching test only when all the matching conditions specified by the if-match clauses of the node are met. The relationship between multiple if-match clauses for the same attribute is OR. Thai is, the system checks the if-match clauses in sequence. If a route matches one of the if-match clauses, the route matches the route-policy and is no longer matched against other if-match clauses. For example, in node 10, the if-match community-filter 1 and if-match as-path-filter 1 commands are used to filter routes based on different attributes. The relationship between the two commands is AND. In node 20, if-match community-filter 1 and if-match community-filter 2 are used to filter routes based on communities. The relationship between if-match community-filter 1 and if-match community-filter 2 is OR. The apply clauses specify actions. That is, the apply clauses set some attributes of the route after the route matches the node."
}