{
    "PageTitle": "apply comm-filter delete",
    "FuncDef": "The apply comm-filter delete command deletes a BGP community attribute based on the specified value in a community filter.\nThe undo apply comm-filter command cancels the configuration. The apply comm-filter delete command deletes a BGP community attribute based on the specified value in a community filter. The undo apply comm-filter command cancels the configuration. By default, the community attributes of BGP routes are not deleted.",
    "CLIs": [
        "apply comm-filter { <basIndex> | <advIndex> } delete",
        "apply comm-filter <cmntyName> delete",
        "undo apply comm-filter"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "<basIndex>",
            "Info": "Specifies the number of a basic community filter.\nThe value is an integer that ranges from 1 to 99."
        },
        {
            "Parameters": "<advIndex>",
            "Info": "Specifies the number of an advanced community filter.\nThe value is an integer ranging from 100 to 199."
        },
        {
            "Parameters": "<cmntyName>",
            "Info": "Specifies the name of a community filter.\nThe value is a string of 1 to 51 case-sensitive characters and cannot contain digits only. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip community-filter 1 permit 1:200",
            "[*HUAWEI] ip community-filter 1 permit 2:200",
            "[*HUAWEI] ip community-filter 1 permit 3:200",
            "[*HUAWEI] route-policy test permit node 10",
            "[*HUAWEI-route-policy] apply comm-filter 1 delete"
        ]
    ],
    "ExtraInfo": "The community attribute is a private attribute of BGP, and the apply comm-filter delete command is valid only for BGP routes.\nWhen the apply comm-filter delete command is run in the Route-policy view to delete the values from the community filter, only one community attribute can be specified in the ip community-filter command. If multiple community attributes are configured in the same community filter, running the apply comm-filter delete command cannot delete these community attributes. To delete the community attributes, you need to run the ip community-filter command several times to configure community attributes one by one, and then run the apply comm-filter delete command to delete these community attributes."
}