{
    "PageTitle": "apply cost-type",
    "FuncDef": "The apply cost-type command sets the cost type of a route.\nThe undo apply cost-type command cancels the configuration. The apply cost-type command sets the cost type of a route. The undo apply cost-type command cancels the configuration. By default, no cost type of a route is set.",
    "CLIs": [
        "apply cost-type { external | internal | type-1 | type-2 | internal-inc-ibgp | med-plus-igp }",
        "undo apply cost-type"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "external",
            "Info": "Sets the cost type to IS-IS external.\n-"
        },
        {
            "Parameters": "internal",
            "Info": "Sets the cost type to IS-IS internal or sets the MED of a BGP route to the cost of the IGP route to which the BGP route recurses. This parameter takes effect only on EBGP peers.\n-"
        },
        {
            "Parameters": "type-1",
            "Info": "Sets the cost type to OSPF external Type 1.\n-"
        },
        {
            "Parameters": "type-2",
            "Info": "Sets the cost type to OSPF external Type 2.\n-"
        },
        {
            "Parameters": "internal-inc-ibgp",
            "Info": "Sets the cost type to IS-IS internal or enables the MED of a BGP route to inherit the cost of the IGP route to which the BGP route recurses. This parameter takes effect both on EBGP and IBGP peers.\n-"
        },
        {
            "Parameters": "med-plus-igp",
            "Info": "Sets the MED of a BGP route by adding the original MED to the cost of the IGP route to which the BGP route recurses. This parameter takes effect both on EBGP and IBGP peers.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy policy permit node 10",
            "[*HUAWEI-route-policy] apply cost-type type-1"
        ]
    ],
    "ExtraInfo": "To set the cost type for the routes that match an if-match clause, run the apply cost-type command. After the cost type of the routes that match a route-policy is set, the routes that are imported using the route-policy carry the set cost type."
}