{
    "PageTitle": "if-match prefix mod",
    "FuncDef": "The if-match prefix mod command configures a matching rule that is based on the route prefix modulo operation result.\nThe undo if-match prefix mod command deletes a matching rule that is based on the route prefix modulo operation result. The if-match prefix mod command configures a matching rule that is based on the route prefix modulo operation result. The undo if-match prefix mod command deletes a matching rule that is based on the route prefix modulo operation result. By default, no matching rule that is based on the route prefix modulo operation result is configured.",
    "CLIs": [
        "if-match prefix mod <mod-value> equal <mod-result>",
        "undo if-match prefix mod [ <mod-value> equal <mod-result> ]"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "<mod-value>",
            "Info": "Specifies a route prefix modulus value.\nThe value is an integer ranging from 1 to 128."
        },
        {
            "Parameters": "equal",
            "Info": "Indicates that the route prefix modulo operation result must be the specified mod-result.\n-"
        },
        {
            "Parameters": "<mod-result>",
            "Info": "Specifies the route prefix modulo operation result.\nThe value is an integer ranging from 0 to 127.\nThe value of mod-result must be less than that of mod-value."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy policy permit node 10",
            "[*HUAWEI-route-policy] if-match prefix mod 4 equal 1",
            "[*HUAWEI-route-policy] apply cost 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] route-policy policy permit node 20",
            "[*HUAWEI-route-policy] if-match prefix mod 4 equal 2",
            "[*HUAWEI-route-policy] apply cost 20"
        ]
    ],
    "ExtraInfo": "To configure a matching rule that is based on the route prefix modulo operation result, run the if-match prefix mod command. In addition, a route prefix modulo operation rule needs to be configured so that IP address-based load balancing can be implemented.\nIn most cases, the route prefix modulus value is set to the number of devices that participate in load balancing.\nYou need to configure a route-policy for the matching rule."
}