{
    "PageTitle": "if-match ipv6 next-hop acl",
    "FuncDef": "The if-match ipv6 next-hop acl command configures a filtering rule that is based on next-hop addresses of IPv6 routes.\nThe undo if-match ipv6 next-hop acl command cancels the configuration. The if-match ipv6 next-hop acl command configures a filtering rule that is based on next-hop addresses of IPv6 routes. The undo if-match ipv6 next-hop acl command cancels the configuration. By default, no filtering rule based on next-hop addresses of IPv6 routes is configured. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "if-match ipv6 next-hop acl { <acl-number> | <acl-name> }",
        "undo if-match ipv6 next-hop acl { <acl-number> | <acl-name> }"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "<acl-number>",
            "Info": "Specifies the number of a basic ACL.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "<acl-name>",
            "Info": "Specifies the name of a named basic ACL.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported. The name must start with a letter or digit, and cannot contain only digits."
        },
        {
            "Parameters": "acl",
            "Info": "Specifies the ACL for route filtering.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 2000",
            "[*HUAWEI-acl6-basic-2000] quit",
            "[*HUAWEI] route-policy policy permit node 10",
            "[*HUAWEI-route-policy] if-match ipv6 next-hop acl 2000"
        ]
    ],
    "ExtraInfo": "When you run the if-match ipv6 next-hop acl command to match the next hop of an IPv6 route, an ACL must be used together with the if-match ipv6 next-hop acl command. For example:"
}