{
    "PageTitle": "if-match cost",
    "FuncDef": "The if-match cost command sets a filtering rule that is based on the route cost.\nThe undo if-match cost command cancels the configuration. The if-match cost command sets a filtering rule that is based on the route cost. The undo if-match cost command cancels the configuration. By default, no filtering rule based on the route cost is set.",
    "CLIs": [
        "if-match cost <cost>",
        "if-match cost greater-equal <greater-equal-value> less-equal <less-equal-value>",
        "if-match cost { greater-equal <greater-equal-value> | less-equal <less-equal-value> }",
        "undo if-match cost"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "<cost>",
            "Info": "Specifies the route cost. Route costs can be changed to prevent routing loops.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "greater-equal <greater-equal-value>",
            "Info": "Specifies the minimum value of route cost.\nThe value is an integer ranging from 0 to 4294967294."
        },
        {
            "Parameters": "less-equal <less-equal-value>",
            "Info": "Specifies the maximum value of route cost.\nThe value is an integer ranging from 1 to 4294967295.\nless-equal-value is demanded to be greater than greater-equal-value.If greater-equal is specified, but less-equal is not, the maximum value 4294967295 is used as less-equal. If less-equal is specified, but greater-equal is not, the minimum value 0 is used as greater-equal."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy policy permit node 10",
            "[*HUAWEI-route-policy] if-match cost 8"
        ]
    ],
    "ExtraInfo": "You can use the if-match cost command to configure a node to filter routes based on the route cost. After such a filtering rule is configured, you can apply the apply clauses to change the attributes of the routes that match the filtering rule."
}