{
    "PageTitle": "if-match ipv6 route-source prefix-list",
    "FuncDef": "The if-match ipv6 route-source prefix-list command configures a filtering rule that is based on IPv6 addresses of the source devices from which routes are received.\nThe undo if-match ipv6 route-source prefix-list command cancels the configuration. The if-match ipv6 route-source prefix-list command configures a filtering rule that is based on IPv6 addresses of the source devices from which routes are received. The undo if-match ipv6 route-source prefix-list command cancels the configuration. By default, no filtering rule based on IPv6 addresses of the source devices from which routes are received is configured. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "if-match ipv6 route-source prefix-list <ipv6-prefix-name>",
        "undo if-match ipv6 route-source [ prefix-list <ipv6-prefix-name> ]"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "prefix-list <ipv6-prefix-name>",
            "Info": "Specifies the name of the IPv6 prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ipv6-prefix p1 permit :: 0 greater-equal 32 less-equal 64",
            "[*HUAWEI] route-policy policy permit node 10",
            "[*HUAWEI-route-policy] if-match ipv6 address prefix-list p1",
            "[*HUAWEI-route-policy] if-match ipv6 route-source prefix-list p1"
        ]
    ],
    "ExtraInfo": "When you run the if-match ipv6 route-source prefix-list command to match the address of the source from which IPv6 routes are received, an IPv6 prefix list must also be configured for the matching rule to take effect. For example:"
}