{
    "PageTitle": "if-match extcommunity-filter",
    "FuncDef": "The if-match extcommunity-filter command sets a filtering rule that is based on the VPN-Target extended community filter.\nThe undo if-match extcommunity-filter command cancels the configuration. The if-match extcommunity-filter command sets a filtering rule that is based on the VPN-Target extended community filter. The undo if-match extcommunity-filter command cancels the configuration. By default, no filtering rule based on the VPN-Target extended community filter is set.",
    "CLIs": [
        "if-match extcommunity-filter { <basIndex> [ matches-all | whole-match ] | <advIndex> } &<1-16>",
        "if-match extcommunity-filter <ecfName> [ matches-all | whole-match ]",
        "undo if-match extcommunity-filter { <basIndex> | <advIndex> } &<1-16>",
        "undo if-match extcommunity-filter <ecfName>",
        "undo if-match extcommunity-filter"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "<basIndex>",
            "Info": "Specifies the basic VPN-Target extended community filter number.\nThe value is an integer ranging from 1 to 199."
        },
        {
            "Parameters": "matches-all",
            "Info": "Matches all the VPN-Target attributes of the VPN-Target filter. This parameter is valid only for basic extended community filters.\n-"
        },
        {
            "Parameters": "whole-match",
            "Info": "Exactly matches the VPN-Targets in routes against the VPN-Targets in the filter. That is, the number of VPN-Targets and their values in routes must be the same as those of the VPN-Targets in the filter, but the sequences can be different. This parameter is valid only for basic extended community filters.\n-"
        },
        {
            "Parameters": "<advIndex>",
            "Info": "Specifies the advanced VPN-Target extended community filter number.\nThe value is an integer ranging from 200 to 399."
        },
        {
            "Parameters": "<ecfName>",
            "Info": "Specifies the VPN-Target extended community filter name.\nThe value is a string of 1 to 51 case-sensitive characters and cannot contain digits only. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip extcommunity-filter 1 permit rt 100:1",
            "[*HUAWEI] route-policy policy permit node 10",
            "[*HUAWEI-route-policy] if-match extcommunity-filter 1"
        ]
    ],
    "ExtraInfo": "The extended community attributes help flexibly control the route-policy. You can use the if-match extcommunity-filter command to configure a node to filter routes based on the VPN-Target extended community filter. After such a filtering rule is configured, you can apply the apply clauses to change the attributes of the routes that match the VPN-Target extended community attributes-based filtering rule.\nThe if-match extcommunity-filter command is applicable only to BGP routes and must work with the ip extcommunity-filter command. For example:"
}