{
    "PageTitle": "ip community-filter",
    "FuncDef": "The ip community-filter command adds a basic community filter.\nThe undo ip community-filter command deletes a basic community filter. The ip community-filter command adds a basic community filter. The undo ip community-filter command deletes a basic community filter. By default, no basic community filter exists.",
    "CLIs": [
        "ip community-filter <cfIndex> [ index <index-val> ] <matchMode> [ <cmntyStr> | <cmntyNum> | internet | no-advertise | no-export | no-export-subconfed ] &<1-20>",
        "undo ip community-filter <cfIndex> [ index <index-val> ] [ <matchMode> ] [ <cmntyStr> | <cmntyNum> | internet | no-advertise | no-export | no-export-subconfed ] &<1-20>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<cfIndex>",
            "Info": "Specifies the number of a basic community filter.\nThe value is an integer ranging from 1 to 99."
        },
        {
            "Parameters": "index <index-val>",
            "Info": "Specifies the sequence number of a basic community filter.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "<matchMode>",
            "Info": "Sets the matching mode of the community filter.\nThe value is an enumerated type:\npermit: Sets the matching mode of the community filter to permit.deny: Sets the matching mode of the community filter to deny."
        },
        {
            "Parameters": "<cmntyStr>",
            "Info": "Specifies a community attribute, in the format of aa:nn.\nThe value is in the format of aa:nn. The values of aa, and nn are integers ranging from 0 to 65535."
        },
        {
            "Parameters": "<cmntyNum>",
            "Info": "Specifies a community attribute, in the format of aa:nn.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "internet",
            "Info": "Allows the routes that match the community filter to be sent to all peers.\n-"
        },
        {
            "Parameters": "no-advertise",
            "Info": "Prevents routes from being advertised to other peers.\n-"
        },
        {
            "Parameters": "no-export",
            "Info": "Prevents routes from being advertised outside an AS. If an AS confederation is used, routes are not advertised outside the AS confederation, but to other sub-ASs in the AS confederation.\n-"
        },
        {
            "Parameters": "no-export-subconfed",
            "Info": "Prevents routes from being advertised outside an AS. If an AS confederation is used, routes are not advertised to any other sub-ASs in the AS confederation.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip community-filter 1 deny internet"
        ]
    ],
    "ExtraInfo": "The community attribute is a private attribute of BGP and can be used to filter only BGP routes. The community attribute can be used as a matching condition of a route-policy using a command, such as the if-match community-filter command."
}