{
    "PageTitle": "ip extcommunity-list encapsulation basic",
    "FuncDef": "The ip extcommunity-list encapsulation basic command configures a basic encapsulation extended community filter.\nThe undo ip extcommunity-list encapsulation basic command deletes a basic encapsulation extended community filter. The ip extcommunity-list encapsulation basic command configures a basic encapsulation extended community filter. The undo ip extcommunity-list encapsulation basic command deletes a basic encapsulation extended community filter. By default, no basic encapsulation extended community filter is configured.",
    "CLIs": [
        "ip extcommunity-list encapsulation basic <encapsulation-name> [ index <index-value> ] <matchMode> { <encapsulation-value> } &<1-16>",
        "undo ip extcommunity-list encapsulation basic <encapsulation-name> [ index <index-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<encapsulation-name>",
            "Info": "Specifies the name of a basic encapsulation extended community filter.\nThe value is a string of 1 to 51 case-sensitive characters. It cannot be comprised of only digits. If spaces are used, the string must start and end with double quotation marks (\")."
        },
        {
            "Parameters": "index <index-value>",
            "Info": "Specifies the index of a basic encapsulation extended community filter.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "<matchMode>",
            "Info": "Sets the matching mode of the basic encapsulation extended community filter.\nThe value is an enumerated type:\npermit: Indicates the permit matching mode.deny: Indicates the deny matching mode."
        },
        {
            "Parameters": "<encapsulation-value>",
            "Info": "Specifies the value of the basic encapsulation extended community attribute.\nThe value is in the format of a 2-byte AS number:2-byte user-defined value, such as 0:100. The AS number must be 0. The user-defined value is an integer ranging from 0 to 65535."
        },
        {
            "Parameters": "basic",
            "Info": "Indicates the basic encapsulation extended community attribute.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip extcommunity-list encapsulation basic aaa permit 0:1 0:2 0:3"
        ]
    ],
    "ExtraInfo": "The ip extcommunity-list encapsulation command configures an encapsulation extended community filter to filter BGP-EVPN routes carrying the encapsulated extended community attribute.\nAn encapsulation extended community filter, such as if-match extcommunity-list encapsulation aaa, can be used as a matching condition of a route-policy.\nThe relationship between the rules of the encapsulation extended community filter is OR.\nFor example, an encapsulation extended community filter in either of the following formats has the same filtering effect:\nFormat 1:\nip extcommunity-list encapsulation basic aaa permit 0:1 0:2 0:3\nFormat 2:\nip extcommunity-list encapsulation basic aaa permit 0:1\nip extcommunity-list encapsulation basic aaa permit 0:2 0:3\nThe undo ip extcommunity-list encapsulation command can be used to delete a single node's encapsulation extended community filter."
}