{
    "PageTitle": "ip extcommunity-filter advanced",
    "FuncDef": "The ip extcommunity-filter advanced command adds an advanced VPN-Target extended community filter.\nThe undo ip extcommunity-filter advanced command deletes a specified advanced VPN-Target extended community filter. The ip extcommunity-filter advanced command adds an advanced VPN-Target extended community filter. The undo ip extcommunity-filter advanced command deletes a specified advanced VPN-Target extended community filter. By default, no advanced VPN-Target extended community filter is configured.",
    "CLIs": [
        "ip extcommunity-filter advanced <advanced-extcomm-filter-name> [ index <index-number> ] <matchMode> <regular-expression>",
        "undo ip extcommunity-filter advanced <advanced-extcomm-filter-name> [ index <index-number> ] [ [ <matchMode> ] <regular-expression> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "index <index-number>",
            "Info": "Specifies the sequence number of an advanced VPN-Target extended community filter.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "<matchMode>",
            "Info": "Sets the matching mode of the advanced VPN-Target extended community filter.\nThe value is an enumerated type:\npermit: Sets the matching mode of the VPN-Target extended community filter to permit.deny: Sets the matching mode of the VPN-Target extended community filter to deny."
        },
        {
            "Parameters": "<regular-expression>",
            "Info": "Specifies the regular expression matched the VPN-Target extended community.\nThe value is a string of 1 to 1024 characters, spaces supported."
        },
        {
            "Parameters": "advanced <advanced-extcomm-filter-name>",
            "Info": "Specifies the name of the advanced VPN-Target extended community filter.\nThe name is a string of 1 to 51 case-sensitive characters, spaces not supported. The string cannot be all digits. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip extcommunity-filter advanced aa permit 200:*"
        ]
    ],
    "ExtraInfo": "A VPN-Target extended community filter can be used as a matching condition of a route-policy using a command, such as the if-match extcommunity-filter zz command.\nThe relationship between the rules of the VPN-Target extended community filter is \"OR\", which is different from that of an RD filter. This is because each route has only one RD but can have multiple communities.\nThe undo ip extcommunity-filter command deletes a specified VPN-Target extended community filter.\nThe display ip extcommunity-filter command displays detailed configurations of the VPN-Target extended community filter."
}