{
    "PageTitle": "ip ip-prefix",
    "FuncDef": "The ip ip-prefix command configures an IP prefix list or one entry in the IP prefix list.\nThe undo ip ip-prefix command deletes an IP prefix list or one entry in the IP prefix list. The ip ip-prefix command configures an IP prefix list or one entry in the IP prefix list. The undo ip ip-prefix command deletes an IP prefix list or one entry in the IP prefix list. By default, no IP prefix list is configured.",
    "CLIs": [
        "ip ip-prefix <ip-prefix-name> [ index <index-number> ] <matchMode> <ipv4-address> <masklen> [ match-network ] [ greater-equal <greater-equal-value> ] [ less-equal <less-equal-value> ]",
        "undo ip ip-prefix <ip-prefix-name> [ index <index-number> ]",
        "undo ip ip-prefix <ip-prefix-name> <ipv4-address> <masklen> [ match-network ] [ greater-equal <greater-equal-value> ] [ less-equal <less-equal-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-prefix-name>",
            "Info": "Specifies the name of an IP prefix list.\nThe value is a string of 1 to 169 case-sensitive characters. The character string can contain spaces if it is enclosed in double quotation marks (\"\")."
        },
        {
            "Parameters": "index <index-number>",
            "Info": "Specifies the sequence number of the entry in the IP prefix list.\nThe value is an integer ranging from 1 to 4294967295.\nBy default, the sequence number increases with a step of 10 according to the configuration order, and the first number is 10."
        },
        {
            "Parameters": "<matchMode>",
            "Info": "Specifies the matching mode of the IP prefix list.\nThe value is an enumerated type:\npermit: Specifies the matching mode of the IP prefix list as permit. In permit mode, if the IP address to be filtered is in the defined prefix range, the IP address matches the route-policy and no longer match against the next entry. Otherwise, the IP address continues to match against the next entry.deny: Specifies the matching mode of the IP prefix list as deny. In deny mode, if the IP address to be filtered is in the defined prefix range, the IP address fails to match the route-policy and cannot match against the next entry. Otherwise, the IP address continues to match against the next entry."
        },
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IP address.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "<masklen>",
            "Info": "Specifies the mask length.\nThe value is an integer ranging from 0 to 32."
        },
        {
            "Parameters": "match-network",
            "Info": "Matches the network address. match-network is used to match routes to a specified network address and can be configured only when ipv4-address is 0.0.0.0. For example, ip ip-prefix prefix1 permit 0.0.0.0 8 matches all the routes with the mask length of 8, and ip ip-prefix prefix1 permit 0.0.0.0 8 match-network matches all the routes with the mask length ranging from 0.0.0.1 to 0.255.255.255.\n-"
        },
        {
            "Parameters": "greater-equal <greater-equal-value>",
            "Info": "Specifies the minimum value of the mask length range.\nThe value of greater-equal-value is subject to the following rule: masklen<=greater-equal-value<=less-equal-value<=32."
        },
        {
            "Parameters": "less-equal <less-equal-value>",
            "Info": "Specifies the maximum value of the mask length range.\nThe value of less-equal-value is subject to the following rule: masklen<=greater-equal-value<=less-equal-value<=32."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix p3 index 10 deny 0.0.0.0 8 match-network",
            "[*HUAWEI] ip ip-prefix p3 index 20 permit 0.0.0.0 0 less-equal 32"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix p2 permit 0.0.0.0 0 greater-equal 17 less-equal 18"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix p1 permit 10.0.0.0 8 greater-equal 17 less-equal 18"
        ]
    ],
    "ExtraInfo": "An IP prefix list can be used as a filter or as filtering conditions of a route-policy when it is used with the if-match command.\nEach entry in an IP prefix list can be used as a filtering rule. When a route to be filtered matches an entry, whether the route matches the IP prefix list is determined by the matching mode. A route to be filtered matches an entry or entries based on the following rules:"
}