{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "history size",
    "FuncDef": [
        "To change the command history buffer size for a particular line, use the **history size** command in line configuration mode. To reset the command history buffer size to ten lines, use the **no** form of this command. "
    ],
    "CLIs": [
        "history size <number-of-lines>",
        "no history size"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *number-of-lines* ",
            "Info": " Specifies the number of command lines that the system will record in its history buffer. The range is from 0 to 256. The default is 10. "
        }
    ],
    "Examples": [
        [
            "The following example displays line 4 configured with a history buffer size of 35 lines:",
            "```",
            "Router(config)# line 4",
            "```",
            "```",
            "Router(config-line)# history size 35",
            "```"
        ]
    ],
    "ExtraInfo": "The **history size** command should be used in conjunction with the **history** and **show history** commands. The **history** command enables or disables the command history function. The **show history** command lists the commands you have entered in the current EXEC session. The number of commands that the history buffer will show is set by the **history size** command.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)The **history size** command only sets the size of the buffer; it does not reenable the history function. If the **no****history** command is used, the **history** command must be used to reenable this function.---",
    "RelatedCmds": [
        {
            "cmd": " **history** ",
            "description": " Enables or disables the command history function. "
        },
        {
            "cmd": " **show history** ",
            "description": " Lists the commands you have entered in the current EXEC session. "
        },
        {
            "cmd": " **terminal history size** ",
            "description": " Enables the command history function for the current terminal session or changes the size of the command history buffer for the current terminal session. "
        }
    ]
}