{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "hostname",
    "FuncDef": [
        "To specify or modify the host name for the network server, use the **hostname** command in global configuration mode. "
    ],
    "CLIs": [
        "hostname <name>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *name* ",
            "Info": " New host name for the network server. "
        }
    ],
    "Examples": [
        [
            "The following example changes the host <name> to \"host1\":",
            "```",
            "Router(config)# hostname sandbox",
            "```",
            "```",
            "host1(config)#",
            "```"
        ]
    ],
    "ExtraInfo": "The host name is used in prompts and default configuration filenames.Do not expect case to be preserved. Uppercase and lowercase characters look the same to many internet software applications. It may seem appropriate to capitalize a name the same way you might do in English, but conventions dictate that computer names appear all lowercase. For more information, refer to RFC 1178, *Choosing a Name for Your Computer*.The name must also follow the rules for ARPANET host names. They must start with a letter, end with a letter or digit, and have as interior characters only letters, digits, and hyphens. Names must be 63 characters or fewer. A host name of less than 10 characters is recommended. For more information, refer to RFC 1035, *Domain Names—Implementation and Specification*.On most systems, a field of 30 characters is used for the host name and the prompt in the CLI. Note that the length of your host name may cause longer configuration mode prompts to be truncated. For example, the full prompt for service profile configuration mode is:```(config-service-profile)#`````` ```However, if you are using the host-name of \"Router\", you will only see the following prompt (on most systems):```Router(config-service-profil)# `````` ```If the hostname is longer, you will see even less of the prompt:```Basement-rtr2(config-service)# `````` ```Keep this behavior in mind when assigning a name to your system (using the **hostname** global configuration command). If you expect that users will be relying on mode prompts as a CLI navigation aid, you should assign host names of no more than nine characters.",
    "RelatedCmds": [
        {
            "cmd": " **setup** ",
            "description": " Enables you to make major changes to your configurations, for example, adding a protocol suit, making major addressing scheme changes, or configuring newly installed interfaces. "
        }
    ]
}