{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "terminal dispatch-timeout",
    "FuncDef": [
        "To set the character dispatch timer for the current terminal line for the current session, use the **terminal dispatch-timeout** command in EXEC mode. "
    ],
    "CLIs": [
        "terminal dispatch-timeout <milliseconds>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *milliseconds* ",
            "Info": " Integer that specifies the number of milliseconds that the router waits after it puts the first character into a packet buffer before sending the packet. During this interval, more characters can be added to the packet, which increases the processing efficiency of the remote host. "
        }
    ],
    "Examples": [
        [
            "In the following example, the dispatch timeout timer is set to 80 <milliseconds>:",
            "```",
            "Router# terminal dispatch-timeout 80",
            "```"
        ]
    ],
    "ExtraInfo": "Use this command to increase the processing efficiency of the remote host.The **dispatch-timeout** line configuration command causes the software to buffer characters into packets for transmission to the remote host. The Cisco IOS software sends a packet a specified amount of time after the first character is put into the buffer. You can use the **terminal dispatch-timeout** and **terminal dispatch-character** line configuration commands together. In this case, the software dispatches a packet each time the dispatch character is entered, or after the specified dispatch timeout interval, depending on which condition is met first.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)The router response time might appear intermittent if the timeout interval is greater than 100 milliseconds and remote echoing is used.---",
    "RelatedCmds": [
        {
            "cmd": " **dispatch-timeout** ",
            "description": " Sets the character dispatch timer for a specified line or group of lines. "
        }
    ]
}