{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "terminal history size",
    "FuncDef": [
        "To change the size of the command history buffer for the current terminal session, use the **terminal history size** command in EXEC mode. To reset the command history buffer to its default size of 10 lines, use the **no** form of this command. "
    ],
    "CLIs": [
        "terminal history size <number-of-lines>",
        "terminal no history size"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *number-of-lines* ",
            "Info": " Number of command lines that the system will record in its history buffer. The range is from 0 to 256. The default is 10. "
        }
    ],
    "Examples": [
        [
            "In the following example, the number of command lines recorded is set to 15 for the current terminal session. The user then checks to see what line he/she is connected to using the show users command. The user uses this line information to issue the show line command. (In this example, the user uses the show begin option in the show line command to start the output at the \"Editing is enabled/disabled\" line.)",
            "```",
            "Router# terminal history size 15",
            "```",
            "```",
            "Router# show users",
            "```",
            "```",
            "```",
            "```",
            "Line User Host(s) Idle Location",
            "```",
            "```",
            "* 50 vty 0 admin idle 00:00:00",
            "```",
            "```",
            "! the * symbol indicates the active terminal session for the user (line 50)",
            "```",
            "```",
            "```",
            "```",
            "Router# show line 50 | begin Editing",
            "```",
            "```",
            "```",
            "```",
            "Editing is enabled.",
            "```",
            "```",
            "! the following line shows the history settings for the line",
            "```",
            "```",
            "History is enabled, history size is 15.",
            "```",
            "```",
            "DNS resolution in show commands is enabled",
            "```",
            "```",
            "Full user help is disabled",
            "```",
            "```",
            "Allowed transports are telnet. Preferred is none.",
            "```",
            "```",
            "No output characters are padded",
            "```",
            "```",
            "No special data dispatching characters",
            "```"
        ]
    ],
    "ExtraInfo": "The history feature provides a record of commands you have entered. This feature is particularly useful for recalling long or complex commands or entries for the purposes of modifying them slightly and reissuing them.The **terminal history** **size** command enables the command history feature and sets the command history buffer size. The **terminal****no****history****size** command resets the buffer size to the default of 10 command lines.Table 2 lists the keys and functions you can use to recall commands from the history buffer. When you use these keys, the commands recalled will be from EXEC mode if you are in EXEC mode, or from all configuration modes if you are in any configuration mode.Table 167 History Keys| Key | Function || --- | --- || Ctrl-P or Up Arrow[1](#wp1015124) | Recalls commands in the history buffer in a backward sequence, beginning with the most recent command. Repeat the key sequence to recall successively older commands. || Ctrl-N or Down Arrow1 | Returns to more recent commands in the history buffer after recalling commands with Ctrl-P or the Up Arrow. Repeat the key sequence to recall successively more recent commands. || [1](#wp1015125) The arrow keys function only with ANSI-compatible terminals. || --- |  In EXEC mode, you can also use the **show history** command to show the contents of the command history buffer.To check the current settings for the command history feature on your line, use the **show line** command.",
    "RelatedCmds": [
        {
            "cmd": " **history** ",
            "description": " Enables the command history function, or changes the command history buffer size for a particular line. "
        },
        {
            "cmd": " **show <command> begin** ",
            "description": " Searches the output of any show command and displays the output from the first instance of a specified string. "
        },
        {
            "cmd": " **show history** ",
            "description": " Lists the commands you have entered in the current EXEC session. "
        },
        {
            "cmd": " **terminal history** ",
            "description": " Enables the command history feature for the current terminal session. "
        }
    ]
}