{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "traceroute",
    "FuncDef": [
        "To discover the routes that packets will actually take when traveling to their destination address, use the **traceroute** command in user EXEC or privileged EXEC mode. "
    ],
    "CLIs": [
        "traceroute [ vrf <vrf-name> | topology <topology-name> ] [ <protocol> ] <destination>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *protocol* ",
            "Info": " (Optional) Protocol keyword, either **appletalk**, **clns**, **ip**, **ipv6**, **ipx**, **oldvines**, or **vines**. When not specified, the *protocol* argument is based on an examination by the software of the format of the *destination* argument. The default protocol is IP. "
        },
        {
            "Parameters": " *destination* ",
            "Info": " (Optional in privileged EXEC mode; required in user EXEC mode) The destination address or hostname for which you want to trace the route. The software determines the default parameters for the appropriate protocol and the tracing action begins. "
        }
    ],
    "Examples": [
        [
            "After you enter the traceroute command in privileged EXEC mode, the system prompts you for a protocol. The default protocol is IP.",
            "If you enter a hostname or address on the same line as the traceroute command, the default action is taken as appropriate for the protocol type of that name or address.",
            "The following example is sample dialog from the traceroute command using default values. The specific dialog varies somewhat from protocol to protocol.",
            "```",
            "Router# traceroute",
            "```",
            "```",
            "```",
            "```",
            "Protocol [ ip ] :",
            "```",
            "```",
            "Target IP address:",
            "```",
            "```",
            "Source address:",
            "```",
            "```",
            "DSCP Value [ 0 ] : ! Only displayed if a topology is configured on the router.",
            "```",
            "```",
            "Numeric display [ n ] :",
            "```",
            "```",
            "Timeout in seconds [ 3 ] :",
            "```",
            "```",
            "Probe count [ 3 ] :",
            "```",
            "```",
            "Minimum Time to Live [ 1 ] :",
            "```",
            "```",
            "Maximum Time to Live [ 30 ] :",
            "```",
            "```",
            "Port Number [ 33434 ] :",
            "```",
            "```",
            "Loose, Strict, Record, Timestamp, Verbose [ none ] :",
            "```",
            "```",
            "```",
            "The following example displays output available in Cisco IOS XE Release 3.2S and later. Output of the traceroute command with the vrf keyword includes the incoming VRF name/tag and the outgoing VRF name/tag.",
            "```",
            "Router# traceroute vrf red 10.0.10.12",
            "```",
            "```",
            "```",
            "```",
            "Type escape sequence to abort.",
            "```",
            "```",
            "Tracing the route to 10.0.10.12",
            "```",
            "```",
            "VRF info: (vrf in name/id, vrf out name/id)",
            "```",
            "```",
            "1 10.1.13.15 (red/13,red/13) 0 msec",
            "```",
            "```",
            "10.1.16.16 (red/13,red/13) 0 msec",
            "```",
            "```",
            "10.1.13.15 (red/13,red/13) 1 msec",
            "```",
            "```",
            "2 10.1.8.13 (red/13,red/13) 0 msec",
            "```",
            "```",
            "10.1.7.13 (red/13,red/13) 0 msec",
            "```",
            "```",
            "10.1.8.13 (red/13,red/13) 0 msec",
            "```",
            "```",
            "3 10.1.2.11 (red/13,blue/10) 1 msec 0 msec 0 msec",
            "```",
            "```",
            "4 < > *",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "The **traceroute** command works by taking advantage of the error messages generated by routers when a datagram exceeds its hop limit value.The **traceroute** command starts by sending probe datagrams with a hop limit of 1. Including a hop limit of 1 with a probe datagram causes the neighboring routers to discard the probe datagram and send back an error message. The **traceroute** command sends several probes with increasing hop limits and displays the round-trip time for each.The **traceroute** command sends out one probe at a time. Each outgoing packet might result in one or more error messages. A time-exceeded error message indicates that an intermediate router has seen and discarded the probe. A destination unreachable error message indicates that the destination node has received and discarded the probe because the hop limit of the packet reached a value of 0. If the timer goes off before a response comes in, the **traceroute** command prints an asterisk (\\*).The **traceroute** command terminates when the destination responds, when the hop limit is exceeded, or when the user interrupts the trace with the escape sequence. By default, to invoke the escape sequence, type **Ctrl-^ X**—by simultaneously pressing and releasing the **Ctrl**, **Shift**, and **6** keys, and then pressing the **X** key.To use nondefault parameters and invoke an extended **traceroute** test, enter the command without a *protocol* or *destination* argument in privileged EXEC mode. You are stepped through a dialog to select the desired parameters. Extended **traceroute** tests are not supported in user EXEC mode. The user-level traceroute feature provides a basic trace facility for users who do not have system privileges. The *destination* argument is required in user EXEC mode.If the system cannot map an address for a hostname, it returns a \"%No valid source address for destination\" message.If the **vrf** *vrf-name* keyword and argument are used, the **topology** option is not displayed because only the default VRF is supported. The **topology** *topology-name* keyword and argument and the DiffServ Code Point (DSCP) option in the extended traceroute system dialog are displayed only if a topology is configured on the router.In Cisco IOS XE Release 3.2S, output of the **traceroute** command with the **vrf** keyword was enhanced to make troubleshooting easier by displaying the incoming VRF name/tag and the outgoing VRF name/tag.",
    "RelatedCmds": [
        {
            "cmd": " **ping (MTR)** ",
            "description": " Pings a destination within a specific topology. "
        }
    ]
}