{
    "PageTitle": "advertise l2vpn evpn (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The advertise l2vpn evpn command enables a device to advertise IP routes from a VPN instance to its EVPN instance.\nThe undo advertise l2vpn evpn command restores the default configuration.. The advertise l2vpn evpn command enables a device to advertise IP routes from a VPN instance to its EVPN instance. The undo advertise l2vpn evpn command restores the default configuration.. By default, a device is disabled from advertising IP routes from a VPN instance to its EVPN instance. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "advertise l2vpn evpn [ import-route-multipath ] [ include-local-cross-route ]",
        "undo advertise l2vpn evpn [ import-route-multipath ] [ include-local-cross-route ]"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "import-route-multipath",
            "Info": "Advertises all routes with the same destination address in a VPN instance to an EVPN instance.\n-"
        },
        {
            "Parameters": "include-local-cross-route",
            "Info": "Advertises all routes of local cross in a VPN instance to an EVPN instance.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] route-distinguisher 1:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance evrf",
            "[*HUAWEI-bgp-instance-evrf] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-evrf-vpna] advertise l2vpn evpn"
        ]
    ],
    "ExtraInfo": ""
}