{
    "PageTitle": "encapsulation default",
    "FuncDef": "The encapsulation default command configures a Layer 2 sub-interface to receive packets with any encapsulation type by default.\nThe undo encapsulation default command disables a Layer 2 sub-interface from receiving packets with any encapsulation type by default. The encapsulation default command configures a Layer 2 sub-interface to receive packets with any encapsulation type by default. The undo encapsulation default command disables a Layer 2 sub-interface from receiving packets with any encapsulation type by default. By default, no encapsulation type is specified on an EVC Layer 2 sub-interface. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "encapsulation default",
        "undo encapsulation default"
    ],
    "ParentView": [
        "100GE Layer 2 sub-interface view,200GE Layer 2 sub-interface view,400GE Layer 2 sub-interface view,50GE Layer 2 sub-interface view,Eth-Trunk Layer 2 sub-interface view,Layer 2 sub-interface view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1.1 mode l2",
            "[*HUAWEI-100GE1/0/1.1] encapsulation default"
        ]
    ],
    "ExtraInfo": "A Layer 2 Ethernet can transmit untagged, single-tagged, and double-tagged packets.  To enable an EVC Layer 2 sub-interface to transmit different types of packets, run the flow-encapsulation command to configure an encapsulation type for the EVC Layer 2 sub-interface. The encapsulation default command configures a Layer 2 sub-interface to receive packets with any encapsulation type by default. When packets cannot meet the requirements of other sub-interfaces, the packets are sent to the Layer 2 sub-interface."
}