{
    "PageTitle": "filter-policy",
    "FuncDef": "The filter-policy command configures a device to filter received MAC routes. MAC duplication suppression is not performed for MAC addresses in the filter policy.\nThe undo filter-policy command disables a device from filtering received MAC routes. The filter-policy command configures a device to filter received MAC routes. MAC duplication suppression is not performed for MAC addresses in the filter policy. The undo filter-policy command disables a device from filtering received MAC routes. By default, the advertised or received MAC routes are not filtered. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "filter-policy { <acl-number> | acl-name <acl-name-value> }",
        "undo filter-policy { <acl-number> | acl-name <acl-name-value> }"
    ],
    "ParentView": [
        "BD-EVPN mac-duplication view"
    ],
    "ParaDef": [
        {
            "Parameters": "<acl-number>",
            "Info": "Specifies the number of a basic ACL.\nThe value is an integer in the range from 4000 to 4999."
        },
        {
            "Parameters": "acl-name <acl-name-value>",
            "Info": "Specifies the name of a named basic ACL.\nThe value is a string of 1 to 32 case-sensitive characters without spaces. The value starts with a letter or digit but cannot contain only digits. The ACL type must be link."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl name mac link",
            "[*HUAWEI-acl-L2-mac] quit",
            "[*HUAWEI] bridge-domain 1",
            "[*HUAWEI-bd1] evpn",
            "[*HUAWEI-bd1-evpn] mac-duplication",
            "[*HUAWEI-bd1-evpn-mac-dup] filter-policy acl-name mac"
        ]
    ],
    "ExtraInfo": "The filter-policy command is used to configure a MAC address whitelist. MAC duplication is not suppressed for MAC addresses in the whitelist.\nWhen configured filtering conditions are used for a named ACL, only the configurations specified by source and time-range take effect."
}