{
    "PageTitle": "l3-reoriginate different-split-group",
    "FuncDef": "The l3-reoriginate different-split-group command enables the current device to advertise Layer 3 regenerated routes only to devices in different split horizon groups.\nThe undo l3-reoriginate different-split-group command restores the default configuration. The l3-reoriginate different-split-group command enables the current device to advertise Layer 3 regenerated routes only to devices in different split horizon groups. The undo l3-reoriginate different-split-group command restores the default configuration. By default, re-originate L3 routes are advertised without being restricted by an SHG. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "l3-reoriginate different-split-group",
        "undo l3-reoriginate different-split-group"
    ],
    "ParentView": [
        "Global EVPN configuration view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn-overlay enable",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.9 as-number 100",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer 10.1.1.9 enable",
            "[*HUAWEI-bgp-af-evpn] peer 10.1.1.9 split-group aa",
            "[*HUAWEI-bgp-af-evpn] quit",
            "[*HUAWEI-bgp] quit",
            "[*HUAWEI] evpn",
            "[*HUAWEI-evpn] l3-reoriginate different-split-group"
        ]
    ],
    "ExtraInfo": "In a scenario where Segment VXLAN is used to implement DC interconnection, if both route reflectors and route regenerating are configured on Border Leaf nodes, the Border Leaf nodes regenerate Layer 3 routes received from peers in the DC, Border Leaf nodes advertise regenerated Layer 3 routes to all BGP EVPN peers (including devices in the data center) and reflect routes to all clients. As a result, devices in the data center receive redundant regenerated routes. To prevent this problem, you can specify devices in the data center as a split horizon group and run the l3-reoriginate different-split-group command to enable the Border Leaf node to advertise regenerated routes only to devices in different split horizon groups. In this way, devices in the data center and Border Leaf nodes are in the same split horizon group. Therefore, the Border Leaf node does not advertise re-established routes to them but reflects routes."
}