{
    "PageTitle": "nexthop recursive-lookup delay (BGP-EVPN address family view)",
    "FuncDef": "The nexthop recursive-lookup delay command configures a delay in responding to changes in the next hop recursion result.\nThe undo nexthop recursive-lookup delay command restores the default configuration.\nThe nexthop recursive-lookup non-critical-event delay command configures a delay in responding to non-urgent next-hop recursion changes.\nThe undo nexthop recursive-lookup non-critical-event delay command restores the default configuration. The nexthop recursive-lookup delay command configures a delay in responding to changes in the next hop recursion result. The undo nexthop recursive-lookup delay command restores the default configuration. The nexthop recursive-lookup non-critical-event delay command configures a delay in responding to non-urgent next-hop recursion changes. The undo nexthop recursive-lookup non-critical-event delay command restores the default configuration. By default, the delay in responding to non-critical next hop recursion changes is 10s, and the device does not delay responding to critical next hop recursion changes. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "nexthop recursive-lookup delay [ <delay-time> ]",
        "nexthop recursive-lookup non-critical-event delay [ <nonCrit-delay-time> ]",
        "undo nexthop recursive-lookup delay",
        "undo nexthop recursive-lookup non-critical-event delay"
    ],
    "ParentView": [
        "BGP-EVPN address family view,bgp-muli-instance-af-evpn view"
    ],
    "ParaDef": [
        {
            "Parameters": "<delay-time>",
            "Info": "Specifies the delay in responding to recursion changes.\nThe value is an integer that ranges from 1 to 100, in seconds. The default value is 5 seconds."
        },
        {
            "Parameters": "<nonCrit-delay-time>",
            "Info": "Indicates the delay in responding to non-critical recursion changes.\nThe value is an integer ranging from 0 to 100, in seconds. The default value is 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] nexthop recursive-lookup non-critical-event delay 10"
        ]
    ],
    "ExtraInfo": "If the recursion result of BGP routes changes frequently, you can run the nexthop recursive-lookup delay command to configure BGP to respond to the recursion result change after a specified period of time. This can reduce unnecessary route re-selection and re-advertisement, but affects network convergence. Recursion result changes are classified into two types:"
}