{
    "PageTitle": "peer advertise-large-community (BGP-EVPN address family view) (group)",
    "FuncDef": "The peer advertise-large-community command enables the function to advertise routes carrying the large-community attribute to a BGP EVPN peer group.\nThe undo peer advertise-large-community command disables the function to advertise routes carrying the large-community attribute to a BGP EVPN peer group. The peer advertise-large-community command enables the function to advertise routes carrying the large-community attribute to a BGP EVPN peer group. The undo peer advertise-large-community command disables the function to advertise routes carrying the large-community attribute to a BGP EVPN peer group. By default, a device does not advertise routes carrying the large-community attribute to a BGP EVPN peer group. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <peerGroupName> advertise-large-community",
        "undo peer <peerGroupName> advertise-large-community"
    ],
    "ParentView": [
        "BGP-EVPN address family view,bgp-muli-instance-af-evpn view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerGroupName>",
            "Info": "Specifies the name of a BGP EVPN peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy RP permit node 10",
            "[*HUAWEI-route-policy] apply large-community 35551:100:65552 additive",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group gp1",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer gp1 enable",
            "[*HUAWEI-bgp-af-evpn] peer gp1 route-policy RP export",
            "[*HUAWEI-bgp-af-evpn] peer gp1 advertise-large-community"
        ]
    ],
    "ExtraInfo": "To enable a device to advertise the Large-Community attribute to a BGP EVPN peer group, run the peer advertise-large-community command. If the Large-Community attribute is advertised to a BGP EVPN peer group, all BGP EVPN peers in the peer group inherit the Large-Community attribute configuration. This simplifies routing policy application and facilitates route maintenance and management."
}