{
    "PageTitle": "peer advertise add-path (BGP-EVPN address family view) (group)",
    "FuncDef": "The peer advertise add-path command configures the maximum number of routes that the device can send to a specified peer.\nThe undo peer advertise add-path command restores the default configurations. The peer advertise add-path command configures the maximum number of routes that the device can send to a specified peer. The undo peer advertise add-path command restores the default configurations. By default, the device sends only the optimal route to a peer. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <group-name> advertiseadd-pathpath-number <path-number>",
        "undo peer <group-name> advertiseadd-path"
    ],
    "ParentView": [
        "BGP-EVPN address family view,bgp-muli-instance-af-evpn view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "path-number <path-number>",
            "Info": "Specifies the maximum number of routes that the device can send.\nThe value is an integer ranging from 2 to 64."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 1.1.1.1 as-number 100",
            "[*HUAWEI-bgp] peer 2.2.2.2 as-number 100",
            "[*HUAWEI-bgp] group gp1",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer 1.1.1.1 enable",
            "[*HUAWEI-bgp-af-evpn] peer 2.2.2.2 enable",
            "[*HUAWEI-bgp-af-evpn] peer gp1 enable",
            "[*HUAWEI-bgp-af-evpn] peer 1.1.1.1 group gp1",
            "[*HUAWEI-bgp-af-evpn] peer 2.2.2.2 group gp1",
            "[*HUAWEI-bgp-af-evpn] peer gp1 advertise add-path path-number 3"
        ]
    ],
    "ExtraInfo": "After BGP Add-Path is configured on an RR, the RR needs to send routes to a specified peer. To configure the maximum number of routes that the RR can send to the peer, run the peer advertise add-path command. The actual number of routes that the RR can send to the peer is the smaller one of the value configured using the peer advertise add-path command and the actual number of routes selected by the RR. If the maximum number of routes that the RR can send to the peer is less than the actual number of routes selected by the RR, the RR selects the optimal and Add-Path routes based on the BGP route selection rules."
}