{
    "PageTitle": "peer advertise-large-community (BGP-EVPN address family view)",
    "FuncDef": "The peer advertise-large-community command enables the function to advertise routes carrying the large-community attribute to a BGP EVPN peer.\nThe undo peer advertise-large-community command disables the function to advertise routes carrying the large-community attribute to a BGP EVPN peer. The peer advertise-large-community command enables the function to advertise routes carrying the large-community attribute to a BGP EVPN peer. The undo peer advertise-large-community command disables the function to advertise routes carrying the large-community attribute to a BGP EVPN peer. By default, a device does not advertise routes carrying the large-community attribute to a BGP EVPN peer. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <peerIpv4Addr> advertise-large-community [ disable ]",
        "undo peer <peerIpv4Addr> advertise-large-community [ disable ]"
    ],
    "ParentView": [
        "BGP-EVPN address family view,bgp-muli-instance-af-evpn view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerIpv4Addr>",
            "Info": "Specifies an IPv4 peer address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "disable",
            "Info": "Disables the Large-Community attribute from being advertised to a BGP peer.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix 1 permit 10.1.1.0 24",
            "[*HUAWEI] route-policy RP permit node 10",
            "[*HUAWEI-route-policy] if-match ip-prefix 1",
            "[*HUAWEI-route-policy] apply large-community 35551:100:65552 additive",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.2 as-number 200",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer 10.1.1.2 enable",
            "[*HUAWEI-bgp-af-evpn] peer 10.1.1.2 route-policy RP export",
            "[*HUAWEI-bgp-af-evpn] peer 10.1.1.2 advertise-large-community"
        ]
    ],
    "ExtraInfo": "To enable the function to advertise routes carrying the large-community attribute to the BGP EVPN peer, run the peer advertise-large-community command."
}