{
    "PageTitle": "peer allow-as-loop (BGP-EVPN address family view) (IPv6)",
    "FuncDef": "The peer allow-as-loop command sets the number of local AS number repetitions.\nThe undo peer allow-as-loop command cancels the configuration. The peer allow-as-loop command sets the number of local AS number repetitions. The undo peer allow-as-loop command cancels the configuration. By default, the local AS number cannot be repeated. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <peerIpv6Addr> allow-as-loop [ <num> ]",
        "undo peer <peerIpv6Addr> allow-as-loop"
    ],
    "ParentView": [
        "BGP-EVPN address family view,bgp-muli-instance-af-evpn view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerIpv6Addr>",
            "Info": "Specifies the IPv6 address of a BGP EVPN peer.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<num>",
            "Info": "Maximum number of times the local AS number can be included in the AS_Path of each received route.\nThe value is an integer in the range from 1 to 10. The default value is 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 200",
            "[*HUAWEI-bgp] peer 2001:db8:1::1 as-number 200",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer 2001:db8:1::1 enable",
            "[*HUAWEI-bgp-af-evpn] peer 2001:db8:1::1 allow-as-loop 2"
        ]
    ],
    "ExtraInfo": "Generally, BGP uses AS numbers to detect routing loops. The local AS number configured using the bgp command and the fake AS number configured using the peer fake-as command are compared with the AS_Path carried in the received route. The number of loops is the largest. In Hub and Spoke networking, if EBGP runs between the PE and CE of the Hub, the routing information advertised by the Hub-PE to the Hub-CE carries the AS number of the Hub-CE. When the Hub-PE receives the routing update from the Hub-CE, the routing update carries the AS number of the Hub-PE. In this case, the Hub-PE cannot receive the routing update.\nTo ensure correct route transmission in the Hub and Spoke networking, configure the BGP peers on the path from the Hub-CE to the Spoke-CE to allow the routes with the same AS number in the AS_Path attribute to pass."
}