{
    "PageTitle": "peer route-limit (BGP-EVPN address family view) (group)",
    "FuncDef": "The peer route-limit command sets the maximum number of routes that can be received from a peer group.\nThe undo peer route-limit command restores the default setting. The peer route-limit command sets the maximum number of routes that can be received from a peer group. The undo peer route-limit command restores the default setting. By default, there is no limit on the number of routes that can be received from a peer group. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <peerGroupName> route-limit <limit> [ <percentage> ] [ alert-only | idle-forever | idle-timeout <times> ]",
        "undo peer <peerGroupName> route-limit"
    ],
    "ParentView": [
        "BGP-EVPN address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerGroupName>",
            "Info": "Specifies the name of a BGP EVPN peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "<limit>",
            "Info": "Specifies the maximum number of routes that can be accepted from a peer.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "<percentage>",
            "Info": "Specifies the proportion threshold of the number of received routes to limit.\nIf the proportion reaches percentage and is less than 100%, the device sends a threshold-reaching alarm named BGP_1.3.6.1.4.1.2011.5.25.177.1.3.1 ROUTETHRESHOLDEXCEED and properly receives routes.If the proportion reaches 100%, the device sends a threshold-crossing alarm named BGP_1.3.6.1.4.1.2011.5.25.177.1.3.6 ROUTEEXCEED and stops receiving routes.\nThe value is an integer ranging from 1 to 100. The default value is 75."
        },
        {
            "Parameters": "alert-only",
            "Info": "Enables the device to send a threshold alarm or limit-exceeding alarm and stop accepting excess routes if accept-prefix is not specified and the percentage of the number of received routes to the maximum number of routes that can be accepted reaches 100%. In this case, the peer relationship is not disconnected.\n-"
        },
        {
            "Parameters": "idle-forever",
            "Info": "If the percentage of the number of received routes to the maximum number of routes that can be received is greater than percentage, the device reports an alarm. After the number of received routes exceeds the threshold, the peer relationship is disconnected and will not be automatically re-established.\n-"
        },
        {
            "Parameters": "idle-timeout <times>",
            "Info": "Enables the device to send an alarm if the proportion of the number of received routes to limit reaches percentage. After the number of received routes exceeds the limit, the connection is interrupted, and the device does not automatically re-establish the connection until the timer expires.\nThe value is an integer ranging from 1 to 1200, in minutes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group gp1 internal",
            "[*HUAWEI-bgp] peer 1.1.1.2 as-number 100",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer gp1 enable",
            "[*HUAWEI-bgp-af-evpn] peer 1.1.1.2 group gp1",
            "[*HUAWEI-bgp-af-evpn] peer gp1 route-limit 10000"
        ]
    ],
    "ExtraInfo": "The peer route-limit command is used to set the maximum number of routes that a BGP device is allowed to receive from its peer group. This provides a mechanism for controlling the routes received from peer group in addition to distribution lists, filtering lists, and route mappings."
}