{
    "PageTitle": "peer preferred-value (BGP-EVPN address family view) (group)",
    "FuncDef": "The peer preferred-value command sets a preferred value for the routes that a BGP device learns from its peer group.\nThe undo peer preferred-value command deletes the preferred value set for the routes that a BGP device learns from its peer group. The peer preferred-value command sets a preferred value for the routes that a BGP device learns from its peer group. The undo peer preferred-value command deletes the preferred value set for the routes that a BGP device learns from its peer group. By default, the preferred value of the routes learned from other BGP peer groups is 0. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <peerGroupName> preferred-value <preferredvalue>",
        "undo peer <peerGroupName> preferred-value"
    ],
    "ParentView": [
        "BGP-EVPN address family view,bgp-muli-instance-af-evpn view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerGroupName>",
            "Info": "Specifies the name of a BGP EVPN peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "<preferredvalue>",
            "Info": "Specifies the preferred value for routes.\nThe value is an integer ranging from 0 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group gp1 internal",
            "[*HUAWEI-bgp] peer 1.1.1.2 as-number 100",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer gp1 enable",
            "[*HUAWEI-bgp-af-evpn] peer 1.1.1.2 group gp1",
            "[*HUAWEI-bgp-af-evpn] peer gp1 preferred-value 50"
        ]
    ],
    "ExtraInfo": "After a preferred value is configured for a peer group, all the routes learned from the peer group have the preferred value. If multiple routes with the same prefix are available, the route with the largest preferred value is preferred."
}