{
    "PageTitle": "peer route-policy export (BGP-EVPN address family view) (IPv6)",
    "FuncDef": "The peer route-policy export command specifies a route-policy for filtering routes to be advertised to a peer.\nThe undo peer route-policy export command deletes a specified route-policy. The peer route-policy export command specifies a route-policy for filtering routes to be advertised to a peer. The undo peer route-policy export command deletes a specified route-policy. By default, no route-policy is configured for the routes to be advertised to a specified peer. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <peerIpv6Addr> route-policy <route-policy-name> export",
        "undo peer <peerIpv6Addr> route-policy <route-policy-name> export"
    ],
    "ParentView": [
        "BGP-EVPN address family view,bgp-muli-instance-af-evpn view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerIpv6Addr>",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<route-policy-name>",
            "Info": "Specifies the name of a routing policy.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy test-policy permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 2001:db8:1::1 as-number 100",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer 2001:db8:1::1 enable",
            "[*HUAWEI-bgp-af-evpn] peer 2001:db8:1::1 route-policy test-policy export"
        ]
    ],
    "ExtraInfo": "After a route-policy is created, the peer route-policy export command is used to apply a Route-Policy to a peer group so that the routes advertised to peer group can be controlled. To be specific, only the necessary routes are advertised to the peer group. In this manner, route management is implemented, the scale of the routing table is reduced, and fewer network resources are consumed."
}