{
    "PageTitle": "reflect same-split-group",
    "FuncDef": "The reflect same-split-group command enables a device to reflect routes only to devices in the same split horizon group.\nThe undo reflect same-split-group command restores the default configuration. The reflect same-split-group command enables a device to reflect routes only to devices in the same split horizon group. The undo reflect same-split-group command restores the default configuration. By default, route reflection are advertised without being restricted by an SHG. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "reflect same-split-group",
        "undo reflect same-split-group"
    ],
    "ParentView": [
        "Global EVPN configuration view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn-overlay enable",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.9 as-number 100",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer 10.1.1.9 enable",
            "[*HUAWEI-bgp-af-evpn] peer 10.1.1.9 split-group aa",
            "[*HUAWEI-bgp-af-evpn] quit",
            "[*HUAWEI-bgp] quit",
            "[*HUAWEI] evpn",
            "[*HUAWEI-evpn] reflect same-split-group"
        ]
    ],
    "ExtraInfo": "In a scenario where Segment VXLAN is used to implement DC interconnection, if the route reflector function is configured on a Border Leaf node, the Border Leaf node reflects the received route to the Border Leaf node in the peer DC after receiving the route from the client in the DC, however, it does not have a route to the internal device of the local data center. Therefore, the received reflected route is invalid. To prevent this problem, you can specify devices in the data center as a split horizon group on the Border Leaf node and run the reflect same-split-group command to enable the Border Leaf node to reflect routes only to devices in the same split horizon group. In this case, the Border Leaf node in the peer DC and the local Border Leaf node are in different split horizon groups. Therefore, the Border Leaf node does not reflect routes to them."
}