{
    "PageTitle": "reset bgp evpn dampening",
    "FuncDef": "The reset bgp evpn dampening command clears BGP EVPN route dampening information and releases suppressed routes. The reset bgp evpn dampening command clears BGP EVPN route dampening information and releases suppressed routes. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "reset bgp instance <instance-name> evpndampening",
        "reset bgp instance <instance-name> evpndampening { mac-route | prefix-route } <prefix>",
        "reset bgp evpn dampening",
        "reset bgp evpn dampening { mac-route | prefix-route } <prefix>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance <instance-name>",
            "Info": "Clears route dampening information about a specified BGP multi-instance.\nThe value is a string of 1 to 31 case-sensitive characters without any spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "mac-route",
            "Info": "Indicates MAC advertisement routes.\n-"
        },
        {
            "Parameters": "prefix-route",
            "Info": "Indicates IP prefix routes.\n-"
        },
        {
            "Parameters": "<prefix>",
            "Info": "Specifies the prefix of an EVPN route.\nEVPN route prefixes are classified into the following types:\nMAC advertisement route, in the format of E:M:H-H-H:L:X.X.X.X or E:M:H-H-H:L: [X:X::X:X]:\nE: ID of the VLAN to which the MAC address belongs.M: The value is 48, indicating the length of the MAC address.H-H-H: MAC address. H is a 4-digit hexadecimal number, such as 00e0 or fc01. If you enter less than four digits, 0s are padded ahead. For example, e0 is displayed as 00e0.L: The value is 0, indicating the mask length of the IP address corresponding to the MAC address.X.X.X.X: IP address corresponding to the MAC address. Currently, only 0.0.0.0 is supported.X:X::X:X: IPv6 address corresponding to the MAC address.\nIP prefix route, in the format of L:X.X.X.X:M or L:[X:X::X:X]:M:\nL: Currently, the value can only be 0.X.X.X.X: IP address of the host.M: mask of the host IP address.X:X::X:X: host IPv6 address."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset bgp evpn dampening"
        ]
    ],
    "ExtraInfo": "Route dampening can address route instability. In most cases, BGP EVPN is used on complex networks where routes change frequently. To prevent the adverse impact of continuous route flapping, BGP EVPN uses route dampening to suppress unstable routes.\nThe reset bgp evpn dampening command clears dampening information about specified BGP EVPN routes on the public network and releases specified suppressed routes. If no parameter is specified, dampening information about all BGP EVPN routes on the public network is cleared and all suppressed routes are released."
}