{
    "PageTitle": "reset bgp evpn",
    "FuncDef": "The reset bgp evpn command resets a specified or all BGP EVPN connections. The reset bgp evpn command resets a specified or all BGP EVPN connections. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "reset bgp [ instance <instance-name> ] evpn { all | <as-number> | <ipv4-address> | group <group-name> }",
        "reset bgp evpn [ <ipv4-address> ] slow-peer",
        "reset bgp instance <instance-name> evpn [ <ipv4-address> ] slow-peer"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance <instance-name>",
            "Info": "Specifies a BGP multi-instance name.\nThe value is a string of 1 to 31 case-sensitive characters without any spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "all",
            "Info": "Resets all BGP EVPN connections.\n-"
        },
        {
            "Parameters": "<as-number>",
            "Info": "Specifies a 2-byte AS number (number<1-65535>) or a 4-byte AS number (number<1-65535>.number<0-65535>).\nFor an integral AS number, the value is an integer ranging from 1 to 4294967295.\nFor an AS number in dotted notation, the value is in the format of x.y, where x and y are integers ranging from 1 to 65535 and from 0 to 65535, respectively."
        },
        {
            "Parameters": "<ipv4-address>",
            "Info": "Resets connections with a specified BGP EVPN peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "group <group-name>",
            "Info": "Resets BGP connections with the specified peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "slow-peer",
            "Info": "Restores a slow peer connection to a normal peer connection.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset bgp evpn all"
        ]
    ],
    "ExtraInfo": "If you want to have the new configuration take effect immediately after the BGP EVPN configuration changes, run the reset bgp evpn command.\nTo reset all BGP EVPN connections, run the reset bgp evpn all command."
}