{
    "PageTitle": "reset bgp evpn flap-info",
    "FuncDef": "The reset bgp evpn flap-info command clears statistics about BGP EVPN route flapping. The reset bgp evpn flap-info command clears statistics about BGP EVPN route flapping. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "reset bgp instance <instance-name> evpnflap-info",
        "reset bgp instance <instance-name> evpnflap-info { mac-route | prefix-route } <prefix>",
        "reset bgp evpn flap-info",
        "reset bgp evpn flap-info { mac-route | prefix-route } <prefix>",
        "reset bgp instance <instance-name> evpn { <ip-address> | <ipv6-address> } flap-info",
        "reset bgp evpn { <ip-address> | <ipv6-address> } flap-info"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance <instance-name>",
            "Info": "Clears route dampening information about a specified BGP multi-instance.\nThe value is a string of 1 to 31 case-sensitive characters. If spaces are used, the string must be enclosed in double quotation marks (\" \")."
        },
        {
            "Parameters": "mac-route",
            "Info": "Indicates MAC advertisement routes.\n-"
        },
        {
            "Parameters": "prefix-route",
            "Info": "Indicates IP prefix routes.\n-"
        },
        {
            "Parameters": "<prefix>",
            "Info": "Specifies the prefix of an EVPN route.\nAn EVPN route prefix has the following formats:\nMAC advertisement route. The value is in the format of E:M:H-H-H:L:X.X.X.X or E:M:H-H-H:L: [X:X::X:X], where:\nE indicates the ID of the VLAN to which the MAC address belongs.M is fixed at 48, indicating the length of the MAC address.H-H-H indicates the MAC address. The value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits, such as 00e0 or fc01. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0.L is fixed at 0, indicating the mask length of the IP address corresponding to the MAC address.X.X.X.X indicates the IP address corresponding to the MAC address. Currently, this part can only be displayed as 0.0.0.0.X:X::X:X indicates the IPv6 address corresponding to the MAC address.\nIP Prefix route. The value is in the format of L:X.X.X.X:M or L:[X:X::X:X]:M, where:\nL is fixed at 0.X.X.X.X indicates the ip address of host routes.M indicates the mask length of host routes.X:X::X:X indicates the ipv6 address of host routes."
        },
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies an IPv4 peer address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset bgp evpn flap-info"
        ]
    ],
    "ExtraInfo": "The process of adding a route to and then deleting the route from a routing table is called route flapping.\nWhen route flapping occurs, the routing protocol sends Update packets to neighbors. The neighbors that receive the Update packets need to recalculate routes and modify their routing tables. Frequent route flapping consumes extensive bandwidth and CPU resources and can even affect network operations.\nTo clear flapping statistics about BGP EVPN routes on the public network, run the reset bgp evpn flap-info command. The command output helps you monitor route changes and locate network problems."
}