{
    "PageTitle": "retry-cycle",
    "FuncDef": "The retry-cycle command sets a hold-off time to unsuppress MAC duplication.\nThe undo retry-cycle command restores the default configuration. The retry-cycle command sets a hold-off time to unsuppress MAC duplication. The undo retry-cycle command restores the default configuration. By default, MAC duplication is unsuppressed after 540 seconds. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "retry-cycle <retry-times>",
        "undo retry-cycle",
        "undo retry-cycle <retry-times>"
    ],
    "ParentView": [
        "BD-EVPN mac-duplication view"
    ],
    "ParaDef": [
        {
            "Parameters": "<retry-times>",
            "Info": "Specifies a hold-off time to unsuppress MAC duplication suppression.\nThe value is an integer ranging from 120 to 3600, in seconds. The value must be a multiple of 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 1",
            "[~HUAWEI-bd1] evpn",
            "[~HUAWEI-bd1-evpn] mac-duplication",
            "[~HUAWEI-bd1-evpn-mac-dup] retry-cycle 200"
        ]
    ],
    "ExtraInfo": "On an EVPN VXLAN, two PEs may interconnect through both network-side and access-side links. If this is the case, BUM traffic loops and MAC route flapping both occur, preventing devices from working properly. In this case, MAC duplication suppression on the devices works. By default, the system checks the number of times a MAC address entry flaps within a detection period. If the number of times a MAC address entry flaps exceeds the upper threshold, the system considers MAC route flapping to be occurring on the network and consequently suppresses the flapping MAC routes. The suppressed MAC routes cannot be sent to a remote PE through a BGP EVPN peer relationship. Then, the system starts a hold-off timer to unsuppress MAC duplication. After the timer expires, MAC routes are automatically unsuppressed. To modify the hold-off time, run the retry-cycle command."
}