{
    "PageTitle": "rewrite egress vid",
    "FuncDef": "The rewrite egress vid command changes the VLAN tag that a dot1q Layer 2 sub-interface adds to packets when decapsulating these packets.\nThe undo rewrite egress vid command restores the VLAN tag that a dot1q Layer 2 sub-interface adds to packets when decapsulating these packets. The rewrite egress vid command changes the VLAN tag that a dot1q Layer 2 sub-interface adds to packets when decapsulating these packets. The undo rewrite egress vid command restores the VLAN tag that a dot1q Layer 2 sub-interface adds to packets when decapsulating these packets. By default, when packets are decapsulated on a Layer 2 sub-interface that uses Dot1q encapsulation, the VLAN tag to be added is the same as the VLAN tag to be removed when packets are encapsulated. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "rewrite egress vid <vlan-id>",
        "undo rewrite egress vid <vlan-id>",
        "undo rewrite egress vid"
    ],
    "ParentView": [
        "100GE Layer 2 sub-interface view,10GE Layer 2 sub-interface view,200GE Layer 2 sub-interface view,25GE Layer 2 sub-interface view,400GE Layer 2 sub-interface view,50GE Layer 2 sub-interface view,Eth-Trunk Layer 2 sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<vlan-id>",
            "Info": "Specifies the VLAN tag that a Layer 2 sub-interface using Dot1q encapsulation adds to packets when decapsulating the packets.\nThe value is an integer that ranges from 1 to 4094 ."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1.1 mode l2",
            "[*HUAWEI-100GE1/0/1.1] encapsulation dot1q vid 10",
            "[*HUAWEI-100GE1/0/1.1] rewrite egress vid 20"
        ]
    ],
    "ExtraInfo": ""
}