{
    "PageTitle": "vxlan vni (Bridge domain view)",
    "FuncDef": "The vxlan vni command creates a VXLAN network identifier (VNI) and maps a VNI to a bridge domain (BD) in 1:1 mode.\nThe undo vxlan vni command deletes the mapping between a VNI and a BD.\nThe vxlan vni split-group command configures a mapping VNI to be associated with a BD and specifies the split horizon group (SHG) to which the mapping VNI belongs.\nThe undo vxlan vni split-group command restores the default configuration. The vxlan vni command creates a VXLAN network identifier (VNI) and maps a VNI to a bridge domain (BD) in 1:1 mode. The undo vxlan vni command deletes the mapping between a VNI and a BD. The vxlan vni split-group command configures a mapping VNI to be associated with a BD and specifies the split horizon group (SHG) to which the mapping VNI belongs. The undo vxlan vni split-group command restores the default configuration. By default, no VNI is created and no mapping VNI is associated with a BD. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "vxlan vni <vni-id> [ split-group <split-group-name> ]",
        "undo vxlan vni <vni-id> [ split-group <split-group-name> ]"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "<vni-id>",
            "Info": "Specifies the VNI ID.\nThe value is an integer ranging from 1 to 16777215."
        },
        {
            "Parameters": "split-group <split-group-name>",
            "Info": "Specifies the ID of the mapping VNI associated with the current BD.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] vxlan vni 30 split-group p"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] vxlan vni 5000"
        ]
    ],
    "ExtraInfo": "A virtual network (VN) on a VXLAN is a virtual broadcast domain. To allow a BD to function as a VXLAN network entity to transmit VXLAN traffic, run the vxlan vni command to map a VNI to a BD in 1:1 mode.\nTo implement Layer 2 communication between hosts in different DCs in a scenario where segment VXLAN is used, run the vxlan vni split-group command on transit leaf nodes (edge devices interconnecting the DCs) to configure a mapping VNI to be associated with the BD. The mapping VNI is used for the VXLAN tunnel between the DCs. After this configuration is complete, a transit leaf node replaces the VNI in VXLAN packets received within the DC with the mapping VNI. This configuration decouples the VNI space for a DC's network from the VNI space for the network between DCs and isolates faults.\nAdditionally, to prevent loops when a transit leaf node forwards BUM traffic, the split horizon group to which the mapping VNI belongs must be specified, so that devices within a DC belong to the default SHG, and transit leaf nodes between DCs belong to the specified SHG. In this manner, when a transit leaf node receives BUM traffic, it does not forward traffic to a device belonging to the same SHG, therefore preventing loops."
}