{
    "PageTitle": "vxlan statistics enable",
    "FuncDef": "The vxlan statistics enable command enables the function of collecting VXLAN packet statistics based on the VNI and VXLAN tunnel.\nThe undo vxlan statistics enable command disables the function of collecting VXLAN packet statistics based on the VNI and VXLAN tunnel. The vxlan statistics enable command enables the function of collecting VXLAN packet statistics based on the VNI and VXLAN tunnel. The undo vxlan statistics enable command disables the function of collecting VXLAN packet statistics based on the VNI and VXLAN tunnel. By default, the function of collecting VXLAN packet statistics based on the VNI and VXLAN tunnel is disabled. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "vxlan statistics peer <peer-ip> vni <vni-id> enable",
        "vxlan statistics peer <peer-ip> enable",
        "vxlan statistics source <srcAddr> peer <peer-ip> enable",
        "vxlan statistics source <srcAddr> peer <peer-ip> vni <vni-id> enable",
        "undo vxlan statistics peer <peer-ip> vni <vni-id> enable",
        "undo vxlan statistics peer <peer-ip> enable",
        "undo vxlan statistics source <srcAddr> peer <peer-ip> enable",
        "undo vxlan statistics source <srcAddr> peer <peer-ip> vni <vni-id> enable"
    ],
    "ParentView": [
        "NVE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "vni <vni-id>",
            "Info": "Enables VXLAN packets statistics collection based on a specified VNI ID.\nThe value is an integer ranging from 1 to 16777215."
        },
        {
            "Parameters": "peer <peer-ip>",
            "Info": "Enables VXLAN packet statistics collection based on the IP address of the peer VTEP.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "source <srcAddr>",
            "Info": "Enable VXLAN packet statistics collection with a specified local VTEP IP address.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface nve 1",
            "[*HUAWEI-Nve1] source 1.1.1.1",
            "[*HUAWEI-Nve1] vni 1 head-end peer-list 1.1.1.2",
            "[*HUAWEI-Nve1] vxlan statistics peer 1.1.1.2 vni 1 enable"
        ]
    ],
    "ExtraInfo": ""
}