{
    "PageTitle": "eth-trunk (load balancing profile view)",
    "FuncDef": "The eth-trunk command configures an Eth-Trunk load balancing mode in a load balancing profile.\nThe undo eth-trunk command restores the default Eth-Trunk load balancing mode in a load balancing profile. The eth-trunk command configures an Eth-Trunk load balancing mode in a load balancing profile. The undo eth-trunk command restores the default Eth-Trunk load balancing mode in a load balancing profile. By default, for the CE8851-32CQ8DQ-P, CE8850-HAM, CE8850-SAN, CE8851K, CE6860-SAN, CE6866, CE6860-HAM, and CE6866K, the load balancing modes are seed(1) and hash-mode(1).\n\n\nBy default, for the CE6820H, CE6820H-K, CE6820S, CE6863H, CE6863H-K, CE6881H, and CE6881H-K, the load balancing modes are universal-id(1) and hash-mode(1).\n\n\nBy default, for the CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode), CE6885-SAN, and CE6885-LL (low latency mode), the load balancing modes are universal-id(1), seed(1), and hash-mode(1). By default, for the CE8851-32CQ8DQ-P, CE8850-HAM, CE8850-SAN, CE8851K, CE6860-SAN, CE6866, CE6860-HAM, and CE6866K, the load balancing modes are seed(1) and hash-mode(1). By default, for the CE6820H, CE6820H-K, CE6820S, CE6863H, CE6863H-K, CE6881H, and CE6881H-K, the load balancing modes are universal-id(1) and hash-mode(1). By default, for the CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode), CE6885-SAN, and CE6885-LL (low latency mode), the load balancing modes are universal-id(1), seed(1), and hash-mode(1).",
    "CLIs": [
        "eth-trunk { seed <seed-data> | hash-mode <hash-mode-id> }",
        "undo eth-trunk [ seed [ <seed-data> ] | hash-mode [ <hash-mode-id> ] ]",
        "eth-trunk universal-id <universal-id>",
        "undo eth-trunk universal-id [ <universal-id> ]",
        "eth-trunk { universal-id <universal-id> | hash-mode <hash-mode-id> }",
        "undo eth-trunk [ universal-id [ <universal-id> ] | hash-mode [ <hash-mode-id> ] ]"
    ],
    "ParentView": [
        "Load balancing profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "universal-id <universal-id>",
            "Info": "Specifies the offset of the hash algorithm.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer ranging from 1 to 16. The default value is 1."
        },
        {
            "Parameters": "hash-mode <hash-mode-id>",
            "Info": "Specifies the hash algorithm for Eth-Trunk load balancing.\nThe value is an integer that ranges from 1 to 13. The default value is 1.\nThe value is an integer that ranges from 1 to 3. The default value is 1.\nThe value is an integer that ranges from 1 to 9. The default value is 1.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer that ranges from 1 to 13. The default value is 1.\nFor the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM:The value is an integer that ranges from 1 to 9. The default value is 1.\nFor the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S:The value is an integer that ranges from 1 to 3. The default value is 1."
        },
        {
            "Parameters": "seed <seed-data>",
            "Info": "Specifies the start hash value of the load balancing hash algorithm.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer that ranges from 1 to 65535. The default value is 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance profile default",
            "[~HUAWEI-load-balance-profile-default] eth-trunk hash-mode 3"
        ]
    ],
    "ExtraInfo": "On a hierarchical network, the access layer is connected to the aggregation layer through Eth-Trunks, and the aggregation layer is also connected to the core layer through Eth-Trunks. If the same hash algorithm is configured on devices at both the access layer and aggregation layer, the same hash result will be obtained. As a result, traffic sent by devices at the aggregation layer may not be load balanced on Eth-Trunk member links."
}