{
    "PageTitle": "eth-trunk mode (dynamic load balancing profile view)",
    "FuncDef": "The eth-trunk mode command configures the dynamic load balancing mode for a LAG.\nThe undo eth-trunk mode command restores the default dynamic load balancing mode for a LAG. The eth-trunk mode command configures the dynamic load balancing mode for a LAG. The undo eth-trunk mode command restores the default dynamic load balancing mode for a LAG. By default, a LAG uses the eligible dynamic load balancing mode, in which the flowlet interval is 1000. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "eth-trunk mode { spray | fixed | eligible [ flowlet-gap-time <gap-time> ] }",
        "undo eth-trunk mode [ spray | fixed | eligible [ flowlet-gap-time <gap-time> ] ]"
    ],
    "ParentView": [
        "Dynamic load balancing profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "spray",
            "Info": "Enables the spray dynamic load balancing mode for a LAG.\nIn spray dynamic load balancing mode, a device selects a member link with the lightest load to forward data packets.\n-"
        },
        {
            "Parameters": "fixed",
            "Info": "Enables the fixed dynamic load balancing mode for a LAG.\nIn fixed dynamic load balancing mode, a device forwards a data packet through the link for forwarding the previous data packet. The time interval is 2 seconds. If the data packet to be forwarded is the first packet in a flow, the device forwards it through one of the member links in static load balancing mode based on the hash result.\n-"
        },
        {
            "Parameters": "eligible",
            "Info": "Enables the eligible dynamic load balancing mode for a LAG.\nIn eligible dynamic load balancing mode, based on the flowlet, a device selects a member link with the lightest load to forward the data packet. Data packets in the same flowlet are forwarded through the same link.\n-"
        },
        {
            "Parameters": "flowlet-gap-time <gap-time>",
            "Info": "Specifies the flowlet interval. A device splits a flow into flowlets based on this parameter.\nThe value is an integer that ranges from 16 to 32000. The unit is 1024 nanoseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance profile dynamic test",
            "[*HUAWEI-load-balance-profile-dynamic-test] eth-trunk mode fixed"
        ]
    ],
    "ExtraInfo": "You can change the dynamic load balancing mode for a LAG based on the network traffic to provide maximum load balancing between member links. The eligible dynamic load balancing mode is recommended."
}