{
    "PageTitle": "ip (Load balancing profile view)",
    "FuncDef": "The ip command sets the load balancing mode of IPv4 packets in a load balancing profile.\nThe undo ip command deletes the load balancing mode of IPv4 packets or restores the default load balancing mode of IPv4 packets in a load balancing profile. The ip command sets the load balancing mode of IPv4 packets in a load balancing profile. The undo ip command deletes the load balancing mode of IPv4 packets or restores the default load balancing mode of IPv4 packets in a load balancing profile. By default, for the CE6820H, CE6820H-K, CE6820S, CE6863H, CE6863H-K, CE6881H, and CE6881H-K, IPv4 packets are load balanced based on src-ip, dst-ip, l4-src-port, and l4-dst-port.\n\n\nBy default, for the CE6866, CE6860-SAN, CE6860-HAM, CE6866K, CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode), CE6885-SAN, CE6885-LL (low latency mode), CE8851-32CQ8DQ-P, CE8850-SAN, CE8850-HAM, and CE8851K, IPv4 packets are load balanced based on session-id, dest-qp, src-ip, dst-ip, l4-src-port, and l4-dst-port. By default, for the CE6820H, CE6820H-K, CE6820S, CE6863H, CE6863H-K, CE6881H, and CE6881H-K, IPv4 packets are load balanced based on src-ip, dst-ip, l4-src-port, and l4-dst-port. By default, for the CE6866, CE6860-SAN, CE6860-HAM, CE6866K, CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode), CE6885-SAN, CE6885-LL (low latency mode), CE8851-32CQ8DQ-P, CE8850-SAN, CE8850-HAM, and CE8851K, IPv4 packets are load balanced based on session-id, dest-qp, src-ip, dst-ip, l4-src-port, and l4-dst-port.",
    "CLIs": [
        "ip [ src-ip | dst-ip | protocol | l4-src-port | l4-dst-port | src-mac | dst-mac | flowlabel | src-interface | dest-qp | session-id ]",
        "undo ip [ src-ip | dst-ip | protocol | l4-src-port | l4-dst-port | src-mac | dst-mac | flowlabel | src-interface | dest-qp | session-id ]",
        "ip [ src-ip | dst-ip | protocol | l4-src-port | l4-dst-port ]",
        "undo ip [ src-ip | dst-ip | protocol | l4-src-port | l4-dst-port ]"
    ],
    "ParentView": [
        "Load balancing profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "src-ip",
            "Info": "Performs load balancing based on the source IP address.\n-"
        },
        {
            "Parameters": "dst-ip",
            "Info": "Performs load balancing based on the destination IP address.\n-"
        },
        {
            "Parameters": "protocol",
            "Info": "Performs load balancing based on the protocol type.\n-"
        },
        {
            "Parameters": "l4-src-port",
            "Info": "Performs load balancing based on the transport-layer source port number.\n-"
        },
        {
            "Parameters": "l4-dst-port",
            "Info": "Performs load balancing based on the transport-layer destination port number.\n-"
        },
        {
            "Parameters": "src-mac",
            "Info": "Performs load balancing based on the source MAC address.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "dst-mac",
            "Info": "Performs load balancing based on the destination MAC address.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "flowlabel",
            "Info": "Performs load balancing based on flow labels in IPv6 packets.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "src-interface",
            "Info": "Performs load balancing based on the inbound interface.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "dest-qp",
            "Info": "Performs load balancing for RoCEv2 packets based on dest-qp.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "session-id",
            "Info": "Performs load balancing for PPPoE packets based on session-id.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance profile abc",
            "[*HUAWEI-load-balance-profile-abc] ip protocol"
        ]
    ],
    "ExtraInfo": "You can run this command to configure a load balancing mode for IPv4 packets in a load balancing profile. If no parameter is specified in the undo ip command, the default load balancing mode of IPv4 packets is restored in the load balancing profile. If a parameter is specified in the undo ip command, the specified load balancing mode of IPv4 packets is deleted from the load balancing profile."
}