{
    "PageTitle": "ipv6 (load balancing profile view)",
    "FuncDef": "The ipv6 command configures the load balancing mode for ipv6 packets in a load balancing profile.\nThe undo ipv6 command deletes the specified load balancing mode or restores the default load balancing mode for ipv6 packets in a load balancing profile. The ipv6 command configures the load balancing mode for ipv6 packets in a load balancing profile. The undo ipv6 command deletes the specified load balancing mode or restores the default load balancing mode for ipv6 packets in a load balancing profile. By default, ipv6 packets are load balanced based on src-ip, dst-ip, l4-src-port, and l4-dst-port. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "ipv6 [ src-ip | dst-ip | protocol | l4-src-port | l4-dst-port ]",
        "undo ipv6 [ src-ip | dst-ip | protocol | l4-src-port | l4-dst-port ]"
    ],
    "ParentView": [
        "Load balancing profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "src-ip",
            "Info": "Performs load balancing based on the source ipv6 address.\n-"
        },
        {
            "Parameters": "dst-ip",
            "Info": "Performs load balancing based on the destination ipv6 address.\n-"
        },
        {
            "Parameters": "protocol",
            "Info": "Performs load balancing based on the protocol type.\n-"
        },
        {
            "Parameters": "l4-src-port",
            "Info": "Performs load balancing based on the transport-layer source port number.\n-"
        },
        {
            "Parameters": "l4-dst-port",
            "Info": "Performs load balancing based on the transport-layer destination port number.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance profile abc",
            "[*HUAWEI-load-balance-profile-abc] ipv6 src-ip protocol"
        ]
    ],
    "ExtraInfo": "The ipv6 command configures the load balancing mode for ipv6 packets in a load balancing profile. The undo ipv6 command with no parameter specified restores the default load balancing mode for ipv6 packets whereas the undo ipv6 command with a parameter specified deletes the specified load balancing mode for ipv6 packets."
}