{
    "PageTitle": "l2 (Load balancing profile view)",
    "FuncDef": "The l2 command configures a load balancing mode of Layer 2 packets in a load balancing profile.\nThe undo l2 command deletes the load balancing mode of Layer 2 packets or restores the default load balancing mode of Layer 2 packets. The l2 command configures a load balancing mode of Layer 2 packets in a load balancing profile. The undo l2 command deletes the load balancing mode of Layer 2 packets or restores the default load balancing mode of Layer 2 packets. By default, Layer 2 packets are load balanced based on src-mac, dst-mac, and vlan.",
    "CLIs": [
        "l2 [ src-mac | dst-mac | src-interface | eth-type | vlan ]",
        "undo l2 [ src-mac | dst-mac | src-interface | eth-type | vlan ]"
    ],
    "ParentView": [
        "Load balancing profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "src-mac",
            "Info": "Performs load balancing based on source MAC addresses in Layer 2 packets.\n-"
        },
        {
            "Parameters": "dst-mac",
            "Info": "Performs load balancing based on destination MAC addresses in Layer 2 packets.\n-"
        },
        {
            "Parameters": "src-interface",
            "Info": "Performs load balancing based on physical-layer source port numbers in Layer 2 packets.\n-"
        },
        {
            "Parameters": "eth-type",
            "Info": "Performs load balancing based on the protocol types of packets.\n-"
        },
        {
            "Parameters": "vlan",
            "Info": "Performs load balancing based on vlan.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance profile a",
            "[*HUAWEI-load-balance-profile-a] l2 eth-type"
        ]
    ],
    "ExtraInfo": "The undo l2 command with no parameter specified restores the default load balancing mode of Layer 2 packets. The undo l2 command with a parameter specified deletes a specified load balancing mode of Layer 2 packets."
}