{
    "PageTitle": "l3(inner-connect-load-balance-view)",
    "FuncDef": "The l3 command configures a load balancing mode for Layer 3 packets.\nThe undo l3 command deletes the specified load balancing mode of Layer 3 packets or restores the default load balancing mode of Layer 3 packets. The l3 command configures a load balancing mode for Layer 3 packets. The undo l3 command deletes the specified load balancing mode of Layer 3 packets or restores the default load balancing mode of Layer 3 packets. By default, Layer 3 packets on internal communication interfaces are load balanced based on sbsp, src-ip, dst-ip, src-port, and dst-port. This command is supported only on the CE6863H, CE6863H-K, CE6881H and CE6881H-K.",
    "CLIs": [
        "l3 { sbsp | outer-vlan | inner-vlan | src-ip | dst-ip | protocol | src-port | dst-port }",
        "undo l3 [ sbsp | outer-vlan | inner-vlan | src-ip | dst-ip | protocol | src-port | dst-port ]"
    ],
    "ParentView": [
        "inner-connect load balance view"
    ],
    "ParaDef": [
        {
            "Parameters": "sbsp",
            "Info": "Performs load balancing based on the source port of the source card.\n-"
        },
        {
            "Parameters": "outer-vlan",
            "Info": "Performs load balancing based on the outer VLAN ID.\n-"
        },
        {
            "Parameters": "inner-vlan",
            "Info": "Performs load balancing based on the inner VLAN ID.\n-"
        },
        {
            "Parameters": "src-ip",
            "Info": "Performs load balancing based on the source IP address.\n-"
        },
        {
            "Parameters": "dst-ip",
            "Info": "Performs load balancing based on the destination IP address.\n-"
        },
        {
            "Parameters": "protocol",
            "Info": "Performs load balancing based on the protocol number.\n-"
        },
        {
            "Parameters": "src-port",
            "Info": "Performs load balancing based on the source port.\n-"
        },
        {
            "Parameters": "dst-port",
            "Info": "Performs load balancing based on the destination port.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance inner-connect",
            "[~HUAWEI-inner-connect] l3 sbsp src-ip dst-ip dst-port"
        ]
    ],
    "ExtraInfo": ""
}