{
    "PageTitle": "lacp mixed-rate link enable",
    "FuncDef": "The lacp mixed-rate link enable command enables interfaces working at different rates to forward packets after they are added to an Eth-Trunk interface in static or dynamic Link Aggregation Control Protocol (LACP) mode.\nThe undo lacp mixed-rate link enable command disables interfaces working at different rates from forwarding data packets after they are added to an Eth-Trunk interface in static or dynamic LACP mode. The lacp mixed-rate link enable command enables interfaces working at different rates to forward packets after they are added to an Eth-Trunk interface in static or dynamic Link Aggregation Control Protocol (LACP) mode. The undo lacp mixed-rate link enable command disables interfaces working at different rates from forwarding data packets after they are added to an Eth-Trunk interface in static or dynamic LACP mode. By default, after interfaces working at different rates are added to an Eth-Trunk interface in static or dynamic LACP mode, traffic is forwarded through the member interface with a higher LACP priority on the Actor. If the member interfaces have the same LACP priority, traffic is forwarded through the member interface with a smaller interface ID.",
    "CLIs": [
        "lacp mixed-rate link enable",
        "undo lacp mixed-rate link enable"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] mode lacp-static",
            "[*HUAWEI-Eth-Trunk1] lacp mixed-rate link enable"
        ]
    ],
    "ExtraInfo": "By default, after interfaces operating at different rates are added to an Eth-Trunk interface in static or dynamic LACP mode, traffic is forwarded at only one of the rates through the corresponding interfaces. This operation cannot implement load balancing on the Eth-Trunk interface.\nTo implement load balancing, run the lacp mixed-rate link enable command to enable the Eth-Trunk interface's member interfaces operating at different rates to share packets."
}