{
    "PageTitle": "lacp priority (Eth-Trunk interface view)",
    "FuncDef": "The lacp priority command sets the LACP system priority for an Eth-trunk interface.\nThe undo lacp priority command restores the default LACP system priority of an Eth-Trunk interface. The lacp priority command sets the LACP system priority for an Eth-trunk interface. The undo lacp priority command restores the default LACP system priority of an Eth-Trunk interface. The default LACP priority is 32768.",
    "CLIs": [
        "lacp priority <priority>",
        "undo lacp priority"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "priority <priority>",
            "Info": "Specifies the LACP system priority of the current Eth-Trunk interface.\nThe value is an integer ranging from 0 to 65535. The smaller the priority value, the higher the priority."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 10",
            "[*HUAWEI-Eth-Trunk10] mode lacp-static",
            "[*HUAWEI-Eth-Trunk10] lacp priority 1"
        ]
    ],
    "ExtraInfo": "To change the Actor of an Eth-Trunk, run this command in the Eth-Trunk view.\nLACP system priorities are set to prioritize the devices at both ends of an Eth-Trunk. The device with a higher system priority is selected as the Actor, and then active member interfaces are selected according to the configuration of the Eth-Trunk interface on the Actor.\nThe system priority configured in the Eth-Trunk view is preferentially used as the Eth-Trunk system priority. If the system priority is not configured in the Eth-Trunk interface view, the global system priority is used.\nIf neither of the devices at the two ends of an Eth-Trunk is configured with the system priority, the devices adopt the default value 32768. In this case, the Actor is selected according to the system ID. That is, the device with the smaller system ID becomes the Actor."
}