{
    "PageTitle": "lacp m-lag system-id",
    "FuncDef": "The lacp m-lag system-id command configures a Link Aggregation Control Protocol (LACP) system ID for a member Eth-Trunk interface in an M-LAG (LACP M-LAG system ID for short).\nThe undo lacp m-lag system-id command restores the default LACP M-LAG system ID. The lacp m-lag system-id command configures a Link Aggregation Control Protocol (LACP) system ID for a member Eth-Trunk interface in an M-LAG (LACP M-LAG system ID for short). The undo lacp m-lag system-id command restores the default LACP M-LAG system ID. By default, the LACP M-LAG system ID in the system view is the system bridge MAC address.",
    "CLIs": [
        "lacp m-lag system-id <mac-address>",
        "undo lacp m-lag system-id"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "system-id <mac-address>",
            "Info": "Specifies an LACP M-LAG system ID.\nA smaller system ID indicates a higher priority.\nThe value is in the format of H-H-H. Each H is a 4-digit hexadecimal number, such as 00e0 or fc01. If an H contains less than four hexadecimal digits, 0s are padded ahead. For example, if an H is e0, it is equal to 00e0.\nAn LACP system ID cannot be all 0s.\nIf the value is all Fs, the LACP system ID is restored to the default."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lacp m-lag system-id 00e0-fc00-0000"
        ]
    ],
    "ExtraInfo": "When an M-LAG consists of Eth-Trunk interfaces working in LACP mode, each member Eth-Trunk interface and the connected peer Eth-Trunk interface use LACP M-LAG system priorities to determine the priority of the device at either end of the Eth-Trunk link. The device with the higher priority functions as the LACP Actor and determines which member interfaces in its Eth-Trunk interface are active based on the interface priorities. The other device selects the member interfaces connected to the active member interfaces on the Actor as active member interfaces. If a member Eth-Trunk interface in an M-LAG has the same LACP system priority as its connected Eth-Trunk interface, run the lacp m-lag system-id command to configure an LACP M-LAG system ID. In this situation, LACP system IDs are used to determine the priority of the device at either end of the Eth-Trunk link. The device with the higher priority then selects active member interfaces in its Eth-Trunk interface, and the other device selects the interconnected member interfaces to be active member interfaces."
}