{
    "PageTitle": "load-balance mpls",
    "FuncDef": "The load-balance mpls command configures a load balancing mode for MPLS packets.\nThe undo load-balance mpls command deletes the specified load balancing mode or restores the default load balancing mode of MPLS packets. The load-balance mpls command configures a load balancing mode for MPLS packets. The undo load-balance mpls command deletes the specified load balancing mode or restores the default load balancing mode of MPLS packets. By default, MPLS packets are load balanced based on top-label and 2nd-label. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "load-balance mpls [ top-label | 2nd-label | 3rd-label | src-ip | dst-ip | src-interface | src-mac | dst-mac | l4-src-port | l4-dst-port | protocol ]",
        "undo load-balance mpls { top-label | 2nd-label | 3rd-label | src-ip | dst-ip | src-interface | src-mac | dst-mac | l4-src-port | l4-dst-port | protocol }"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "top-label",
            "Info": "Performs load balancing based on top labels.\n-"
        },
        {
            "Parameters": "2nd-label",
            "Info": "Performs load balancing based on second labels.\n-"
        },
        {
            "Parameters": "3rd-label",
            "Info": "Performs load balancing based on third labels.\n-"
        },
        {
            "Parameters": "src-ip",
            "Info": "Performs load balancing based on the source IP address.\n-"
        },
        {
            "Parameters": "dst-ip",
            "Info": "Performs load balancing based on the destination IP address.\n-"
        },
        {
            "Parameters": "src-interface",
            "Info": "Performs load balancing based on the inbound interface.\n-"
        },
        {
            "Parameters": "src-mac",
            "Info": "Performs load balancing based on the source MAC address.\n-"
        },
        {
            "Parameters": "dst-mac",
            "Info": "Performs load balancing based on the destination MAC address.\n-"
        },
        {
            "Parameters": "l4-src-port",
            "Info": "Performs load balancing based on the transport-layer source port number.\n-"
        },
        {
            "Parameters": "l4-dst-port",
            "Info": "Performs load balancing based on the transport-layer destination port number.\n-"
        },
        {
            "Parameters": "protocol",
            "Info": "Performs load balancing based on the protocol type.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 1",
            "[*HUAWEI-Eth-Trunk1] load-balance mpls 2nd-label"
        ]
    ],
    "ExtraInfo": ""
}