{
    "PageTitle": "load-balance ip",
    "FuncDef": "The load-balance ip command configures a load balancing mode for IP packets.\nThe undo load-balance ip command deletes the specified load balancing mode or restores the default load balancing mode for IP packets. The load-balance ip command configures a load balancing mode for IP packets. The undo load-balance ip command deletes the specified load balancing mode or restores the default load balancing mode for IP packets. By default, IP packets are load balanced based on session-id, dest-qp, src-ip, dst-ip, l4-src-port, and l4-dst-port. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "load-balance ip [ src-ip | dst-ip | l4-src-port | l4-dst-port | protocol | src-mac | dst-mac | flowlabel | src-interface | dest-qp | session-id ]",
        "undo load-balance ip [ src-ip | dst-ip | l4-src-port | l4-dst-port | protocol | src-mac | dst-mac | flowlabel | src-interface | dest-qp | session-id ]"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "src-ip",
            "Info": "Performs load balancing based on the source IP address.\n-"
        },
        {
            "Parameters": "dst-ip",
            "Info": "Performs load balancing based on the destination IP address.\n-"
        },
        {
            "Parameters": "l4-src-port",
            "Info": "Performs load balancing based on the transport-layer source port number.\n-"
        },
        {
            "Parameters": "l4-dst-port",
            "Info": "Performs load balancing based on the transport-layer destination port number.\n-"
        },
        {
            "Parameters": "protocol",
            "Info": "Performs load balancing based on the protocol type.\n-"
        },
        {
            "Parameters": "src-mac",
            "Info": "Performs load balancing based on the source MAC address.\n-"
        },
        {
            "Parameters": "dst-mac",
            "Info": "Performs load balancing based on the destination MAC address.\n-"
        },
        {
            "Parameters": "flowlabel",
            "Info": "Performs load balancing based on the flow label.\n-"
        },
        {
            "Parameters": "src-interface",
            "Info": "Performs load balancing based on the inbound interface.\n-"
        },
        {
            "Parameters": "dest-qp",
            "Info": "Performs load balancing based on the dest-qp of RoCEv2 packets.\n-"
        },
        {
            "Parameters": "session-id",
            "Info": "Performs load balancing based on session IDs of PPPoE packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 1",
            "[~HUAWEI-Eth-Trunk1] load-balance ip dst-mac"
        ]
    ],
    "ExtraInfo": "By default, the device performs load balancing based on session-id, dest-qp, src-ip, dst-ip, l4-src-port, and l4-dst-port after receiving IP packets. You can run the load-balance ip command to enable the device to extract related fields from IP packets and perform the hash operation to implement even load balancing."
}