{
    "PageTitle": "load-balance l2",
    "FuncDef": "The load-balance l2 command configures a load balancing mode for Layer 2 packets.\nThe undo load-balance l2 command deletes the specified load balancing mode or restores the default load balancing mode of Layer 2 packets. The load-balance l2 command configures a load balancing mode for Layer 2 packets. The undo load-balance l2 command deletes the specified load balancing mode or restores the default load balancing mode of Layer 2 packets. By default, Layer 2 packets are load balanced based on src-mac, dst-mac, and vlan. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "load-balance l2 [ vlan | src-mac | dst-mac | eth-type | src-interface ]",
        "undo load-balance l2 [ vlan | src-mac | dst-mac | eth-type | src-interface ]"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan",
            "Info": "Configures an Eth-Trunk interface to load balance traffic based on the VLAN.\n-"
        },
        {
            "Parameters": "src-mac",
            "Info": "Configures an Eth-Trunk interface to load balance traffic based on the source MAC address.\n-"
        },
        {
            "Parameters": "dst-mac",
            "Info": "Configures an Eth-Trunk interface to load balance traffic based on the destination MAC address.\n-"
        },
        {
            "Parameters": "eth-type",
            "Info": "Configures an Eth-Trunk interface to load balance traffic based on the protocol type.\n-"
        },
        {
            "Parameters": "src-interface",
            "Info": "Configures an Eth-Trunk interface to load balance traffic based on the source port.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 1",
            "[*HUAWEI-Eth-Trunk1] load-balance l2 dst-mac"
        ]
    ],
    "ExtraInfo": ""
}