{
    "PageTitle": "tunnel (load balancing profile view)",
    "FuncDef": "The tunnel command configures a load balancing mode for tunnel packets in a load balancing profile.\nThe undo tunnel command restores the default load balancing mode of tunnel packets in a load balancing profile. The tunnel command configures a load balancing mode for tunnel packets in a load balancing profile. The undo tunnel command restores the default load balancing mode of tunnel packets in a load balancing profile. By default, tunnel packets are load balanced based on outer-header. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "tunnel { outer-header | inner-header }",
        "undo tunnel [ outer-header | inner-header ]",
        "tunnel { outer-header | inner-header }",
        "undo tunnel [ outer-header | inner-header ]"
    ],
    "ParentView": [
        "Load balancing profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "outer-header",
            "Info": "Specifies load balancing based on the outer header.\n-"
        },
        {
            "Parameters": "inner-header",
            "Info": "Specifies load balancing based on the inner header.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance profile abc",
            "Warning: The profile default has been used, and this command will rename it. Continue? [Y/N]:y",
            "[*HUAWEI-load-balance-profile-abc] tunnel inner-header"
        ]
    ],
    "ExtraInfo": "For tunnel packets, such as GRE and VXLAN packets, you can run the tunnel command to configure hash calculation based on the outer or inner header in the specified load balancing profile."
}