{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "configure replace",
    "FuncDef": [
        "To replace the current running configuration with a saved Cisco IOS configuration file, use the **configure replace** command in privileged EXEC mode. "
    ],
    "CLIs": [
        "configure replace <target-url> [ nolock ] [ list ] [ force ] [ ignorecase ] [ revert trigger [ error ] < [ >timer <minutes> ] | time <minutes> ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *target-url* ",
            "Info": " URL (accessible by the Cisco IOS file system) of the saved Cisco IOS configuration file that is to replace the current running configuration. "
        },
        {
            "Parameters": " **nolock** ",
            "Info": " (Optional) Disables the locking of the running configuration file that prevents other users from changing the running configuration during a configuration replace operation. "
        },
        {
            "Parameters": " **list** ",
            "Info": " (Optional) Displays a list of the command lines applied by the Cisco IOS software parser during each pass of the configuration replace operation. The total number of passes performed is also displayed. "
        },
        {
            "Parameters": " **force** ",
            "Info": " (Optional) Replaces the current running configuration file with the specified saved Cisco IOS configuration file without prompting you for confirmation. "
        },
        {
            "Parameters": " **ignorecase** ",
            "Info": " (Optional) Instructs the configuration to ignore the case of the configuration confirmation. "
        },
        {
            "Parameters": " **revert trigger** ",
            "Info": " (Optional) Sets the triggers for reverting to the original configuration.  •**error**—Reverts to the original configuration upon error.  •**timer** *minutes*—Reverts to the original configuration if the specified time elapses. "
        },
        {
            "Parameters": " **time** *minutes* ",
            "Info": " (Optional) Time (in minutes) within which you must enter the **configure confirm** command to confirm replacement of the current running configuration file. If the **configure confirm** command is not entered within the specified time limit, the configuration replace operation is automatically reversed (in other words, the current running configuration file is restored to the configuration state that existed prior to entering the **configure replace** command). "
        }
    ],
    "Examples": [
        [
            "•! [ ] (/c/dam/en/us/td/i/templates/blank.gif) [ Replacing the Current Running Configuration with a Saved Cisco IOS Configuration File ] (#wp1071696)",
            "•! [ ] (/c/dam/en/us/td/i/templates/blank.gif) [ Reverting to the Startup Configuration File ] (#wp1071728)",
            "•! [ ] (/c/dam/en/us/td/i/templates/blank.gif) [ Performing a Configuration Replace Operation with the configure confirm Command ] (#wp1071735)",
            "•! [ ] (/c/dam/en/us/td/i/templates/blank.gif) [ Performing a Configuration Rollback Operation ] (#wp1071750)",
            "Replacing the Current Running Configuration with a Saved Cisco IOS Configuration File",
            "The following example shows how to replace the current running configuration with a saved Cisco IOS configuration file named disk0:myconfig. Note that the configure replace command interactively prompts you to confirm the operation.",
            "```",
            "Router# configure replace disk0:myconfig",
            "```",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "```",
            "to replace the current running configuration with the",
            "```",
            "```",
            "contents of the specified configuration file, which is",
            "```",
            "```",
            "assumed to be a complete configuration, not a partial",
            "```",
            "```",
            "configuration. Enter Y if you are sure you want to proceed. ? [ no ] : Y",
            "```",
            "```",
            "```",
            "```",
            "Total number of passes: 1",
            "```",
            "```",
            "Rollback Done",
            "```",
            "```",
            "```",
            "In the following example, the list keyword is specified to display the command lines that were applied during the configuration replace operation:",
            "```",
            "Router# configure replace disk0:myconfig list",
            "```",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "```",
            "to replace the current running configuration with the",
            "```",
            "```",
            "contents of the specified configuration file, which is",
            "```",
            "```",
            "assumed to be a complete configuration, not a partial",
            "```",
            "```",
            "configuration. Enter Y if you are sure you want to proceed. ? [ no ] : Y",
            "```",
            "```",
            "```",
            "```",
            "!Pass 1",
            "```",
            "```",
            "```",
            "```",
            "!List of Commands:",
            "```",
            "```",
            "no snmp-server community public ro",
            "```",
            "```",
            "snmp-server community mystring ro",
            "```",
            "```",
            "end",
            "```",
            "```",
            "```",
            "```",
            "Total number of passes: 1",
            "```",
            "```",
            "Rollback Done",
            "```",
            "Reverting to the Startup Configuration File",
            "The following example shows how to revert to the Cisco IOS startup configuration file. This example also shows the use of the optional force keyword to override the interactive user prompt.",
            "```",
            "Router# configure replace nvram:startup-config force",
            "```",
            "```",
            "```",
            "```",
            "Total number of passes: 1",
            "```",
            "```",
            "Rollback Done",
            "```",
            "Performing a Configuration Replace Operation with the configure confirm Command",
            "The following example shows the use of the configure replace command with the time <seconds> keyword and argument. You must enter the configure confirm command within the specified time limit to confirm replacement of the current running configuration file. If the configure confirm command is not entered within the specified time limit, the configuration replace operation is automatically reversed (in other words, the current running configuration file is restored to the configuration state that existed prior to entering the configure replace command).",
            "```",
            "Router# configure replace nvram:startup-config time 120",
            "```",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "```",
            "to replace the current running configuration with the",
            "```",
            "```",
            "contents of the specified configuration file, which is",
            "```",
            "```",
            "assumed to be a complete configuration, not a partial",
            "```",
            "```",
            "configuration. Enter Y if you are sure you want to proceed. ? [ no ] : Y",
            "```",
            "```",
            "```",
            "```",
            "Total number of passes: 1",
            "```",
            "```",
            "Rollback Done",
            "```",
            "```",
            "```",
            "```",
            "Router# configure confirm",
            "```",
            "Performing a Configuration Rollback Operation",
            "The following example shows how to make changes to the current running configuration and then roll back the changes. As part of the configuration rollback operation, you must save the current running configuration before making changes to the file. In this example, the archive config command is used to save the current running configuration. Note that the generated output of the configure replace command indicates that only one pass was performed to complete the rollback operation.",
            "! [ ] (/c/dam/en/us/td/i/templates/note.gif)",
            "---",
            "Note ! [ ] (/c/dam/en/us/td/i/templates/blank.gif)The path command must be configured before using the archive config command.",
            "---",
            "You first save the current running configuration in the configuration archive as follows:",
            "```",
            "Router# archive config",
            "```",
            "```",
            "```",
            "You then enter configuration changes as shown in the following example:",
            "```",
            "Router# configure terminal",
            "```",
            "```",
            "Router(config)# user netops2 password rain",
            "```",
            "```",
            "Router(config)# user netops3 password snow",
            "```",
            "```",
            "Router(config)# exit",
            "```",
            "```",
            "```",
            "After making changes to the running configuration file, you might want to roll back these changes and revert to the configuration that existed before the changes were made. The show archive command is used to verify the version of the configuration to be used as a target file. The configure replace command is then used to revert to the target configuration file as shown in the following example:",
            "```",
            "```",
            "```",
            "Router# show archive",
            "```",
            "```",
            "```",
            "```",
            "There are currently 1 archive configurations saved.",
            "```",
            "```",
            "The next archive file will be named disk0:myconfig-2",
            "```",
            "```",
            "Archive # Name",
            "```",
            "```",
            "0",
            "```",
            "```",
            "1 disk0:myconfig-1 <- Most Recent",
            "```",
            "```",
            "2",
            "```",
            "```",
            "3",
            "```",
            "```",
            "4",
            "```",
            "```",
            "5",
            "```",
            "```",
            "6",
            "```",
            "```",
            "7",
            "```",
            "```",
            "8",
            "```",
            "```",
            "9",
            "```",
            "```",
            "10",
            "```",
            "```",
            "```",
            "```",
            "Router# configure replace disk0:myconfig-1",
            "```",
            "```",
            "```",
            "```",
            "Total number of passes: 1",
            "```",
            "```",
            "Rollback Done",
            "```"
        ]
    ],
    "ExtraInfo": "When configuring more than one keyword option, the following rules apply:•![](/c/dam/en/us/td/i/templates/blank.gif)The **list** keyword must be entered before the **force** and **time** keywords.•![](/c/dam/en/us/td/i/templates/blank.gif)The **force** keyword must be entered before the **time** keyword.If the current running configuration is replaced with a saved Cisco IOS configuration file that contains commands unaccepted by the Cisco IOS software parser, an error message is displayed listing the commands that were unaccepted. The total number of passes performed in the configuration replace operation is also displayed.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)In Cisco IOS Release 12.2(25)S, a locking feature for the configuration replace operation was introduced. When the **configure replace** command is enabled, the Cisco IOS running configuration file is locked by default for the duration of the configuration replace operation. This locking mechanism prevents other users from changing the running configuration while the replace operation is taking place, which might otherwise cause the replace operation to terminate unsuccessfully. You can disable the locking of the running configuration using the **configure replace nolock** command.The running configuration lock is automatically cleared at the end of the configuration replace operation. It is not expected that you should need to clear the lock manually during the replace operation, but as a protection against any unforeseen circumstances, you can manually clear the lock using the **clear configuration lock** command. You can also display any locks that may be currently applied to the running configuration using the **show configuration lock** command.---",
    "RelatedCmds": [
        {
            "cmd": " **archive config** ",
            "description": " Saves a copy of the current running configuration to the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **configure confirm** ",
            "description": " Confirms replacement of the current running configuration with a saved Cisco IOS configuration file. "
        },
        {
            "cmd": " **maximum** ",
            "description": " Sets the maximum number of archive files of the running configuration to be saved in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **path** ",
            "description": " Specifies the location and filename prefix for the files in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **show archive** ",
            "description": " Displays information about the files saved in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **time-period** ",
            "description": " Sets the time increment for automatically saving an archive file of the current running configuration in the Cisco IOS configuration archive. "
        }
    ]
}