{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "config-register",
    "FuncDef": [
        "To change the configuration register settings, use the **config-register**command in global configuration mode. "
    ],
    "CLIs": [
        "config-register<value>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *value* ",
            "Info": " Hexadecimal or decimal value that represents the 16-bit configuration register value that you want to use the next time the router is restarted. The value range is from 0x0 to 0xFFFF (0 to 65535 in decimal). "
        }
    ],
    "Examples": [
        [
            "In the following example, the configuration register is set to boot the system image from Flash memory:",
            "```",
            "config-register 0x2102",
            "```"
        ]
    ],
    "ExtraInfo": "This command applies only to platforms that use a software configuration register.The lowest four bits of the configuration register (bits 3, 2, 1, and 0) form the boot field. The boot field determines if the router boots manually, from ROM, or from Flash or the network.To change the boot field value and leave all other bits set to their default values, follow these guidelines:•![](/c/dam/en/us/td/i/templates/blank.gif)If you set the configuration register boot field value to 0x0, you must boot the operating system manually with the **boot** command.•![](/c/dam/en/us/td/i/templates/blank.gif)If you set the configuration register boot field value to 0x1, the router boots using the default ROM software.•![](/c/dam/en/us/td/i/templates/blank.gif)If you set the configuration register boot field to any value from 0x2 to 0xF, the router uses the boot field value to form a default boot filename for booting from a network server.For more information about the configuration register bit settings and default filenames, refer to the appropriate router hardware installation guide.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)In a virtual switch application, If you have configured your config-register with a value that would skip file parsing during the bootup process, your change to either a standalone or virtual switch will not take place until you reconfigure your config-register. The config-register must be allowed to parse files in order to ensure the conversion from either a standalone or virtual switch.---",
    "RelatedCmds": [
        {
            "cmd": " **boot system** ",
            "description": " Specifies the system image that the router loads at startup. "
        },
        {
            "cmd": " **confreg** ",
            "description": " Changes the configuration register settings while in ROM monitor mode. "
        },
        {
            "cmd": " **o** ",
            "description": " Lists the value of the boot field (bits 0 to 3) in the configuration register. "
        },
        {
            "cmd": " **show version** ",
            "description": " Displays the configuration of the system hardware, the software version, the names and sources of configuration files, and the boot images. "
        }
    ]
}