{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "configure memory",
    "FuncDef": [
        "To configure the system from the system memory, use the **configure memory** command in privileged EXEC mode. "
    ],
    "CLIs": [
        "configure memory"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "In the following example, a router is configured from the configuration file in the memory location pointed to by the CONFIG_FILE environment variable:",
            "```",
            "Router# configure memory",
            "```"
        ]
    ],
    "ExtraInfo": "On all platforms except Class A Flash file system platforms, this command executes the commands located in the configuration file in NVRAM (the \"startup configuration file\").On Class A Flash file system platforms, if you specify the **configure memory** command, the router executes the commands pointed to by the CONFIG\\_FILE environment variable. The CONFIG\\_FILE environment variable specifies the location of the configuration file that the router uses to configure itself during initialization. The file can be located in NVRAM or any of the Flash file systems supported by the platform.When the CONFIG\\_FILE environment variable specifies NVRAM, the router executes the NVRAM configuration only if it is an entire configuration, not a distilled version. A distilled configuration is one that does not contain access lists.To view the contents of the CONFIG\\_FILE environment variable, use the **show bootvar** EXEC command. To modify the CONFIG\\_FILE environment variable, use the **boot config** command and then save your changes by issuing the **copy system:running-config nvram:startup-config** command.",
    "RelatedCmds": [
        {
            "cmd": " **boot config** ",
            "description": " Specifies the device and filename of the configuration file from which the router configures itself during initialization (startup). "
        },
        {
            "cmd": " **copy system:running-config nvram:startup-config** ",
            "description": " Saves the running configuration as the startup configuration file. "
        },
        {
            "cmd": " **show bootvar** ",
            "description": " Displays the contents of the BOOT environment variable, the name of the configuration file pointed to by the CONFIG_FILE environment variable, the contents of the BOOTLDR environment variable, and the configuration register setting. "
        }
    ]
}