{
    "PageTitle": "assign queue adjust",
    "FuncDef": "The assign queue adjust command specifies an elephant-flow queue for which differentiated flow scheduling is to be enabled and adjusts mice flows in the elephant-flow queue to the mice-flow queue.\nThe undo assign queue command disables the functions of specifying an elephant-flow queue for which differentiated flow scheduling is to be enabled and adjusting mice flows in the elephant-flow queue to the mice-flow queue. The assign queue adjust command specifies an elephant-flow queue for which differentiated flow scheduling is to be enabled and adjusts mice flows in the elephant-flow queue to the mice-flow queue. The undo assign queue command disables the functions of specifying an elephant-flow queue for which differentiated flow scheduling is to be enabled and adjusting mice flows in the elephant-flow queue to the mice-flow queue. By default, no queue is specified for which differentiated flow scheduling is to be enabled. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "assign queue { <start-queue-index> [ to <end-queue-index> ] } &<1-7> adjustmice-flowtoqueue <queue-id>",
        "undo assign queue { <start-queue-index> [ to <end-queue-index> ] } &<1-7>"
    ],
    "ParentView": [
        "mice-elephant-flow view"
    ],
    "ParaDef": [
        {
            "Parameters": "<start-queue-index>",
            "Info": "Specifies the start queue ID of elephant-flow queues.\nThe value is an integer that ranges from 0 to 6."
        },
        {
            "Parameters": "to <end-queue-index>",
            "Info": "Specifies the end queue ID of elephant-flow queues.\nThe value of end-queue-index must be greater than or equal to that of start-queue-index. start-queue-index and end-queue-index determine the range of elephant-flow queues. Elephant-flow queues include all queues from start-queue-index to end-queue-index.\nIf to end-queue-index is not specified, the elephant-flow queue is the one specified by start-queue-index.\nThe value is an integer that ranges from 0 to 6."
        },
        {
            "Parameters": "mice-flow",
            "Info": "Moves mice flows from the elephant-flow queue to the mice-flow queue.\n-"
        },
        {
            "Parameters": "queue",
            "Info": "Specifies a mice-flow queue.\n-"
        },
        {
            "Parameters": "<queue-id>",
            "Info": "Specifies a mice-flow queue.\nMice flows in an elephant-flow queue are moved to a mice-flow queue. queue-id must be greater than end-queue-index.\nThe value is an integer ranging from 1 to 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ai-service",
            "[~HUAWEI-ai-service] mice-elephant-flow",
            "[~HUAWEI-ai-service-mice-elephant-flow] assign queue 3 adjust mice-flow to queue 4"
        ]
    ],
    "ExtraInfo": "You can run this command to specify the queue for which differentiated flow scheduling is to be enabled on the device and adjust mice flows in the elephant-flow queue to the mice-flow queue."
}