{
    "PageTitle": "display multicast routing-table (All views)",
    "FuncDef": "The display multicast routing-table command displays information about multicast routing tables. The display multicast routing-table command displays information about multicast routing tables.",
    "CLIs": [
        "display multicast routing-table { <groupAddr> [ mask { <group-mask-length> | <group-mask-addr> } ] | <srcAddr> [ mask { <source-mask-length> | <source-mask-addr> } ] | incoming-interface { { <iif-port-type> <iif-port-num> | <iif-port-name> } | register } | backup-incoming-interface { <biif-port-type> <biif-port-num> | <biif-port-name> } | outgoing-interface { include | exclude | match } { { <oif-port-type> <oif-port-num> | <oif-port-name> } | register | none } } [ outgoing-interface-number [ <oif-number> ] ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<groupAddr>",
            "Info": "Displays information about a multicast routing table that contains a specified multicast group address.\nThe address is in dotted decimal notation. The value ranges from 224.0.1.0 to 239.255.255.255."
        },
        {
            "Parameters": "mask",
            "Info": "Displays information about a multicast routing table that contains a specified multicast group or source address mask.\n-"
        },
        {
            "Parameters": "<group-mask-length>",
            "Info": "Displays information about a multicast routing table in which the multicast group address mask has the specified length.\nThe value is a decimal integer ranging from 4 to 32."
        },
        {
            "Parameters": "<group-mask-addr>",
            "Info": "Displays information about a multicast routing table that contains a specified multicast group address mask.\nThe address mask is in dotted decimal notation."
        },
        {
            "Parameters": "<srcAddr>",
            "Info": "Displays information about a multicast routing table that contains a specified multicast source address.\nThe address is in dotted decimal notation."
        },
        {
            "Parameters": "<source-mask-length>",
            "Info": "Displays information about a multicast routing table that contains the mask length of a specified source address.\nThe value is a decimal integer that ranges from 0 to 32."
        },
        {
            "Parameters": "<source-mask-addr>",
            "Info": "Displays information about a multicast routing table that contains a specified source mask.\nThe address mask is in dotted decimal notation."
        },
        {
            "Parameters": "incoming-interface",
            "Info": "Displays information about a multicast routing table that contains a specified inbound interface.\n-"
        },
        {
            "Parameters": "<iif-port-type>",
            "Info": "Specifies the type of an inbound interface.\n-"
        },
        {
            "Parameters": "<iif-port-num>",
            "Info": "Specifies the number of an inbound interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "<iif-port-name>",
            "Info": "Specifies the name of an inbound interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "register",
            "Info": "Displays information about a multicast routing table that contains a specified PIM-SM register interface.\n-"
        },
        {
            "Parameters": "backup-incoming-interface",
            "Info": "Specifies a backup inbound interface.\n-"
        },
        {
            "Parameters": "<biif-port-type>",
            "Info": "Indicates the type of the backup inbound interface.\n-"
        },
        {
            "Parameters": "<biif-port-num>",
            "Info": "Specifies the number of the backup inbound interface.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "<biif-port-name>",
            "Info": "Specifies the name of the backup inbound interface.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "outgoing-interface",
            "Info": "Displays information about a multicast routing table that contains a specified outbound interface.\n-"
        },
        {
            "Parameters": "include",
            "Info": "Displays the (S, G) entries whose downstream interface list contains specified downstream interfaces.\n-"
        },
        {
            "Parameters": "exclude",
            "Info": "Displays the (S, G) entries whose downstream interface list does not contain specified downstream interfaces.\n-"
        },
        {
            "Parameters": "match",
            "Info": "Displays (S, G) entries whose the downstream interface list contains only one interface that is the same as a specified downstream interface.\n-"
        },
        {
            "Parameters": "<oif-port-type>",
            "Info": "Specifies the type of an outbound interface.\n-"
        },
        {
            "Parameters": "<oif-port-num>",
            "Info": "Specifies the number of an outbound interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "<oif-port-name>",
            "Info": "Specifies the name of an outbound interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "none",
            "Info": "Displays information about a multicast routing table that contains a null outbound interface list.\n-"
        },
        {
            "Parameters": "outgoing-interface-number",
            "Info": "Displays information about a multicast routing table that contains a specified number of outbound interfaces.\n-"
        },
        {
            "Parameters": "<oif-number>",
            "Info": "Specifies the number of outbound interfaces.\nThe value is an integer that ranges from 0 to 2048."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display multicast routing-table"
        ]
    ],
    "ExtraInfo": ""
}