{
    "PageTitle": "display multicast rpf-info",
    "FuncDef": "The display multicast rpf-info command displays the Reverse Path Forwarding (RPF) routes of a specified multicast source or source/group, including currently used topology name and information about all routes. The display multicast rpf-info command displays the Reverse Path Forwarding (RPF) routes of a specified multicast source or source/group, including currently used topology name and information about all routes.",
    "CLIs": [
        "display multicast { vpn-instance <vpn-instance-name> | all-instance } rpf-info <source-address> [ <group-address> ] [ rpt | spt ] [ verbose ]",
        "display multicast rpf-info <source-address> [ <group-address> ] [ rpt | spt ] [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "all-instance",
            "Info": "Specifies all instances.\n-"
        },
        {
            "Parameters": "<source-address>",
            "Info": "Specifies the address of a multicast source, used to display the information of RPF routing corresponding to the source.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<group-address>",
            "Info": "Specifies the multicast group address, used to display the information of RPF routing corresponding to the source/group.\nThe address is in dotted decimal notation. The value ranges from 224.0.0.0 to 239.255.255.255."
        },
        {
            "Parameters": "rpt",
            "Info": "Display the information of rendezvous point tree (RPT).\n-"
        },
        {
            "Parameters": "spt",
            "Info": "Display the information of shortest path tree (SPT).\n-"
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed RPF information.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display multicast vpn-instance RED rpf-info 10.1.1.2 228.0.0.1"
        ],
        [
            "<HUAWEI> display multicast rpf-info 172.16.0.1"
        ]
    ],
    "ExtraInfo": "The RPF route with the source-address as the destination address is an optimal route selected from unicast routes and multicast static routes.\nThe display multicast rpf-info command can be used to display the information about the RPF route to a specified multicast source, such as the information about the multicast source, status of the RPF interface, RPF neighbor, and route."
}