{
    "PageTitle": "ip rpf-route-static",
    "FuncDef": "The ip rpf-route-static command configures a multicast static route.\nThe undo ip rpf-route-static command deletes a multicast static route. The ip rpf-route-static command configures a multicast static route. The undo ip rpf-route-static command deletes a multicast static route. By default, no multicast static route is configured.",
    "CLIs": [
        "ip rpf-route-static [ vpn-instance <vpn-instance-name> ] <source-address> { <mask> | <mask-length> } { <rpf-nbr> | { <interface-name> | <interface-type> <interface-number> } } [ preference <preValue> ]",
        "undo ip rpf-route-static [ vpn-instance <vpn-instance-name> ] <source-address> { <mask> | <mask-length> } [ <rpf-nbr> | { <interface-name> | <interface-type> <interface-number> } ]",
        "undo ip rpf-route-static all",
        "undo ip rpf-route-static vpn-instance <vpn-instance-name> all"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of case-sensitive characters. By default, the instance is a public network instance."
        },
        {
            "Parameters": "<source-address>",
            "Info": "Specifies the address of the multicast source.\nThe address is in dotted decimal notation."
        },
        {
            "Parameters": "<mask>",
            "Info": "Specifies the address mask of the multicast source.\nThe address is in dotted decimal notation."
        },
        {
            "Parameters": "<mask-length>",
            "Info": "Specifies the mask length of the multicast source address.\nThe value is an integer ranging from 0 to 32."
        },
        {
            "Parameters": "<rpf-nbr>",
            "Info": "Specifies the IP address of the Reverse Path Forwarding (RPF) neighbor.\nThe address is in dotted decimal notation."
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of the outbound interface of a static route.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of an interface.\n-"
        },
        {
            "Parameters": "preference <preValue>",
            "Info": "Specifies the preference of routes. The greater the value is, the lower the preference is.\nThe value is an integer that ranges from 1 to 255. The default value is 1."
        },
        {
            "Parameters": "all",
            "Info": "Indicates all multicast static routes in the multicast static routing table.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip rpf-route-static 10.0.0.0 255.0.0.0 10.0.0.10"
        ]
    ],
    "ExtraInfo": "Multicast static routes are an important basis of the RPF check. By configuring multicast static routes, you can specify an RPF interface and an RPF neighbor for the specific source of packets on the current Device.\nMulticast static routes provide the following functions, depending on specific applicable environments:"
}