{
    "PageTitle": "flush send",
    "FuncDef": "The flush send command enables a Smart Link group to send Flush packets and specifies the control VLAN ID and password to be carried in the Flush packets.\nThe undo flush send command disables the function. The flush send command enables a Smart Link group to send Flush packets and specifies the control VLAN ID and password to be carried in the Flush packets. The undo flush send command disables the function. By default, a Smart Link group does not send Flush packets. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "flush send control-vlan <vlan-id> [ password { sha | simple | hmac-sha256 } <password> ]",
        "undo flush send"
    ],
    "ParentView": [
        "Smart Link group view"
    ],
    "ParaDef": [
        {
            "Parameters": "password",
            "Info": "Specifies the encryption mode of the password in Flush packets.\n-"
        },
        {
            "Parameters": "<password>",
            "Info": "Specifies a password carried in Flush packets.\nA simple password is a string of 1 to 16 characters.When the password is encrypted in SHA256 or HMAC SHA256 mode, the value is a string of 48 characters.If the source version supports a ciphertext password of 24 or 32 characters, the target version also supports a ciphertext password of 24 or 32 characters.\nThe value is a string of 1 to 16 case-sensitive characters or 24/32/48/108/128 case-sensitive characters."
        },
        {
            "Parameters": "sha",
            "Info": "Indicates that the password for sending Flush packets uses the SHA256 encryption mode.\n-"
        },
        {
            "Parameters": "simple",
            "Info": "Specifies the password of Flush packets is in simple text.\n-"
        },
        {
            "Parameters": "hmac-sha256",
            "Info": "Specifies the password of Flush packets is in HMAC-SHA256 encryption mode.\n-"
        },
        {
            "Parameters": "control-vlan <vlan-id>",
            "Info": "Specifies the control VLAN ID of Smart Link Flush packets.\nThe value is an integer that ranges from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] smart-link group 1",
            "[*HUAWEI-smlk-group1] flush send control-vlan 100 password sha YsHsjx_202206"
        ]
    ],
    "ExtraInfo": "After a link switchover is performed in a Smart Link group, the existing forwarding entries no longer apply to the new topology. All MAC address entries and Address Resolution Protocol (ARP) entries on the network must be updated. In this situation, you can configure the Smart Link group on a downstream device to send Flush packets to instruct upstream devices to update their MAC address entries and ARP entries.\nTo enable a Smart Link group to send Flush packets and specify the control VLAN ID and password carried in the packets, run the flush send command in the Smart Link group view."
}