{
    "PageTitle": "port (Smart Link group view)",
    "FuncDef": "The port command adds an interface to a Smart Link group and specifies the interface as a master or slave interface.\nThe undo port command deletes a master or slave interface from a Smart Link group. The port command adds an interface to a Smart Link group and specifies the interface as a master or slave interface. The undo port command deletes a master or slave interface from a Smart Link group. By default, no interface is added to a Smart Link group. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "port { <interface-name> | <interface-type> <interface-number> } { master | slave }",
        "undo port [ all | [ <interface-name> | <interface-type> <interface-number> ] { master | slave } ]"
    ],
    "ParentView": [
        "Smart Link group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-type> <interface-number>",
            "Info": "Specifies an interface to be added to a Smart Link group.\ninterface-type specifies the type of the interface.interface-number specifies the number of the interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "master",
            "Info": "Specifies the interface as a master interface.\n-"
        },
        {
            "Parameters": "slave",
            "Info": "Specifies the interface as a slave interface.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Deletes all interfaces in a Smart Link group.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] smart-link group 1",
            "[*HUAWEI-smlk-group1] port 100GE 1/0/1 master"
        ]
    ],
    "ExtraInfo": "Smart Link is a reliability mechanism that provides reliable and efficient link backup and a fast traffic switchover. Smart Link is used on dual-homing networks. If the primary and secondary links in a Smart Link group are normal, the secondary link is blocked to provide backup. If the primary link fails, traffic is switched to the secondary link. To implement the preceding functions, run the port command to configure a master interface and a slave interface in the Smart Link group. In most cases, only one interface is Active, and the other interface is blocked and Inactive."
}