{
    "PageTitle": "protected-vlan reference-instance",
    "FuncDef": "The protected-vlan reference-instance command configures a Smart Link protection instance.\nThe undo protected-vlan reference-instance command deletes a Smart Link protection instance. The protected-vlan reference-instance command configures a Smart Link protection instance. The undo protected-vlan reference-instance command deletes a Smart Link protection instance. By default, all instances are Smart Link protection instances. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "protected-vlan reference-instance { <instance-id1> [ to <instance-id2> ] } &<1-10>",
        "undo protected-vlan reference-instance { all | { <instance-id1> [ to <instance-id2> ] } &<1-10> }"
    ],
    "ParentView": [
        "Smart Link group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<instance-id1>",
            "Info": "Specifies the first ID of a Smart Link load-balancing instance.\nThe value is an integer ranging from 0 to 48."
        },
        {
            "Parameters": "to",
            "Info": "Specifies the range.\n-"
        },
        {
            "Parameters": "<instance-id2>",
            "Info": "Specifies the last ID of a Smart Link load-balancing instance.\nThe value is an integer ranging from 0 to 48.\n<endInst> must be greater than <beginInst>. <beginInst> and instance-id1 specify an instance ID range. If you do not specify to <endInst>, only one load-balancing instance with the ID <beginInst> is specified.\nIn one load-balance instance command, a maximum of 10 instance ID ranges can be specified using to."
        },
        {
            "Parameters": "all",
            "Info": "Deletes all Smart Link load-balancing instance IDs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp region-configuration",
            "[*HUAWEI-mst-region] instance 10 vlan 100",
            "[*HUAWEI-mst-region] quit",
            "[*HUAWEI] smart-link group 1",
            "[*HUAWEI-smlk-group1] protected-vlan reference-instance 10"
        ]
    ],
    "ExtraInfo": "After a protection instance is bound to a Smart Link group, Smart Link takes effect only on packets from VLANs mapped to the protection instance. If you want packets from some VLANs to be forwarded without being influenced by Smart Link, run the protected-vlan reference-instance command to configure protection instances to which only the other VLANs are mapped."
}