{
    "PageTitle": "smart-link flush receive control-vlan",
    "FuncDef": "The smart-link flush receive control-vlan command enables a device to receive Flush packets and specifies the control VLAN ID and password for receiving Flush packets.\nThe undo smart-link flush receive command disables a device from receiving Flush packets. The smart-link flush receive control-vlan command enables a device to receive Flush packets and specifies the control VLAN ID and password for receiving Flush packets. The undo smart-link flush receive command disables a device from receiving Flush packets. By default, an interface is disabled from receiving Flush packets. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "smart-link flush receive control-vlan <vlan-id> [ password { sha | simple | hmac-sha256 } <password> ]",
        "undo smart-link flush receive"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,Layer 2 10GE interface view,Layer 2 200GE interface view,25GE-L2 view,400GE-L2 view,Layer 2 50GE interface view,Layer 2 Eth-Trunk interface view,Layer 2 GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<vlan-id>",
            "Info": "Specifies the control VLAN ID of Smart Link Flush packets.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "password",
            "Info": "Specifies the encryption mode of the password in Flush packets.\n-"
        },
        {
            "Parameters": "<password>",
            "Info": "Specifies a password carried in Flush packets.\nThe value is a string of 1 to 16 case-sensitive characters or a string of 24, 32, or 48 case-sensitive characters.\nIf the password is a simple password, the value is a string of 1 to 16 characters.If the password is encrypted using SHA or HMAC SHA256, the value is a string of 48 characters.If the source version supports a ciphertext password of 24 or 32 characters, the target version is automatically compatible with the ciphertext password."
        },
        {
            "Parameters": "sha",
            "Info": "Specifies the password of Flush packets is in SHA encryption mode.\n-"
        },
        {
            "Parameters": "simple",
            "Info": "Specifies the password of Flush packets is in simple text.\n-"
        },
        {
            "Parameters": "hmac-sha256",
            "Info": "Specifies the password of Flush packets is in HMAC-SHA256 encryption mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] smart-link flush receive control-vlan 100 password sha YsHsjx_202206"
        ]
    ],
    "ExtraInfo": "When a link switchover occurs in a Smart Link group, the existing forwarding entries no longer apply to the new topology. Therefore, the MAC address entries and ARP entries on the entire network need to be updated. The Smart Link group sends Flush packets to notify upstream devices of the topology change. Upstream devices can update their MAC address entries and ARP entries only if they are enabled to receive Flush packets. If a device rejects Flush packets, it cannot forward packets correctly after a link failover occurs in the Smart Link group."
}