{
    "PageTitle": "smart-link hold-time",
    "FuncDef": "The smart-link hold-time command sets the delay in reporting the Up/Down event of an interface in a Smart Link group.\nThe undo smart-link hold-time command deletes the delay in reporting the Up/Down event of an interface in a Smart Link group. The smart-link hold-time command sets the delay in reporting the Up/Down event of an interface in a Smart Link group. The undo smart-link hold-time command deletes the delay in reporting the Up/Down event of an interface in a Smart Link group. By default, the delay for link switchovers in a Smart Link group is 0. That is, when an interface goes Up or Down, a Smart Link group performs a link switchover immediately. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "smart-link hold-time <hold-time>",
        "undo smart-link hold-time"
    ],
    "ParentView": [
        "Smart Link group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<hold-time>",
            "Info": "Specifies a delay for link switchovers in a Smart Link group.\nThe value is an integer ranging from 1 to 60, in 100 ms."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] smart-link group 1",
            "[*HUAWEI-smlk-group1] smart-link hold-time 3"
        ]
    ],
    "ExtraInfo": "If a Smart Link group performs link switchovers due to intermittent link disconnections, packet forwarding and system performance will be affected. To address this problem, run the smart-link hold-time command to configure a delay for link switchovers in the Smart Link group. If you configure a delay for link switchovers in a Smart Link group, the Smart Link group will not perform link switchovers whenever the interface status changes in the Smart Link group until the delay expires. This configuration suppresses link switchovers due to intermittent link disconnections."
}