{
    "PageTitle": "traffic-analysis udp export source",
    "FuncDef": "The traffic-analysis udp export source command configures the source IP address for the exported packets that carry intelligent traffic analysis results of UDP flows.\nThe undo traffic-analysis udp export source command restores the default configuration. The traffic-analysis udp export source command configures the source IP address for the exported packets that carry intelligent traffic analysis results of UDP flows. The undo traffic-analysis udp export source command restores the default configuration. By default, no source IP address is configured for the exported packets that carry intelligent traffic analysis results of UDP flows. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "traffic-analysis udp export source { ip <ip-address> | ipv6 <ipv6-address> }",
        "undo traffic-analysis udp export source { ip [ <ip-address> ] | ipv6 [ <ipv6-address> ] }",
        "traffic-analysis udp export source ip <ip-address>",
        "undo traffic-analysis udp export source ip [ <ip-address> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip <ip-address>",
            "Info": "Specifies the source IPv4 address for the exported packets that carry intelligent traffic analysis results of UDP flows.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6 <ipv6-address>",
            "Info": "Specifies the source IPv6 address for the exported packets that carry intelligent traffic analysis results of UDP flows.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic-analysis udp export source ip 10.1.1.1"
        ]
    ],
    "ExtraInfo": "After intelligent traffic analysis for UDP flows is enabled on a switch, the flow tables that contain UDP flow analysis results are first stored on the switch. When a flow table meets the aging conditions, the switch sends the flow table to the specified TDA for further processing and graphical display of flow information. The TDA may need to identify the data source based on the source IP address in exported packets that carry intelligent traffic analysis results of UDP flows. Therefore, you can run this command to set the source IP address of these exported packets."
}