{
    "PageTitle": "traffic-analysis tcp one-way",
    "FuncDef": "The traffic-analysis tcp one-way command enables intelligent traffic analysis for unidirectional TCP flows.\nThe undo traffic-analysis tcp one-way command restores the default configuration. The traffic-analysis tcp one-way command enables intelligent traffic analysis for unidirectional TCP flows. The undo traffic-analysis tcp one-way command restores the default configuration. By default, intelligent traffic analysis for unidirectional TCP flows is disabled. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "traffic-analysis tcp one-way sequence <sequence-value> <sequence-mask>",
        "undo traffic-analysis tcp one-way [ sequence <sequence-value> <sequence-mask> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<sequence-value>",
            "Info": "Specifies a sequence number or acknowledgment number.\nThe value must be a hexadecimal number and start with 0x. The length ranges from 3 to 10 digits."
        },
        {
            "Parameters": "<sequence-mask>",
            "Info": "Specifies the mask of the sequence number or acknowledgment number. This mask is similar to the subnet mask of IP addresses. F indicates that the bit is matched, and 0 indicates that the bit is not matched. This helps determine the range of sequence numbers or acknowledgment numbers of TCP packets.\nThe value must be a hexadecimal number and start with 0x. The length ranges from 3 to 10 digits."
        },
        {
            "Parameters": "sequence",
            "Info": "Matches TCP packets with a specified sequence number range or acknowledgment number range.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic-analysis tcp one-way sequence 0x0000000A 0x000000FF"
        ]
    ],
    "ExtraInfo": ""
}