{
    "PageTitle": "traffic-analysis tcp export host",
    "FuncDef": "The traffic-analysis tcp export host command configures the destination IP address and destination UDP port number for the exported packets that carry intelligent traffic analysis results of TCP flows.\nThe undo traffic-analysis tcp export host command restores the default configuration. The traffic-analysis tcp export host command configures the destination IP address and destination UDP port number for the exported packets that carry intelligent traffic analysis results of TCP flows. The undo traffic-analysis tcp export host command restores the default configuration. By default, no destination IP address or destination UDP port number is configured for the exported packets that carry intelligent traffic analysis results of TCP flows. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "traffic-analysis tcp export host { ip <ip-address> | ipv6 <ipv6-address> } <port-number> [ vpn-instance <vpn-instance-name> ]",
        "undo traffic-analysis tcp export host { ip <ip-address> | ipv6 <ipv6-address> } <port-number> [ vpn-instance <vpn-instance-name> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip <ip-address>",
            "Info": "Specifies the destination IPv4 address for the exported packets that carry intelligent traffic analysis results of TCP flows.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6 <ipv6-address>",
            "Info": "Specifies the destination IPv6 address for the exported packets that carry intelligent traffic analysis results of TCP flows.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<port-number>",
            "Info": "Specifies the destination UDP port number for the exported packets that carry intelligent traffic analysis results of TCP flows.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the VPN instance name for the exported packets that carry intelligent traffic analysis results of TCP flows.\nThe value must be the name of an existing VPN instance on the switch."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic-analysis tcp export host ip 10.1.1.1 222"
        ]
    ],
    "ExtraInfo": "After intelligent traffic analysis for TCP flows is enabled on a switch, the flow tables that contain TCP flow analysis results are first stored on the switch. When a flow table meets the aging conditions, the switch sends the flow table to the specified TDA for further processing and display of flow information. You can run this command to configure the destination IP address, that is, the TDA IP address, to which the exported packets carrying TCP flow analysis results are sent."
}