{
    "PageTitle": "traffic-analysis tcp timeout inactive",
    "FuncDef": "The traffic-analysis tcp timeout inactive command configures the inactive aging period of a TCP flow in intelligent traffic analysis.\nThe undo traffic-analysis tcp timeout inactive command restores the default configuration. The traffic-analysis tcp timeout inactive command configures the inactive aging period of a TCP flow in intelligent traffic analysis. The undo traffic-analysis tcp timeout inactive command restores the default configuration. By default, the inactive aging period of a TCP flow in intelligent traffic analysis is 30 seconds. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "traffic-analysis tcp timeout inactive <inactive-interval>",
        "undo traffic-analysis tcp timeout inactive [ <inactive-interval> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<inactive-interval>",
            "Info": "Specifies the inactive aging period of a TCP flow in intelligent traffic analysis.\nThe value is an integer that ranges from 5 to 500. in second. The default value is 30."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic-analysis tcp timeout inactive 120"
        ]
    ],
    "ExtraInfo": "Network traffic may burst intermittently and a large number of flows are generated in a short period of time. However, the memory capacity of the TAP is limited. Earlier flows in the memory need to be exported to release memory space for new flows. The process of exporting old flows is called aging. Because the storage space of the TAP is also limited, all analyzed flows must be aged out and exported to the TDA for further processing.\nWhen the inactive time (from the last packet receiving time to the current time) of a TCP flow in intelligent traffic analysis exceeds the configured inactive aging period, the flow is exported to the specified destination."
}