{
    "PageTitle": "ptp virtual-clock-id",
    "FuncDef": "The ptp virtual-clock-id command configures a virtual clock ID on a 1588v2 device.\nThe undo ptp virtual-clock-id command restores the default clock ID. The ptp virtual-clock-id command configures a virtual clock ID on a 1588v2 device. The undo ptp virtual-clock-id command restores the default clock ID. By default, a 1588v2 device has only a default clock ID and does not have a virtual clock ID.\n\n\nA clock ID is 8 bytes long. The default clock ID is generated by padding fffe in the middle of the system MAC address. For example, if the system MAC address is 00e0fc123456, the default clock ID is 00e0fcfffe123456. By default, a 1588v2 device has only a default clock ID and does not have a virtual clock ID. A clock ID is 8 bytes long. The default clock ID is generated by padding fffe in the middle of the system MAC address. For example, if the system MAC address is 00e0fc123456, the default clock ID is 00e0fcfffe123456. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H-48S6CQ, CE6881H-48S6CQ-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ptp virtual-clock-id <clock-id-value>",
        "undo ptp virtual-clock-id"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "virtual-clock-id <clock-id-value>",
            "Info": "Specifies the four least significant bytes of a virtual clock ID.\nThe value ranges from 1 to ffffffff, in hexadecimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp virtual-clock-id 00000123"
        ]
    ],
    "ExtraInfo": "A clock ID uniquely identifies a 1588v2 device in a single clock domain. The default clock ID depends on the system MAC address and does not need to be changed in most situations.\nWhen the default clock IDs of the two devices are the same, run the ptp virtual-clock-id command to set a virtual clock ID for either of the two devices. The configured virtual clock ID uniquely identifies a 1588v2 device and does not change even if hardware is replaced."
}