{
    "PageTitle": "ptp utc-offset",
    "FuncDef": "The ptp utc-offset command sets the accumulative offset between the Universal Coordinated Time (UTC) and International Atomic Time (TAI) on the grandmaster clock.\nThe undo ptp utc-offset command restores the default setting. The ptp utc-offset command sets the accumulative offset between the Universal Coordinated Time (UTC) and International Atomic Time (TAI) on the grandmaster clock. The undo ptp utc-offset command restores the default setting. The default accumulative offset is 35s. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H-48S6CQ, CE6881H-48S6CQ-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ptp utc-offset <utc-offset>",
        "undo ptp utc-offset"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "utc-offset <utc-offset>",
            "Info": "Specifies the accumulative offset between the UTC time and TAI time.\nThe value is an integer ranging from 0 to 255, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp enable",
            "[*HUAWEI] ptp utc-offset 33"
        ]
    ],
    "ExtraInfo": "The UTC is Greenwich Mean Time (GMT) that is displayed on a 1588v2 device. There is a fixed offset between the UTC and TAI. The International Earth Rotation Service (IERS) periodically advertises the offset.\nWhen 1588v2 devices trace an external clock source, they use the offset provided by the external clock source by default. After signals of the external clock source are lost, they continue to use this offset. If the offset changes, time signals of the entire 1588v2 network may be inaccurate.\nTo manually set the offset between the UTC time and TAI time, you only need to run the ptp utc-offset command on the grandmaster clock. Other 1588v2 devices only need to synchronize the time with the grandmaster clock."
}