{
    "PageTitle": "ptp announce-drop enable",
    "FuncDef": "The ptp announce-drop enable command enables an interface to discard Announce packets.\nThe undo ptp announce-drop enable command disables an interface from discarding Announce packets. The ptp announce-drop enable command enables an interface to discard Announce packets. The undo ptp announce-drop enable command disables an interface from discarding Announce packets. By default, an interface does not discard Announce messages. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H-48S6CQ, CE6881H-48S6CQ-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ptp announce-drop enable",
        "undo ptp announce-drop enable"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE1/0/1",
            "[~HUAWEI-100GE1/0/1] ptp announce-drop enable"
        ]
    ],
    "ExtraInfo": "In a PTP clock synchronization process, Announce packets are used to determine the master/slave relationship. For a pair of nodes that perform time synchronization, the upstream node that advertises the synchronization time is called the master node, and the downstream node that receives the synchronization time is called the slave node. The master device sends Sync packets to the slave device to transmit the performance parameters of time signals. In addition, the master device performs mechanisms such as delay measurement to ensure the accuracy of time signals.\nAfter PTP is enabled globally on a device, each interface on the device starts to send and receive Announce packets. Not all interfaces on a PTP device participate in PTP time synchronization. If an interface receives a large number of Announce packets, other services may be affected. If an interface does not need to receive clock synchronization information from other devices, you can configure the interface to discard Announce packets."
}