{
    "PageTitle": "install eva script",
    "FuncDef": "The install eva script command installs an EVA script.\nThe uninstall eva script command uninstalls an EVA script. The install eva script command installs an EVA script. The uninstall eva script command uninstalls an EVA script.",
    "CLIs": [
        "install eva script <fileName> [ inspection ]",
        "uninstall eva script <fileName>",
        "uninstall eva script inspection",
        "install eva script <fileName> inspection { ftp | sftp } { ipv4 <ipv4Address> | ipv6 <ipv6Address> } port <portNum> username <userName> password <pwd> [ vpn-instance <vpnInstance> ] [ server-path <serverPath> ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "<fileName>",
            "Info": "Indicates the name of the EVA script file, which is in JSON format.\nThe value is a string of 1 to 63 characters. It contains the script path. The specified script name must exist on the device. If the script is in the root directory of the flash memory, you do not need to specify the path."
        },
        {
            "Parameters": "inspection",
            "Info": "Indicates that a PMI script is to be installed.\n-"
        },
        {
            "Parameters": "ftp",
            "Info": "Indicates the FTP server.\n-"
        },
        {
            "Parameters": "sftp",
            "Info": "Indicates the SFTP server.\n-"
        },
        {
            "Parameters": "ipv4 <ipv4Address>",
            "Info": "Indicates the IPv4 address of the server.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6 <ipv6Address>",
            "Info": "Indicates the IPv6 address of the server.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "port <portNum>",
            "Info": "Indicates the port number of the server.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "username <userName>",
            "Info": "Indicates the user name of the server.\nThe value is a string of 1 to 255 characters."
        },
        {
            "Parameters": "password <pwd>",
            "Info": "Indicates the password of the server.\nThe value is a string of 1 to 255 characters."
        },
        {
            "Parameters": "vpn-instance <vpnInstance>",
            "Info": "Indicates the name of the VPN instance used for logging in to the server.\nThe value is a string of 1 to 31 characters."
        },
        {
            "Parameters": "server-path <serverPath>",
            "Info": "Indicates directory for storing files on the server.\nThe value is a string of 1 to 63 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> install eva script test.json"
        ]
    ],
    "ExtraInfo": "EVA allows you to install user-defined scripts on devices for fault analysis and device health check. If you do not need to continue running a script, EVA allows you to uninstall the script file.\nWhen the FTP or SFTP server parameters related to PMI are specified, EVA can automatically download scripts from the specified server, install scripts, and upload script execution results.\nSFTP is recommended because it is more secure than FTP."
}