{
    "PageTitle": "binding",
    "FuncDef": "The binding command binds an instance to a performance statistics task.\nThe undo binding command unbinds an instance from a performance statistics task. The binding command binds an instance to a performance statistics task. The undo binding command unbinds an instance from a performance statistics task. By default, no instance is bound to a performance statistics task.",
    "CLIs": [
        "binding instance-type <instance-type> { <all> | <instance> { <vpn-instance-name> } &<1-8> }",
        "undo binding instance-type <instance-type> { <all> | <instance> { <vpn-instance-name> } &<1-8> }"
    ],
    "ParentView": [
        "Statistics task view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance-type <instance-type>",
            "Info": "Specifies the type of an instance bound to a performance statistics task. The instance type is predefined in each feature. Each instance type is defined in a feature.\nYou can use the instance-type parameter to view the instance types supported by the device."
        },
        {
            "Parameters": "<all>",
            "Info": "Specifies all instances of a specific type.\nThis parameter is not supported by all instance types. For details, see the help information of the instance type."
        },
        {
            "Parameters": "<instance>",
            "Info": "Specifies single instances of a specific type.\nThis parameter is not supported by all instance types. For details, see the help information of the instance type."
        },
        {
            "Parameters": "<vpn-instance-name>",
            "Info": "Specifies the name of an instance bound to a performance statistics task.\nThe value is a string of 1 to 255 case-insensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pm",
            "[~HUAWEI-pm] statistics-task huawei",
            "[*HUAWEI-pm-statistics-huawei] binding instance-type interface instance 100GE1/0/1"
        ]
    ],
    "ExtraInfo": "To bind an instance to a performance statistics task, run the binding command to allow the system to collect performance statistics about the instance."
}