{
    "PageTitle": "measure enable",
    "FuncDef": "The measure enable command enables the statistics counters of an instance bound to a performance statistics task.\nThe undo measure enable command disables the statistics counters of an instance bound to a performance statistics task. The measure enable command enables the statistics counters of an instance bound to a performance statistics task. The undo measure enable command disables the statistics counters of an instance bound to a performance statistics task. By default, all statistics counters of the instance bound to a performance statistics task are enabled.",
    "CLIs": [
        "measure enable instance-type <instance-type> measure <measure-name>",
        "undo measure enable instance-type <instance-type> measure <measure-name>"
    ],
    "ParentView": [
        "Statistics task view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance-type <instance-type>",
            "Info": "Specifies the type of an instance bound to a performance statistics task. The instance type is predefined in a specific feature. Each instance type maps a feature.\nThe value is a string of 1 to 63 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "<measure-name>",
            "Info": "Specifies the name of a statistics counter in a performance statistics task. Each statistics counter is predefined in a specific feature.\nThe value is a string of 1 to 63 case-insensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pm",
            "[~HUAWEI-pm] statistics enable",
            "[*HUAWEI-pm] statistics-task huawei",
            "[*HUAWEI-pm-statistics-huawei] binding instance-type card instance master",
            "[*HUAWEI-pm-statistics-huawei] measure enable instance-type card measure memory-usage"
        ]
    ],
    "ExtraInfo": "After you run the binding instance-type instance command to bind a statistics instance to a performance statistics task, run the measure disable instance-type command to disable all the statistics counters of this instance if the performance statistics task is no longer required. To enable one or more statistics counters of an instance bound to the performance statistics task, run the measure enable command."
}