{
    "PageTitle": "protocol",
    "FuncDef": "The protocol command configures local information (transmission mode + destination address + port + VPN + source address/source interface) about the PM server to which performance statistics files are uploaded.\nThe undo protocol command deletes local information about the PM server to which performance statistics files are uploaded. The protocol command configures local information (transmission mode + destination address + port + VPN + source address/source interface) about the PM server to which performance statistics files are uploaded. The undo protocol command deletes local information about the PM server to which performance statistics files are uploaded. By default, no server information is configured for uploading performance statistics files to a specified PM server.",
    "CLIs": [
        "protocol { ftp | sftp } ip-address <ip-address> [ port <port-number> | { net-manager-vpn | vpn-instance <vpn-instance-name> } | { client-sourceinterface { <interface-name> | <interface-type> <interface-number> } | client-sourceipv6 <IPV6ADDR> } ]",
        "undo protocol"
    ],
    "ParentView": [
        "PM server view"
    ],
    "ParaDef": [
        {
            "Parameters": "ftp",
            "Info": "Specifies the FTP protocol for uploading performance statistics files.\n-"
        },
        {
            "Parameters": "sftp",
            "Info": "Specifies the SFTP protocol for uploading performance statistics files.\n-"
        },
        {
            "Parameters": "ip-address <ip-address>",
            "Info": "Specifies the IP address of the PM server.\nAn IPv4 address is in dotted decimal notation. An IPv6 address is a 32-digit hexadecimal number in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "port <port-number>",
            "Info": "Specifies the listening port number of the PM server.\nIf the port number is not specified, the default port number is used.\nThe value is an integer ranging from 1 to 65535. The default standard port number is 21 (using FTP) or 22 (using SFTP)."
        },
        {
            "Parameters": "net-manager-vpn",
            "Info": "Indicates the network management VPN.\n-"
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies a VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "client-source",
            "Info": "Specifies the source of a performance statistics file to be uploaded.\n-"
        },
        {
            "Parameters": "interface <interface-name>",
            "Info": "Specifies the name of the source interface to which a performance statistics file is uploaded.\nThe value is a string of 1 to 63 case-sensitive characters. The interface name must exist and an IPv4 address must have been configured for the interface."
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Specifies the type and number of the source interface for uploading performance statistics files.\n-"
        },
        {
            "Parameters": "ipv6 <IPV6ADDR>",
            "Info": "Specifies the source IP address for uploading performance statistics files.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pm",
            "[~HUAWEI-pm] pm-server a",
            "[*HUAWEI-pm-server-a] protocol sftp ip-address 192.168.10.3 port 1025"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pm",
            "[~HUAWEI-pm] pm-server a",
            "[*HUAWEI-pm-server-a] protocol sftp ip-address 192.168.10.2 net-manager-vpn"
        ]
    ],
    "ExtraInfo": "To upload performance statistics files to a specified PM server, run the pm server ip-address port-number command to specify the PM server with the IP address ip-address and port number port-number.\nIf the IP address of the PM server is a private IP address, you can use the net-manager-vpn parameter to specify a network management VPN for uploading performance statistics files or use the vpn-instance vpn-instance-name parameter to specify a VPN instance name for uploading performance statistics files."
}