{
    "PageTitle": "vpn-target (VPN instance IPv4 address family MVPN view)",
    "FuncDef": "The vpn-target command configures a multicast virtual private network (MVPN) target for the VPN instance MVPN address family.\nThe undo vpn-target command deletes the MVPN target of the VPN instance MVPN address family. The vpn-target command configures a multicast virtual private network (MVPN) target for the VPN instance MVPN address family. The undo vpn-target command deletes the MVPN target of the VPN instance MVPN address family. By default, no MVPN target is configured for the VPN instance MVPN address family. The VPN instance MVPN address family uses the VPN target configured in the VPN instance IPv4 address family view as the MVPN target. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "vpn-target { <vrfRT> } &<1-8> [ <vrfRTType> ]",
        "undo vpn-target { <vrfRT> } &<1-8> [ <vrfRTType> ]",
        "undo vpn-target all"
    ],
    "ParentView": [
        "VPN instance IPv4 address family MVPN view"
    ],
    "ParaDef": [
        {
            "Parameters": "<vrfRT>",
            "Info": "Specifies the MVPN target to be added to the import or export VPN target extended community list of the VPN instance MVPN address family.\nThe available MVPN target formats are as follows:\n16-bit AS number: 32-bit user-defined number. For example, 1:3. An AS number ranges from 0 to 65535, and a user-defined number ranges from 0 to 4294967295. The AS number and user-defined number cannot both be 0s. This means that the VPN target value cannot be 0:0.32-bit IP address: 16-bit user-defined number. For example, 192.168.122.15:1. An IP address ranges from 0.0.0.0 to 255.255.255.255, and a user-defined number ranges from 0 to 65535.Integral 4-byte AS number: 2-byte user-defined number, for example, 65537:3. An AS number ranges from 65536 to 4294967295, and a user-defined number ranges from 0 to 65535. The AS number and user-defined number cannot both be 0s. This means that the VPN target value cannot be 0:0.4-byte AS number in dotted notation: 2-byte user-defined number, for example, 0.0:3 or 0.1:0. A 4-byte AS number in dotted notation is in the format of x.y, where x and y are integers that range from 0 to 65535. A user-defined number ranges from 0 to 65535. The AS number and user-defined number cannot both be 0s. This means that the VPN target value cannot be 0:0.0."
        },
        {
            "Parameters": "<vrfRTType>",
            "Info": "vrfRT type.\nThe parameters are as follows:\nboth: Adds a VPN target to both the import and export VPN target extended community lists of the VPN instance MVPN address family.export-extcommunity: Indicates the export MVPN target. A maximum of 500 export MVPN targets can be configured.import-extcommunity: Indicates the import MVPN target. A maximum of 4096 import MVPN targets can be configured."
        },
        {
            "Parameters": "all",
            "Info": "Deletes all MVPN targets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast mvpn 2.2.2.2",
            "[*HUAWEI] ip vpn-instance mcast1",
            "[*HUAWEI-vpn-instance-mcast1] ipv4-family",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4] route-distinguisher 1:1",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4] multicast routing-enable",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4] multicast mvpn route-import local-admin-id 2",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4] mvpn",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4-mvpn] vpn-target 1:1 2:2 3:3 both"
        ]
    ],
    "ExtraInfo": "The MVPN target controls route learning between MVPN sites. An MVPN target can be an import or export MVPN target. An export MVPN target is contained in an MVPN route to be advertised to a remote Multiprotocol Border Gateway Protocol (MP-BGP) peer. After receiving an MVPN route, an MP-BGP peer compares the received export MVPN target with the local import MVPN target to determine whether the MVPN route can be added to the MVPN routing table of the local VPN instance."
}