{
    "PageTitle": "dhcp server database",
    "FuncDef": "The dhcp server database command enables the function to save the current DHCP data to storage devices.\nThe undo dhcp server database command disables the function to save the DHCP data to storage devices. The dhcp server database command enables the function to save the current DHCP data to storage devices. The undo dhcp server database command disables the function to save the DHCP data to storage devices. By default, the function of saving DHCP data to storage devices is disabled.",
    "CLIs": [
        "dhcp server database { enable | write-delay <interval> }",
        "undo dhcp server database { enable | write-delay }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "enable",
            "Info": "Enables the function of storing DHCP data.\n-"
        },
        {
            "Parameters": "write-delay <interval>",
            "Info": "Specifies the interval at which DHCP data is saved.\nThe value is an integer ranging from 300 to 86400, in seconds. The default value is 3600 seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp server database enable",
            "[*HUAWEI] dhcp server database write-delay 3600"
        ]
    ],
    "ExtraInfo": "When the device functions as a DHCP server, run the dhcp server database enable command to enable the device to save DHCP data to storage devices. This avoids data loss caused by device faults. Then the system generates lease.txt and conflict.txt files in the storage device. The two files save address lease information and address conflict information respectively. After the dhcp server database enable command is run, current DHCP data is automatically saved at the specified interval, and previous data files are overwritten. The interval can be set using the dhcp server database write-delay interval command.\nIf a fault occurs on the device, DHCP data can be restored from storage devices after the system restarts.\nRun the display dhcp server database command to check the storage device for saving DHCP data."
}