{
    "PageTitle": "dhcp anti-attack check duplicate option",
    "FuncDef": "The dhcp anti-attack check duplicate option command enables the device to check and discard DHCP messages with duplicate options.\nThe undo dhcp anti-attack check duplicate option command disables the device from checking and discarding DHCP messages with duplicate options. The dhcp anti-attack check duplicate option command enables the device to check and discard DHCP messages with duplicate options. The undo dhcp anti-attack check duplicate option command disables the device from checking and discarding DHCP messages with duplicate options. By default, the device is disabled from checking and discarding DHCP messages with duplicate options.",
    "CLIs": [
        "dhcp anti-attack check duplicate option [ <option-start> [ to <option-end> ] ] &<1-254>",
        "undo dhcp anti-attack check duplicate option [ <option-start> [ to <option-end> ] ] &<1-254>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<option-start>",
            "Info": "Specifies the option value.\noption-start: Specifies the start value of an option in a DHCP packet.\nThe value is an integer ranging from 1 to 254. For an option, the end value must be larger than the start value."
        },
        {
            "Parameters": "to <option-end>",
            "Info": "Specifies the option value.\noption-end: Specifies the end value of an option in a DHCP packet.\nThe value is an integer ranging from 1 to 254. For an option, the end value must be larger than the start value."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] dhcp anti-attack check duplicate option"
        ]
    ],
    "ExtraInfo": "The dhcp anti-attack check duplicate option command applies to DHCP servers, DHCP relay agents, and DHCP clients. To discard DHCP messages with duplicate options 1 to 254, run the dhcp anti-attack check duplicate option command."
}