{
    "PageTitle": "dhcp option82 link-selection subnet-ip-address",
    "FuncDef": "The dhcp option82 link-selection subnet-ip-address command configures the IP address corresponding to the Sub5 field in Option 82 on a DHCP relay interface.\nThe undo dhcp option82 link-selection subnet-ip-address command deletes the IP address corresponding to the Sub5 field in Option 82 on a DHCP relay interface. The dhcp option82 link-selection subnet-ip-address command configures the IP address corresponding to the Sub5 field in Option 82 on a DHCP relay interface. The undo dhcp option82 link-selection subnet-ip-address command deletes the IP address corresponding to the Sub5 field in Option 82 on a DHCP relay interface. By default, no IP address is configured for the Sub5 field in Option 82.",
    "CLIs": [
        "dhcp option82 link-selection subnet-ip-address <ip-address>",
        "undo dhcp option82 link-selection subnet-ip-address"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies the IP address corresponding to the Sub5 field in Option 82.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] dhcp option82 link-selection insert enable",
            "[*HUAWEI-100GE1/0/1] dhcp option82 link-selection subnet-ip-address 10.1.1.1"
        ]
    ],
    "ExtraInfo": "The dhcp option82 link-selection subnet-ip-address command configures the IP address corresponding to the Sub5 field in Option 82 on an interface of a DHCP relay agent. The DHCP relay agent then fills this IP address in the Sub5 field."
}