{
    "PageTitle": "dhcp server excluded-ip-address",
    "FuncDef": "The dhcp server excluded-ip-address command specifies the range of IP addresses that cannot be automatically assigned to clients from an interface address pool. The undo dhcp server excluded-ip-address command deletes the specified range of IP addresses that cannot be automatically assigned to clients from an interface address pool. By default, all IP addresses in an address pool can be automatically assigned to clients.",
    "CLIs": [
        "dhcp server excluded-ip-address <start-ip-address> [ <end-ip-address> ]",
        "undo dhcp server excluded-ip-address <start-ip-address> [ <end-ip-address> ]"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<start-ip-address>",
            "Info": "Specifies the start IP address of the IP address segment where addresses cannot be automatically assigned to clients.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<end-ip-address>",
            "Info": "Specifies the end IP address of the IP address segment where addresses cannot be automatically assigned to clients. If <end-ip-address> is not specified, only the IP address corresponding to <start-ip-address> cannot be automatically assigned.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ip address 192.168.1.1 24",
            "[*HUAWEI-100GE1/0/1] dhcp select interface",
            "[*HUAWEI-100GE1/0/1] dhcp server excluded-ip-address 192.168.1.1 192.168.1.20"
        ]
    ],
    "ExtraInfo": "The dhcp server excluded-ip-address command applies to DHCP servers. Fixed IP addresses are allocated to some specific hosts (such as the WWW server) on the network for a long time. If these hosts' IP addresses are overlapped with IP addresses in the address pool and the DHCP server allocates these overlapped IP addresses to other hosts, IP address conflicts may occur. To prevent such IP address conflicts, you need to exclude these IP addresses from being automatically assigned in the address pool."
}