{
    "PageTitle": "dhcp relay giaddr outgoing-interface-address",
    "FuncDef": "The dhcp relay giaddr outgoing-interface-address command configures the relay agent address as the IP address of the outbound interface.\nThe undo dhcp relay giaddr outgoing-interface-address command deletes the configuration. The dhcp relay giaddr outgoing-interface-address command configures the relay agent address as the IP address of the outbound interface. The undo dhcp relay giaddr outgoing-interface-address command deletes the configuration. By default, a DHCP relay interface uses its primary IP address as the relay agent address.",
    "CLIs": [
        "dhcp relay giaddr outgoing-interface-address",
        "undo dhcp relay giaddr outgoing-interface-address"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] dhcp relay giaddr outgoing-interface-address"
        ]
    ],
    "ExtraInfo": "By default, the primary IP address of the DHCP relay interface is used as the relay agent address, and the relay agent address is added to the GiAddr field of packets. The DHCP server then uses the relay agent address to identify the network segment where a user resides and allocates an appropriate IP address for the user to allow for communication with the DHCP relay.\nIf the user and the DHCP server are located in different VPNs, the DHCP server fails to use this relay agent address to communicate with the DHCP relay, and DHCP reply packets are unreachable.\nTo address this issue, run the dhcp relay giaddr outgoing-interface-address command to configure the relay agent address as the IP address of the outbound interface in DHCP request packets. In this manner, the DHCP reply packets sent by the DHCP server can be successfully forwarded to the DHCP relay.\nGenerally, the DHCP server allocates IP addresses based on the GiAddr field. A modification of the GiAddr field may cause a user online failure."
}