{
    "PageTitle": "dhcp enable",
    "FuncDef": "The dhcp enable command enables the DHCP function.\nThe undo dhcp enable command disables the DHCP function. The dhcp enable command enables the DHCP function. The undo dhcp enable command disables the DHCP function. By default, the DHCP function is disabled.",
    "CLIs": [
        "dhcp enable [ ipv4 | ipv6 ]",
        "undo dhcp enable [ ipv4 | ipv6 ]",
        "dhcp enable",
        "undo dhcp enable"
    ],
    "ParentView": [
        "System view,System view of the virtual system"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4",
            "Info": "Configures the device to process only DHCPv4 messages.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Configures the device to process only DHCPv6 messages.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo dhcp enable",
            "Warning: All DHCP functions will be disabled. Continue? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "As the network scale expands and the network complexity increases, the network configuration becomes more and more complex. Computer locations often change and the number of computers often exceeds the number of IP addresses that can be allocated. The DHCP is developed to meet these requirements. After you run the dhcp enable command to enable DHCP on a device, the device processes both DHCPv4 and DHCPv6 packets. If only DHCPv4 or DHCPv6 packets need to be processed, run the undo dhcp enable ipv4 or undo dhcp enable ipv6 command to disable DHCPv4 or DHCPv6, this effectively reduces the CPU usage of the device."
}