{
    "PageTitle": "dhcp relay request server-match enable",
    "FuncDef": "The dhcp relay request server-match enable command configures a DHCP relay agent to check the DHCP server identifier (Option54) in a DHCP Request message to be forwarded.\nThe undo dhcp relay request server-match enable command configures a DHCP relay agent not to check the DHCP server identifier (Option54) in a DHCP Request message to be forwarded. The dhcp relay request server-match enable command configures a DHCP relay agent to check the DHCP server identifier (Option54) in a DHCP Request message to be forwarded. The undo dhcp relay request server-match enable command configures a DHCP relay agent not to check the DHCP server identifier (Option54) in a DHCP Request message to be forwarded. By default, a DHCP relay agent checks the DHCP server identifier (Option54) in a DHCP Request message to be forwarded.",
    "CLIs": [
        "dhcp relay request server-match enable",
        "undo dhcp relay request server-match enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] undo dhcp relay request server-match enable"
        ]
    ],
    "ExtraInfo": "During the four-message exchange process, the DHCP Offer message sent by a DHCP server carries the DHCP server identifier (Option54) to identify the server. After receiving the DHCP Offer message, the DHCP client records the DHCP server identifier and carries it in the DHCP Request message to be replied to indicate which DHCP server is selected. When the DHCP relay agent forwards the DHCP Request message, it checks the DHCP server identifier in the message and forwards the message only to the corresponding DHCP server.\nIf multiple DHCP servers are deployed on the network and the design of a server does not comply with standards, the DHCP server identifier carried in the DHCP Offer message to be sent by the server is not its identifier. As a result, the DHCP server identifier carried in the DHCP Request message is incorrect, the DHCP relay agent forwards the message to an incorrect DHCP server rather than the matching DHCP server, and the client fails to obtain an IP address.\nTo resolve this issue, you can run the undo dhcp relay request server-match enable command, so that the DHCP relay agent does not check the DHCP server identifier (Option54) in the DHCP Request message to be forwarded and forwards the message to all relayed DHCP servers, ensuring that the matching DHCP server can receive the DHCP Request message."
}