{
    "PageTitle": "dhcp option82 subscriber-id format",
    "FuncDef": "The dhcp option82 subscriber-id format command inserts the Sub6 suboption into the DHCP Option 82 field of DHCP messages and configures the format of the Sub6 suboption.\nThe undo dhcp option82 subscriber-id format command cancels the configuration of the Sub6 suboption inserted into the DHCP Option 82 field of DHCP messages. The dhcp option82 subscriber-id format command inserts the Sub6 suboption into the DHCP Option 82 field of DHCP messages and configures the format of the Sub6 suboption. The undo dhcp option82 subscriber-id format command cancels the configuration of the Sub6 suboption inserted into the DHCP Option 82 field of DHCP messages. By default, the Sub6 suboption is not inserted into the DHCP Option 82 field of DHCP messages.",
    "CLIs": [
        "dhcp option82 subscriber-id format { ascii <ascii-text> | hex <hex-text> }",
        "undo dhcp option82 subscriber-id format"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,Interface group view,System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ascii <ascii-text>",
            "Info": "Specifies the ASCII character string in the Sub6 field.\nThe value is an ASCII character string of 1 to 128 characters, spaces supported."
        },
        {
            "Parameters": "hex <hex-text>",
            "Info": "Specifies the HEX character string in the Sub6 field.\nThe value is in hexadecimal notation. The value can contain only numerals 0 to 9, lowercase letters a to f, and uppercase letters A to F. If no space is included, the value length must be an even number smaller than 257."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] portswitch",
            "[*HUAWEI-100GE1/0/1] dhcp option82 subscriber-id format ascii hw"
        ]
    ],
    "ExtraInfo": "In an authentication system for wired Ethernet access based on DHCP and Option82, a device can insert suboptions (suboption 1, suboption 2, suboption 6, and suboption 9) into the Option 82 field in DHCP Request messages. These suboptions in DHCP Request messages help locate user devices. Unauthorized users cannot access the network by using static IP addresses or stealing accounts of authorized users. You can run the dhcp option82 subscriber-id format command to configure the Sub6 suboption."
}