{
    "PageTitle": "display ip pool",
    "FuncDef": "The display ip pool command displays the configurations of an address pool. The display ip pool command displays the configurations of an address pool.",
    "CLIs": [
        "display ip pool",
        "display ip pool interface <interface-pool-name> [ <start-ip-address> [ <end-ip-address> ] | all | conflict | expired | used ]",
        "display ip pool vpn-instance <vpn-instance-name>",
        "display ip pool name <pool-name> [ <start-ip-address> [ <end-ip-address> ] | all | conflict | expired | used [ user-typedhcp ] ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface <interface-pool-name>",
            "Info": "Displays the configuration of the specified interface address pool.\nAn interface address pool is specified using the type and number of an interface without spaces between them.\nThe value is a string of 1 to 64 case-insensitive characters without spaces. It can contain digits, letters, and special characters underscores (_), hyphens (-), and periods (.). It cannot be set to - or --."
        },
        {
            "Parameters": "<start-ip-address>",
            "Info": "Displays the IP addresses within the range specified by the start IP address in the address pool.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<end-ip-address>",
            "Info": "If end-ip-address is set, the end IP address is also specified.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "all",
            "Info": "Displays all IP addresses in the address pool.\n-"
        },
        {
            "Parameters": "conflict",
            "Info": "Displays the conflicting IP addresses in the address pool. (If an IP address that the DHCP server prepares to allocate to a user exists on the network, the IP address will be added to the conflict list. This problem occurs when a static IP address is configured or an active/standby switchover occurs in a VRRP group if the range of IP addresses in the address pools on the master and backup devices overlap.).\n-"
        },
        {
            "Parameters": "expired",
            "Info": "Displays the expired and idle IP addresses in the address pool.\n-"
        },
        {
            "Parameters": "used",
            "Info": "Display the IP addresses used in the address pool.\n-"
        },
        {
            "Parameters": "<vpn-instance-name>",
            "Info": "Displays information about the address pool in a specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "name <pool-name>",
            "Info": "Displays the configuration of the specified global address pool.\nThe value is a string of 1 to 64 case-insensitive characters without spaces. It can contain digits, letters, and special characters underscores (_), hyphens (-), and periods (.). It cannot be set to - or --."
        },
        {
            "Parameters": "user-type",
            "Info": "Display the IP addresses used in the address pool by the specific type of users.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ip pool name huawei conflict",
            "Option-value : %^%#5g)NPN1M,$M;pQ-lT\\P>Al6QN4#ldIVVjD69XlCN%^%#"
        ]
    ],
    "ExtraInfo": ""
}