{
    "PageTitle": "excluded-ip-address",
    "FuncDef": "The excluded-ip-address command specifies the range of IP addresses that cannot be automatically assigned to clients from an address pool. The undo excluded-ip-address command deletes the specified range of IP addresses that cannot be automatically assigned to clients from an address pool. By default, all IP addresses in an address pool can be automatically assigned to clients.",
    "CLIs": [
        "excluded-ip-address <start-ip-address> [ <end-ip-address> ]",
        "undo excluded-ip-address <start-ip-address> [ <end-ip-address> ]"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "<start-ip-address>",
            "Info": "Specifies the start IP address of the IP address segment where addresses cannot be automatically assigned to clients.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<end-ip-address>",
            "Info": "Specifies the end IP address of the IP address segment where addresses cannot be automatically assigned to clients. If end-ip-address is not specified, only the IP address corresponding to start-ip-address cannot be automatically assigned.\nThe value is in dotted decimal notation. end-ip-address and start-ip-address must be on the same network segment and end-ip-address must be larger than start-ip-address."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool global1",
            "[*HUAWEI-ip-pool-global1] network 10.10.10.0 mask 24",
            "[*HUAWEI-ip-pool-global1] excluded-ip-address 10.10.10.10 10.10.10.20"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool global1",
            "[*HUAWEI-ip-pool-global1] network 10.10.10.0 mask 24",
            "[*HUAWEI-ip-pool-global1] excluded-ip-address 10.10.10.30",
            "Warning: The address is in used or conflict state. Are you sure to continue excluding the address?[Y/N]:y"
        ]
    ],
    "ExtraInfo": "The excluded-ip-address command applies to DHCP servers. Fixed IP addresses are allocated to some specific hosts (such as the WWW server) on the network for a long time. If these hosts' IP addresses are overlapped with IP addresses in the address pool and the DHCP server allocates these overlapped IP addresses to other hosts, IP address conflicts may occur. To prevent such IP address conflicts, you need to exclude these IP addresses from being automatically assigned in the address pool."
}