{
    "PageTitle": "option",
    "FuncDef": "The option command configures the user-defined option that a DHCP server assigns to a DHCP client. The undo option command deletes the user-defined option that a DHCP server assigns to a DHCP client. By default, no user-defined option that a DHCP server assigns to a DHCP client is configured.",
    "CLIs": [
        "option <code> sub-option <sub-code> { ascii <sub-ascii-string> | hex <sub-hex-string> | cipher <sub-cipher-string> | ip-address <sub-ip-address> &<1-8> }",
        "option <code> { ascii <ascii-string> | hex <hex-string> | cipher <cipher-string> | ip-address <ip-address> &<1-8> }",
        "undo option [ <code> [ sub-option <sub-code> ] ]"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "<code>",
            "Info": "Specifies the code of a user-defined option.\nThe value is an integer that ranges from 1 to 254, except the values 1, 3, 6, 15, 44, 46, 50, 51, 52, 53, 54, 55, 57, 58, 59, 61, 82, 120, 121, and 184. There are well-known options and user-defined options. For details about well-known options, see RFC 2132."
        },
        {
            "Parameters": "sub-option <sub-code>",
            "Info": "Specifies the code of a user-defined sub-option.\nThe value is an integer that ranges from 1 to 254. For details about well-known options, see RFC 2132."
        },
        {
            "Parameters": "ascii <sub-ascii-string>",
            "Info": "Specifies the user-defined option code as an ASCII character string.\nThe value is a string of 1 to 253 case-sensitive characters, spaces supported."
        },
        {
            "Parameters": "ascii <ascii-string>",
            "Info": "Specifies the user-defined option code as an ASCII character string.\nThe value is a string of 1 to 255 characters, spaces supported."
        },
        {
            "Parameters": "hex <sub-hex-string>",
            "Info": "Specifies a user-defined option as hexadecimal characters.\nThe value is a hexadecimal string with an even number of case-insensitive characters, for example, hh or hhhh. The value without spaces ranges from 2 to 252 characters. The value can be a combination of digits (0-9), uppercase letters (A-F), and lowercase letters (a-f)."
        },
        {
            "Parameters": "hex <hex-string>",
            "Info": "Specifies a user-defined option as hexadecimal characters.\nThe value is a hexadecimal string with an even number of case-insensitive characters, for example, hh or hhhh. The value without spaces ranges from 2 to 254 characters. The value can be a combination of digits (0-9), uppercase letters (A-F), and lowercase letters (a-f)."
        },
        {
            "Parameters": "cipher <cipher-string>",
            "Info": "Specifies the user-defined option code as a ciphertext character string.\nThe value is a string of case-sensitive characters in cleartext or ciphertext, spaces not supported. The ciphertext is a character string starting and ending with %@ %# or %+ %#. If spaces are used, the string must start and end with double quotation marks (\").\n\nThe value is a string of 1 to 255 characters in cleartext.\nThe value is a string of 20 to 432 characters in ciphertext.\n\nNo matter whether the character string is entered in cleartext or ciphertext, the character string is displayed in ciphertext in the configuration file and in cleartext in packets."
        },
        {
            "Parameters": "cipher <sub-cipher-string>",
            "Info": "Specifies the user-defined option code as a ciphertext character string.\nThe value is a string of case-sensitive characters in cleartext or ciphertext, spaces not supported. The ciphertext is a character string starting and ending with %@ %# or %+ %#. If spaces are used, the string must start and end with double quotation marks (\").\n\nThe value is a string of 1 to 253 characters in cleartext.\nThe value is a string of 20 to 432 characters in ciphertext.\n\nNo matter whether the character string is entered in cleartext or ciphertext, the character string is displayed in ciphertext in the configuration file and in cleartext in packets."
        },
        {
            "Parameters": "ip-address <ip-address>",
            "Info": "Specifies a user-defined option as an IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ip-address <sub-ip-address>",
            "Info": "Specifies a user-defined option as an IP address.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool global1",
            "[*HUAWEI-ip-pool-global1] option 64 hex 11"
        ]
    ],
    "ExtraInfo": "This command applies to DHCP servers. The option field in a DHCP packet carries control information and parameters. If a DHCP server is configured with options, when a DHCP client applies for an IP address, the client can obtain the configurations in the option field of the DHCP response packet from the DHCP server. To configure user-defined options for an interface address pool, run the dhcp server option command."
}