{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "banner slip-ppp",
    "FuncDef": [
        "To customize the banner that is displayed when a Serial Line Internet Protocol (SLIP) or PPP connection is made, use the **banner slip-ppp** command in global configuration mode. To restore the default SLIP or PPP banner, use the **no** form of this command. "
    ],
    "CLIs": [
        "banner slip-ppp <d message d>",
        "no banner slip-ppp"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *d* ",
            "Info": " Delimiting character of your choice—a pound sign (#), for example. You cannot use the delimiting character in the banner message. "
        },
        {
            "Parameters": " *message* ",
            "Info": " Message text. You can include tokens in the form $(*token*) in the message text. Tokens will be replaced with the corresponding configuration variable. "
        }
    ],
    "Examples": [
        [
            "The following example sets the SLIP/PPP banner using several tokens and the percent sign (%) as the delimiting character:",
            "```",
            "```",
            "```",
            "Router(config)# banner slip-ppp %",
            "```",
            "```",
            "Enter TEXT <message>. End with the character '%'.",
            "```",
            "```",
            "Starting $(encap) connection from $(gate-ip) to $(peer-ip) using a maximum packet size of",
            "$(mtu) bytes... %",
            "```",
            "```",
            "```",
            "The new SLIP/PPP banner will now be displayed when the slip EXEC command is used. Notice that the $(<token>) syntax is replaced by the corresponding configuration variable.",
            "```",
            "```",
            "```",
            "Router# slip",
            "```",
            "```",
            "Starting SLIP connection from 172.16.69.96 to 192.168.1.200 using a maximum packet size of",
            "1500 bytes...",
            "```"
        ]
    ],
    "ExtraInfo": "Follow this command with one or more blank spaces and a delimiting character of your choice. Then enter one or more lines of text, terminating the message with the second occurrence of the delimiting character.Use this command to define a custom SLIP or PPP connection message. This is useful when legacy client applications require a specialized connection string. To customize the banner, use tokens in the form $(*token*) in the message text. Tokens will display current Cisco IOS configuration variables, such as the routers host name, IP address, encapsulation type, and Maximum Transfer Unit (MTU) size. The banner tokens are described in [Table 17](#wp1014711).Table 17 banner slip-ppp Tokens| Token | Information Displayed in the Banner || --- | --- || **$(hostname)** | Displays the host name of the router. || **$(domain)** | Displays the domain name of the router. || **$(peer-ip)** | Displays the IP address of the peer machine. || **$(gate-ip)** | Displays the IP address of the gateway machine. || **$(encap)** | Displays the encapsulation type (SLIP, PPP, and so on). || **$(encap-alt)** | Displays the encapsulation type as SL/IP instead of SLIP. || **$(mtu)** | Displays the MTU size. |  ",
    "RelatedCmds": [
        {
            "cmd": " **banner exec** ",
            "description": " Defines and enables a customized banner to be displayed whenever the EXEC process is initiated. "
        },
        {
            "cmd": " **banner incoming** ",
            "description": " Defines and enables a customized message to be displayed when there is an incoming connection to a terminal line from a host on the network. "
        },
        {
            "cmd": " **banner motd** ",
            "description": " Defines and enables a customized message-of-the-day banner. "
        },
        {
            "cmd": " **ppp** ",
            "description": " Initiates a connection to a remote host using PPP. "
        },
        {
            "cmd": " **slip** ",
            "description": " Initiates a connection to a remote host using SLIP. "
        }
    ]
}