{
    "PageTitle": "nqa vxlanecho enable",
    "FuncDef": "The nqa vxlanecho enable command enables VXLAN ping/tracert.\nThe undo nqa vxlanecho enable command disables VXLAN ping/tracert. The nqa vxlanecho enable command enables VXLAN ping/tracert. The undo nqa vxlanecho enable command disables VXLAN ping/tracert. By default, VXLAN ping/tracert is disabled. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "nqa vxlanecho enable udp-port <udpPort> [ source-ip-interface { <ifName> | <ifType> <ifNum> } ]",
        "nqa vxlanecho enable ipv6 udp-port <udpPort6> [ source-ip-interface { <ifName6> | <ifType6> <ifNum6> } ]",
        "undo nqa vxlanecho enable udp-port <udpPort> [ source-ip-interface { <ifName> | <ifType> <ifNum> } ]",
        "undo nqa vxlanecho enable ipv6 udp-port <udpPort6> [ source-ip-interface { <ifName6> | <ifType6> <ifNum6> } ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "source-ip-interface <ifName>",
            "Info": "Specifies the name of the interface where the source IP address of VXLAN echo request and reply packets resides.\nBy default, no source IP address or interface is specified.\nYou are advised to specify this parameter in M-LAG scenarios."
        },
        {
            "Parameters": "<ifType>",
            "Info": "Specifies the type of the interface where the source IP address of VXLAN Echo Request and Reply packets resides.\nBy default, no source IP address or interface is specified.\nYou are advised to specify this parameter in M-LAG scenarios."
        },
        {
            "Parameters": "<ifNum>",
            "Info": "Specifies the number of the interface where the source IP address of VXLAN Echo Request and Reply packets resides.\nBy default, no source IP address or interface is specified.\nYou are advised to specify this parameter in M-LAG scenarios."
        },
        {
            "Parameters": "ipv6",
            "Info": "Indicates an IPv6 address.\n-"
        },
        {
            "Parameters": "udp-port <udpPort>",
            "Info": "Specifies a monitoring port number of the VXLAN server for the NQA test.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "<udpPort6>",
            "Info": "Specifies the listening port number of the IPv6 VXLAN server for the NQA test.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "<ifName6>",
            "Info": "Specifies the name of the interface where the source IPv6 address of VXLAN echo request and reply packets resides.\nYou are advised to set this parameter in M-LAG scenarios.\nBy default, no source IPv6 address or interface is specified.\n-"
        },
        {
            "Parameters": "<ifType6>",
            "Info": "Specifies the type of the interface where the source IPv6 address of VXLAN Echo Request and Reply packets resides.\nYou are advised to set this parameter in M-LAG scenarios.\nBy default, no source IPv6 address or interface is specified.\n-"
        },
        {
            "Parameters": "<ifNum6>",
            "Info": "Specifies the number of the interface where the source IPv6 address of VXLAN Echo Request and Reply packets resides.\nYou are advised to set this parameter in M-LAG scenarios.\nBy default, no source IPv6 address or interface is specified.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa vxlanecho enable udp-port 2000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa vxlanecho enable ipv6 udp-port 2000"
        ]
    ],
    "ExtraInfo": "The VXLAN echo capability needs to be enabled and the VXLAN echo listening port number needs to be configured on the responder when the ping vxlan or tracert vxlan operation is required.\nWhen you configure the source IP interface, if you do not specify the source IP address when running the ping vxlan or tracert vxlan command, the source IP address of the request packet is obtained from this interface. The source IP address of the response packet is obtained from the interface."
}