{
    "PageTitle": "capture-packet local-host",
    "FuncDef": "The capture-packet local-host command configures a packet obtaining instance for the packets to be sent to a host.\nThe undo capture-packet command deletes a packet obtaining instance. The capture-packet local-host command configures a packet obtaining instance for the packets to be sent to a host. The undo capture-packet command deletes a packet obtaining instance. By default, no packet capture instance is configured for the packets to be sent to the host.",
    "CLIs": [
        "capture-packet local-host [ interface { <interface-type> <interface-number> | <interface-name> } &<1-4> ] [ acl { <acl-number> | name <acl-name> } | vlan <vlan-id> | inner-vlan <cvlan-id> ] destination { file <filename> | terminal } [ time-out <time-value> | packet-num <number> | packet-len <length> ]",
        "capture-packet local-host [ interface { <interface-type> <interface-number> | <interface-name> } &<1-4> ] [ aclipv6 { <acl-number2> | name <acl-name> } | vlan <vlan-id> | inner-vlan <cvlan-id> ] destination { file <filename> | terminal } [ time-out <time-value> | packet-num <number> | packet-len <length> ]",
        "undo capture-packet [ <capture-index> ]",
        "capture-packet local-host [ interface { <interface-type> <interface-number> | <interface-name> } &<1-4> ] [ acl { <acl-number> | name <acl-name> } | vlan <vlan-id> ] destination { file <filename> | terminal } [ time-out <time-value> | packet-num <number> | packet-len <length> ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Obtains packets on a specified interface.\ninterface-type: indicates the interface type.interface-number: indicates the interface number.\nThe value is a string of 1 to 128 case-insensitive characters without spaces but with spaces between type and number."
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Obtains packets on a specified interface.\nThe value is a string of 1 to 128 case-insensitive characters without spaces."
        },
        {
            "Parameters": "acl",
            "Info": "Configures an ACL.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Configures an IPv6 address.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "<acl-number2>",
            "Info": "Obtains packets that match a specified ACL.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer that ranges from 2000 to 3999."
        },
        {
            "Parameters": "name <acl-name>",
            "Info": "Creates an ACL with a name.\nThe value is a string of 1 to 32 case-sensitive characters without spaces. The value must start with a letter or digit, and cannot contain only digits."
        },
        {
            "Parameters": "vlan <vlan-id>",
            "Info": "Obtains packets from a specified VLAN.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):For device models in low latency mode, the value can be changed using a command. The value is in the range from 1 to 1023."
        },
        {
            "Parameters": "destination",
            "Info": "Indicates the destination to which obtained packet information is sent.\n-"
        },
        {
            "Parameters": "file <filename>",
            "Info": "Saves obtained packet information to a file. The file name extension must be .cap.\nThe value is a string of 5 to 64 case-sensitive characters. It cannot contain spaces and paths. It cannot contain the following special characters: ~ ? * \\ : / | < > [ ]."
        },
        {
            "Parameters": "terminal",
            "Info": "Displays information about the obtained packets on the terminal.\n-"
        },
        {
            "Parameters": "time-out <time-value>",
            "Info": "Specifies the timeout period for obtaining packets. The device stops the packet capture instance when the timeout period expires.\nThe value is an integer ranging from 1 to 86400, in seconds."
        },
        {
            "Parameters": "packet-num <number>",
            "Info": "Specifies the number of packets to be obtained. The device stops the packet capture instance when the specified number of packets are obtained.\nThe value is an integer in the range from 1 to 5000. The default value is 100."
        },
        {
            "Parameters": "packet-len <length>",
            "Info": "Specifies the length of obtained packets to be displayed on the terminal or stored on the storage medium.\nThe value is an integer in the range from 20 to 64, in bytes. The default value is 64 bytes."
        },
        {
            "Parameters": "<acl-number>",
            "Info": "Obtains packets that match a specified ACL.\nThe value is an integer that ranges from 2000 to 4999 ."
        },
        {
            "Parameters": "inner-vlan <cvlan-id>",
            "Info": "Obtains packets with a specified inner VLAN ID.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "<capture-index>",
            "Info": "Deletes the packet capture instance with a specified index.\nThe value is an integer ranging from 1 to 8."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> capture-packet local-host interface 100GE 1/0/1 destination file capture1.cap time-out 360 packet-num 100"
        ]
    ],
    "ExtraInfo": "Devices on a network transmit various services, and network administrators often need to obtain packets on devices to locate faults. The device does not support the remote packet capture function; therefore, administrators need to obtain packets onsite by connecting a PC to the switch. If packets need to be obtained on an optical interface, an optical-to-electrical converter must be installed on the interface, reducing maintenance efficiency. Running the capture-packet local-host command can remotely obtain the packets to be sent to the CPU and analyze the obtained packets, to greatly improve maintenance efficiency and reduce maintenance cost."
}