{
    "PageTitle": "check",
    "FuncDef": "The check command checks the integrity of a patch package. The check command checks the integrity of a patch package.",
    "CLIs": [
        "check patch { <PkgName> | startup }",
        "check module { <PkgName> | startup }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "<PkgName>",
            "Info": "Specifies the patch file to be checked for integrity.\nThe value of this parameter can consist of the path where the patch file is stored and the name of the patch file, or consist of only the name of the patch file.\nThe value is a string of 5 to 127 case-sensitive characters without spaces. The length of the patch file storage path ranges from 0 to 64 characters, and the length of the patch file name ranges from 5 to 63 characters."
        },
        {
            "Parameters": "startup",
            "Info": "Checks the integrity of the patch package used for the next startup.\n-"
        },
        {
            "Parameters": "module",
            "Info": "Checks the integrity of the module package.\n-"
        },
        {
            "Parameters": "patch",
            "Info": "Checks the integrity of the patch package.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> check module startup"
        ],
        [
            "<HUAWEI> check patch startup",
            "Warning: Patch package verification consumes system CPU resources. Continue? [Y/N]: Y"
        ],
        [
            "<HUAWEI> check patch xxxx.PAT",
            "Warning: Patch package verification consumes system CPU resources. Continue?[Y/N]: Y"
        ],
        [
            "<HUAWEI> check module TEST.MOD",
            "Warning: Package verification consumes system CPU resources. Continue? [Y/N]: Y"
        ],
        [
            "<HUAWEI> check module startup",
            "Warning: Package verification consumes system CPU resources. Continue? [Y/N]: Y"
        ],
        [
            "<HUAWEI> check module TEST.MOD",
            "Warning: Package verification consumes system CPU resources. Continue? [Y/N]: Y"
        ],
        [
            "<HUAWEI> check module startup",
            "Warning: Package verification consumes system CPU resources. Continue? [Y/N]: Y"
        ]
    ],
    "ExtraInfo": "Before you load a module file, run the check module command to check whether the file is damaged. If the module file is not damaged, a message is displayed indicating that the file is complete. Otherwise, a message is displayed indicating that the file is incomplete. If the specified module file name does not exist, a message is displayed indicating that the file does not exist. If you specify the startup parameter without setting any next-startup module file, a message is displayed indicating that the required module file does not exist. In this case, run the install-module [ next-startup ] command to specify the next-startup module file."
}