{
    "PageTitle": "redirect nexthop",
    "FuncDef": "The redirect nexthop command configures an action of redirecting packets to a next-hop IP address in a traffic behavior.\nThe undo redirect command deletes the redirection configuration. The redirect nexthop command configures an action of redirecting packets to a next-hop IP address in a traffic behavior. The undo redirect command deletes the redirection configuration. By default, the action of redirecting packets to a remote next hop is not configured in a traffic behavior.",
    "CLIs": [
        "redirect [ vpn-instance <vpn-instance-name> ] nexthop { <ip-address> [ tracknqa <admin-name> <test-name> [ reactionprobe-failtimes <fail-times> ] ] } &<1-16> [ fail-actiondiscard ] [ low-precedence ]",
        "undo redirect [ vpn-instance <vpn-instance-name> ] nexthop { <ip-address> [ tracknqa <admin-name> <test-name> [ reactionprobe-failtimes <fail-times> ] ] } &<1-16> [ fail-actiondiscard ] [ low-precedence ]",
        "redirect ipv6 [ vpn-instance <vpn-instance-name> ] nexthop { <ipv6-address> [ tracknqa <admin-name> <test-name> [ reactionprobe-failtimes <fail-times> ] ] } &<1-16> [ fail-actiondiscard ]",
        "undo redirect ipv6 [ vpn-instance <vpn-instance-name> ] nexthop { <ipv6-address> [ tracknqa <admin-name> <test-name> [ reactionprobe-failtimes <fail-times> ] ] } &<1-16> [ fail-actiondiscard ]",
        "undo redirect",
        "redirect [ vpn-instance <vpn-instance-name> ] nexthop { <ip-address> [ tracknqa <admin-name> <test-name> [ reactionprobe-failtimes <fail-times> ] ] } &<1-16> [ fail-actiondiscard ]",
        "undo redirect [ vpn-instance <vpn-instance-name> ] nexthop { <ip-address> [ tracknqa <admin-name> <test-name> [ reactionprobe-failtimes <fail-times> ] ] } &<1-16> [ fail-actiondiscard ]"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies the next-hop IPv4 address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "tracknqa",
            "Info": "Indicates an NQA test instance.\n-"
        },
        {
            "Parameters": "<admin-name>",
            "Info": "Specifies the administrator name of an NQA test instance.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "<test-name>",
            "Info": "Specifies the name of an NQA test instance.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "fail-action",
            "Info": "Specifies the action to be taken if the next hop is unreachable.\n-"
        },
        {
            "Parameters": "discard",
            "Info": "Discards the packets.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Specifies the next-hop IPv6 address.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the next-hop IPv6 address. The address cannot be of the link-local type.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "reaction",
            "Info": "Cancels redirection.\n-"
        },
        {
            "Parameters": "probe-failtimes <fail-times>",
            "Info": "Specifies the maximum number of link detection failures in an NQA test instance.\nThe value is an integer in the range from 1 to 15."
        },
        {
            "Parameters": "low-precedence",
            "Info": "Specifies the low priority of policy-based routing.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] redirect nexthop 10.0.0.1"
        ]
    ],
    "ExtraInfo": "The redirect nexthop command allows you to specify a maximum of 16 next-hop IP addresses (using the ip-address parameter for multiple times). If multiple next-hop IP addresses are configured, the device redirects packets in active/standby mode. The device determines the primary link and backup links according to the sequence in which next-hop IP addresses were configured. The next-hop IP address that was configured first has the highest priority and this next hop is used as the primary path. Other next hops are used as backup paths. When the primary link becomes Down, a next hop with higher priority is used as the primary path.\nIf an NQA test instance is configured to detect the link for the redirection next-hop IP address and the number of NQA link detection failures is greater than or equal to the configured maximum value, the current next hop will be canceled. If multiple next hops work in active/standby mode, traffic will be automatically switched to a reachable next hop.\nPBR is implemented based on the redirection action configured in a traffic behavior and takes effect only on incoming packets of interfaces. By default, a device forwards packets to the next hop found in its routing table. If PBR is configured, the device forwards packets to the next hop specified by PBR. After you specify the low-precedence parameter, the device forwards packets matching PBR to the next hop/outbound interface of the specific route in its routing table. When the specific route becomes invalid, the device forwards packets to the next hop/outbound interface specified by PBR. When both the next hop of the specific route and next hop specified by PBR become invalid, and the routing table has default routes, the device continues forwarding packets according to the matching default route."
}