{
    "PageTitle": "controller-ipv6",
    "FuncDef": "The controller-ipv6 command specifies the controller IPv6 address used to establish an OpenFlow connection with the device and displays the Controller-IPv6 view.\nThe undo controller-ipv6 command deletes the controller IPv6 address used to establish an OpenFlow connection with the device. The controller-ipv6 command specifies the controller IPv6 address used to establish an OpenFlow connection with the device and displays the Controller-IPv6 view. The undo controller-ipv6 command deletes the controller IPv6 address used to establish an OpenFlow connection with the device. By default, the controller IPv6 address used to establish an OpenFlow connection with the device is not specified. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "controller-ipv6 [ vpn-instance <vpn-instance-name> ] <ipv6-address>",
        "undo controller-ipv6 [ vpn-instance <vpn-instance-name> ] <ipv6-address>"
    ],
    "ParentView": [
        "SDN forwarder view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of the VPN instance that the controller belongs to.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the controller IPv6 address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] sdn agent",
            "[*HUAWEI-sdn-agent] controller-ipv6 2001:db8:1::1"
        ]
    ],
    "ExtraInfo": ""
}