{
    "PageTitle": "suppression alarm",
    "FuncDef": "The suppression alarm command configures a suppression period for an alarm.\nThe undo suppression alarm command deletes a suppression period. The suppression alarm command configures a suppression period for an alarm. The undo suppression alarm command deletes a suppression period. By default, suppression time is 0.",
    "CLIs": [
        "suppression alarm <alarm-name> { cause-period <cause-seconds> | clear-period <clear-seconds> }",
        "undo suppression alarm <alarm-name> cause-period",
        "undo suppression alarm <alarm-name> clear-period"
    ],
    "ParentView": [
        "Alarm management view"
    ],
    "ParaDef": [
        {
            "Parameters": "<alarm-name>",
            "Info": "Specifies the name of an alarm. This alarm must exist.\nThe value is a string of 1 to 63 characters, spaces not supported."
        },
        {
            "Parameters": "cause-period <cause-seconds>",
            "Info": "Specifies the period after which an alarm is generated. If an alarm is repeatedly reported during cause-period, the system does not report the alarm until cause-period expires.\nThe value is an integer that ranges from 0 to 600, in seconds."
        },
        {
            "Parameters": "clear-period <clear-seconds>",
            "Info": "Specifies the period after which an alarm is cleared. If a clear alarm is repeatedly reported during clear-period, the system reports the clear alarm until cause-period expires.\nThe value is an integer that ranges from 0 to 600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] alarm",
            "[~HUAWEI-alarm] suppression alarm linkDown cause-period 5",
            "[*HUAWEI-alarm] suppression alarm linkDown clear-period 15"
        ]
    ],
    "ExtraInfo": "You can configure a suppression period to prevent an alarm from being frequently reported.\nAlarms for each application can be assigned a specific suppression period. Alarm suppression can be disabled for some alarms generated for hardware and devices."
}