{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "memory reserve critical",
    "FuncDef": [
        "![](/c/dam/en/us/td/i/templates/note.gif) "
    ],
    "CLIs": [
        "Note ! [ ] (/c/dam/en/us/td/i/templates/blank.gif)Effective with Cisco IOS Release 12.4(15)T1, the memory reserve critical command is replaced by the memory reserve command. See the memory reserve command for more information.",
        "---",
        "To configure the size of the memory region to be used for critical notifications (system logging messages), use the memory reserve critical command in global configuration mode. To disable the reservation of memory for critical notifications, use the no form of this command.",
        "memory reserve critical <kilobytes>",
        "no memory reserve critical"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *kilobytes* ",
            "Info": " Specifies the amount of memory to be reserved in kilobytes. Valid values are 1 to 4294967295, but the value you specify cannot exceed 25 percent of total memory. The default is 100 kilobytes. "
        }
    ],
    "Examples": [
        [
            "The following example shows how to reserve 1,000 KB of system memory for logging messages at the next system restart:",
            "```",
            "Router(config)# memory reserve critical 1000",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "This command reserves a region of memory on the router so that, when system resources are overloaded, the router retains enough memory to issue critical system logging messages.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)Once the size of the reserved memory region is specified, any change to the specified value takes effect only after the current configuration is saved and the system has been reloaded.---",
    "RelatedCmds": [
        {
            "cmd": " **memory free low-watermark** ",
            "description": " Configures a router to issue syslog notifications when available memory falls below a specified threshold. "
        }
    ]
}