{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "microcode reload (12000)",
    "FuncDef": [
        "To reload the Cisco IOS image from a line card on Cisco 12000 series routers, use the **microcode reload**command in global configuration mode. "
    ],
    "CLIs": [
        "microcode reload [ <slot-number> ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *slot-number* ",
            "Info": " (Optional) Slot number of the line card that you want to reload the Cisco IOS software image on. Slot numbers range from 0 to 11 for the Cisco 12012 and from 0 to 7 for the Cisco 12008 router. If you do not specify a slot number, the Cisco IOS software image is reloaded on all line cards. "
        }
    ],
    "Examples": [
        [
            "In the following example, the mirocode firmware is reloaded on the line card in slot 10:",
            "```",
            "Router(config)# microcode reload 10",
            "```"
        ]
    ],
    "ExtraInfo": "In addition to the Cisco IOS image that resides on the GRP card, each line card on Cisco 12000 series routers has a Cisco IOS image. When the router is reloaded, the specified Cisco IOS image is loaded onto the GRP card and automatically downloaded to all the line cards.Normally, you want the same Cisco IOS image on the GRP card and all line cards. However, if you want to upgrade a line card with a new version of microcode for testing or to fix a defect, you might need to load a different Cisco IOS image. Additionally, you might need to load a new image on the line card to work around a problem affecting only one of the line cards.To load a Cisco IOS image on a line card, first use the **copy tftp** command to download the Cisco IOS image to a slot on one of the PCMCIA Flash memory cards. Then use the **microcode** command to download the image to the line card, followed by the **microcode reload** command to start the image. To verify that the correct image is running on the line card, use the **execute-on slot** *slot* **show version** command.For additional information on GSR configuration, refer to the \"Observing System Startup and Performing a Basic Configuration\" chapter in the Cisco 12000 series installation and configuration guides.The **microcode reload** (12000) command allows you to issue another command immediately.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)Issuing a **microcode reload** command on any of the line cards in a Cisco 12000 GSR immediately returns the console command prompt. This allows you to issue a subsequent command immediately to the reloading line card. However, any commands entered at this time will not execute, and often no indication will be given that such a command failed to run. Verify that the microcode has reloaded before issuing new commands.---",
    "RelatedCmds": [
        {
            "cmd": " **microcode (12000)** ",
            "description": " Loads a Cisco IOS software image on a line card from Flash memory or the GRP card on a Cisco 12000 series GSR. "
        }
    ]
}