{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "microcode (12000)",
    "FuncDef": [
        "To load a Cisco IOS software image on a line card from Flash memory or the GRP card on a Cisco 12000 series Gigabit Switch Router (GSR), use the **microcode** command in global configuration mode. To load the microcode bundled with the GRP system image, use the **no** form of this command. "
    ],
    "CLIs": [
        "microcode { oc12-atm | oc12-pos | oc3-pos4 } { flash <file-id> [ <slot> ] | system [ <slot> ] }",
        "no microcode { oc12-atm | oc12-pos | oc3-pos4 } [ flash <file-id> [ <slot> ] | system [ <slot> ] ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **oc12-atm ",
            "Info": " oc12-pos "
        },
        {
            "Parameters": " **flash** ",
            "Info": " Loads the image from the Flash file system. "
        },
        {
            "Parameters": " *file-id* ",
            "Info": " Specifies the device and filename of the image file to download from Flash memory. A colon (:) must separate the device and filename (for example, slot0:gsr-p-mz). Valid devices include:  •**bootflash:**—Internal Flash memory.  •**slot0:**—First PCMCIA slot.  •**slot1:**—Second PCMCIA slot. "
        },
        {
            "Parameters": " *slot* ",
            "Info": " (Optional) Slot number of the line card that you want to copy the software image to. Slot numbers range from 0 to 11 for the Cisco 12012 router and 0 to 7 for the Cisco 12008 router. If you do not specify a slot number, the Cisco IOS software image is downloaded on all line cards. "
        },
        {
            "Parameters": " **system** ",
            "Info": " Loads the image from the software image on the GRP card. "
        }
    ],
    "Examples": [
        [
            "In the following example, the Cisco IOS software image in slot 0 is downloaded to the line card in slot 10. This software image is used when the system is booted, a line card is inserted or removed, or the microcode reload global configuration command is issued.",
            "```",
            "Router(config)# microcode oc3-POS-4 flash slot0:fip.v141-7 10",
            "```",
            "```",
            "Router(config)# microcode reload 10",
            "```",
            "```",
            "```",
            "In this example, the user would issue the execute-on slot 10 show versioncommand to verify that the correct version is loaded."
        ]
    ],
    "ExtraInfo": "In addition to the Cisco IOS image that resides on the GRP card, each line card on a Cisco 12000 series has a Cisco IOS image. When the router is reloaded, the specified image is loaded onto the GRP card and then automatically downloaded to all the line cards.Normally, you want the same Cisco IOS image on the GRP card and all line cards. However, if you want to upgrade a line card with a new version of microcode for testing or to fix a defect, you might need to load a Cisco IOS image that is different from the one on the line card. Additionally, you might need to load a new image on the line card to work around a problem that is affecting only one of the line cards.To load a Cisco IOS image on a line card, first use the **copy tftp** command to download the Cisco IOS image to a slot on one of the PCMCIA Flash memory cards. Then use the **microcode** command to download the image to the line card, followed by the **microcode reload** command to start the image. Immediately after you enter the **microcode reload** command and press Return, the system reloads all microcode. Global configuration mode remains enabled. After the reloading is complete, enter the **exit** command to return to the EXEC system prompt.To verify that the correct image is running on the line card, use the **execute-on slot** *slot* **show version** command.For additional information on GSR configuration, refer to the documentation specific to your Cisco IOS software release.",
    "RelatedCmds": [
        {
            "cmd": " **microcode reload (12000)** ",
            "description": " Reloads microcode on Cisco 12000 series GSRs. "
        }
    ]
}