{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "mode",
    "FuncDef": [
        "To set the redundancy mode, use the **mode**command in redundancy configuration mode. "
    ],
    "CLIs": [
        "Syntax for 12.2S Release",
        "mode { rpr | rpr-plus | sso }",
        "Syntax for Cisco IOS XE Release 2.5 and Later Releases",
        "mode { rpr | sso }",
        "Syntax for 12.2XNE Release",
        "mode sso"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **rpr** ",
            "Info": " Specifies Route Processor Redundancy (RPR) mode. "
        },
        {
            "Parameters": " **rpr-plus** ",
            "Info": " Specifies Route Processor Redundancy Plus (RPR+) mode. "
        },
        {
            "Parameters": " **sso** ",
            "Info": " Specifies stateful switchover (SSO) mode. "
        }
    ],
    "Examples": [
        [
            "```",
            "Router(config)# redundancy",
            "```",
            "```",
            "Router(config-red)# mode rpr-plus",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "Router(config)# redundancy",
            "```",
            "```",
            "Router(config-red)# mode sso",
            "```"
        ]
    ],
    "ExtraInfo": "Cisco IOS Release 12.2S and 7600 Series RoutersSSO is not supported on Cisco 7600 series routers that are configured with a Supervisor Engine 2.On releases prior to Release 12.2(17d)SXB, single router mode (SRM) with SSO redundancy does not support stateful switchover for multicast traffic. When a switchover occurs, all multicast hardware switching entries are removed and are then re-created and reinstalled in the hardware by the newly active multilayer switch feature card (MSFC).SRM/SSO is supported in the following releases only:•![](/c/dam/en/us/td/i/templates/blank.gif)Release 12.2(17b)SXA and subsequent rebuilds.•![](/c/dam/en/us/td/i/templates/blank.gif)Release 12.2(17d)SXB and subsequent rebuilds.Nonstop forwarding (NSF) with SSO redundancy mode supports IPv4. NSF with SSO redundancy mode does not support IPv6, Internetwork Packet Exchange (IPX), and Multiprotocol Label Switching (MPLS).If you have configured MPLS on the Cisco 7600 series routers with redundant supervisor engines, you must configure the Cisco 7600 series router in RPR mode. The switch should not be running in the default mode of SSO.Enter the **redundancy** command in global configuration mode to enter redundancy configuration mode. You can enter the **mode**command within redundancy configuration mode.Follow these guidelines when configuring your system for RPR+ mode:•![](/c/dam/en/us/td/i/templates/blank.gif)You must install compatible images on the active and standby supervisor engines to support RPR+ mode and SSO mode.•![](/c/dam/en/us/td/i/templates/blank.gif)Both supervisor engines must run the same Cisco IOS software version.•![](/c/dam/en/us/td/i/templates/blank.gif)Any modules that are not online at the time of a switchover are reset and reloaded on a switchover.•![](/c/dam/en/us/td/i/templates/blank.gif)The Forwarding Information Base (FIB) tables are cleared on a switchover. As a result, routed traffic is interrupted until route tables reconverge.The standby supervisor engine reloads on any change of mode and begins to work in the current mode. When you use this command to force the standby supervisor engine to run as a Distributed Forwarding Card (DFC) card, the uplink ports in the standby engine continue to be in use and are not disabled.Cisco IOS Release XE Release 2.5 and ASR 1000 Series RoutersFor Cisco ASR 1002 and 1004 routers, RRP and stateful switchover can be used to switch between Cisco IOS processes. RPR and SSO need to be configured by the user, however, because a second Cisco IOS process is not available by default on Cisco ASR 1002 and 1004 routers. Enter the **redundancy** command in global configuration mode to enter redundancy configuration mode. You can enter the **mode**command within redundancy configuration mode.The Cisco ASR 1006 Router supports a second Route Processor. The second Cisco IOS process can run only on the standby Route Processor. This means that hardware redundancy is available and RPR and SSO do not need to be configured by the user because a second Cisco IOS process is available by default on the Cisco ASR 1006 router.RPR+ mode is not supported on the Cisco ASR 1000 Series Routers.Cisco IOS Release 12.2XNE and 1000 Series RoutersEnter the **redundancy** command in global configuration mode to enter redundancy configuration mode. You can enter the **mode**command within redundancy configuration mode.RPR mode is not supported on the Cisco 10000 router.",
    "RelatedCmds": [
        {
            "cmd": " **redundancy** ",
            "description": " Enters redundancy configuration mode. "
        },
        {
            "cmd": " **redundancy force-switchover** ",
            "description": " Forces a switchover from the active to the standby supervisor engine. "
        },
        {
            "cmd": " **route-converge-interval** ",
            "description": " Configures the time interval after which the old FIB entries are purged. "
        },
        {
            "cmd": " **show redundancy** ",
            "description": " Displays RF information. "
        },
        {
            "cmd": " **show running-config** ",
            "description": " Displays the status and configuration of the module or Layer 2 VLAN. "
        }
    ]
}