{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "warm-reboot",
    "FuncDef": [
        "To enable a router to do a warm-reboot, use the **warm-reboot** command in global configuration mode. To disable warm rebooting, use the **no** form of this command. "
    ],
    "CLIs": [
        "warm-reboot [ count <number> ] [ uptime <minutes> ]",
        "no warm-reboot count <number> uptime <minutes>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **count** *number* ",
            "Info": " (Optional) Maximum number of warm reboots allowed between any intervening cold reboot. Valid values range from 1 to 50. The default value is 5 times. "
        },
        {
            "Parameters": " **uptime** *minutes* ",
            "Info": " (Optional) Minimum number of minutes that must elapse between initial system configuration and an exception before a warm reboot is attempted. If the system crashes before the specified time elapses, a warm reboot is not attempted. Valid values range from 0 to 120. The default value is 5 minutes. "
        }
    ],
    "Examples": [
        [
            "The following example shows how to enable a warm reboot on the router:",
            "```",
            "Router#(config) warm-reboot count 10 uptime 10",
            "```"
        ]
    ],
    "ExtraInfo": "Use the **warm-reboot** command to enable the router to reload a Cisco IOS image without ROM monitor mode (ROMMON) intervention, in which the image restores read-write data from a previously saved copy in the RAM and starts execution from that point. Unlike a cold reboot, this process does not involve a flash to RAM copy or self-decompression of the image.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)After a warm reboot is enabled, it will not become active until after the next cold reboot because a warm reboot requires a copy of the initialized memory.---![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)If the system crashes before the image completes the warm reboot process, a cold reboot is initiated.---",
    "RelatedCmds": [
        {
            "cmd": " **show warm-reboot** ",
            "description": " Displays the statistics for attempted warm reboots. "
        }
    ]
}