{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "write core",
    "FuncDef": [
        "To test the configuration of a core dump setup, use the **write core** command in privileged EXEC mode. "
    ],
    "CLIs": [
        "write core [ <hostname> [ LINE ] | <destination-address> [ LINE ] ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *hostname* ",
            "Info": " (Optional) Host name of the remote server where the core dump file is to be written. "
        },
        {
            "Parameters": " **LINE** ",
            "Info": " (Optional) Assigns the name \"LINE\" to the core dump file. "
        }
    ],
    "Examples": [
        [
            "The following example shows how to test the configuration of a core dump setup. In this example, the core dump file is written to the remote server with the host name test.",
            "```",
            "write core test",
            "```"
        ]
    ],
    "ExtraInfo": "When a router reloads, it is sometimes useful to obtain a full copy of the memory image (called a core dump) to identify the cause of the reload. Core dumps are generally useful to your technical support representative. Not all types of router reloads will produce a core dump.The **write core** command causes the router to generate a core dump without reloading, which may be useful if the router is malfunctioning but has not reloaded. The core dump files will be the size of the respective memory regions. It is important to remember that the entire memory region is dumped, not just the memory that is in use.![](/c/dam/en/us/td/i/templates/caut.gif)---**Caution** ![](/c/dam/en/us/td/i/templates/blank.gif)Use the**write core** command only under the direction of a technical support representative. Creating a core dump while the router is functioning in a network can disrupt network operation. When using this command, the router will not reload until the content of its memory is dumped. This event might take some time, depending on the amount of DRAM present on the router. Also, the resulting binary file, which is very large, must be transferred to a Trivial File Transfer Protocol (TFTP), File Transfer Protocol (FTP), or remote copy protocol (rcp) server and subsequently interpreted by technical personnel who have access to source code and detailed memory maps.---Depending on your TFTP server, you might need to create an empty target file to which the router can write the core dump.",
    "RelatedCmds": []
}