{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "reload",
    "FuncDef": [
        "To reload the operating system, use the **reload** command in privileged EXEC or diagnostic mode. "
    ],
    "CLIs": [
        "reload [ /verify | /noverify ] [ [ warm file ] [ line | in [ <hhh>:<mm> | <mmm> [ <text> ] ] | at <hh>:<mm> [ <day> <month> ] [ <text> ] ] | reason [ <reason-string> ] | cancel ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **/verify** ",
            "Info": " (Optional) Verifies the digital signature of the file that will be loaded onto the operating system. "
        },
        {
            "Parameters": " **/noverify** ",
            "Info": " (Optional) Does not verify the digital signature of the file that will be loaded onto the operating system.  **Note** This keyword is often issued if the **file verify auto** command is enabled, which automatically verifies the digital signature of all images that are copied. "
        },
        {
            "Parameters": " **line** ",
            "Info": " (Optional) Reason for reloading; the string can be from 1 to 255 characters long. "
        },
        {
            "Parameters": " **in** *hhh*:*mm* *",
            "Info": "* *mmm* "
        },
        {
            "Parameters": " *text* ",
            "Info": " (Optional) Reason for reloading; the string can be from 1 to 255 characters long. "
        },
        {
            "Parameters": " **at** *hh*:*mm* ",
            "Info": " (Optional) Schedules a reload of the software to take place at the specified time (using a 24-hour clock). If you specify the month and day, the reload is scheduled to take place at the specified time and date. If you do not specify the month and day, the reload takes place at the specified time on the current day (if the specified time is later than the current time) or on the next day (if the specified time is earlier than the current time). Specifying 00:00 schedules the reload for midnight. The reload must take place within 24 days. "
        },
        {
            "Parameters": " *day* ",
            "Info": " (Optional) Number of the day in the range from 1 to 31. "
        },
        {
            "Parameters": " **reason** *reason-string* ",
            "Info": " (Optional) Specifies a reason for reloading. "
        },
        {
            "Parameters": " **cancel** ",
            "Info": " (Optional) Cancels a scheduled reload. "
        }
    ],
    "Examples": [
        [
            "The following example shows how to immediately reload the software on the router:",
            "```",
            "Router# reload",
            "```",
            "```",
            "```",
            "The following example shows how to reload the software on the router in 10 minutes:",
            "```",
            "Router# reload in 10",
            "```",
            "```",
            "```",
            "```",
            "Router# Reload scheduled for 11:57:08 PDT Fri Apr 21 1996 (in 10 minutes)",
            "```",
            "```",
            "Proceed with reload? [ confirm ]",
            "```",
            "```",
            "```",
            "The following example shows how to reload the software on the router at 1:00 p.m. on that <day>:",
            "```",
            "Router# reload at 13:00",
            "```",
            "```",
            "```",
            "```",
            "Router# Reload scheduled for 13:00:00 PDT Fri Apr 21 1996 (in 1 hour and 2 minutes)",
            "```",
            "```",
            "Proceed with reload? [ confirm ]",
            "```",
            "```",
            "```",
            "The following example shows how to reload the software on the router on April 21 at 2:00 a.m.:",
            "```",
            "Router# reload at 02:00 apr 21",
            "```",
            "```",
            "```",
            "```",
            "Router# Reload scheduled for 02:00:00 PDT Sat Apr 21 1996 (in 38 hours and 9 minutes)",
            "```",
            "```",
            "Proceed with reload? [ confirm ]",
            "```",
            "```",
            "```",
            "The following example shows how to cancel a pending reload:",
            "```",
            "Router# reload cancel",
            "```",
            "```",
            "```",
            "```",
            "%Reload cancelled.",
            "```",
            "```",
            "```",
            "The following example shows how to perform a warm reboot at 4:00 a.m. on that <day>:",
            "`Router#`reload warm at 04:00",
            "The following example shows how to specify a reason for the reload:",
            "`Router#`reload reason <reloaded with updated version>",
            "The following example shows how to specify image verification via the /verify keyword before reloading an image onto the router:",
            "```",
            "Router# reload /verify",
            "```",
            "```",
            "```",
            "```",
            "Verifying file integrity of bootflash:c7200-kboot-mz.121-8a.E",
            "```",
            "```",
            "%ERROR:Signature not found in file bootflash:c7200-kboot-mz.121-8a.E.",
            "```",
            "```",
            "Signature not present. Proceed with verify? [ confirm ]",
            "```",
            "```",
            "Verifying file disk0:c7200-js-mz",
            "..........................................................................",
            "```",
            "```",
            "............................................................Done!",
            "```",
            "```",
            "Embedded Hash MD5 :CFA258948C4ECE52085DCF428A426DCD",
            "```",
            "```",
            "Computed Hash MD5 :CFA258948C4ECE52085DCF428A426DCD",
            "```",
            "```",
            "CCO Hash MD5 :44A7B9BDDD9638128C35528466318183",
            "```",
            "```",
            "Signature Verified",
            "```",
            "```",
            "```",
            "```",
            "Proceed with reload? [ confirm ] n",
            "```"
        ]
    ],
    "ExtraInfo": "The **reload** command halts the system. If the system is set to restart on error, it reboots itself. Use the **reload** command after configuration information is entered into a file and saved to the startup configuration.You cannot reload from a virtual terminal if the system is not set up for automatic booting. This restriction prevents the system from using an image stored in the ROM monitor and taking the system out of the remote user's control.If you modify your configuration file, the system prompts you to save the configuration. During a save operation, the system prompts whether you want to proceed with the save if the CONFIG\\_FILE variable points to a startup configuration file that no longer exists. If you respond \"yes\" in this situation, the system enters setup mode upon reload.When you schedule a reload to occur at a later time (using the **in** keyword), it must take place within 24 days.The **at** keyword can be used only if the system clock has been set on the router (either through Network Time Protocol [NTP], the hardware calendar, or manually). The time is relative to the configured time zone on the router. To schedule reloads across several routers to occur simultaneously, synchronize the time on each router with NTP.When you specify the reload time using the **at** keyword, if you specify the month and day, the reload takes place at the specified time and date. If you do not specify the month and day, the reload takes place at the specified time on the current day (if the specified time is later than the current time), or on the next day (if the specified time is earlier than the current time). Specifying 00:00 schedules the reload for midnight. The reload must take place within 24 days.To display information about a scheduled reload, use the **show reload** command. The /verify and /noverify KeywordsIf the /**verify** keyword is specified, the integrity of the image will be verified before it is reloaded onto a router. If verification fails, the image reload will not occur. Image verification is important because it assures the user that the image is protected from accidental corruption, which can occur at any time during transit, starting from the moment the files are generated by Cisco until they reach the user.The **/noverify** keyword overrides any global automatic image verification that may be enabled via the **file verify auto** command.The warm KeywordIf you issue the **reload** command after you have configured the **warm-reboot** global configuration command, a cold reboot will occur. Thus, if you want to reload your system, but do not want to override the warm reboot functionality, you should specify the **warm** keyword with the **reload** command. The warm reboot functionality allows a Cisco IOS image to reload without ROM monitor intervention. That is, read-write data is saved in RAM during a cold startup and restored during a warm reboot. Warm rebooting allows the router to reboot quicker than conventional rebooting (where control is transferred to ROM monitor and back to the image) because nothing is copied from flash to RAM.",
    "RelatedCmds": [
        {
            "cmd": " **copy system:running-config nvram:startup-config** ",
            "description": " Copies any file from a source to a destination. "
        },
        {
            "cmd": " **file verify auto** ",
            "description": " Enables automatic image verification. "
        },
        {
            "cmd": " **show reload** ",
            "description": " Displays the reload status on the router. "
        },
        {
            "cmd": " **warm-reboot** ",
            "description": " Enables router reloading with reading images from storage. "
        }
    ]
}