{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "request platform software process release",
    "FuncDef": [
        "To restart processes that have been placed in the hold down state by the Process Manager on the Cisco ASR 1000 Series Routers, use the **request platform software process release** command in privileged EXEC or diagnostic mode. "
    ],
    "CLIs": [
        "request platform software process release <slot> all"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *slot* ",
            "Info": " Specifies the hardware slot. Options include:  •*number*—The number of the SIP slot of the hardware module where the trace level is being set. For instance, if you wanted to specify the SIP in SIP slot 2 of the router, enter 2 as the *number*.  •**f0**—The ESP in ESP slot 0.  •f1—The ESP in ESP slot 1  •**fp active**—The active ESP.  •**fp standby**—The standby ESP.  •**r0**—The RP in RP slot 0.  •r1—The RP in RP slot 1.  •**rp active**—The active RP.  •**rp standby**—The standby RP. "
        },
        {
            "Parameters": " **all** ",
            "Info": " Specifies that all processes currently in the holddown state within the selected slot will be restarted. "
        }
    ],
    "Examples": [
        [
            "In the following example, this command is entered to restart any process currently on RP 0 in the holddown state:",
            "```",
            "request platform software process release r0 all",
            "```"
        ]
    ],
    "ExtraInfo": "This command is used to restart processes in the holddown state. If a process is in the holddown state, a console message is generated to notify the user that the process is helddown.Before placing any process in the holddown state, the Process Manager makes up to 5 attempts over 120 seconds to enable the process. These attempts to enable the process also happen automatically at startup. If the Process Manager is unable to enable the process after these attempts, the process will then be placed in the holddown state.When this command is entered, it only attempts to restart processes currently in the holddown state. Active processes will not be affected by entering this command.",
    "RelatedCmds": []
}