{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "request platform software system shell",
    "FuncDef": [
        "To request platform shell access, use the **request platform software system shell** command in privileged EXEC mode. "
    ],
    "CLIs": [
        "request platform software system shell [ rp | esp | sip ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *rp* ",
            "Info": " Specifies the Route Processor (RP); it can be either active or standby. "
        }
    ],
    "Examples": [
        [
            "In the following example, a request to theplatform shell is made",
            "```",
            "Router(config)# platform shell",
            "```",
            "```",
            "Router(config)# exit",
            "```",
            "```",
            "Router# request platform software shell system",
            "```",
            "```",
            "Activity within this shell can jeopardize the functioning of the system.",
            "```",
            "```",
            "Are you sure you want to continue? [ y/n ] y",
            "```",
            "```",
            "",
            "```",
            "```",
            "Activity within this shell can jeopardize the functioning",
            "```",
            "```",
            "of the system.",
            "```",
            "```",
            "Use this functionality only under supervision of Cisco Support.",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "The platform shell command needs to be entered before before using the request platform software system shell command. Providing shell access would not be necessary. However, there might be some cases where the command may not be available, or the IOS process hangs, or IOS console may not be available. In such cases, you can login to the shell and see the status of the system.The shell should be accessed under Cisco supervision, and no support is provided if accessed without supervision. The following message is displayed , before the shell access is granted:\"Activity within this shell can jeopardize the functioning of the system.Use this functionality only under supervision of Cisco Support.\"",
    "RelatedCmds": [
        {
            "cmd": " **platform shell** ",
            "description": " Grants shell and enters shell access grant configuration mode. "
        }
    ]
}