{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "request platform software vty attach",
    "FuncDef": [
        "To enter EXEC mode on a router after persistent SSH or persistent Telnet is configured to connect to the router in diagnostic mode, use the **request platform software vty attach** command in diagnostic mode. "
    ],
    "CLIs": [
        "request platform software vty attach [ permanent ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **permanent** ",
            "Info": " (Optional) Specifies that the router should not return to diagnostic mode if EXEC mode is exited. "
        }
    ],
    "Examples": [
        [
            "In the following example, this command is used to leave diagnostic mode and enter privileged EXEC mode:",
            "```",
            "Router(diag)# request platform software vty attach",
            "```",
            "```",
            "Router#",
            "```",
            "```",
            "```",
            "In the following example, this command is used to leave diagnostic mode and enter privileged EXEC mode. The user then re-enters diagnostic mode by exiting privileged EXEC mode:",
            "```",
            "Router(diag)# request platform software vty attach",
            "```",
            "```",
            "Router# exit",
            "Router(diag)#",
            "```",
            "```",
            "```",
            "In the following example, this command is used with the permanent option to leave diagnostic mode and enter privileged EXEC mode. The user then exits the router by exiting privileged EXEC mode:",
            "```",
            "Router(diag)# request platform software vty attach permanent",
            "```",
            "```",
            "Router# exit",
            "```",
            "```",
            "Connection to Router closed.",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "If persistent Telnet or persistent SSH is configured to make users wait for an IOS vty line before allowing them to access the IOS CLI, this command can be used to attach to an IOS vty line and place the user in EXEC mode. Exiting EXEC mode returns the user to diagnostic mode unless the **permanent** keyword is entered. When the **permanent** keyword is entered, exiting EXEC mode exits the router.The vty lines must be configured to allow local login for this command to work. The vty lines must also be configured to accept the type of transport traffic (SSH or Telnet) being used to connect to the router for the session in which the **request platform software vty attach** command is entered.",
    "RelatedCmds": []
}