{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "request platform software package install rollback",
    "FuncDef": [
        "To roll back a previous software upgrade, use the **request platform software package install rollback** command in privileged EXEC or diagnostic mode. "
    ],
    "CLIs": [
        "request platform software package install rp <rp-slot-number> rollback [ as-booted < | > provisioning-file <provisioning-file-URL> ] [ force ] [ on-reboot ] [ verbose ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **as-booted** ",
            "Info": " Specifies that the software update will not occur, and that the router will instead boot using the same procedure that it used during the last bootup. "
        },
        {
            "Parameters": " **provisioning-file** *provisioning-file-URL* ",
            "Info": " Specifies that the software update will not occur, and that the router will instead boot using the specified provisioning file. "
        },
        {
            "Parameters": " **verbose** ",
            "Info": " Displays verbose information, meaning all output that can be displayed on the console during the process will be displayed. "
        }
    ],
    "Examples": [
        [
            "In the following example, an upgrade that was using a rollback timer is rolled back to the previous configuration instead of upgraded:",
            "```",
            "request platform software package install rp 0 rollback",
            "```"
        ]
    ],
    "ExtraInfo": "This command rolls back a configuration that has an active rollback timer. Active rollback timers are used when the **auto-rollback** option is entered when software is being upgraded using the **request platform software package install file** command.",
    "RelatedCmds": [
        {
            "cmd": " **request platform software package install commit** ",
            "description": " Cancel the rollback timer and commits a software upgrade. "
        },
        {
            "cmd": " **request platform software package install file** ",
            "description": " Upgrades a consolidated package or an individual sub-package. "
        }
    ]
}