{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "network-clock select",
    "FuncDef": [
        "To name a source to provide timing for the network clock and to specify the selection priority for this clock source, use the **network**-**clock** **select** command in global configuration mode. To cancel the network clock selection, use the **no** form of this command. "
    ],
    "CLIs": [
        "Cisco ASR 1000 Series",
        "network-clock select <priority> [ bits [ R0 | R1 ] { e1 [ crc4 | no-crc4 | unframed ] | t1 [ esf | sf | unframed ] } | controller <type number> | global | interface <type number> | local | system ]",
        "no network-clock select <priority> [ global | local ]",
        "Cisco 7600 Series and Cisco 10000 Series",
        "network-clock select <priority> { controller <type number> | interface <type number> | slot <number> | system } [ global | local ]",
        "no network-clock select <priority> [ global | local ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *priority* ",
            "Info": " Selection priority for the clock source (1 is the highest priority). The range is 1 to 6.  The clock with the highest priority is selected to drive the system time division multiplexing (TDM) clocks. When the higher-priority clock source fails, the next-higher-priority clock source is selected. "
        },
        {
            "Parameters": " **bits** ",
            "Info": " (Optional) Derives network timing from the central office (CO) Building Integrated Timing Supply (BITS) clock. "
        },
        {
            "Parameters": " **R0** ",
            "Info": " (Optional) Specifies Route Processor 0 BITS as the source slot. "
        },
        {
            "Parameters": " **R1** ",
            "Info": " (Optional) Specifies Route Processor 1 BITS as the source slot. "
        },
        {
            "Parameters": " **e1** ",
            "Info": " (Optional) Configures the BITS interface to use an E1 connection. "
        },
        {
            "Parameters": " **crc4** ",
            "Info": " (Optional) Configures the E1 BITS interface framing with Cyclic Redundancy Check 4 (CRC4). "
        },
        {
            "Parameters": " **no-crc4** ",
            "Info": " (Optional) Configures the E1 BITS interface framing with no CRC4. "
        },
        {
            "Parameters": " **unframed** ",
            "Info": " (Optional) Configures the BITS interface with clear channel. "
        },
        {
            "Parameters": " **t1** ",
            "Info": " (Optional) Configures the BITS interface to use a T1 connection. "
        },
        {
            "Parameters": " **esf** ",
            "Info": " (Optional) Configures the T1 BITS interface with the Extended Super Frame (ESF) framing standard. "
        },
        {
            "Parameters": " **sf** ",
            "Info": " (Optional) Configures the T1 BITS interface with the Super Frame (SF) framing standard. "
        },
        {
            "Parameters": " **controller** *type number* ",
            "Info": " Specifies the controller to be the clock source. "
        },
        {
            "Parameters": " **interface** *type number* ",
            "Info": " Specifies the interface to be the clock source. "
        },
        {
            "Parameters": " **slot** *number* ",
            "Info": " Specifies the slot to be the clock source. The range is 1 to 6. "
        },
        {
            "Parameters": " **global** ",
            "Info": " (Optional) Configures the source as global. "
        },
        {
            "Parameters": " **local** ",
            "Info": " (Optional) Configures the source as local. "
        },
        {
            "Parameters": " **system** ",
            "Info": " Specifies the system clock as the clock source. "
        }
    ],
    "Examples": [
        [
            "The following example shows how to configure the network clock as revertive and assign clock sources to two priorities:",
            "```",
            "Router> enable",
            "```",
            "```",
            "Router# configure terminal",
            "```",
            "```",
            "Router(config)# network-clock revertive",
            "```",
            "```",
            "Router(config)# network-clock select 1 bits R0 e1",
            "```",
            "```",
            "Router(config)# network-clock select 2 interface GigabitEthernet 0/0/1",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "When an active clock source fails, the system chooses the next-lower-priority clock source that is specified by this command. When a higher-priority clock source becomes available, the system automatically reselects it.You can specify up to five clock priorities. The highest-priority active interface in the router supplies the primary reference source to all other interfaces that require network clock synchronization services.For timing sources, the Route Processor can receive timing information through its BITS interface or through a TDM-based Shared Port Adapter (SPA). For some telecommunications deployments, BITS clocking is required to provide global clocking synchronization of network equipment in the end-to-end data path. A BITS clock can be supplied to the network clock module using a T1 or E1 connection.If a controller is specified in the clock source hierarchy, you must configure that controller for line timing (by using the appropriate **clock source line** command for the controller). Any controller that is not currently acting as the clock source will automatically operate in loop timing mode. Both controllers can be given different clock source priority values. For more information, see the [Cisco IOS Interface and Hardware Component Command Reference](http://www.cisco.com/en/US/docs/ios/interface/command/reference/ir_book.html).![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)To minimize backplane clock shifts, the **no network-clock select** command does not take effect until you return to EXEC mode by entering **exit** or **end**. This process minimizes the number of times that clock sources are configured.---Use the **show network-clocks** command to display clock priorities that are configured on the router.",
    "RelatedCmds": [
        {
            "cmd": " **network-clock-participate** ",
            "description": " Configures a network module to participate in network clocking. "
        },
        {
            "cmd": " **network-clock-switch** ",
            "description": " Configures the switch delay time to the next-priority network clock source when the current network clock source fails or a higher-priority clock source is up and available. "
        },
        {
            "cmd": " **show network-clocks** ",
            "description": " Displays the network clock configuration and current primary clock source. "
        }
    ]
}