{
    "PageTitle": "display igmp group",
    "FuncDef": "The display igmp group ssm-mapping command displays information about multicast groups for which source-specific multicast (SSM) mapping rules are configured using the ssm-mapping command.\nThe display igmp group command displays information about IGMP groups, including multicast groups that hosts dynamically join by sending Report messages and multicast groups to which hosts are statically added by using commands. The display igmp group ssm-mapping command displays information about multicast groups for which source-specific multicast (SSM) mapping rules are configured using the ssm-mapping command. The display igmp group command displays information about IGMP groups, including multicast groups that hosts dynamically join by sending Report messages and multicast groups to which hosts are statically added by using commands.",
    "CLIs": [
        "display igmp group [ <group-address> | interface { <interface-type> <interface-number> | <interface-name> } ] [ ssm-mapping ] [ verbose ]",
        "display igmp { vpn-instance <vpn-instance-name> | all-instance } group [ <group-address> | interface { <interface-type> <interface-number> | <interface-name> } ] [ ssm-mapping ] [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-address>",
            "Info": "Displays configurations and running information about IGMP groups that have the specified group address.\ngroup-address specifies a multicast group address.\nThe value ranges from 224.0.0.0 to 239.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Displays configurations and running information about IGMP groups that a specified interface joins.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Displays configurations and running information about IGMP groups that a specified interface joins.\n-"
        },
        {
            "Parameters": "ssm-mapping",
            "Info": "Specifies information about multicast groups for which source-specific multicast (SSM) mapping rules are configured using the ssm-mapping command.\n-"
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed configurations and running information about IGMP groups that hosts dynamically join or the IGMP groups to which hosts are statically added.\n-"
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Displays configurations and running information about IGMP groups in a specified VPN instance.\nvpn-instance-name specifies a VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "all-instance",
            "Info": "Displays configurations and running information about IGMP groups in all instances.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display igmp group"
        ],
        [
            "<HUAWEI> display igmp group ssm-mapping"
        ],
        [
            "<HUAWEI> display igmp group ssm-mapping verbose"
        ],
        [
            "<HUAWEI> display igmp group"
        ],
        [
            "<HUAWEI> display igmp group verbose"
        ]
    ],
    "ExtraInfo": "If a host wants to receive multicast data for a multicast group, the host must join the multicast group. Either of the following modes can be used to enable a host to join a multicast group:"
}