{
    "PageTitle": "igmp access-limit",
    "FuncDef": "The igmp access-limit command sets the maximum number of IGMP group memberships that can be created on an interface.\nThe undo igmp access-limit command cancels the setting. The igmp access-limit command sets the maximum number of IGMP group memberships that can be created on an interface. The undo igmp access-limit command cancels the setting. By default, the maximum number of IGMP group memberships on an interface is not configured.",
    "CLIs": [
        "igmp access-limit <number> except { <acl-number> | acl-name <acl-name> }",
        "igmp access-limit <number>",
        "undo igmp access-limit"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<number>",
            "Info": "Specifies the maximum number of IGMP entries that can be created on an interface.\nThe value is an integer ranging from 1 to 16384."
        },
        {
            "Parameters": "except",
            "Info": "Specifies an unrestricted ACL rule.\n-"
        },
        {
            "Parameters": "<acl-number>",
            "Info": "Specifies the number of a basic or an advanced ACL.\nThe value is an integer.\nThe value ranging from 2000 to 2999 specifies a basic ACL. A basic ACL filters group addresses, without distinguishing between (*, G) and (S, G) entries.The value ranging from 3000 to 3999 specifies an advanced ACL. An advanced ACL filters only (S, G) entries on an interface."
        },
        {
            "Parameters": "acl-name <acl-name>",
            "Info": "Specifies the name of a named ACL.\nThe value is a string of 1 to 32 case-sensitive characters. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] vlan 1",
            "[*HUAWEI-vlan1] quit",
            "[*HUAWEI] interface Vlanif 1",
            "[*HUAWEI-Vlanif1] igmp access-limit 1024"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] acl name myacl",
            "[*HUAWEI-acl4-advance-myacl] rule permit ip source 1.1.1.1 0 destination 232.0.0.0 0.0.255.255",
            "[*HUAWEI-acl4-advance-myacl] quit",
            "[*HUAWEI] vlan 1",
            "[*HUAWEI-vlan1] quit",
            "[*HUAWEI] interface Vlanif 1",
            "[*HUAWEI-Vlanif1] igmp access-limit 1024 except acl-name myacl"
        ]
    ],
    "ExtraInfo": "When a large number of multicast users request multiple programs simultaneously, excessive bandwidth resources will be exhausted, and the Router's performance will be degraded, deteriorating the multicast service quality. To prevent this issue, run the igmp access-limit command on a Router interface to limit the number of IGMP entries. When receiving an IGMP Join message from a user, the Router interface first checks whether the configured maximum number of IGMP entries is reached. If the maximum number is reached, the Router interface discards the IGMP Join message and rejects the user. If the maximum number is not reached, the Router interface sets up an IGMP membership and forwards data flows of the requested multicast group to the user. This mechanism enables users who have successfully joined multicast groups to enjoy smoother multicast services.\nThe principles of counting the number of IGMP entries are as follows:"
}