{
    "PageTitle": "igmp lastmember-queryinterval",
    "FuncDef": "The igmp lastmember-queryinterval command sets the interval at which an IGMP querier sends IGMP last-member query messages after it receives an IGMP Leave message from a host.\nThe undo igmp lastmember-queryinterval command restores the default setting. The igmp lastmember-queryinterval command sets the interval at which an IGMP querier sends IGMP last-member query messages after it receives an IGMP Leave message from a host. The undo igmp lastmember-queryinterval command restores the default setting. By default, an IGMP querier sends IGMP last-member query messages at an interval of 1s.",
    "CLIs": [
        "igmp lastmember-queryinterval <interval>",
        "undo igmp lastmember-queryinterval"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,Loopback interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interval>",
            "Info": "Specifies an interval at which an IGMP querier sends IGMP last-member query messages.\nThe value is an integer ranging from 1 to 5, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] vlan 1",
            "[*HUAWEI-vlan1] quit",
            "[*HUAWEI] interface Vlanif 1",
            "[*HUAWEI-Vlanif1] igmp lastmember-queryinterval 3"
        ]
    ],
    "ExtraInfo": "If multiple multicast devices are connected to a shared network segment where user hosts reside, these multicast devices automatically elect a unique querier. The querier maintains IGMP group memberships by sending IGMP query messages. To set the interval at which IGMP last-member query messages are sent, run the igmp lastmember-queryinterval command.\nThe igmp lastmember-queryinterval command is valid only when the querier runs IGMPv2 or IGMPv3. A last-member query is also known as a group-specific query. IGMPv3 also supports source/group-specific queries."
}