{
    "PageTitle": "port (Monitor link group view)",
    "FuncDef": "The port command adds an interface to a Monitor Link group and specifies the interface as an uplink or downlink interface.\nThe undo port command deletes an uplink or downlink interface from a Monitor Link group. The port command adds an interface to a Monitor Link group and specifies the interface as an uplink or downlink interface. The undo port command deletes an uplink or downlink interface from a Monitor Link group. By default, no interface is added to a Monitor Link group.",
    "CLIs": [
        "port { <interface-type> <interface-number> | <interface-name> } { uplink | downlink [ <downlink-id> ] }",
        "undo port { { [ <interface-type> <interface-number> | <interface-name> ] { uplink | downlink <downlink-id> } } | all }"
    ],
    "ParentView": [
        "Monitor link group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies an interface to be added to a Monitor Link group.\ninterface-type specifies the type of the interface.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies an interface to be added to a Monitor Link group.\ninterface-number specifies the number of the interface.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the interface to be added to a Monitor Link group.\ninterface-type specifies the name of an interface.\n-"
        },
        {
            "Parameters": "uplink",
            "Info": "Specifies the interface as an uplink interface.\n-"
        },
        {
            "Parameters": "downlink <downlink-id>",
            "Info": "Specifies the interface as a downlink interface and the downlink interface number.\nThe value is an integer ranging from 1 to 512. If you do not specify <downlink-id>, the downlink interface number is assigned based on the configuration order."
        },
        {
            "Parameters": "all",
            "Info": "Deletes all member interfaces from a Monitor Link group.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] monitor-link group 1",
            "[*HUAWEI-mtlk-group1] port 100GE1/0/1 downlink 1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] monitor-link group 1",
            "[*HUAWEI-mtlk-group1] port 100GE1/0/1 uplink"
        ]
    ],
    "ExtraInfo": "A Monitor Link group consists uplink interfaces and downlink interfaces. If all uplink interfaces fail, Monitor Link sets the downlink interfaces to Down. After configuring a Monitor Link group, run the port command to add uplink and downlink interfaces to the Monitor Link group. Monitor Link checks the uplink interface in the Monitor Link group and sets the downlink interface status accordingly."
}