{
    "PageTitle": "ssh client assign",
    "FuncDef": "The ssh client assign pki command binds a PKI realm to an SSH client.\nThe undo ssh client assign pki command unbinds a PKI realm from an SSH client.\nThe ssh client assign sm2-host-key command assigns an SM2 host key to an SSH client.\nThe undo ssh client assign sm2-host-key command deletes the SM2 host key assigned to an SSH client. The ssh client assign pki command binds a PKI realm to an SSH client. The undo ssh client assign pki command unbinds a PKI realm from an SSH client. The ssh client assign sm2-host-key command assigns an SM2 host key to an SSH client. The undo ssh client assign sm2-host-key command deletes the SM2 host key assigned to an SSH client. By default, no PKI realm is bound to an SSH client.\n\n\nBy default, no SM2 host key is assigned to an SSH client. By default, no PKI realm is bound to an SSH client. By default, no SM2 host key is assigned to an SSH client.",
    "CLIs": [
        "ssh client assign { sm2-host-key <key-name> | pki <pki-domain> }",
        "undo ssh client assign sm2-host-key",
        "undo ssh client assign pki"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<key-name>",
            "Info": "Specifies the name of an SM2 host key assigned to an SSH client.\nThe value is a string of 1 to 35 case-insensitive characters, spaces not supported. The string can contain only letters, digits, and underscores (_)."
        },
        {
            "Parameters": "pki <pki-domain>",
            "Info": "Specifies the PKI realm bound to the SSH client.\nThe value is a string of 1 to 64  case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssh client assign pki domainA"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] sm2 key-pair label sm2key001",
            "[*HUAWEI] commit",
            "[~HUAWEI] ssh client assign sm2-host-key sm2key001"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssh client assign pki default",
            "Warning: A preset certificate is loaded to the specified PKI domain. The current operation has security risks. Continue? [Y/N]:Y"
        ]
    ],
    "ExtraInfo": "When the device functions as an SSH client and uses a certificate for authentication, you can run the ssh client assign pki command to bind a PKI realm to the SSH client.\nWhen the device functions as an SSH client and uses the SM2 algorithm for authentication, you can run the ssh client assign sm2-host-key command to assign a specified SM2 key pair to the SSH client."
}