{
    "PageTitle": "ssh server authentication-type keyboard-interactive enable",
    "FuncDef": "The ssh server authentication-type keyboard-interactive enable command enables keyboard interactive authentication on an SSH server.\nThe undo ssh server authentication-type keyboard-interactive enable command disables keyboard interactive authentication on the SSH server. The ssh server authentication-type keyboard-interactive enable command enables keyboard interactive authentication on an SSH server. The undo ssh server authentication-type keyboard-interactive enable command disables keyboard interactive authentication on the SSH server. By default, keyboard interactive authentication is disabled on an SSH server.",
    "CLIs": [
        "ssh server authentication-type keyboard-interactive enable",
        "undo ssh server authentication-type keyboard-interactive enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssh server authentication-type keyboard-interactive enable"
        ]
    ],
    "ExtraInfo": "Keyboard interactive authentication is the basis of password card authentication, and password card authentication is an implementation of two-factor authentication.Two-factor authentication: It is an identity authentication method. Two identity authentication modes are used to verify the identity of a user. For example, the first authentication mode is user name and password, and the second authentication mode is a group of encrypted passwords.Password card authentication: It is an identity authentication method that uses the password generated in a certain mode to verify the user identity.To log in to the SSH server using password card authentication, keyboard interactive authentication must be enabled. The function implementation process is as follows:When an SSH user logs in to the local device, the user needs to enter the user name. After detecting that the user is a password card authentication user, the TACACS server sends the user name to the password card authentication server (a third-party device that provides the authentication password).The password card authentication server generates a challenge code (a group of encrypted passwords) based on the user name, initiates a challenge, and sends the challenge code to the TACACS server. The TACACS server displays the challenge code to the user through the local device.The user enters the password and the received challenge code. The device displays the challenge response code (another group of encrypted passwords generated based on the challenge code). The user enters the challenge response code and sends it to the password card authentication server through the TACACS server. The password card authentication server checks whether the challenge response code is correct and returns the authentication result to the user.After this function is enabled, the system prompts the user to enter the challenge response code.This function takes effect only when SSH users log in to the system in password authentication mode. To disable keyboard interactive authentication, run the undo ssh server authentication-type keyboard-interactive enable command."
}