{
    "PageTitle": "ssh ipv6 server-source",
    "FuncDef": "The ssh ipv6 server-source command specifies a source IPv6 address for an SSH server.\nThe undo ssh ipv6 server-source command cancels the specified source IPv6 address for an SSH server. The ssh ipv6 server-source command specifies a source IPv6 address for an SSH server. The undo ssh ipv6 server-source command cancels the specified source IPv6 address for an SSH server. By default, no source interface or source IPv6 address is specified for an SSH server.",
    "CLIs": [
        "ssh ipv6 server-source -a <ipv6-address> [ -vpn-instance <vpn-instance-name> ]",
        "ssh ipv6 server-source all-interface",
        "undo ssh ipv6 server-source -a <ipv6-address> [ -vpn-instance <vpn-instance-name> ]",
        "undo ssh ipv6 server-source all-interface"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "-vpn-instance <vpn-instance-name>",
            "Info": "Specifies the VPN instance of an SSH server.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "all-interface",
            "Info": "Indicates that any interface having an IP address configured can be used as the source interface of an SSH server.\n-"
        },
        {
            "Parameters": "-a <ipv6-address>",
            "Info": "Specifies the source IPv6 address of an SSH server.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] ssh ipv6 server-source -a 2001:db8::1 -vpn-instance vpn1",
            "Warning: SSH server source configuration will take effect in the next login. Do you want to continue? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "The SSH server receives login requests from all interfaces and addresses, leading to low system security. To improve system security, you can run this command to specify the source interface or IPv6 source address of the SSH server so that only authorized users can log in to the server."
}