{
    "PageTitle": "stelnet",
    "FuncDef": "The stelnet command enables the system to log in to another device from the current device through STelnet. The stelnet command enables the system to log in to another device from the current device through STelnet.",
    "CLIs": [
        "stelnet ipv6 [ -a <source-ipv6-address> ] [ -force-receive-pubkey ] <host-ipv6-address> [ [ public-net | -vpn-instance <vpn-instance-name> ] | [ -oi { <interface-name> | <interface-type> <interface-number> } ] | [ <server-port> ] | [ prefer_kex <prefer_kex> ] | [ prefer_ctos_cipher <prefer_ctos_cipher> ] | [ prefer_stoc_cipher <prefer_stoc_cipher> ] | [ prefer_ctos_hmac <prefer_ctos_hmac> ] | [ prefer_stoc_hmac <prefer_stoc_hmac> ] | [ prefer_ctos_compresszlib ] | [ prefer_stoc_compresszlib ] | [ -ki <interval> ] | [ -kc <count> ] | [ identity-key <identity-key-type> ] | [ user-identity-key <user-key> ] ]",
        "stelnet -i { <interface-name> | <interface-type> <interface-number> } [ -force-receive-pubkey ] <host-ip-address> [ <server-port> ] [ [ prefer_kex <prefer_kex> ] | [ prefer_ctos_cipher <prefer_ctos_cipher> ] | [ prefer_stoc_cipher <prefer_stoc_cipher> ] | [ prefer_ctos_hmac <prefer_ctos_hmac> ] | [ prefer_stoc_hmac <prefer_stoc_hmac> ] | [ prefer_ctos_compresszlib ] | [ prefer_stoc_compresszlib ] | [ -ki <interval> ] | [ -kc <count> ] | [ identity-key <identity-key-type> ] | [ user-identity-key <user-key> ] ]",
        "stelnet [ -a <source-ip-address> ] [ -force-receive-pubkey ] <host-ip-address> [ <server-port> ] [ [ prefer_kex <prefer_kex> ] | [ prefer_ctos_cipher <prefer_ctos_cipher> ] | [ prefer_stoc_cipher <prefer_stoc_cipher> ] | [ prefer_ctos_hmac <prefer_ctos_hmac> ] | [ prefer_stoc_hmac <prefer_stoc_hmac> ] | [ prefer_ctos_compresszlib ] | [ prefer_stoc_compresszlib ] | [ -vpn-instance <vpn-instance-name> ] | [ -ki <interval> ] | [ -kc <count> ] | [ identity-key <identity-key-type> ] | [ user-identity-key <user-key> ] ]"
    ],
    "ParentView": [
        "User view,System view"
    ],
    "ParaDef": [
        {
            "Parameters": "-a <source-ipv6-address>",
            "Info": "Specifies the source IPv6 address of STelnet.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "-a <source-ip-address>",
            "Info": "Specifies the source IP address of STelnet.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "-force-receive-pubkey",
            "Info": "Indicates that a server forcibly receives public key authentication.\n-"
        },
        {
            "Parameters": "<host-ipv6-address>",
            "Info": "Specifies the IP address or host name of the remote system (IPv6-based STelnet server).\nThe value is a string of case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "public-net",
            "Info": "Specifies the public network where the SSH server resides.\nIf you have run the set net-manager vpn-instance command to configure the default VPN instance used for an NMS to manage devices and want to use SSH to access a public network server, you must specify this parameter.\n-"
        },
        {
            "Parameters": "-vpn-instance <vpn-instance-name>",
            "Info": "Specifies a VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "-oi",
            "Info": "Specifies the source interface for the IPv6 client. The IPv6 address configured in this interface view is the source IPv6 address of outbound packets. If no IPv6 address is configured for the source interface, the connection cannot be set up.\n-"
        },
        {
            "Parameters": "<interface-type> <interface-number>",
            "Info": "Specifies the source interface for the client, including the type and number of the interface.\n-"
        },
        {
            "Parameters": "<server-port>",
            "Info": "Specifies the port number of the SSH server.\nThe value is an integer ranging from 1 to 65535. The default port number is 22."
        },
        {
            "Parameters": "prefer_kex <prefer_kex>",
            "Info": "Specifies the preferred algorithm for key exchange.\nThe options are as follows:\ndh_group1_sha1dh_group_exchange_sha1sm2_kepdh-group-exchange-sha256ecdh-sha2-nistp256ecdh-sha2-nistp384ecdh-sha2-nistp521dh_group14_sha1dh_group16_sha512curve25519_sha256"
        },
        {
            "Parameters": "prefer_ctos_cipher <prefer_ctos_cipher>",
            "Info": "Specifies the preferred encryption algorithm for packets from the client to the server.\nEncryption algorithms supported depend on the ssh client cipher command settings."
        },
        {
            "Parameters": "prefer_stoc_cipher <prefer_stoc_cipher>",
            "Info": "Specifies the preferred encryption algorithm for packets from the server to the client.\nEncryption algorithms supported depend on the ssh client cipher command settings."
        },
        {
            "Parameters": "prefer_ctos_hmac <prefer_ctos_hmac>",
            "Info": "Specifies the preferred HMAC algorithm for packets from the client to the server.\nThe preferred HMAC algorithms supported depend on the HMAC algorithm type configured using the ssh client hmac command."
        },
        {
            "Parameters": "prefer_stoc_hmac <prefer_stoc_hmac>",
            "Info": "Specifies the preferred HMAC algorithm for packets from the server to the client.\nThe preferred HMAC algorithms supported depend on the HMAC algorithm type configured using the ssh client hmac command."
        },
        {
            "Parameters": "prefer_ctos_compress",
            "Info": "Specifies the preferred compression algorithm for packets from the server to the client. Only the ZLIB algorithm is supported.\n-"
        },
        {
            "Parameters": "zlib",
            "Info": "Specifies the preferred compression algorithm is ZLIB.\n-"
        },
        {
            "Parameters": "prefer_stoc_compress",
            "Info": "Specifies the preferred compression algorithm for packets from a client to the server. Only the ZLIB algorithm is supported.\n-"
        },
        {
            "Parameters": "-ki <interval>",
            "Info": "Specifies an interval at which keepalive packets are sent if no data is received.\nThe value is an integer in the range of 1 to 3600, in seconds."
        },
        {
            "Parameters": "-kc <count>",
            "Info": "Specifies the maximum number of times that a server does not respond to keepalive packets.\nThe value is an integer ranging from 1 to 30."
        },
        {
            "Parameters": "identity-key <identity-key-type>",
            "Info": "Specifies the public key for server authentication.\nSpecifies the public key for server authentication, which depends on the type configured using the ssh client publickey command."
        },
        {
            "Parameters": "user-identity-key <user-key>",
            "Info": "Specifies the public key for user authentication.\nSpecifies the public key for user authentication, which depends on the type configured using the ssh client publickey command."
        },
        {
            "Parameters": "-i",
            "Info": "Specifies the egress interface corresponding to the link-local address or host name.\n-"
        },
        {
            "Parameters": "<host-ip-address>",
            "Info": "Specifies the IP address or host name of the remote system (IPv4-based STelnet server).\nThe value is a string of 0 to 4294967295 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "ipv6",
            "Info": "Indicates login to another device from the current device through IPv6 STelnet.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> stelnet ipv6 2001:db8:1::1 1025 prefer_kex dh-group1 prefer-ctos-cipher aes128 prefer-stoc-cipher aes128 prefer-ctos-hmac sha1 prefer-stoc-hmac sha1 -vpn-instance vpn01"
        ],
        [
            "<HUAWEI> stelnet ipv6 2001:db8:1::1 1025 prefer_kex dh-group1 prefer-ctos-cipher aes128 prefer-stoc-cipher aes128 prefer-ctos-hmac sha1 prefer-stoc-hmac sha1 -vpn-instance vpn01"
        ],
        [
            "<HUAWEI> stelnet -a 10.1.1.1 10.164.39.120 prefer_kex dh-group1 prefer-ctos-cipher aes128 prefer-stoc-cipher aes128 prefer-ctos-hmac sha1 prefer-stoc-hmac sha1 -vpn-instance vpn01 -ki 2 -kc 4"
        ],
        [
            "<HUAWEI> stelnet -a 10.1.1.1 10.164.39.120 prefer_kex dh_exchange_group prefer_ctos_cipher aes128 prefer_stoc_cipher aes128 prefer_ctos_hmac sha1 prefer_stoc_hmac sha1 -vpn-instance vpn01 -ki 2 -kc 4"
        ]
    ],
    "ExtraInfo": "Logins by using Telnet bring security risks because Telnet does not provide any secure authentication mechanism and data is transmitted by using TCP in plain text. Compared with Telnet, SSH guarantees secure file transfer on a traditional insecure network by authenticating clients and encrypting data in bidirectional mode. The SSH protocol supports STelnet. You can run this command to use STelnet to log in to another device from the current device.STelnet is a secure Telnet service. SSH users can use the STelnet service in the same way as the Telnet service.When the STelnet server or its connection to a client fails, the client must detect the fault in time and release the connection. To achieve this goal, before a client logs in to the server through STelnet, configure an interval at which keepalive packets are sent if no data is received and the maximum number of times that the server does not respond. If the client does not receive any data within the specified interval, it sends a keepalive packet to the server. If the maximum number of times that the server does not respond exceeds the specified value, the client tears down the connection."
}