{
    "PageTitle": "display vbst local",
    "FuncDef": "The display vbst local command displays information in the VBST internal data area. The display vbst local command displays information in the VBST internal data area.",
    "CLIs": [
        "display vbst local instance [ vlan <vlan-id> ]",
        "display vbst local port port-id <port-id>",
        "display vbst local port-instance port-id <port-id>",
        "display vbst local portlist"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan <vlan-id>",
            "Info": "Displays information about instances in the internal data area of a VBST-enabled VLAN.\nIf vlan vlan-id is not specified, information about instances in the internal data area of all VBST-enabled VLANs is displayed.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "port",
            "Info": "Displays interface information in the VBST internal data area.\n-"
        },
        {
            "Parameters": "port-id <port-id>",
            "Info": "Displays information about instances in the internal data area of a VBST-enabled interface.\nIf port-id port-id is not specified, information about instances in the internal data area of all VBST-enabled interfaces is displayed.\nThe value is an integer that ranges from 1 to 2304."
        },
        {
            "Parameters": "port-instance",
            "Info": "Displays the mapping between VLANs and instances on the interface in the VBST internal data area.\n-"
        },
        {
            "Parameters": "portlist",
            "Info": "Displays spanning tree information about the interface list.\n-"
        },
        {
            "Parameters": "instance",
            "Info": "Displays information about instances in the VBST internal data area.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display vbst local instance"
        ],
        [
            "<HUAWEI> display vbst local port port-id 7"
        ],
        [
            "<HUAWEI> display vbst local port-instance port-id 7"
        ],
        [
            "<HUAWEI> display vbst local portlist"
        ]
    ],
    "ExtraInfo": ""
}