{
    "PageTitle": "stp vlan timer hello",
    "FuncDef": "The stp vlan timer hello command sets the interval of the switching device to send BPDUs, that is, the value of the Hello Time.\nThe undo stp vlan timer hello command restores the default setting. The stp vlan timer hello command sets the interval of the switching device to send BPDUs, that is, the value of the Hello Time. The undo stp vlan timer hello command restores the default setting. By default, the interval of the switch to send BPDUs is 200 centiseconds (2 seconds).",
    "CLIs": [
        "stp vlan <vlan-id> [ to <vlan-id> ] [ <vlan-id> [ to <vlan-id> ] ] &<1-9> timerhello <time-value>",
        "undo stp vlan <vlan-id> [ to <vlan-id> ] [ <vlan-id> [ to <vlan-id> ] ] &<1-9> timerhello [ <time-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "to <vlan-id>",
            "Info": "Specifies one or more VLANs in which the Hello timer value is set.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "<time-value>",
            "Info": "Specifies the interval at which the device sends BPDUs, in centiseconds. The step is 100.\nThe value is an integer that ranges from 100 to 1000, in centiseconds, and the step is 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp vlan 10 timer hello 400"
        ]
    ],
    "ExtraInfo": "On a network where a spanning tree protocol is enabled, a switching device periodically sends BPDUs to other devices in the same spanning tree at the interval of the Hello Time. Sending BPDUs periodically ensures that the spanning tree is stable. The stp vlan timer hello command can be used to set the BPDU sending interval, that is, the Hello Time.If no BPDUs are received by the switching device within the timeout period (timeout period = Hello Time x 3 x Timer Factor), the spanning tree is calculated again."
}