{
    "PageTitle": "stp vlan bridge-diameter",
    "FuncDef": "The stp vlan bridge-diameter command configures the diameter of the spanning tree.\nThe undo stp vlan bridge-diameter command restores the default diameter. The stp vlan bridge-diameter command configures the diameter of the spanning tree. The undo stp vlan bridge-diameter command restores the default diameter. By default, the diameter of the spanning tree is 7.",
    "CLIs": [
        "stp vlan <vlan-id> [ to <vlan-id> ] [ <vlan-id> [ to <vlan-id> ] ] &<1-9> bridge-diameter <bridge-diameter>",
        "undo stp vlan <vlan-id> [ to <vlan-id> ] [ <vlan-id> [ to <vlan-id> ] ] &<1-9> bridge-diameter [ <bridge-diameter> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<vlan-id>",
            "Info": "Configures the diameter of a spanning tree in VLANs.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer that ranges from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "<bridge-diameter>",
            "Info": "Specifies the diameter.\nThe value is an integer that ranges from 2 to 7. The default value is 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp vlan 10 bridge-diameter 5"
        ]
    ],
    "ExtraInfo": "On a network running a spanning tree protocol, the network diameter is the maximum number of devices between two switching devices. If the network diameter is improperly set, network converge may slow down, affecting users' normal communication.\nThe stp vlan bridge-diameter command can be used to set a proper network diameter based on the network scale. This helps to accelerate network convergence.\nThe following time parameters are related to the network scale:"
}