{
    "PageTitle": "stp vlan priority",
    "FuncDef": "The stp vlan priority command sets the priority of the switching device in a spanning tree.\nThe undo stp vlan priority command restores the default priority. The stp vlan priority command sets the priority of the switching device in a spanning tree. The undo stp vlan priority command restores the default priority. By default, the priority of the switching device in a spanning tree is 32768.",
    "CLIs": [
        "stp vlan <vlan-id> [ to <vlan-id> ] [ <vlan-id> [ to <vlan-id> ] ] &<1-9> priority <priority-value>",
        "undo stp vlan <vlan-id> [ to <vlan-id> ] [ <vlan-id> [ to <vlan-id> ] ] &<1-9> priority [ <priority-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "to <vlan-id>",
            "Info": "Configures the priority of a port in VLANs.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "<priority-value>",
            "Info": "Specifies the priority of the device in a spanning tree.\nThe smaller the value is, the higher the device priority is.\nThe value is an integer that ranges from 0 to 61440 and is a multiple of 4096, such as 0, 4096, and 8192.  The default value is 32768."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp vlan 10 priority 4096"
        ]
    ],
    "ExtraInfo": "Priorities of switching devices are an important factor to calculate a spanning tree and determine the selection of the root bridge.\nOn a VBST network, each spanning tree has only one root bridge, which is responsible for sending BPDUs. Owning to the importance of the root bridge, the switching device with high performance and network hierarchy is generally chosen as the root bridge. The priority of such a switching device, however, may not be that high. Therefore, setting a high priority for the switching device is necessary so that the device can function as a root bridge.\nOther devices with low performance and network hierarchy are not fit to be a root bridge. Therefore, set low priorities for these devices.\nOn a VBST network, each switching device can be set with a priority for the spanning tree in each VLAN."
}