{
    "PageTitle": "adaptive-routing enable dragonfly-role",
    "FuncDef": "The adaptive-routing enable dragonfly-role command enables the adaptive routing function on an interface and configures the role of the interface on a direct network.\nThe undo adaptive-routing enable dragonfly-role command disables the adaptive routing function on an interface and cancels the role configuration of the interface on a direct network. The adaptive-routing enable dragonfly-role command enables the adaptive routing function on an interface and configures the role of the interface on a direct network. The undo adaptive-routing enable dragonfly-role command disables the adaptive routing function on an interface and cancels the role configuration of the interface on a direct network. By default, the adaptive routing function is disabled on an interface, and no role is configured for the interface on a direct network. This command is supported only on the CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "adaptive-routing enable dragonfly-role { global | local }",
        "undo adaptive-routing enable dragonfly-role { global | local }"
    ],
    "ParentView": [
        "100GE interface view,200GE interface view,400GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "global",
            "Info": "Global role.\n-"
        },
        {
            "Parameters": "local",
            "Info": "Local role.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] adaptive-routing enable",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] adaptive-routing enable dragonfly-role global"
        ]
    ],
    "ExtraInfo": "After a role is configured for an interface on a direct network, when congestion occurs on the direct network, the interface performs corresponding operations based on the role to quickly adjust network paths and prevent services from being blocked."
}