{
    "PageTitle": "adaptive-routing bandwidth",
    "FuncDef": "The adaptive-routing bandwidth command configures the upper and lower thresholds for the bandwidth utilization level in a dragonfly profile.\nThe undo adaptive-routing bandwidth command restores the default upper and lower thresholds for the bandwidth utilization level in a dragonfly profile. The adaptive-routing bandwidth command configures the upper and lower thresholds for the bandwidth utilization level in a dragonfly profile. The undo adaptive-routing bandwidth command restores the default upper and lower thresholds for the bandwidth utilization level in a dragonfly profile. By default, the upper threshold is 6 and the lower threshold is 3. This command is supported only on the CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "adaptive-routing bandwidth high-threshold <high-threshold-value> low-threshold <low-threshold-value>",
        "undo adaptive-routing bandwidth high-threshold <high-threshold-value> low-threshold <low-threshold-value>"
    ],
    "ParentView": [
        "Dragonfly-profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "low-threshold <low-threshold-value>",
            "Info": "Specifies the lower threshold for the bandwidth utilization level.\nThe value is an integer ranging from 1 to 7. The default value is 3. high-threshold-value must be greater than low-threshold-value."
        },
        {
            "Parameters": "high-threshold <high-threshold-value>",
            "Info": "Specifies the upper threshold for the bandwidth utilization level.\nThe value is an integer ranging from 1 to 7. The default value is 6. high-threshold-value must be greater than low-threshold-value."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dragonfly profile default",
            "[~HUAWEI-dragonfly-profile-default] adaptive-routing bandwidth high-threshold 7 low-threshold 3"
        ]
    ],
    "ExtraInfo": ""
}