{
    "PageTitle": "adjust original-dscp",
    "FuncDef": "The adjust original-dscp command enables dragonfly deadlock prevention and adjusts the queue priority and DSCP value of matched packets.\nThe undo adjust original-dscp command disables dragonfly deadlock prevention and deletes the queue adjustment configuration for matched packets in a dragonfly profile. The adjust original-dscp command enables dragonfly deadlock prevention and adjusts the queue priority and DSCP value of matched packets. The undo adjust original-dscp command disables dragonfly deadlock prevention and deletes the queue adjustment configuration for matched packets in a dragonfly profile. By default, dragonfly deadlock prevention is disabled in a dragonfly profile. This command is supported only on the CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "adjust original-dscp <original-dscpvalue> topriority <prioritynumber> dscp <dscpvalue>",
        "undo adjust original-dscp <original-dscpvalue> topriority <prioritynumber> dscp <dscpvalue>"
    ],
    "ParentView": [
        "Dragonfly-profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "to",
            "Info": "Adjusts the information about the matched packets.\n-"
        },
        {
            "Parameters": "priority <prioritynumber>",
            "Info": "Adjusts the queue priority of the matched packets so that the packets are forwarded from the specified queue.\nThe value is an integer that ranges from 0 to 5."
        },
        {
            "Parameters": "dscp <dscpvalue>",
            "Info": "Adjusts the DSCP value of the matched packets to ensure that packets in a hook-shaped flow are still mapped to the specified queue on the downstream device.\nThe value is an integer that ranges from 0 to 63."
        },
        {
            "Parameters": "original-dscp <original-dscpvalue>",
            "Info": "Specifies the DSCP value of packets to be adjusted.\nThe value is an integer that ranges from 0 to 63."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dragonfly profile default",
            "[*HUAWEI-dragonfly-profile-default] abs-pfc priority 1 4 enable",
            "[*HUAWEI-dragonfly-profile-default] adjust original-dscp 10 to priority 4 dscp 32"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] qos buffer headroom-pool size 4 mbytes slot 1",
            "[*HUAWEI] dcb pfc default",
            "[*HUAWEI-dcb-pfc-default] priority 1 4",
            "[*HUAWEI-dcb-pfc-default] quit",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] dcb pfc enable",
            "[*HUAWEI-100GE1/0/1] quit",
            "[*HUAWEI] dragonfly profile default",
            "[*HUAWEI-dragonfly-profile-default] adjust original-dscp 10 to priority 4 dscp 32"
        ]
    ],
    "ExtraInfo": "In a direct topology, you can run this command in the dragonfly profile to switch the queue of service flows whose inbound and outbound interfaces are both local ports or whose inbound interface is a global port, proactively adjusting the queue priority and DSCP value of packets to prevent deadlock."
}