{
    "PageTitle": "display stp process",
    "FuncDef": "The display stp process command displays the status of and statistics about the specify ID of a Multiple Spanning Tree Protocol (MSTP) process. The display stp process command displays the status of and statistics about the specify ID of a Multiple Spanning Tree Protocol (MSTP) process.",
    "CLIs": [
        "display stp process <process-id> [ instance <instance-id> ] [ interface { <interface-name> | <interface-type> <interface-number> } | slot <slot-id> ] [ brief ]",
        "display stp process <process-id> [ instance <instance-id> ] [ interface { <interface-name> | <interface-type> <interface-number> } | slot <slot-id> ] tc-bpdustatistics [ history ]",
        "display stp process <process-id> [ instance <instance-id> ] topology-change",
        "display stp process <process-id> active",
        "display stp process <process-id> bridge { local | root }",
        "display stp process <process-id> global",
        "display stp process <process-id> [ instance <instance-id> ] abnormal-interface",
        "display stp process <process-id> v-stp"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<process-id>",
            "Info": "Specifies the ID of a Multiple Spanning Tree Protocol (MSTP) process.\nThe value is a decimal integer ranging from 1 to 256."
        },
        {
            "Parameters": "instance <instance-id>",
            "Info": "Displays statistics about the topology changes of a specified STP instance.\nIf instance <instanceId> is not specified, the status of and statistics about all spanning tree instances will be displayed in the sequence of the interface numbers.\nThe value is an integer ranging from 0 to 4094, Value 0 indicates Common and Internal Spanning Tree (CIST)."
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Displays information of a spanning tree on a specified interface.\nIf interface <ifType> <ifNum> is not specified, the status of and statistics about all interfaces will be displayed in the sequence of the interface numbers.\n-"
        },
        {
            "Parameters": "slot <slot-id>",
            "Info": "Specifies the number of the slot where the interface resides.\nThe value is a string of 1 to 23 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "brief",
            "Info": "Displays the brief status.\n-"
        },
        {
            "Parameters": "tc-bpdu",
            "Info": "Displays the statistics about sent and received topology change (TC) and topology change notification (TCN) BPDUs on interfaces.\n-"
        },
        {
            "Parameters": "statistics",
            "Info": "Displays the statistics about sent and received topology change (TC) and topology change notification (TCN) BPDUs on interfaces.\n-"
        },
        {
            "Parameters": "history",
            "Info": "Displays historical TC/TCN statistics on an interface.\n-"
        },
        {
            "Parameters": "topology-change",
            "Info": "Displays statistics about Multiple Spanning Tree Protocol (MSTP) topology changes.\n-"
        },
        {
            "Parameters": "active",
            "Info": "Displays the status of and statistics on spanning trees of all Up interfaces.\nTo view information about spanning trees on all Up interfaces, run the display stp active command.\n-"
        },
        {
            "Parameters": "bridge",
            "Info": "Displays detailed information about the spanning tree of a bridge.\nTo view detailed information about the spanning trees of the root and local bridges, run the display stp bridge command.\n-"
        },
        {
            "Parameters": "local",
            "Info": "Displays detailed information about the spanning tree of the local bridge.\n-"
        },
        {
            "Parameters": "root",
            "Info": "Displays detailed information about the spanning tree of the root bridge.\n-"
        },
        {
            "Parameters": "global",
            "Info": "Displays global Spanning Tree Protocol (STP) information.\n-"
        },
        {
            "Parameters": "abnormal-interface",
            "Info": "Displays information about abnormal interfaces running the Spanning Tree Protocol (STP).\nRun the display stp abnormal-interface command can query information about abnormal STP interfaces quickly.\n-"
        },
        {
            "Parameters": "v-stp",
            "Info": "Displays V-STP status and statistics.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display stp process 0 active"
        ],
        [
            "<HUAWEI> display stp process 0 bridge root"
        ],
        [
            "<HUAWEI> display stp process 0 global"
        ]
    ],
    "ExtraInfo": "The display stp process command displays the status and statistics of the spanning tree of a specified MSTP process.If Protocol Status is Disabled, it indicates that the spanning tree protocol is not running.If the spanning tree protocol is running, the corresponding information is displayed, such as the working mode of the spanning tree.The display stp process brief command displays the spanning tree status of the port with the specified MSTP process ID. The global information cannot be displayed.The display stp process global command displays brief information about the spanning tree protocol of a specified MSTP process.The display stp process tc-bpdu statistics command displays the number of sent and received TC (Topology Change) /TCN (Topology Change Notification) on the port of a specified MSTP process.To determine whether a fault has occurred on interfaces that send and receive TC/TCN BPDUs, run this command and locate the fault source based on port information.The display stp process topology-change command displays statistics about the MSTP process (Multiple Spanning Tree Protocol) topology changes in a specified MSTP process.On a Layer 2 network running the MSTP process, a device clears ARP entries and MAC address entries after receiving TC BPDUs. If a device receives a large number of TC BPDUs and frequently clears ARP and MAC address entries, the CPU usage of the device becomes high. As a result, network traffic is unstable.You can run this command to view statistics about topology changes in an MSTP process. If the number of topology changes increases, network flapping occurs.The display stp process active command displays the spanning tree status of the interfaces in Up state in the specified MSTP process. The spanning tree status of the interfaces in Down state is not displayed.The display stp process bridge command displays the spanning tree status of the local bridge and root bridge in a specified MSTP process.The display stp process abnormal-interface command displays information about abnormal ports running a spanning tree protocol in a specified MSTP process.The display stp process v-stp command displays the status and statistics of the V-STP process with a specified MSTP process ID, including bridge information, peer-link port information, and virtual port information. Users can learn about the status of the V-STP process."
}