{
    "PageTitle": "display stp",
    "FuncDef": "The display stp command displays the status of and statistics about a spanning tree instance in a Multiple Spanning Tree Protocol (MSTP) process. The display stp command displays the status of and statistics about a spanning tree instance in a Multiple Spanning Tree Protocol (MSTP) process.",
    "CLIs": [
        "display stp [ instance <instance-id> ] [ interface { <interface-name> | <interface-type> <interface-number> } | slot <slot-id> ] [ brief ]"
    ],
    "ParentView": [
        "MSTP process view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance <instance-id>",
            "Info": "Displays the status of and statistics about a spanning tree instance.\nIf instance <instance-id> is not specified, the status of and statistics about all spanning tree instances will be displayed in the sequence of the interface numbers.\nThe value is an integer ranging from 0 to 4094, Value 0 indicates CIST."
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Displays information of a spanning tree on a specified interface.\nIf interface <ifType> <ifNum> is not specified, the status of and statistics about all interfaces will be displayed in the sequence of the interface numbers.\n-"
        },
        {
            "Parameters": "slot <slot-id>",
            "Info": "Specifies the number of the slot where the interface resides.\nThe value is a string of 1 to 23 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "brief",
            "Info": "Displays the brief status.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp process 1",
            "[*HUAWEI-mst-process-1] display stp"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp process 1",
            "[*HUAWEI-mst-process-1] display stp"
        ]
    ],
    "ExtraInfo": "The display stp command is used to check whether the spanning tree protocol is run on the specified MSTP process."
}