{
    "PageTitle": "arp anti-attack entry-check enable (interface view)",
    "FuncDef": "The arp anti-attack entry-check enable command enables fixed Address Resolution Protocol (ARP) and configures the fixed ARP mode.\nThe undo arp anti-attack entry-check enable command disables fixed ARP. The arp anti-attack entry-check enable command enables fixed Address Resolution Protocol (ARP) and configures the fixed ARP mode. The undo arp anti-attack entry-check enable command disables fixed ARP. By default, fixed ARP is disabled.",
    "CLIs": [
        "arp anti-attack entry-check fixed-all enable",
        "arp anti-attack entry-check fixed-mac enable",
        "arp anti-attack entry-check send-ack enable",
        "undo arp anti-attack entry-check [ fixed-all | fixed-mac | send-ack ] enable"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "fixed-mac",
            "Info": "Specifies the fixed-mac mode of fixed ARP.\n-"
        },
        {
            "Parameters": "send-ack",
            "Info": "Specifies the send-ack mode of fixed ARP.\n-"
        },
        {
            "Parameters": "fixed-all",
            "Info": "Specifies the fixed-all mode of fixed ARP.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 20",
            "[*HUAWEI-vlan20] quit",
            "[*HUAWEI] interface vlanif 20",
            "[*HUAWEI-vlanif20] arp anti-attack entry-check fixed-mac enable"
        ]
    ],
    "ExtraInfo": "When the device receives the first ARP packet from a user, the device generates an ARP entry for the user. If the information carried in subsequent ARP packets sent by the user changes, the ARP entry is updated. If attackers forge and send ARP packets to update ARP entries of authorized users, the device learns incorrect ARP entries and authorized users cannot use the network normally. To resolve this problem, run the arp anti-attack entry-check enable command to enable fixed ARP. After a device generates an ARP entry for a user, the device either allows specific information in the ARP entry to be updated or prohibits any information to be updated. Fixed ARP can be implemented in the following modes:"
}