{
    "PageTitle": "arp limit vlan",
    "FuncDef": "The arp limit command limits the maximum number of dynamic Address Resolution Protocol (ARP) entries that an interface can learn.\nThe undo arp limit command restores the default number of dynamic ARP entries that an interface can learn. The arp limit command limits the maximum number of dynamic Address Resolution Protocol (ARP) entries that an interface can learn. The undo arp limit command restores the default number of dynamic ARP entries that an interface can learn. For the default maximum number of dynamic ARP entries that an interface can learn, see \"Parameters.\"",
    "CLIs": [
        "arp limit vlan <vlan-id1> [ to <vlan-id2> ] <maximum>",
        "undo arp limit vlan <vlan-id1> [ to <vlan-id2> ]"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,100ge sub-interface view,Layer 2 10GE interface view,10GE sub-interface view,1200ge sub-interface view,Layer 2 200GE interface view,200GE sub-interface view,25GE-L2 view,25GE sub-interface view,400GE-L2 view,400GE sub-interface view,Layer 2 50GE interface view,50GE sub-interface view,Layer 2 Eth-Trunk interface view,Eth-Trunk sub-interface view,Layer 2 GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<vlan-id1>",
            "Info": "Specifies the ID of the VLAN for which ARP entry learning is restricted.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094. This parameter can be set only in the Layer 2 interface view and QinQ sub-interface view. If you set this parameter in the QinQ sub-interface view, vlan-id specifies the outer VLAN ID of the QinQ sub-interface. The value of <vlan-id2> must be greater than that of <vlan-id1>.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "<vlan-id2>",
            "Info": "Specifies the ID of the VLAN for which ARP entry learning is restricted.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094. This parameter can be set only in the Layer 2 interface view and QinQ sub-interface view. If you set this parameter in the QinQ sub-interface view, vlan-id specifies the outer VLAN ID of the QinQ sub-interface. The value of <vlan-id2> must be greater than that of <vlan-id1>.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "limit <maximum>",
            "Info": "Specifies the maximum number of the ARP entries that the interface can learn.\nFor the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 131072. The default value is 131072.\nFor the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S:The value is an integer ranging from 1 to 261120. The default value is 261120."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] arp limit vlan 10 20"
        ]
    ],
    "ExtraInfo": "If an unauthorized user sends a large number of ARP messages to a device, the device learns a large number of ARP entries in a short period of time, causing the ARP buffer to overflow. As a result, normal operation of the network is affected. To address such a problem, you can set the maximum number of ARP entries that each interface can learn."
}