{
    "PageTitle": "arp anti-attack check user-bind enable",
    "FuncDef": "The arp anti-attack check user-bind enable command enables dynamic ARP inspection (DAI) to check ARP packets against the binding table.\nThe undo arp anti-attack check user-bind enable command disables DAI. The arp anti-attack check user-bind enable command enables dynamic ARP inspection (DAI) to check ARP packets against the binding table. The undo arp anti-attack check user-bind enable command disables DAI. By default, dynamic ARP detection is disabled.",
    "CLIs": [
        "arp anti-attack check user-bind enable",
        "undo arp anti-attack check user-bind enable"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,Layer 2 10GE interface view,Layer 2 200GE interface view,25GE-L2 view,400GE-L2 view,Layer 2 50GE interface view,Layer 2 Eth-Trunk interface view,Layer 2 GE interface view,VLAN view,Bridge domain view,Interface group view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] arp anti-attack check user-bind enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 100",
            "[~HUAWEI-vlan100] arp anti-attack check user-bind enable"
        ]
    ],
    "ExtraInfo": "You can run this command to enable DAI to defend against MITM attacks, preventing authorized users' data from being intercepted. A device compares the source IP address, source MAC address, interface, BD, and VLAN information in a received ARP message with binding entries. If they match, the device considers the message valid and forwards it. If they do not match, the device considers the message invalid and discards it. You can enable DAI in the interface, BD, or VLAN view. If DAI is enabled in the interface view, the device checks all ARP messages received by the interface against binding entries. If DAI is enabled in the VLAN or BD view, the device checks the ARP messages received by the interfaces that belong to the VLAN or BD against binding entries."
}