{
    "PageTitle": "display arp anti-attack statistics check user-bind",
    "FuncDef": "The display arp anti-attack statistics check user-bind command displays statistics about discarded ARP packets. The display arp anti-attack statistics check user-bind command displays statistics about discarded ARP packets.",
    "CLIs": [
        "display arp anti-attack statistics check user-bind [ vlan [ <vlan-id> ] | interface [ <interface-name> | <interface-type> <interface-number> ] | bridge-domain [ <bd-id> ] ]",
        "display arp anti-attack statistics check user-bind [ vlan [ <vlan-id> ] | interface [ <interface-name> | <interface-type> <interface-number> ] ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan <vlan-id>",
            "Info": "Displays DAI statistics in a specified VLAN.\nIf vlan-id is not specified, DAI statistics in all VLANs are displayed.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "interface <interface-name>",
            "Info": "Specifies an interface name.\n-"
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Displays DAI configurations on a specified interface.\ninterface-type specifies the interface type.interface-number specifies the interface number.\nIf interface-type interface-number is not specified, DAI configurations on all interfaces are displayed.\n-"
        },
        {
            "Parameters": "bridge-domain <bd-id>",
            "Info": "Displays DAI statistics in a specified BD.\nIf bd-id is not specified, DAI statistics in all BDs are displayed.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6881H and CE6881H-K.\nThe value is an integer ranging from 1 to 16777215."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display arp anti-attack statistics check user-bind interface"
        ],
        [
            "<HUAWEI> display arp anti-attack statistics check user-bind vlan 100"
        ]
    ],
    "ExtraInfo": "After DAI is enabled in the interface view, VLAN view, or BD view, you can run the display arp anti-attack check user-bind alarm statistics command to check statistics about ARP packets discarded because they do not match binding entries. If the alarm function for ARP packets discarded because of DAI is enabled, you can also view the statistics on the ARP packets that do not match the binding table and are discarded on the interface after the last alarm is generated."
}