{
    "PageTitle": "display arp anti-attack record",
    "FuncDef": "The display arp anti-attack record command displays information about discarded Address Resolution Protocol (ARP) packets whose rate exceeds the limit.\nThe display arp miss anti-attack record command displays information about discarded Address Resolution Protocol (ARP) Miss messages whose rate exceeds the limit. The display arp anti-attack record command displays information about discarded Address Resolution Protocol (ARP) packets whose rate exceeds the limit. The display arp miss anti-attack record command displays information about discarded Address Resolution Protocol (ARP) Miss messages whose rate exceeds the limit.",
    "CLIs": [
        "display arp anti-attack record",
        "display arp miss anti-attack record"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> display arp anti-attack record"
        ],
        [
            "<HUAWEI> display arp miss anti-attack record"
        ]
    ],
    "ExtraInfo": "After ARP packet rate limit is configured, the device counts the number of received ARP packets. If the number of ARP packets received in a specified period exceeds the upper limit, the device discards the excess ARP packets. To facilitate fault location, the device records information about discarded ARP packets whose rate exceeds the limit. To check information about discarded ARP packets whose rate exceeds the limit, run the display arp anti-attack record command.\nAfter ARP Miss message rate limit is configured, the device counts the number of received ARP Miss messages. If the number of ARP Miss messages received in a specified period exceeds the upper limit, the device discards the excess ARP Miss messages. To facilitate fault location, the device records information about discarded ARP Miss messages whose rate exceeds the limit. To check information about discarded ARP Miss messages whose rate exceeds the limit, run the display arp miss anti-attack record command."
}