{
    "PageTitle": "group-member interface(Rail group port-group view)",
    "FuncDef": "The group-member interface command adds a specified interface to a Rail Group port group.\nThe undo group-member interface command deletes a specified interface from a Rail Group port group. The group-member interface command adds a specified interface to a Rail Group port group. The undo group-member interface command deletes a specified interface from a Rail Group port group. By default, no interface is added to a Rail Group port group. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "group-member interface { <interface-name> | <interface-type> <interface-number> } [ to { <interface-name> | <interface-type> <interface-number> } ] &<1-32>",
        "group-member interface { <interface-name> | <interface-type> <interface-number> } index <index-value>",
        "undo group-member interface { <interface-name> | <interface-type> <interface-number> } [ to { <interface-name> | <interface-type> <interface-number> } ] &<1-32>",
        "undo group-member interface { <interface-name> | <interface-type> <interface-number> } index <index-value>"
    ],
    "ParentView": [
        "Rail group port-group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of an interface to be added to a Rail Group port group.\n-"
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an interface to be added to a Rail Group port group.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of an interface to be added to a Rail Group port group.\n-"
        },
        {
            "Parameters": "to",
            "Info": "Specifies an interface range that includes all interfaces between the two interfaces.\n-"
        },
        {
            "Parameters": "index <index-value>",
            "Info": "Specifies the index of an interface to be added to a Rail Group port group.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer that ranges from 0 to 255.\nFor the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM:The value is an integer in the range from 0 to 1023."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rail-group Leaf1",
            "[*HUAWEI-rail-group-Leaf1] group-member interface 100GE 1/0/1 to 100GE 1/0/4"
        ]
    ],
    "ExtraInfo": "You can run this command to add members to a Rail Group port group."
}