{
    "PageTitle": "display ip statistics verbose",
    "FuncDef": "The display ip statistics verbose command displays statistics about IP packets by protocol types, such as ICMP, IGMP, PIM, VRRP, OSPF, TCP, UDP, and others. The display ip statistics verbose command displays statistics about IP packets by protocol types, such as ICMP, IGMP, PIM, VRRP, OSPF, TCP, UDP, and others.",
    "CLIs": [
        "display ip statistics verbose [ protocol { <protocol-id> | icmp | igmp | ospf | pim | rsvp | tcp | udp | vrrp } ]",
        "display ip statistics verbose [ protocol { <protocol-id> | icmp | igmp | ospf | pim | rsvp | tcp | udp | vrrp } ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "protocol",
            "Info": "Displays statistics about IP packets of a specific protocol.\n-"
        },
        {
            "Parameters": "<protocol-id>",
            "Info": "Specify the protocol ID.\nThe value is an integer ranging from 1 to 255.\nThe value can be 1(ICMP), 2(IGMP), 6(TCP), 17(UDP), 46(RSVP), 89(OSPF), 103(PIM), or 112(VRRP). If the protocol ID specified is none of the preceding values, the protocol is displayed as \"Others\"."
        },
        {
            "Parameters": "icmp",
            "Info": "Displays statistics about IP packets of ICMP protocol.\n-"
        },
        {
            "Parameters": "igmp",
            "Info": "Displays statistics about IP packets of IGMP protocol.\n-"
        },
        {
            "Parameters": "ospf",
            "Info": "Displays statistics about IP packets of OSPF protocol.\n-"
        },
        {
            "Parameters": "pim",
            "Info": "Displays statistics about IP packets of PIM protocol.\n-"
        },
        {
            "Parameters": "rsvp",
            "Info": "Displays statistics about IP packets of RSVP protocol.\n-"
        },
        {
            "Parameters": "tcp",
            "Info": "Displays statistics about IP packets of TCP protocol.\n-"
        },
        {
            "Parameters": "udp",
            "Info": "Displays statistics about IP packets of UDP protocol.\n-"
        },
        {
            "Parameters": "vrrp",
            "Info": "Displays statistics about IP packets of VRRP protocol.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ip statistics verbose"
        ]
    ],
    "ExtraInfo": "To check statistics about IP packets, including sent, received, fragmented, and reassembled packets, run the command. The received packets displayed also include the packets carrying the Source Route options that are received and then discarded.\nDuring packet transmission, if the source fragments packets, run the command on the source to check the number of successfully fragmented packets and the number of sent fragmented packets, and then run the display ip statistics command on the destination to check whether the same number of fragmented packets are received.\nTo view detailed IP traffic statistics, run the display ip statistics verbose command. The command output helps you locate packet loss problems during packet sending and receiving of a specific application. For example, when BGP fails to be established, you can check whether the value of the bad checksum field increases."
}