{
    "PageTitle": "display ip socket",
    "FuncDef": "The display ip socket command displays information about created IPv4 sockets. If no parameter is specified, the command displays information about all types of sockets.\nThe display ipv6 socket command displays information about created IPv6 sockets. The display ip socket command displays information about created IPv4 sockets. If no parameter is specified, the command displays information about all types of sockets. The display ipv6 socket command displays information about created IPv6 sockets.",
    "CLIs": [
        "display ip socket [ socket-type <socket-type> ] [ cid <cid> ] [ socket-id <socket-id> ]",
        "display ipv6 socket [ socket-type <socket-type> ] [ cid <cid> ] [ socket-id <socket-id> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "socket-type <socket-type>",
            "Info": "Displays information about sockets of a specified type.\nThe value is an integer ranging from 1 to 4:\n Socket for TCP streams Socket for UDP packets Socket for RawIP Socket for RawLink"
        },
        {
            "Parameters": "cid <cid>",
            "Info": "Displays socket information of the APP with a specified CID.\nThe value is in hexadecimal notation and ranges from 0x0-0xffffffff. The default value is 0x0."
        },
        {
            "Parameters": "socket-id <socket-id>",
            "Info": "Displays information about the socket with a specified ID.\nThe value is an integer ranging from 0 to 2147418111."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ip socket"
        ],
        [
            "<HUAWEI> display ipv6 socket",
            "LA = ::->23, FA = ::->0,"
        ]
    ],
    "ExtraInfo": "To check socket information, run the display ip socket command. A filtering rule, such as a PID, socket ID, or socket type, can be specified so that only the information matching the rule is displayed. This reduces the amount of output information, improving output information usability and fault locating accuracy and efficiency.\nThe command can be used to display information about a specific type or all types of sockets."
}