{
    "PageTitle": "icmp drop",
    "FuncDef": "The icmp drop command enables boards to discard specifies the ICMP packets.\nThe undo icmp drop command disables boards from discarding specifies ICMP packets. The icmp drop command enables boards to discard specifies the ICMP packets. The undo icmp drop command disables boards from discarding specifies ICMP packets. By default, interface boards do not discard ICMP packets with a TTL value of 0 or 1, and the system does not discard ICMP packets with options.",
    "CLIs": [
        "icmp { with-options | ttl-exceeded } dropslot <slot-id>",
        "icmp { with-options | ttl-exceeded } dropall",
        "undo icmp { with-options | ttl-exceeded } dropslot <slot-id>",
        "undo icmp { with-options | ttl-exceeded } dropall",
        "undo icmp { with-options | ttl-exceeded } dropslot <undo-slotid>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "with-options",
            "Info": "enables interface boards to discard ICMP packets with options.\n-"
        },
        {
            "Parameters": "ttl-exceeded",
            "Info": "Enables boards to discard ICMP packets with a TTL value of 0 or 1.\n-"
        },
        {
            "Parameters": "slot <slot-id>",
            "Info": "Specifies an existing valid slot ID.\n-"
        },
        {
            "Parameters": "slot <undo-slotid>",
            "Info": "Specifies a slot ID, which can be specified randomly and is not restricted by the current slot status.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Indicates all boards.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] icmp with-options drop all"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] icmp ttl-exceeded drop all"
        ]
    ],
    "ExtraInfo": "If a device receives an IP datagram whose destination address is not a local address and the TTL value is 1 or 0, the device sends an ICMP TTL Exceeded packet. When a device receives a large number of ICMP packets with TTL of 1 or 0, usually sent by an attacker, device performance deteriorates because the device processes these packets. To address this issue, run the icmp ttl-exceeded drop command to configure the device to discard ICMP packets with TTL of 1 or 0. This improves network performance and security.\nWhen a device receives a large number of ICMP packets carrying route options, network loads increase and device performance deteriorates.\nTo address this issue, run the icmp with-options drop command to configure the device to discard ICMP packets carrying route options. This improves network performance and security."
}