{
    "PageTitle": "icmp rate-limit interface",
    "FuncDef": "The icmp rate-limit interface command sets an ICMP packet rate limit.\nThe undo icmp rate-limit interface command restores the default ICMP packet rate limit. The icmp rate-limit interface command sets an ICMP packet rate limit. The undo icmp rate-limit interface command restores the default ICMP packet rate limit. By default, no ICMP packet rate limit is configured on an interface, and the global ICMP packet rate limit (1500 pps) is used as the ICMP packet rate limit on the interface.",
    "CLIs": [
        "icmp rate-limit interface { <interface-name> | <interface-type> <interface-number1> } [ to <interface-number2> ] threshold <threshold-value>",
        "undo icmp rate-limit interface { <interface-name> | <interface-type> <interface-number1> } [ to <interface-number2> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "to <interface-number2>",
            "Info": "Specified the number of an interface for which ICMP messages are destined.\n-"
        },
        {
            "Parameters": "threshold <threshold-value>",
            "Info": "Specified an ICMP packet rate limit.\nThe value is an integer ranging from 0 to 5000, in pps."
        },
        {
            "Parameters": "interface <interface-name>",
            "Info": "Specifies the name of an interface.\n-"
        },
        {
            "Parameters": "interface <interface-type> <interface-number1>",
            "Info": "Specifies the type and number of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo icmp rate-limit disable",
            "[*HUAWEI] icmp rate-limit interface 100GE 1/0/1 to 1/0/2 threshold 900"
        ]
    ],
    "ExtraInfo": "In normal situations, the router can correctly receive ICMP packets. In the case of heavy network traffic, if hosts or ports are frequently unreachable, the router receives a large number of ICMP packets, which causes heavier traffic burden and performance deterioration. In addition, network attackers often make use of ICMP error packets to probe the internal network structure.\nTo improve device performance and enhance network security, run the icmp rate-limit interface command to set the ICMP packet rate limit.\nAfter the icmp rate-limit interface command is run, when the rate at which ICMP messages are sent over a specified interface exceeds the limit, an ACL is automatically delivered to allow the device to discard ICMP messages destined for the local device and start the ICMP packet rate limit timer."
}