{
    "PageTitle": "ip address unnumbered (interface view)",
    "FuncDef": "The ip address unnumbered command enables an interface to borrow an IP address from another interface.\nThe undo ip address unnumbered command disables an interface from borrowing an IP address from another interface. The ip address unnumbered command enables an interface to borrow an IP address from another interface. The undo ip address unnumbered command disables an interface from borrowing an IP address from another interface. By default, an interface is disabled from borrowing an IP address from another interface.",
    "CLIs": [
        "ip address unnumbered interface { <interface-name> | <interface-type> <interface-number> }",
        "undo ip address unnumbered"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,Tunnel interface view,VBDIF interface view,VLANIF interface view,Management interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface <interface-name>",
            "Info": "Specifies the name of an interface whose IP address is borrowed.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Specifies the type and number of an interface whose IP address is borrowed.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface LoopBack 0",
            "[*HUAWEI-LoopBack0] ip address 1.1.1.1 24",
            "[*HUAWEI-LoopBack0] quit",
            "[*HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] ip address unnumbered interface loopback 0"
        ]
    ],
    "ExtraInfo": "To save IP address resources, run the ip address unnumbered command to configure an interface to borrow an IP address from another interface. If an interface is only occasionally used, it is unnecessary to configure an IP address for the interface. Instead, configure the interface to borrow an IP address from another interface.\nThe following interfaces support IP borrowing from other interfaces such as Ethernet and loopback interfaces:"
}