{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "logging synchronous",
    "FuncDef": [
        "To synchronize unsolicited messages and debug output with solicited Cisco IOS software output and prompts for a specific console port line, auxiliary port line, or vty, use the **logging synchronous** command in line configuration mode. To disable synchronization of unsolicited messages and debug output, use the **no** form of this command. "
    ],
    "CLIs": [
        "logging synchronous [ level <severity-level> | all ] [ limit <number-of-lines> ]",
        "no logging synchronous [ level <severity-level> | all ] [ limit <number-of-lines> ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **level***severity-level* ",
            "Info": " (Optional) Specifies the message severity level. Messages with a severity level equal to or higher than this value are printed asynchronously. Low numbers indicate greater severity and high numbers indicate lesser severity. The default value is 2. "
        },
        {
            "Parameters": " **all** ",
            "Info": " (Optional) Specifies that all messages are printed asynchronously, regardless of the severity level. "
        },
        {
            "Parameters": " **limit***number-of-lines* ",
            "Info": " (Optional) Specifies the number of buffer lines to be queued for the terminal, after which new messages are dropped. The default value is 20. "
        }
    ],
    "Examples": [
        [
            "In the following example, a system message appears in the middle of typing the show running-config command:",
            "```",
            "Router(config-line)# end",
            "```",
            "```",
            "Router# show ru",
            "```",
            "```",
            "2w1d: %SYS-5-CONFIG_I: Configured from console by consolenning-config",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "The user then enables synchronous logging for the current line (indicated by the * symbol in the show line command), after which the system displays the system message on a separate line, and returns the user to the prompt to allow the user to finish typing the command on a single line:",
            "```",
            "Router# show line",
            "```",
            "```",
            "Tty Typ Tx/Rx A Modem Roty AccO AccI Uses Noise Overruns Int",
            "```",
            "```",
            "* 0 CTY - - - - - 0 3 0/0 -",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            "Router# configure terminal",
            "```",
            "```",
            "Enter configuration commands, one per line. End with CNTL/Z.",
            "```",
            "```",
            "Router(config)# line 0",
            "```",
            "```",
            "Router(config-line)# logging syn<tab>",
            "```",
            "```",
            "Router(config-line)# logging synchronous",
            "```",
            "```",
            "Router(config-line)# end",
            "```",
            "```",
            "Router# show ru",
            "```",
            "```",
            "2w1d: %SYS-5-CONFIG_I: Configured from console by console",
            "```",
            "```",
            "Router# show running-config",
            "```",
            "```",
            "```",
            "In the following example, synchronous logging for line 4 is enabled with a severity level of 6. Then synchronous logging for line 2 is enabled with a severity level of 7 and is specified with a maximum number of buffer lines of 1,000.",
            "```",
            "Router(config)# line 4",
            "```",
            "```",
            "Router(config-line)# logging synchronous level 6",
            "```",
            "```",
            "Router(config-line)# exit",
            "```",
            "```",
            "Router(config)# line 2",
            "```",
            "```",
            "Router(config-line)# logging synchronous level 7 limit 1000",
            "```",
            "```",
            "Router(config-line)# end",
            "```",
            "```",
            "Router#",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "When synchronous logging of unsolicited messages and debug output is turned on, unsolicited Cisco IOS software output is displayed on the console or printed after solicited Cisco IOS software output is displayed or printed. This keeps unsolicited messages and debug output from being interspersed with solicited software output and prompts.![](/c/dam/en/us/td/i/templates/tip.gif)---**Tip** ![](/c/dam/en/us/td/i/templates/blank.gif)This command is useful for keeping system messages from interrupting your typing. By default, messages will appear immediately when they are processed by the system, and the CLI cursor will appear at the end of the displayed message. For example, the line \"Configured by console from console\" may be printed to the screen, interrupting whatever command you are currently typing. The **logging synchronous** command allows you to avoid these potentially annoying interruptions without have to turn off logging to the console entirely.---When this command is enabled, unsolicited messages and debug output are displayed on a separate line than user input. After the unsolicited messages are displayed, the CLI returns to the user prompt.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)This command is also useful for allowing you to continue typing when debugging is enabled.---When specifying a severity level number, consider that for the logging system, low numbers indicate greater severity and high numbers indicate lesser severity.When a message queue limit of a terminal line is reached, new messages are dropped from the line, although these messages might be displayed on other lines. If messages are dropped, the notice *\"*%SYS-3-MSGLOST *number-of-messages* due to overflow\" follows any messages that are displayed. This notice is displayed only on the terminal that lost the messages. It is not sent to any other lines, any logging servers, or the logging buffer.![](/c/dam/en/us/td/i/templates/caut.gif)---**Caution** ![](/c/dam/en/us/td/i/templates/blank.gif)By configuring abnormally large message queue limits and setting the terminal to \"terminal monitor\" on a terminal that is accessible to intruders, you expose yourself to \"denial of service\" attacks. An intruder could carry out the attack by putting the terminal in synchronous output mode, making a Telnet connection to a remote host, and leaving the connection idle. This could cause large numbers of messages to be generated and queued, and these messages could consume all available RAM. You should guard against this type of attack through proper configuration.---",
    "RelatedCmds": [
        {
            "cmd": " **line** ",
            "description": " Identifies a specific line for configuration and starts the line configuration command collection mode. "
        },
        {
            "cmd": " **logging on** ",
            "description": " Controls logging of error messages and sends debug or error messages to a logging process, which logs messages to designated locations asynchronously to the processes that generated the messages. "
        }
    ]
}