{
    "PageTitle": "set master-key",
    "FuncDef": "The set master-key command sets the system master key. The set master-key command sets the system master key. By default, the system uses the default master key. For devices running versions earlier than V300R023C00, the system master key is the automatically generated master key.\n\n\nFor devices running V300R023C00 and later, the system master key is the default master key.Configuration files can be shared between devices. Encrypted files can be copied from other devices to the current device. For devices running versions earlier than V300R023C00, the system master key is the automatically generated master key. For devices running V300R023C00 and later, the system master key is the default master key.Configuration files can be shared between devices. Encrypted files can be copied from other devices to the current device.",
    "CLIs": [
        "set master-key"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> set master-key",
            "Warning: This operation will automatically save configurations. Are you sure you want to perform it? [Y/N]:y",
            "Do you want to enter the master key? (If you enter Y, you need to manually enter the master key and automatic key update stops. If you enter N, the system automatically generates a master key. If you enter D, the system will change the current master key to the default master key.) [Y/N/D]:n"
        ],
        [
            "<HUAWEI> set master-key",
            "Warning: This operation will automatically save configurations. Are you sure you want to perform it? [Y/N]:y",
            "Do you want to enter the master key? (If you enter Y, you need to manually enter the master key and automatic key update stops. If you enter N, the system automatically generates a master key. If you enter D, the system will change the current master key to the default master key.) [Y/N/D]:y"
        ],
        [
            "<HUAWEI> set master-key",
            "Warning: This operation will automatically save configurations. Are you sure you want to perform it? [Y/N]:y",
            "Do you want to enter the master key? (If you enter Y, you need to manually enter the master key and automatic key update stops. If you enter N, the system automatically generates a master key. If you enter D, the system will change the current master key to the default master key.) [Y/N/D]:d"
        ]
    ],
    "ExtraInfo": "In the actual network environment, networks and devices are provided and maintained by network providers, and data belongs to tenants. To provide secure data transmission and storage on the network, ensure that keys are under complete control of the specific tenant and cannot be obtained by network providers or other tenants. To be specific, tenants need to have their own key management schemes. Tenants can run this command to manually change the system master key as required to improve data security and reliability.There are three types of system master keys: default master key, automatically generated master key, and user-defined master key.Default master key: a fixed binary number generated by the system. The length is 32 bytes.Automatically generated master key: a random number generated by the system, which may contain letters and special characters. It is secure and does not need to be changed frequently.User-defined master key: a user-defined string of 20 to 32 characters and must contain uppercase letters, lowercase letters, digits, and special characters."
}