{
    "PageTitle": "algorithm",
    "FuncDef": "The algorithm command configures a key ID authentication algorithm.\nThe undo algorithm command deletes the configured key ID authentication algorithm. The algorithm command configures a key ID authentication algorithm. The undo algorithm command deletes the configured key ID authentication algorithm. By default, no algorithm is configured.",
    "CLIs": [
        "algorithm { md5 | sha-1 | hmac-md5 | hmac-sha1-12 | hmac-sha1-20 | hmac-sha-256 | sha-256 | sm3 | hmac-sha-384 | hmac-sha-512 }",
        "undo algorithm"
    ],
    "ParentView": [
        "weekly Key-ID view,yearly Key-ID view,daily Key-ID view,monthly Key-ID view,absolute Key-ID view"
    ],
    "ParaDef": [
        {
            "Parameters": "md5",
            "Info": "Indicates that MD5 is used for packet encryption and authentication.\nTo ensure high security, do not use the MD5 algorithm.\n-"
        },
        {
            "Parameters": "sha-1",
            "Info": "Indicates that SHA-1 is used for packet encryption and authentication.\nTo ensure high security, do not use the SHA-1 algorithm.\n-"
        },
        {
            "Parameters": "hmac-md5",
            "Info": "Indicates that HMAC-MD5 is used for packet authentication.\nTo ensure high security, do not use the HMAC-MD5 algorithm.\n-"
        },
        {
            "Parameters": "hmac-sha1-12",
            "Info": "Indicates that HMAC-Secure Hash Algorithm 1-12 (SHA1-12) is used for packet encryption and authentication.\n-"
        },
        {
            "Parameters": "hmac-sha1-20",
            "Info": "Indicates that HMAC-SHA1-20 is used for packet encryption and authentication.\n-"
        },
        {
            "Parameters": "hmac-sha-256",
            "Info": "Indicates that HMAC-Secure Hash Algorithm-256 (SHA-256) is used for packet encryption and authentication.\nHAMC-SHA-256 authentication mode is better and more secure than other authentication modes. To ensure high security, HAMC-SHA-256 authentication algorithm is recommended.\n-"
        },
        {
            "Parameters": "sha-256",
            "Info": "Indicates that SHA-256 is used for packet encryption and authentication.\n-"
        },
        {
            "Parameters": "sm3",
            "Info": "Indicates that SM3 is used for packet encryption and authentication.\n-"
        },
        {
            "Parameters": "hmac-sha-384",
            "Info": "Indicates that HMAC-SHA-384 is used for packet authentication.\nHMAC-SHA-384 authentication provides higher security than other authentication modes. To ensure high security, you are advised to use HMAC-SHA-384 for authentication.\n-"
        },
        {
            "Parameters": "hmac-sha-512",
            "Info": "Indicates that HMAC-SHA-512 is used for packet authentication.\nHMAC-SHA-512 authentication provides higher security than other authentication modes. To ensure high security, you are advised to use HMAC-SHA-512 for authentication.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] keychain huawei mode absolute",
            "[*HUAWEI-keychain-huawei] key-id 1",
            "[*HUAWEI-keychain-huawei-keyid-1] algorithm hmac-sha-256"
        ]
    ],
    "ExtraInfo": "A keychain ensures the security of application protocol packet transmission by dynamically changing the authentication algorithm and key string. A keychain consists of multiple key IDs, each of which needs to be configured with an authentication algorithm. Different key IDs are valid within different time periods, ensuring dynamic change of keychain authentication algorithms.\nProtocol packets are authenticated and encrypted based on the authentication algorithm associated with a specified key ID, improving the packet transmission security.\nThe characteristics of each authentication algorithm are as follows:"
}