{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "history",
    "FuncDef": [
        "To enable the command history function, use the **history** command in line configuration mode. To disable the command history function, use the **no** form of this command. "
    ],
    "CLIs": [
        "history",
        "no history"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "In the following example, the command history function is disabled on line 4:",
            "```",
            "Router(config)# line 4",
            "```",
            "```",
            "Router(config-line)# no history",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "The command history function provides a record of EXEC commands that you have entered. This function is particularly useful for recalling long or complex commands or entries, including access lists.To change the number of command lines that the system will record in its history buffer, use the **history size** line configuration command.The **history** command enables the history function with the last buffer size specified or, if there was not a prior setting, with the default of ten lines. The **no** **history** command disables the history function.The **show history** EXEC command will list the commands you have entered, but you can also use your keyboard to display individual commands. [Table 34](#wp1016879) lists the keys you can use to recall commands from the command history buffer.Table 34 History Keys| Key(s) | Functions || --- | --- || Ctrl-P or Up Arrow[1](#wp1016889) | Recalls commands in the history buffer in a backward sequence, beginning with the most recent command. Repeat the key sequence to recall successively older commands. || Ctrl-N or Down Arrow1 | Returns to more recent commands in the history buffer after recalling commands with Ctrl-P or the Up Arrow. Repeat the key sequence to recall successively more recent commands. || [1](#wp1016890) The arrow keys function only with ANSI-compatible terminals. || --- |  ",
    "RelatedCmds": [
        {
            "cmd": " **history size** ",
            "description": " Sets the command history buffer size for a particular line. "
        },
        {
            "cmd": " **show history** ",
            "description": " Lists the commands you have entered in the current EXEC session. "
        },
        {
            "cmd": " **terminal history** ",
            "description": " Enables the command history function for the current terminal session or changes the size of the command history buffer for the current terminal session. "
        }
    ]
}