{
    "PageTitle": "header",
    "FuncDef": "The header command configures the title contents to be displayed at a login.\nThe undo header command deletes the title contents to be displayed at a login. The header command configures the title contents to be displayed at a login. The undo header command deletes the title contents to be displayed at a login. By default, no title is displayed if a user logs in.",
    "CLIs": [
        "header login information <text>",
        "header login file <file-name>",
        "header shell information <text>",
        "header shell file <file-name>",
        "undo header login",
        "undo header shell"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "login",
            "Info": "Displays the title when the terminal connection is activated during the login to the device.\n-"
        },
        {
            "Parameters": "file <file-name>",
            "Info": "Specifies the file name used in the title.\nThe value is a string of 1 to 64 characters without spaces. The size of a title file should be equal to or smaller than 2 KB. For a title file larger than 2 KB, only the contents of the first 2 KB are displayed."
        },
        {
            "Parameters": "<file-name>",
            "Info": "Specifies the file name used in the title.\nThe value is a string of 1 to 64 characters without spaces. The size of a title file should be equal to or smaller than 2 KB. For a title file larger than 2 KB, only the contents of the first 2 KB are displayed."
        },
        {
            "Parameters": "shell",
            "Info": "Displays the title when a session is set up after the successful login to the device.\n-"
        },
        {
            "Parameters": "information <text>",
            "Info": "Specifies the title information.\nThe value is a string of 1 to 480 characters with spaces supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] header login file flash:/header-file.txt"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] header shell information hHello Welcomeh"
        ]
    ],
    "ExtraInfo": "To display some prompts or alarms to users, you can configure such information as titles on the device. When a user logs in to the device, the configured titles will be displayed.You can use the information <text> parameter to define the title information or use the file <file-name> parameter to configure the content of a specified file as the title information.When a terminal connection is activated and a user attempts to log in, the terminal displays the title configured using the header login command. If the user successfully logs in, the terminal displays the title configured using the header shell command."
}