{
    "PageTitle": "hotkey",
    "FuncDef": "The hotkey command assigns a shortcut key to a command.\nThe undo hotkey command restores the default setting of a shortcut key. The hotkey command assigns a shortcut key to a command. The undo hotkey command restores the default setting of a shortcut key. By default, the system specifies default values for shortcut keys CTRL_G, CTRL_L, and CTRL_O. The default values of other shortcut keys are empty.",
    "CLIs": [
        "hotkey CTRL_G <command-text>",
        "hotkey CTRL_L <command-text>",
        "hotkey CTRL_O <command-text>",
        "hotkey CTRL_U <command-text>",
        "undo hotkey CTRL_G",
        "undo hotkey CTRL_L",
        "undo hotkey CTRL_O",
        "undo hotkey CTRL_U"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<command-text>",
            "Info": "Specifies the command line for a shortcut key.\nIt is a string of 1 to 240 case-sensitive characters, with spaces supported. A shortcut key can be configured for each command supported by the device.\nWhen defining shortcut keys, mark the command with double quotation marks if the command consists of several words or the command includes spaces, and do not mark the command with double quotation marks if the command consists of only one word or the command includes no space."
        },
        {
            "Parameters": "CTRL_L",
            "Info": "Assigns the shortcut key Ctrl+L to a command.\n-"
        },
        {
            "Parameters": "CTRL_O",
            "Info": "Assigns the shortcut key Ctrl+O to a command.\n-"
        },
        {
            "Parameters": "CTRL_U",
            "Info": "Assigns the shortcut key Ctrl+U to a command.\n-"
        },
        {
            "Parameters": "CTRL_G",
            "Info": "Assigns the shortcut key Ctrl+G to a command.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] hotkey ctrl_g \"display tcp status\""
        ]
    ],
    "ExtraInfo": "You can assign a shortcut key to a command that is often used or change the default setting of the shortcut key that is defined by the system according to requirements.\nAfter running the hotkey command to associate a specified command line with a shortcut key, you can press the shortcut key as an alternative to the associated command line."
}