{
    "PageTitle": "set net-manager vpn-instance",
    "FuncDef": "The set net-manager vpn-instance command configures the default IPv4 VPN instance used by the NMS to manage the device.\nThe undo set net-manager vpn-instance command deletes the configured default IPv4 VPN instance.\nThe set net-manager ipv6 vpn-instance command configures the default IPv6 VPN instance used by the NMS to manage the device.\nThe undo set net-manager ipv6 vpn-instance command deletes the configured default IPv6 VPN instance. The set net-manager vpn-instance command configures the default IPv4 VPN instance used by the NMS to manage the device. The undo set net-manager vpn-instance command deletes the configured default IPv4 VPN instance. The set net-manager ipv6 vpn-instance command configures the default IPv6 VPN instance used by the NMS to manage the device. The undo set net-manager ipv6 vpn-instance command deletes the configured default IPv6 VPN instance. By default, no default VPN instance is set on a device.",
    "CLIs": [
        "set net-manager vpn-instance <vpn-instance-name>",
        "set net-manager ipv6 vpn-instance <vpn-instance-name>",
        "undo set net-manager vpn-instance",
        "undo set net-manager ipv6 vpn-instance"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<vpn-instance-name>",
            "Info": "Specifies the name of an IPv4 VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "<vpn-instance-name>",
            "Info": "Specifies the IPv6 VPN name.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "ipv6",
            "Info": "Specifies the IPv6 VPN instance.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance v2",
            "[*HUAWEI-vpn-instance-v2] quit",
            "[*HUAWEI] set net-manager ipv6 vpn-instance v2"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance v1",
            "[*HUAWEI-vpn-instance-v1] quit",
            "[*HUAWEI] set net-manager vpn-instance v1"
        ]
    ],
    "ExtraInfo": "When the NMS manages devices through a VPN, device management information needs to be sent to the NMS through the VPN.\nThe set net-manager vpn-instance command is used on a device to set a default VPN instance used by the NMS to implement device management. The default VPN instance will be used by the device to communicate with the NMS."
}