{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "scheduler heapcheck process",
    "FuncDef": [
        "To perform a \"sanity check\" for corruption in memory blocks when a process switch occurs, use the **scheduler heapcheck process** command in global configuration mode. To disable this feature, use the **no** form of this command. "
    ],
    "CLIs": [
        "scheduler heapcheck process [ memory [ fast ] [ io ] [ multibus ] [ pci ] [ processor ] [ checktype { all | magic | pointer | refcount | lite-chunks } ] ]",
        "no scheduler heapcheck process"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **memory** ",
            "Info": " (Optional) Specifies checking all memory blocks and memory pools. "
        },
        {
            "Parameters": " **fast** ",
            "Info": " (Optional) Specifies checking the fast memory block. "
        },
        {
            "Parameters": " **io** ",
            "Info": " (Optional) Specifies checking the I/O memory block. "
        },
        {
            "Parameters": " **multibus** ",
            "Info": " (Optional) Specifies checking the multibus memory block. "
        },
        {
            "Parameters": " **pci** ",
            "Info": " (Optional) Specifies checking the process control information (PCI) memory block. "
        },
        {
            "Parameters": " **processor** ",
            "Info": " (Optional) Specifies checking the processor memory block. "
        },
        {
            "Parameters": " **checktype** ",
            "Info": " (Optional) Specifies checking specific memory pools. "
        },
        {
            "Parameters": " **all** ",
            "Info": " (Optional) Specifies checking the value of the block magic, red zone, size, refcount, and pointers (next and previous). "
        },
        {
            "Parameters": " **magic** ",
            "Info": " (Optional) Specifies checking the value of the block magic, red zone, and size. "
        },
        {
            "Parameters": " **pointer** ",
            "Info": " (Optional) Specifies checking the value of the next and previous pointers. "
        },
        {
            "Parameters": " **refcount** ",
            "Info": " (Optional) Specifies checking the value of the block magic and refcount. "
        },
        {
            "Parameters": " **lite-chunks** ",
            "Info": " (Optional) Specifies checking the memory blocks allocated by the memory allocation lite (malloc_lite) feature. "
        }
    ],
    "Examples": [
        [
            "The following example shows how to sanity check for corruption in the I/O memory block when a process switch occurs. In this example, the values of only the block magic, red zone, and size will be checked.",
            "```",
            "scheduler heapcheck process memory io checktype magic",
            "```",
            "```",
            "```",
            "The following example shows how to sanity check for corruption in the processor memory block when a process switch occurs. In this example, the values of only the next and previous pointers will be checked.",
            "```",
            "scheduler heapcheck process memory processor checktype pointer",
            "```"
        ]
    ],
    "ExtraInfo": "When configuring this command, you can choose none or all memory block keywords (**fast**, **io**, **multibus**, **pci**, **processor**, and **checktype**).Enabling this command has a significant impact on router performance.",
    "RelatedCmds": [
        {
            "cmd": " **memory lite** ",
            "description": " Enables the malloc_lite feature. "
        },
        {
            "cmd": " **memory sanity** ",
            "description": " Performs a \"sanity check\" for corruption in buffers and queues. "
        }
    ]
}