{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "scheduler allocate",
    "FuncDef": [
        "To guarantee CPU time for processes, use the **scheduler allocate** command in global configuration mode. To restore the default, use the **no** form of this command. "
    ],
    "CLIs": [
        "scheduler allocate <interrupt-time process-time>",
        "no scheduler allocate"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *interrupt-time* ",
            "Info": " Integer (in microseconds) that limits the maximum number of microseconds to spend on fast switching within any one network interrupt context. The range is from 400 to 60000 microseconds. The default is 4000 microseconds. "
        },
        {
            "Parameters": " *process-time* ",
            "Info": " Integer (in microseconds) that guarantees the minimum number of microseconds to spend at the process level when network interrupts are disabled. The range is from 100 to 4000 microseconds.The default is 200 microseconds. The default for Catalyst 6500 series switches and Cisco 7600 series routers is 800 microseconds. "
        }
    ],
    "Examples": [
        [
            "The following example makes 20 percent of the CPU available for process tasks:",
            "```",
            "Router(config)# scheduler allocate 2000 500",
            "```"
        ]
    ],
    "ExtraInfo": "This command applies to the Catalyst 6500 series switches, Cisco 7200 series, Cisco 7500 series, and Cisco 7600 series routers.![](/c/dam/en/us/td/i/templates/caut.gif)---**Caution** ![](/c/dam/en/us/td/i/templates/blank.gif)We recommend that you do not change the default settings. Changing settings associated with CPU processes can negatively impact system performance.---Entering the **scheduler allocate** command without arguments is the same as entering the **no scheduler allocate** or the **default scheduler allocate** command.",
    "RelatedCmds": [
        {
            "cmd": " **scheduler interval** ",
            "description": " Controls the maximum amount of time that can elapse without running system processes. "
        }
    ]
}