{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "service udp-small-servers",
    "FuncDef": [
        "To enable small User Datagram Protocol (UDP) servers such as the Echo, use the **service udp-small-servers** command in global configuration mode. To disable the UDP server, use the **no** form of this command. "
    ],
    "CLIs": [
        "service udp-small-servers [ max-servers <number> | no-limit ]",
        "no service udp-small-servers [ max-servers <number> | no-limit ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **max-servers** ",
            "Info": " (Optional) Sets the number of allowable UDP small servers. "
        },
        {
            "Parameters": " *number* ",
            "Info": " (Optional) Maximum number of UDP small servers. Range is 1 to 2147483647. "
        },
        {
            "Parameters": " **no-limit** ",
            "Info": " (Optional) Allows the number of TCP small servers to have no limit. "
        }
    ],
    "Examples": [
        [
            "The following example shows how to enable small UDP servers and set the maximum <number> of allowable small servers to 10:",
            "```",
            "Router(config)# service udp-small-servers max-servers 10",
            "```"
        ]
    ],
    "ExtraInfo": "To use this command, you must be in a user group associated with a task group that includes the proper task IDs. If you suspect user group assignment is preventing you from using a command, contact your Authentication, Authorization, and Accounting (AAA) administrator for assistance.The UDP small servers currently consist of three services: Discard (port 9), Echo (port 7), and Chargen (port 19). These services are used to test the UDP transport functionality. The discard server receives data and discards it. The echo server receives data and echoes the same data to the sending host. The chargen server generates a sequence of data and sends it to the remote host.",
    "RelatedCmds": [
        {
            "cmd": " **service tcp-small-servers** ",
            "description": " Enables small TCP servers such as the Echo. "
        }
    ]
}