{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "service hide-telnet-address",
    "FuncDef": [
        "To hide addresses while trying to establish a Telnet session, use the**service hide-telnet-address**command in global configuration mode. To disable this service, use the **no** form of this command. "
    ],
    "CLIs": [
        "service hide-telnet-address",
        "no service hide-telnet-address"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "The following example hides Telnet addresses:",
            "```",
            "Router(config)# service hide-telnet-address",
            "```"
        ]
    ],
    "ExtraInfo": "When you attempt to connect to a device, the router displays addresses and other messages (for example, \"Trying router1 (171.69.1.154, 2008)...).\" With the hide feature, the router suppresses the display of the address (for example, \"Trying router1 address #1...\"). The router continues to display all other messages that would normally be displayed during a connection attempt, such as detailed error messages if the connection was not successful.The hide feature improves the functionality of the busy-message feature. When you configure only the **busy-message** command, the normal messages generated during a connection attempt are not displayed; only the busy-message is displayed. When you use the hide and busy features together you can customize the information displayed during Telnet connection attempts. When you configure the **service hide-telnet-address** command and the **busy-message** command, the router suppresses the address and displays the message specified with the **busy-message** command if the connection attempt is not successful.",
    "RelatedCmds": [
        {
            "cmd": " **busy-message** ",
            "description": " Creates a \"host failed\" message that is displayed when a connection fails. "
        }
    ]
}