{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "state-machine",
    "FuncDef": [
        "**To specify the transition criteria for the state of a particular state machine, use the** **state-machine** command in global configuration mode. To remove a particular state machine from the configuration, use the **no** form of this command. "
    ],
    "CLIs": [
        "To specify the transition criteria for the state of a particular state machine, use the state-machine command in global configuration mode. To remove a particular state machine from the configuration, use the no form of this command.",
        "state-machine <name state first-character last-character> [ <next-state> delay | transmit ]",
        "nostate-machine <name>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *name* ",
            "Info": " Name for the state machine (used in the **dispatch-machine** line configuration command). The user can specify any number of state machines, but each line can have only one state machine associated with it. "
        },
        {
            "Parameters": " *state* ",
            "Info": " State being modified. There are a maximum of eight states per state machine. The range is from 0 to 7. Lines are initialized to state 0 and return to state 0 after a packet is transmitted. "
        },
        {
            "Parameters": " *first-character last-character* ",
            "Info": " A range of characters. Use ASCII numerical values. The range is from 0 to 255.  If the state machine is in the indicated state, and the next character input is within this range, the process goes to the specified next state. Full 8-bit character comparisons are performed, so the maximum value is 255. Ensure that the line is configured to strip parity bits (or not generate them), or duplicate the low characters in the upper half of the space. "
        },
        {
            "Parameters": " *next-state* ",
            "Info": " (Optional) State to enter if the character is in the specified range. The range is from 0 to 7. "
        },
        {
            "Parameters": " **delay** ",
            "Info": " (Optional) Transmits the packet if there is no input within 50 milliseconds. "
        },
        {
            "Parameters": " **transmit** ",
            "Info": " (Optional) Causes the packet to be transmitted and the state machine to be reset to state 0. Recurring characters that have not been explicitly defined to have a particular action return the state machine to state 0. "
        }
    ],
    "Examples": [
        [
            "In the following example a dispatch machine named \"function<\"> is configured to ensure that the function key characters on an ANSI terminal are kept in one packet. Because the default in the example is to remain in state 0 without sending anything, normal key signals are sent immediately.",
            "```",
            "Router(config)# line 1 20",
            "```",
            "```",
            "Router(config-line)# dispatch-machine function",
            "```",
            "```",
            "Router(config-line)# exit",
            "```",
            "```",
            "Router(config)# <state>-machine function 0 0 255 6 transmit",
            "```"
        ]
    ],
    "ExtraInfo": "This command is paired with the **dispatch-machine**line configuration command, which defines the line on which the state machine is effective.",
    "RelatedCmds": [
        {
            "cmd": " **dispatch-character** ",
            "description": " Defines a character that causes a packet to be sent. "
        },
        {
            "cmd": " **dispatch-machine** ",
            "description": " Specifies an identifier for a TCP packet dispatch state machine on a particular line. "
        },
        {
            "cmd": " **dispatch-timeout** ",
            "description": " Sets the character dispatch timer. "
        }
    ]
}