{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "storm-control level",
    "FuncDef": [
        "To set the suppression level, use the **storm-control level** command in interface configuration mode. To turn off the suppression mode, use the **no** form of this command. "
    ],
    "CLIs": [
        "storm-control { broadcast | multicast | unicast } level <level> [ .<level> ]",
        "no storm-control { broadcast | multicast | unicast } level"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **broadcast** ",
            "Info": " Specifies the broadcast traffic. "
        },
        {
            "Parameters": " **multicast** ",
            "Info": " Specifies the multicast traffic. "
        },
        {
            "Parameters": " **unicast** ",
            "Info": " Specifies the unicast traffic. "
        },
        {
            "Parameters": " *level* ",
            "Info": " Integer-suppression level; valid values are from 0 to 100 percent. "
        },
        {
            "Parameters": " **.***level* ",
            "Info": " (Optional) Fractional-suppression level; valid values are from 0 to 99. "
        }
    ],
    "Examples": [
        [
            "```",
            "Router(config-if)# storm-control broadcast <level> 30",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "Router(config-if)# no storm-control multicast <level>",
            "```"
        ]
    ],
    "ExtraInfo": "You can enter this command on switch ports and router ports.Enter the **storm-control level** command to enable traffic storm control on the interface, configure the traffic storm-control level, and apply the traffic storm-control level to all traffic storm-control modes that are enabled on the interface.Only one suppression level is shared by all three suppression modes. For example, if you set the broadcast level to 30 and set the multicast level to 40, both levels are enabled and set to 40.The Cisco 7600 series router supports storm control for multicast and unicast traffic only on Gigabit Ethernet LAN ports. The switch supports storm control for broadcast traffic on all LAN ports.The **multicast** and **unicast** keywords are supported on Gigabit Ethernet LAN ports only. These keywords are not supported on 10 Mbps, 10/100 Mbps, 100 Mbps, or 10-Gigabit Ethernet modules.The period is required when you enter the fractional-suppression level.The suppression level is entered as a percentage of the total bandwidth. A threshold value of 100 percent means that no limit is placed on traffic. A threshold value of 0 or 0.0 (fractional) percent means that all specified traffic is blocked on a port, with the following guidelines:•![](/c/dam/en/us/td/i/templates/blank.gif)A fractional level value of 0.33 or lower is the same as 0.0 on the following modules:–![](/c/dam/en/us/td/i/templates/blank.gif)WS-X6704-10GE–![](/c/dam/en/us/td/i/templates/blank.gif)WS-X6748-SFP–![](/c/dam/en/us/td/i/templates/blank.gif)WS-X6724-SFP–![](/c/dam/en/us/td/i/templates/blank.gif)WS-X6748-GE-TX•![](/c/dam/en/us/td/i/templates/blank.gif)Enter 0 on all other modules to block all specified traffic on a port.Enter the **show interfaces counters** **broadcast** command to display the discard count.Enter the **show running-config** command to display the enabled suppression mode and level setting.To turn off suppression for the specified traffic type, you can do one of the following:•![](/c/dam/en/us/td/i/templates/blank.gif)Set the *level* to 100 percent for the specified traffic type.•![](/c/dam/en/us/td/i/templates/blank.gif)Use the **no** form of this command.",
    "RelatedCmds": [
        {
            "cmd": " **show interfaces counters** ",
            "description": " Displays the traffic that the physical interface sees. "
        },
        {
            "cmd": " **show running-config** ",
            "description": " Displays the status and configuration of the module or Layer 2 VLAN. "
        }
    ]
}