{
    "PageTitle": "display mld group static",
    "FuncDef": "The display mld group static command displays information about Multicast Listener Discovery (MLD) groups, including MLD groups that hosts dynamically join by sending Report messages and multicast groups that hosts are configured to statically join by using commands. The display mld group static command displays information about Multicast Listener Discovery (MLD) groups, including MLD groups that hosts dynamically join by sending Report messages and multicast groups that hosts are configured to statically join by using commands. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display mld group [ <GrpAddr6> | interface { <port-type> <port-num> | <port-name> } ] static [ verbose ]",
        "display mld { vpn-instance <vpn-instance-name> | all-instance } group [ <GrpAddr6> | interface { <port-type> <port-num> | <port-name> } ] static [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface <port-type> <port-num>",
            "Info": "Specifies the type and number of an interface.\n-"
        },
        {
            "Parameters": "interface <port-name>",
            "Info": "Specifies an interface name.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "static",
            "Info": "Displays information about MLD groups that hosts statically join.\n-"
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about MLD multicast groups that hosts join.\n-"
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "all-instance",
            "Info": "Specifies all VPN instance.\n-"
        },
        {
            "Parameters": "group <GrpAddr6>",
            "Info": "Specifies an IPv6 multicast group address.\nThe value is in hexadecimal notation and in the format of FFxA:xxxx:xxxx::xxxx, in which x ranges from 0 to F and A is 0 or ranges from 3 to F."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display mld all-instance group static verbose"
        ]
    ],
    "ExtraInfo": ""
}