{
    "PageTitle": "display mld interface (All views)",
    "FuncDef": "The display mld interface command displays Multicast Listener Discovery (MLD) parameters set on an interface. The display mld interface command displays Multicast Listener Discovery (MLD) parameters set on an interface. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display mld interface { up | down } [ verbose ]",
        "display mld { vpn-instance <vpn-instance-name> | all-instance } interface { up | down } [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "up",
            "Info": "Displays information about the interface with the IP protocol status being Up and the MLD protocol status being Active.\n-"
        },
        {
            "Parameters": "down",
            "Info": "Displays information about the interface with the IP protocol status being Down and the MLD protocol status being Inactive.\n-"
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about all MLD interfaces or a specified MLD interface.\n-"
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "all-instance",
            "Info": "Specifies all VPN instance.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] display mld interface up verbose"
        ]
    ],
    "ExtraInfo": ""
}