{
    "PageTitle": "mld access-limit",
    "FuncDef": "The mld access-limit command sets the maximum number of MLD group memberships that can be created on an interface.\nThe undo mld access-limit command cancels the setting. The mld access-limit command sets the maximum number of MLD group memberships that can be created on an interface. The undo mld access-limit command cancels the setting. By default, the maximum number of MLD group memberships on an interface is not configured. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "mld access-limit <number> [ except { <ExceptAclNumValue> | acl6-name <ExceptAclNameValue> } ]",
        "undo mld access-limit [ <number> [ except { <ExceptAclNumValue> | acl6-name <ExceptAclNameValue> } ] ]"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<number>",
            "Info": "Specifies the maximum number of MLD entries that can be created on an interface.\nThe value is an integer ranging from 1 to 16384."
        },
        {
            "Parameters": "except <ExceptAclNumValue>",
            "Info": "Specifies the number of a basic or an advanced ACL.\nThe number of a basic ACL is an integer that ranges from 2000 to 2999. The basic ACL filters group addresses only. The number of an advanced ACL is an integer that ranges from 3000 to 3999. The advanced ACL filters source and group addresses."
        },
        {
            "Parameters": "acl6-name <ExceptAclNameValue>",
            "Info": "Specifies the name of a named ACL.\nThe value is a string of 1 to 32 case-sensitive characters without spaces. The value starts with a letter or digit but cannot contain only digits."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] mld access-limit 1024"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] acl ipv6 name myacl",
            "[*HUAWEI-acl6-advance-myacl] rule permit ipv6 source 2001:db8:100::1 128 destination FF1E::1 120",
            "[*HUAWEI-acl6-advance-myacl] quit",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] mld access-limit 1024 except acl6-name myacl"
        ]
    ],
    "ExtraInfo": "When a large number of users watch multiple programs at the same time, a large amount of bandwidth of the router is occupied, which degrades the performance of the router. To prevent this problem, run the mld access-limit command on the router interface to limit the number of MLD entries. When receiving an MLD Join message, the router checks whether the number of entries exceeds the limit. If the number of entries does not exceed the limit, the router sets up a member relationship and forwards the data flow of the multicast group to the user. This improves the clarity and stability of programs for users who have joined multicast groups.\nThe methods of counting the number of MLD entries are as follows:"
}