{
    "PageTitle": "ping",
    "FuncDef": "The ping command checks the connectivity of an IP network and reachability of a host.",
    "CLIs": [
        "ping [ ip ] { [ -c <count> | -i { <interface-name> | <interface-type> <interface-number> } | -nexthop <nexthop-address> | { -range [ min <min-value> | max <max-value> | step <step-value> ] | -s <packetsize> } | -t <timeout> | -m <time> | -a <source-ip-address> [ -ignore-vpn | -response-vpn <respVrfName> ] | -h <ttl-value> | -p <pattern> | { -tos <tos-value> | -dscp <dscp-value> } | { -f | ignore-mtu } | -q | -r | -vpn-instance <vpn-instance-name> | -v | -name | -system-time | -ri | -8021p <8021p-value> | -detail ] <host> [ ip-forwarding ] }",
        "ping [ ip ] { [ -c <count> | -i { <interface-name> | <interface-type> <interface-number> } | -nexthop <nexthop-address> | { -range [ min <min-value> | max <max-value> | step <step-value> ] | -s <packetsize> } | -t <timeout> | -m <time> | -a <source-ip-address> | -h <ttl-value> | -p <pattern> | { -tos <tos-value> | -dscp <dscp-value> } | { -f | ignore-mtu } | -vpn-instance <vpn-instance-name> | -name | -8021p <8021p-value> | -brief ] <host> [ ip-forwarding ] }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "ip",
            "Info": "Specifies the IPv4 protocol.\nThe default value is IPv4."
        },
        {
            "Parameters": "-c <count>",
            "Info": "Specifies the maximum number of times for sending ICMP echo request packets. After you run the ping command, the sequence number of an ICMP echo request packet starts from 1 and is incremented by 1 each time an ICMP echo request packet is sent. By default, five ICMP echo request packets are sent. You can use count to specify the number of ICMP echo request packets to be sent. If the peer is reachable, it sends five ICMP Echo Response packets with the same sequence numbers as those of the ICMP echo request packets. In the case of a poor network quality, increase the count value and monitor network quality based on the packet loss ratio.\nThe value is an integer ranging from 1 to 4294967295. The default value is 5."
        },
        {
            "Parameters": "-i <interface-name>",
            "Info": "Specifies the interface through which ICMP echo request packets are sent. For broadcast links (on the Ethernet), the specified destination address functions as the next hop address.\nThe value is a string of 1 to 63 characters."
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an interface through which ICMP echo request packets are sent. For broadcast links (on the Ethernet), the specified destination address functions as the next hop address.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of an interface through which ICMP echo request packets are sent. For broadcast links (on the Ethernet), the specified destination address functions as the next hop address.\n-"
        },
        {
            "Parameters": "-nexthop <nexthop-address>",
            "Info": "Specifies an IP address for the next hop. If you have specified this parameter, the device no longer searches the routing table before sending ICMP Echo Response packets. This process prevents ping failures caused by incorrect routing entries.\nThe value is in dotted decimal notation.\n\nThe specified next hop address must be the next hop address of a directly connected physical interface.\nWhen specifying the next hop address, you can configure -i interface-type interface-number to specify the outbound interface. The following conditions must be met to ensure a test success:\n               \n The specified next hop address must match the outbound interface.\n The specified outbound interface cannot be a logical interface's member interface.\n \nWhen you specify the next hop address, you cannot specify a VPN."
        },
        {
            "Parameters": "-s <packetsize>",
            "Info": "Specifies the length of an ICMP echo request packet (excluding the IP header and ICMP header).\nThe value is an integer ranging from 10 to 9600, in bytes. The default value is 56."
        },
        {
            "Parameters": "-range",
            "Info": "Enables the device to send ICMP echo request messages with variable payload lengths.\nIf -range is not specified, the length of the sent packet is -s packetsize. The default value is 56.\nIf -range is specified, the length of the first sent packet is min min-value, and the lengths of subsequent packets increase by step step-value until the packet length reaches max max-value.\n\nBy default, the payload length ranges from 56 to 9600, and the step is 1.\n\nDuring the execution, you can press Ctrl+C to terminate the execution.\nYou can adjust the values of min min-value and max max-value to control the number of packets to be sent. The value of min min-value must be smaller than that of max max-value.\nIf both the -range and -c count parameters are specified, the device sends ICMP Echo Request messages of the same payload length for the number of times specified by the -c count parameter."
        },
        {
            "Parameters": "min <min-value>",
            "Info": "Specifies the minimum payload length of an ICMP echo request message.\nThe value is an integer that ranges from 20 to 9600, in bytes. The default value is 56, in bytes."
        },
        {
            "Parameters": "max <max-value>",
            "Info": "Specifies the minimum payload length of an ICMP Echo Request message.\nThe value is an integer that ranges from 20 to 9600, in bytes. The default value is 9600."
        },
        {
            "Parameters": "step <step-value>",
            "Info": "Specifies the step length of an ICMP echo request message.\nThe value is an integer that ranges from 1 to 1000. The default value is 1."
        },
        {
            "Parameters": "-t <timeout>",
            "Info": "Specifies the timeout period for waiting for an ICMP Echo Reply packet after an ICMP Echo Request Packet is sent. After the ping command is run, the source sends an ICMP Echo Request packet to a specific address and waits for a reply. If the destination sends an ICMP Echo Reply packet to the source within the time specified by timeout, the destination is reachable. If the destination does not send any reply within the timeout period, the source displays a timeout message. Normally, the source will receive an ICMP Echo Reply packet within 1 to 10 seconds after an ICMP Echo Request packet is sent. If the network transmission rate is low, increase the timeout period.\nThe value is an integer ranging from 0 to 65535, in milliseconds. The default value is 2000."
        },
        {
            "Parameters": "-m <time>",
            "Info": "Specifies the interval at which ICMP echo request packets are sent. After you run the ping command, the device sends an ICMP echo request packet. If the device fails to receive a reply within 500 ms, it sends the next ICMP echo request packet. You can use the time parameter to set the interval at which ICMP echo request packets are sent. Do not set this parameter to less than 2000 ms on an unstable network.\nThe value is an integer ranging from 1 to 10000, in milliseconds. The default value is 500."
        },
        {
            "Parameters": "-a <source-ip-address>",
            "Info": "Specifies a source IP address for the ICMP Echo Request messages to be sent. If no source IP address is specified, the IP address of the outbound interface of the route is used as the source address of ICMP Echo Request messages. For example, in a VPN scenario, an IP address in the VPN is preferentially used as the source address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "-ignore-vpn",
            "Info": "Indicates that the VPN instance is ignored in response packets.\n-"
        },
        {
            "Parameters": "-response-vpn <respVrfName>",
            "Info": "Specifies the VPN instance name of response packets.\nThe value is a string of 1 to 31 case-sensitive characters, which do not contain spaces. The VPN instance name cannot be _public_. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "-h <ttl-value>",
            "Info": "Specifies the TTL value. If the TTL value in a packet is reduced to 0 during forwarding, the device that receives the packet sends an ICMP timeout packet to the source, indicating that the destination is unreachable.\nThe value is an integer ranging from 1 to 255. The default value is 255."
        },
        {
            "Parameters": "-p <pattern>",
            "Info": "Specifies the padding byte of ICMP echo request packets. The padding byte allows the system to identify a specific packet among a great number of received ICMP Echo Response packets.\nThe value is in hexadecimal notation and ranges from 0 to FFFFFFFF. By default, the padding starts from 0x00 in ascending order."
        },
        {
            "Parameters": "-tos <tos-value>",
            "Info": "Specifies the ToS value of an ICMP echo request packet. The priority of an ICMP packet is determined by the ToS value.\nThe value is an integer ranging from 0 to 255. The default value is 0."
        },
        {
            "Parameters": "-dscp <dscp-value>",
            "Info": "Specifies the DSCP value of an Echo Request packet to be sent.\nThe value is an integer ranging from 0 to 63. The default value is <b>0</b>."
        },
        {
            "Parameters": "-f",
            "Info": "Indicates that packets are not fragmented during transmission.\nBy default, packets will be fragmented during transmission."
        },
        {
            "Parameters": "ignore-mtu",
            "Info": "Indicates that the system does not check the interface MTU when a packet is sent.\n-"
        },
        {
            "Parameters": "-q",
            "Info": "Indicates that only statistics are displayed. By default, all information is displayed. If -q is specified in the ping command, the system displays only statistics about sent and received packets, packet loss ratio, and minimum, average, and maximum RTTs.\nBy default, the system displays all information."
        },
        {
            "Parameters": "-r",
            "Info": "Records routes. If -r is configured, the IP address of each device that the IP packet passes along the packet transmission path is recorded in the Options field. When the IP packet reaches the destination, all IP addresses recorded in the Options field are copied to an ICMP Echo Response packet. In addition, the IP address of each device that the ICMP Echo Response packet passes through is recorded. When the ping program receives the reply, IP addresses of the passed devices are displayed.\nBy default, no route is recorded."
        },
        {
            "Parameters": "-vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "-v",
            "Info": "Enables the device to display ICMP echo reply packets that are received by but not for this device. For example, a packet times out, or the sequence number of a packet is incorrect.\n\nIf -v is not configured, the system displays only the ICMP Echo Response packets received by the local user.If -v is configured, the system displays all received ICMP Echo Response packets.\nIf the sequence number of a received ICMP Echo Response packet is incorrect or the packet delay is longer than the timeout period, the system displays a detailed message.\nBy default, non-user ICMP Echo Reply messages are not displayed."
        },
        {
            "Parameters": "-system-time",
            "Info": "Specifies the system time when an ICMP echo request packet is sent.\n-"
        },
        {
            "Parameters": "-ri",
            "Info": "Indicates that the source interface of echo response packet is displayed.\n-"
        },
        {
            "Parameters": "-8021p <8021p-value>",
            "Info": "Specifies the 802.1p value of an echo request packet to be sent.\nThe value is an integer ranging from 0 to 7. The default value is 0."
        },
        {
            "Parameters": "-name",
            "Info": "Displays the host name of the destination address.\n-"
        },
        {
            "Parameters": "-detail",
            "Info": "Displays detailed information about packet loss.\n-"
        },
        {
            "Parameters": "<host>",
            "Info": "Specifies the IP address or host name of a remote system.\nThe value is a string of case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "ip-forwarding",
            "Info": "Indicates that the ping packets are forcibly forwarded through IP on the first node.\n-"
        },
        {
            "Parameters": "-brief",
            "Info": "Displays brief information about packet loss.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> ping -m 3000 -s 300 -vpn-instance vpna 10.1.1.2"
        ],
        [
            "<HUAWEI> ping -range min 56 max 60 192.168.1.9"
        ],
        [
            "<HUAWEI> ping -detail 10.1.1.3"
        ],
        [
            "<HUAWEI> ping www.huawei.com"
        ],
        [
            "<HUAWEI> ping -a 1.1.1.1 -c 8 10.1.1.2"
        ],
        [
            "<HUAWEI> ping 10.1.1.2"
        ],
        [
            "<HUAWEI> ping -brief 10.1.1.2"
        ],
        [
            "<HUAWEI> ping -c 2 -a 192.168.10.2 -name 192.168.10.2"
        ],
        [
            "<HUAWEI> ping -v -m 300 -t 300 10.0.0.1"
        ],
        [
            "<HUAWEI> ping -a 192.168.2.1 -response-vpn vpnb -vpn-instance vpna 192.168.1.2"
        ]
    ],
    "ExtraInfo": "Ping is a common debugging tool used to test the network connectivity. It uses ICMP packets to check the following items:"
}