{
    "PageTitle": "ping ipv6",
    "FuncDef": "The ping ipv6 command checks whether an IPv6 host is reachable.",
    "CLIs": [
        "ping ipv6 { [ -a <source-ipv6-address> | -c <echo-number> | { -s <byte-number> | -range [ [ min <min-value> | max <max-value> | step <step-value> ] ] } | -t <timeout> | { -tc <traffic-class-value> | -dscp <dscp> } | vpn-instance <vpn-instance-name> | -m <wait-time> | -name | -h <hoplimit> | { -brief | [ -system-time | -ri | -detail ] } | -nexthop <nextHopAddr> | -p <pattern> | ignore-mtu ] <destination-ipv6-address> [ -i { <interface-name> | <interface-type> <interface-number> } ] [ ipv6-forwarding ] }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "-a <source-ipv6-address>",
            "Info": "Specifies a source IPv6 address for the ICMPv6 Echo Request messages to be sent. If no source IPv6 address is specified, the IPv6 address of the outbound interface of the route is used as the source address of ICMPv6 Echo Request messages. For example, in a VPN scenario, an IPv6 address in the VPN is preferentially used as the source address.\nThe value is a 32-digit hexadecimal number in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "-c <echo-number>",
            "Info": "Specifies the maximum number of times for sending ICMPv6 echo request packets. In the case of a poor network quality, increase the value to check network quality based on the packet loss ratio.\nThe value is an integer ranging from 1 to 4294967295. The default value is 5."
        },
        {
            "Parameters": "-s <byte-number>",
            "Info": "Specifies the length of an ICMPv6 echo request packet (excluding IP and ICMPv6 headers).\nThe value is an integer that ranges from 20 to 9600, in bytes. The default value is 56, in bytes."
        },
        {
            "Parameters": "-range",
            "Info": "Enables the device to send ICMPv6 echo request messages with variable payload lengths.\nIf -range is not specified, the length of sent packets is specified by -s byte-number. The default value is 56, in bytes.\nIf -range is specified, the length of the first sent packet is specified by min min-value, and the length of subsequent packets increases by a value specified by step step-value until the packet length reaches the maximum value (specified by max max-value).\n\nBy default, the length ranges from 56 to 9600, and the step is 1.\n\nDuring the execution, you can press Ctrl+C to terminate the execution.\nYou can adjust the values of min min-value and max max-value to control the number of packets to be sent. The value of min min-value must be smaller than that of max max-value.\n-range and -c echo-number can be used together. In this case, after packets of the same length are sent for the number of times specified by echo-number, the packet length increases by a step until the next packet length is reached."
        },
        {
            "Parameters": "min <min-value>",
            "Info": "Specifies the minimum payload length of an ICMPv6 echo request message.\nThe value is an integer that ranges from 20 to 9600, in bytes. The default value is 56, in bytes."
        },
        {
            "Parameters": "max <max-value>",
            "Info": "Specifies the maximum payload length of an ICMPv6 echo request message.\nThe value is an integer ranging from 20 to 9600, in bytes. The default value is 9600."
        },
        {
            "Parameters": "step <step-value>",
            "Info": "Specifies the step length of an ICMPv6 echo request message.\nThe value is an integer ranging from 1 to 1000, in bytes. The default value is 1."
        },
        {
            "Parameters": "-t <timeout>",
            "Info": "Specifies the timeout period for waiting for an ICMPv6 Echo Reply packet after an ICMPv6 Echo Request Packet is sent. After the ping command is run, the source sends an ICMPv6 Echo Request packet to a specific address and waits for a reply. If the destination sends an ICMPv6 Echo Reply packet to the source within the time specified by timeout, the destination is reachable. If the destination does not send any reply within the timeout period, the source displays \"Request time out\". Normally, the source will receive an ICMPv6 Echo Reply packet within 1 to 10 seconds after an ICMPv6 Echo Request packet is sent. If the network transmission rate is low, increase the timeout period.\nThe value is an integer ranging from 0 to 65535, in milliseconds. The default value is 2000."
        },
        {
            "Parameters": "-tc <traffic-class-value>",
            "Info": "Specifies the traffic class for ICMPv6 echo request packets. You can specify traffic-class-value to control ICMPv6 traffic.\nThe value is an integer ranging from 0 to 255. The default value is 0."
        },
        {
            "Parameters": "-dscp <dscp>",
            "Info": "Specifies the DSCP value of an ICMPv6 echo request packet to be sent.\nThe value is an integer ranging from 0 to 63. The default value is <b>0</b>."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the VPN instance to which the IPv6 address belongs.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The VPN instance name cannot be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "-m <wait-time>",
            "Info": "Specifies the interval at which ICMPv6 echo request packets are sent. After the ping command is run, the device sends an ICMPv6 echo request packet. If the device fails to receive a reply within 500 ms, it sends the next ICMPv6 echo request packet. You can use this parameter to set the packet sending interval as required. Do not set this parameter to less than 2000 ms on an unstable network.\nThe value is an integer ranging from 1 to 10000, in milliseconds. The default value is 500."
        },
        {
            "Parameters": "-name",
            "Info": "Displays the host name of the destination address.\n-"
        },
        {
            "Parameters": "-nexthop <nextHopAddr>",
            "Info": "Specifies an IPv6 address for the next hop. If you have specified this parameter, the device no longer searches the routing table before sending ICMPv6 Echo Response packets. This process prevents ping failures caused by incorrect routing entries.\nThe value is a 32-digit hexadecimal number, in the format X:X:X:X:X:X:X:X.\n\nThe specified next hop address must be the next hop address of a directly connected physical interface.\nWhen specifying the next hop address, you can configure -i interface-type interface-number to specify the outbound interface. The following conditions must be met to ensure a successful test:\nThe specified next hop address matches the outbound interface.\nThe specified outbound interface cannot be a member interface of a logical interface.\nWhen you specify the next hop address, you cannot specify a VPN."
        },
        {
            "Parameters": "-h <hoplimit>",
            "Info": "Specifies the hop limit value for ICMPv6 Echo Request packet to be sent.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "-brief",
            "Info": "Displays brief information about packet loss.\n-"
        },
        {
            "Parameters": "-system-time",
            "Info": "Specifies the system time when an ICMP echo request packet is sent.\n-"
        },
        {
            "Parameters": "-ri",
            "Info": "Indicates that the source interface of echo response packet is displayed.\n-"
        },
        {
            "Parameters": "-detail",
            "Info": "Displays detailed information about packet loss.\n-"
        },
        {
            "Parameters": "-p <pattern>",
            "Info": "Specifies the padding byte of ICMPv6 Echo Request packets. The padding byte allows the system to identify a specific packet among a large number of received ICMPv6 Echo Reply packets.\nThe value is a hexadecimal number ranging from 0 to FFFFFFFF. By default, the padding starts from 0x00."
        },
        {
            "Parameters": "ignore-mtu",
            "Info": "Indicates that the system does not check the interface MTU when a packet is sent.\n-"
        },
        {
            "Parameters": "<destination-ipv6-address>",
            "Info": "Specifies the source IPv6 address of an ICMPv6 echo request packet to be sent.\nThe value is a 32-digit hexadecimal number in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "-i <interface-name>",
            "Info": "Specifies the name of an outbound interface through which ICMPv6 Echo Request packets are sent. If the specified destination IPv6 address is a link-local address, specify the outbound interface for ICMPv6 Echo Request packets.\n-"
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an outbound interface through which ICMPv6 Echo Request packets are sent. If the specified destination IPv6 address is a link-local address, specify the outbound interface for ICMPv6 Echo Request packets.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of an outbound interface through which ICMP Echo Request packets are sent. If the specified destination IPv6 address is a link-local address, specify the outbound interface for ICMP Echo Request packets.\n-"
        },
        {
            "Parameters": "ipv6-forwarding",
            "Info": "Indicates that the ping packets are forcibly forwarded through IPv6 on the first node.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> ping ipv6 -c 1 -name www.huawei.com",
            "Resolved Host ( www.huawei.com -> 2001:db8::1 )"
        ],
        [
            "<HUAWEI> ping ipv6 -c 1 -name 2001:db8::1"
        ],
        [
            "<HUAWEI> ping ipv6 2001:DB8::1"
        ],
        [
            "<HUAWEI> ping ipv6 -brief 2001:db8:1::1"
        ]
    ],
    "ExtraInfo": "To check network connectivity, run the ping ipv6 command. It uses ICMPv6 messages to monitor the following items:"
}