{
    "PageTitle": "tracert vxlan",
    "FuncDef": "The tracert vxlan command detects the gateways that packets pass through when traveling from the source host to the destination host on a VXLAN. The tracert vxlan command detects the gateways that packets pass through when traveling from the source host to the destination host on a VXLAN. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "tracert vxlan [ -t <timeout> | -r <replymode> | -a <innersrc-address> | -h <maxttl> ] vni <vniid> source <source-address> peer <dest-address> [ udp-port <dest-port> ] [ pipe ] [ load-balance { vxlan-source-udpport <vxlan-source-udpport> | { source-address <lb-src-address> destination-address <lb-dst-address> protocol { udp | <lb-protocolid> } source-port <lb-src-port> destination-port <lb-dst-port> source-mac <lb-sourcemac> destination-mac <lb-destinationmac> } } ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "-t <timeout>",
            "Info": "Specifies the timeout interval for receiving a response packet.\nThe value is an integer ranging from 0 to 65535. The default value is 2000."
        },
        {
            "Parameters": "-r <replymode>",
            "Info": "Specifies the mode in which the peer end returns response packets.\nThe value is 1, 2, or 3.\nEach mode is described as follows:\n1: do not reply\n2: reply with an IPv4 or IPv6 UDP packet\n3: reply through the control channel of the application plane\nThe default value is 2."
        },
        {
            "Parameters": "-a <innersrc-address>",
            "Info": "Specifies an inner source IPv4 address.\nThe value is in dotted decimal notation. The default value is the IP address of the outbound interface."
        },
        {
            "Parameters": "-h <maxttl>",
            "Info": "Specifies the maximum number of hops on a detected path.\nThe value is an integer ranging from 1 to 255. The default value is 30."
        },
        {
            "Parameters": "vni <vniid>",
            "Info": "Specifies a VXLAN network indicator (NI).\nThe value is an integer ranging from 1 to 16777215."
        },
        {
            "Parameters": "source <source-address>",
            "Info": "Specifies a source IPv4 address for a VXLAN tunnel.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "source-address <lb-src-address>",
            "Info": "Specifies a load balance source IPv4 address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "peer <dest-address>",
            "Info": "Specifies a peer IPv4 address for a VXLAN tunnel.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "udp-port <dest-port>",
            "Info": "Specifies a destination UDP port number.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "pipe",
            "Info": "Sets the TTL copy mode to pipe.\n-"
        },
        {
            "Parameters": "load-balance",
            "Info": "Indicates load balancing.\n-"
        },
        {
            "Parameters": "vxlan-source-udpport <vxlan-source-udpport>",
            "Info": "Specifies a source port number for VXLAN packets.\nThe value is an integer ranging from 49152 to 65535."
        },
        {
            "Parameters": "destination-address <lb-dst-address>",
            "Info": "Specifies a load balance destination IPv4 address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "protocol",
            "Info": "Specifies a protocol type.\n-"
        },
        {
            "Parameters": "udp",
            "Info": "Indicates the UDP protocol type.\n-"
        },
        {
            "Parameters": "<lb-protocolid>",
            "Info": "Specifies the protocol number.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "source-port <lb-src-port>",
            "Info": "Specifies a load balance source port number.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "destination-port <lb-dst-port>",
            "Info": "Specifies a load balance destination port number.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "source-mac <lb-sourcemac>",
            "Info": "Specifies a load balance source MAC address.\nThe value is in the format of H-H-H."
        },
        {
            "Parameters": "destination-mac <lb-destinationmac>",
            "Info": "Specifies a load balance destination MAC address.\nThe value is in the format of H-H-H."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> tracert vxlan vni 111 source 1.1.1.1 peer 2.2.2.2 udp-port 5000"
        ]
    ],
    "ExtraInfo": "To detect a VXLAN tunnel fault, run the tracert vxlan command. In practice, if a fault occurs on a VXLAN forwarding path, causing traffic on a VXLAN tunnel to be interrupted, you can use the tracert vxlan and ping vxlan commands to detect and locate the faulty node.\nThe tracert vxlan command uses both vxlanecho request packets and vxlanecho reply packets to check VXLAN connectivity. Packets are transmitted in the UDP format, and the port number can be configured. The receiver distinguishes vxlanecho request and vxlanecho reply packets according to the UDP port number. A vxlanecho request packet carries FEC information to be detected, and is sent along the same VXLAN tunnel as other packets carrying the same FEC information. In this manner, VXLAN connectivity is checked. Vxlanecho request packets are transmitted to the destination through VXLAN, whereas vxlanecho reply packets are transmitted to the source through IP.\nIf a fault occurs when a VXLAN tunnel is detected using the ping vxlan command, and packets transmitted along this VXLAN tunnel cannot reach the egress, you can run the tracert vxlan command to locate the fault. Both the tracert vxlan and ping vxlan commands can check VXLAN connectivity and locate faults."
}