{
    "PageTitle": "tracert",
    "FuncDef": "The tracert command enables the system to trace the gateways that packets pass through from the source to the destination.",
    "CLIs": [
        "tracert [ -a <source-ip-address> [ -response-public | -ignore-vpn | -response-vpn <respVrfName> ] | -f <initTtl> | -m <maxTtl> | -p <destPort> | -q <nqueries> | -vpn-instance <vpn-instance-name> | -w <timeout> | -name | -s <size> | { -tos <tos-value> | -dscp <dscp> } | -pipe ] <host>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "-a <source-ip-address>",
            "Info": "Specifies a source IP address for the request packets to be sent. If no source IP address is specified, the IP address of the outbound interface of the route is used as the source address of the request packets. For example, in a VPN scenario, an IP address in the VPN is preferentially used as the source address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "-response-public",
            "Info": "Indicates that response packets are received from the public network.\n-"
        },
        {
            "Parameters": "-ignore-vpn",
            "Info": "Indicates that the VPN instance is ignored in response packets.\n-"
        },
        {
            "Parameters": "-response-vpn <respVrfName>",
            "Info": "Specifies the VPN instance name of response packets.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "-f <initTtl>",
            "Info": "Specifies the initial time to live (TTL). Carried in the IP header, the TTL field indicates the lifetime of the IP packet and specifies the maximum number of devices that the packet can pass through. The TTL value is set on the source and reduced by 1 each time the packet passes through one device. When the TTL value is reduced to 0, the packet is discarded. At the same time, an ICMP Timeout packet is sent to the source. If initTtl is specified and the number of hops is smaller than the specified value, the TTL value will be greater than 0 after the packet passes through all the nodes. Therefore, no ICMP timeout packet is sent to the source.If maxTtl is specified, the value of initTtl must be smaller than or equal to the value of maxTtl.\nThe value is an integer that ranges from 1 to 255. The default value is 1."
        },
        {
            "Parameters": "-m <maxTtl>",
            "Info": "Specifies the maximum TTL. Generally, the maximum TTL is set to the number of hops the packet passes through. You need to use this parameter to change the TTL. If initTtl is specified, the value of maxTtl must be greater than or equal to the value of initTtl.\nThe value is an integer that ranges from 1 to 255. The default value is 64."
        },
        {
            "Parameters": "-p <destPort>",
            "Info": "Specifies the UDP port number of the destination.\n\nIf no UDP port number is specified, when you run the tracert command, a port with the port number greater than 32768 is randomly chosen for the destination to receive trace packets.\nBefore specifying the UDP port number for the destination, ensure that the port is not in use; otherwise, the trace test fails.\nThe value is an integer ranging from 0 to 65535. The default value is 33434."
        },
        {
            "Parameters": "-q <nqueries>",
            "Info": "Specifies the number of test packets sent in a trace test. In the case of poor network qualities, you can set this parameter to a comparatively larger value to ensure that a test packet can reach the destination.\nThe value is an integer ranging from 1 to 65535. The default value is 3."
        },
        {
            "Parameters": "-vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of the VPN instance to which the destination address belongs.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "-w <timeout>",
            "Info": "Specifies the period of time for waiting for a response. If a test packet reaches a gateway and times out, \"*\" is displayed. In the case of poor network qualities and a low network transmission rate, you are advised to prolong the timeout period.\nThe value is an integer ranging from 0 to 3600000, in milliseconds. The default value is 5000."
        },
        {
            "Parameters": "-s <size>",
            "Info": "Specifies a packet size.\nIt is an integer ranging from 12 to 9600."
        },
        {
            "Parameters": "-pipe",
            "Info": "Specifies the pipe mode.\n-"
        },
        {
            "Parameters": "-name",
            "Info": "Displays the host name of the destination address.\n-"
        },
        {
            "Parameters": "-tos <tos-value>",
            "Info": "Specifies the ToS value of packets sent. By specifying this parameter, you can set the DSCP value and IP priority for packets.\nThe value is an integer ranging from 0 to 255. The default value is 0."
        },
        {
            "Parameters": "-dscp <dscp>",
            "Info": "Specifies a DSCP value for the request packets to be sent.\nThe value is an integer ranging from 0 to 63. The default value is <b>0</b>."
        },
        {
            "Parameters": "<host>",
            "Info": "Specifies the name or the IP address of the destination host.\nThe value is a string of 1 to 255 characters. If the parameter value is an IP address, set the format of the parameter to dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> tracert -name -f 2 -m 64 -s 100 10.10.1.1"
        ],
        [
            "<HUAWEI> tracert -name 192.168.10.2"
        ],
        [
            "<HUAWEI> tracert -a 192.168.2.1 -response-vpn vpnb -vpn-instance vpna 192.168.1.2"
        ],
        [
            "<HUAWEI> tracert -q 5 -w 8000 10.10.0.10"
        ],
        [
            "<HUAWEI> tracert -vpn-instance abc 192.168.5.115"
        ],
        [
            "<HUAWEI> tracert www.huawei.com"
        ]
    ],
    "ExtraInfo": "The ping command is used to check the connectivity of the network, and the tracert command is used to locate the faulty node."
}