{
    "PageTitle": "tracert ipv6",
    "FuncDef": "The tracert ipv6 command enables the system to trace gateways that packets pass through from the source to the destination with an IPv6 address.",
    "CLIs": [
        "tracert ipv6 [ -f <first-hop-limit> | -m <max-hop-limit> | -p <port-number> | -q <probes> | -w <timeout> | vpn-instance <vpn-instance-name> | -s <size> | -name | -a <source-ipv6-address> | -nexthop <nextHopAddr> | -passroute | { -tc <tc> | -dscp <dscp> } | -pipe ] <host-name> [ -i { <ifName> | <ifType> <ifNum> } ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "-f <first-hop-limit>",
            "Info": "Specifies the initial hop-limit. Carried in the IPv6 header, the hop-limit field indicates the lifetime of the IPv6 packet and specifies the maximum number of devices through which the packet can pass. The hop-limit field in IPv6 packets is similar to the TTL field in IPv4 packets. The hop-limit value is set on the source and reduced by 1 each time the packet passes through one device. When the hop-limit value is reduced to 0, the packet is discarded. At the same time, an ICMPv6 Timeout packet is sent to the source. If first-hop-limit is specified and the number of hops is less than the specified value, the hop-limit value will be greater than 0 after the packet passes through all the nodes. Therefore, no ICMPv6 Timeout packet is sent to the source. If max-hop-limit is specified, the value of first-hop-limit must be smaller than the value of max-hop-limit.\nThe value is an integer that ranges from 1 to 255. The default value is 1."
        },
        {
            "Parameters": "-m <max-hop-limit>",
            "Info": "Specifies the maximum hop-limit. Usually, the maximum hop-limit is set to the number of hops through which packets passes. Use this parameter to change hop-limit. If first-hop-limit is specified, max-hop-limit must be greater than first-hop-limit.\nThe value is an integer that ranges from 1 to 255. The default value is 64."
        },
        {
            "Parameters": "-p <port-number>",
            "Info": "Specifies the UDP port number of the destination.\n\nIf no UDP port number is specified for the destination, when you run the tracert ipv6 command, a port with the port number greater than 32768 is randomly selected for the destination to receive trace packets.\nThe UDP port number to be specified must not in use. If a used UDP number is specified, the trace test fails.\nThe value is an integer ranging from 1 to 65535. The default value is 33434."
        },
        {
            "Parameters": "-q <probes>",
            "Info": "Specifies the number of trace packets to be sent in a traceroute test. If the network quality is poor, you can increase the number of probe packets to ensure that the probe packets can reach the destination node.\nThe value is an integer ranging from 1 to 65535. The default value is 3."
        },
        {
            "Parameters": "-w <timeout>",
            "Info": "Specifies the timeout period for waiting for a response packet. If a tracert packet times out when reaching a gateway, an asterisk (*) is displayed. If network quality is poor and the transmission rate is low, you can increase the parameter value to prolong the timeout period.\nThe value is an integer ranging from 1 to 65535, in milliseconds. The default value is 5000."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters."
        },
        {
            "Parameters": "-s <size>",
            "Info": "Specifies a packet size.\nThe value is an integer that ranges from 20 to 9600."
        },
        {
            "Parameters": "-name",
            "Info": "Displays the host name of the destination address.\n-"
        },
        {
            "Parameters": "-nexthop <nextHopAddr>",
            "Info": "Specifies an IPv6 address for the next hop. If you have specified this parameter, the device no longer searches the routing table before sending UDP packets.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X.\n\nThe specified next hop address must be the next hop address of a directly connected physical interface.\nWhen specifying the next hop address, you can configure -i interface-type interface-number to specify the outbound interface. The following conditions must be met to ensure a test success:\nThe specified next hop address matches the outbound interface.\nThe specified outbound interface cannot be a member interface of a logical interface.\nWhen you specify the next hop address, you cannot specify a VPN."
        },
        {
            "Parameters": "-passroute",
            "Info": "Sends UDP packets without searching for the routing table.\n-"
        },
        {
            "Parameters": "-pipe",
            "Info": "Specifies the pipe mode.\n-"
        },
        {
            "Parameters": "-a <source-ipv6-address>",
            "Info": "Specifies a source IPv6 address for the request packets to be sent. If no source IPv6 address is specified, the IPv6 address of the outbound interface of the route is used as the source address of request packets. For example, in a VPN scenario, an IPv6 address in the VPN is preferentially used as the source address.\nThe value is a 32-digit hexadecimal number in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "-tc <tc>",
            "Info": "Specifies the traffic class for echo request packets. You can specify traffic-class-value to control echo request traffic.\nThe value is an integer ranging from 0 to 255. The default value is 0."
        },
        {
            "Parameters": "-dscp <dscp>",
            "Info": "Specifies a DSCP value for the request packets to be sent.\nThe value is an integer ranging from 0 to 63. The default value is <b>0</b>."
        },
        {
            "Parameters": "<host-name>",
            "Info": "Specifies the name or the IPv6 address of a destination host.\nThe value is a string of 1 to 255 characters. If the IPv6 address of a destination is specified, the value is in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "-i <ifName>",
            "Info": "Sets the interface name for sending UDP messages.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "<ifType>",
            "Info": "Sets the interface type for sending UDP messages.\n-"
        },
        {
            "Parameters": "<ifNum>",
            "Info": "Sets the interface number for sending UDP messages.\nThe value is a string of 1 to 63 case-insensitive characters. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> tracert ipv6 -name -f 1 -m 3 -p 65535 -q 2 www.huawei.com",
            "Resolved Host ( www.huawei.com -> 2001:DB8::1 )"
        ],
        [
            "<HUAWEI> tracert ipv6 -f 2 -m 64 2001:db8:100::3"
        ],
        [
            "<HUAWEI> tracert ipv6 vpn-instance vsi6 2001:db8:100::3"
        ],
        [
            "<HUAWEI> tracert ipv6 -q 5 -w 8000 2001:db8:100::3"
        ],
        [
            "<HUAWEI> tracert ipv6 -name -f 1 -m 3 -p 65535 -q 2 2001:db8::1"
        ]
    ],
    "ExtraInfo": "You can run the ping ipv6 command to check the connectivity of the network and then run the tracert ipv6 command to locate the faulty node."
}