{
    "PageTitle": "vrrp6 vrid load-balance",
    "FuncDef": "The vrrp6 vrid load-balance command configures a specified VRRP6 backup group as a Virtual Router Redundancy Protocol for IPv6 (VRRP6) load-balance redundancy group (LBRG).\nThe undo vrrp6 vrid load-balance command restores a VRRP6 LBRG to a common VRRP6 backup group. The vrrp6 vrid load-balance command configures a specified VRRP6 backup group as a Virtual Router Redundancy Protocol for IPv6 (VRRP6) load-balance redundancy group (LBRG). The undo vrrp6 vrid load-balance command restores a VRRP6 LBRG to a common VRRP6 backup group. By default, no VRRP6 LBRG is configured in the system. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "vrrp6 vrid <vrid-value> load-balance",
        "undo vrrp6 vrid <vrid-value> load-balance"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<vrid-value>",
            "Info": "Specifies the ID of a VRRP6 backup group.\nThe value is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] ipv6 address 2001:db8::1 64",
            "[*HUAWEI-100GE1/0/1] vrrp6 vrid 1 virtual-ip FE80::7 link-local",
            "[*HUAWEI-100GE1/0/1] vrrp6 vrid 1 virtual-ip 2001:db8::2",
            "[*HUAWEI-100GE1/0/1] vrrp6 vrid 1 load-balance"
        ]
    ],
    "ExtraInfo": "When VRRP6 is used for gateway redundancy on the live network, the master device has heavy loads, whereas the backup devices have light loads. In traditional VRRP6 load balancing mode, multiple VRRP6 backup groups with virtual IPv6 addresses are created and specified as gateways for different users to implement load balancing. To simplify user configurations, create a VRRP6 LBRG and specify it as a gateway for all users to implement load balancing.\nAfter you configure a VRRP6 LBRG, the VRRP6 LBRG returns different MAC addresses for NS request packets from different users. The master device of a specified VRRP6 backup group forwards the traffic of a specified user."
}