{
    "PageTitle": "vrrp6 vrid track bfd",
    "FuncDef": "The vrrp6 vrid track bfd command enables a Virtual Router Redundancy Protocol for IPv6 (VRRP6) backup group to monitor a BFD session.\nThe undo vrrp6 vrid track bfd command disables a VRRP6 backup group from monitoring a BFD session. The vrrp6 vrid track bfd command enables a Virtual Router Redundancy Protocol for IPv6 (VRRP6) backup group to monitor a BFD session. The undo vrrp6 vrid track bfd command disables a VRRP6 backup group from monitoring a BFD session. By default, a VRRP6 backup group does not monitor a BFD session. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "vrrp6 vrid <virtual-router-id> trackbfd <bfd-session-id> [ increase <value-increased> | reduce <value-reduced> ]",
        "vrrp6 vrid <virtual-router-id> trackbfdsession-name <bfd-configure-name> [ increase <value-increased> | reduce <value-reduced> ]",
        "vrrp6 vrid <virtual-router-id> trackbfd <bfd-session-id> { peer | link }",
        "vrrp6 vrid <virtual-router-id> trackbfdsession-name <bfd-configure-name> { peer | link }",
        "undo vrrp6 vrid <virtual-router-id> trackbfd [ <bfd-session-id> | session-name <bfd-configure-name> ]"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<virtual-router-id>",
            "Info": "Specifies the ID of a VRRP6 group.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "<bfd-session-id>",
            "Info": "Specifies the local discriminator of a monitored BFD session.\nThe value is an integer ranging from 1 to 16384."
        },
        {
            "Parameters": "increase <value-increased>",
            "Info": "Specifies a value by which the priority of a VRRP6 group increases when the tracked BFD session changes from up to down.\nThe value is an integer ranging from 1 to 255. As 255 is the priority of an IP address owner, the largest priority can be set to 254."
        },
        {
            "Parameters": "reduce <value-reduced>",
            "Info": "Specifies a value by which the priority of a VRRP6 group decreases when the tracked BFD session changes from up to down.\nThe value is an integer ranging from 1 to 255. The smallest value can be set to 1. By default, the priority decreases by 10 when a monitored BFD session goes Down."
        },
        {
            "Parameters": "session-name <bfd-configure-name>",
            "Info": "Specifies the name of a monitored BFD session.\nThe value is a string of 1 to 64 characters, spaces not supported. If spaces are used, the string must start and end with double quotation marks (\").\nWhen configuring a BFD session name, ensure that the uppercase and lowercase letters in the name are the same as those entered by the user.The system does not distinguish between uppercase and lowercase letters when checking the name of a BFD session. For example, ABC and abc are considered as a BFD session name. If ABC has been configured, the BFD session view of ABC is directly displayed when abc is configured."
        },
        {
            "Parameters": "peer",
            "Info": "Indicates that a monitored BFD session is a peer BFD session.\n-"
        },
        {
            "Parameters": "link",
            "Info": "Indicates that a monitored BFD session is a link BFD session.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd 1 bind peer-ipv6 2001:db8::1 source-ipv6 2001:db8::2 auto",
            "[*HUAWEI-bfd-session-1] quit",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] ipv6 address 2001:db8::2 64",
            "[*HUAWEI-100GE1/0/1] vrrp6 vrid 1 virtual-ip FE80::7 link-local",
            "[*HUAWEI-100GE1/0/1] vrrp6 vrid 1 track bfd 1 reduce 20"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd peer1 bind peer-ipv6 2001:db8::1 source-ipv6 2001:db8::2 auto",
            "[*HUAWEI-bfd-session-peer1] quit",
            "[*HUAWEI] interface 100GE 1/0/3",
            "[*HUAWEI-100GE1/0/3] undo portswitch",
            "[*HUAWEI-100GE1/0/3] ipv6 enable",
            "[*HUAWEI-100GE1/0/3] ipv6 address 2001:db8::2 64",
            "[*HUAWEI-100GE1/0/3] vrrp6 vrid 3 virtual-ip FE80::7 link-local",
            "[*HUAWEI-100GE1/0/3] vrrp6 vrid 3 track bfd session-name peer1 peer"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd atob bind peer-ipv6 2001:db8::1 source-ipv6 2001:db8::2 auto",
            "[*HUAWEI-bfd-session-atob] quit",
            "[*HUAWEI] interface 100GE 1/0/2",
            "[*HUAWEI-100GE1/0/2] undo portswitch",
            "[*HUAWEI-100GE1/0/2] ipv6 enable",
            "[*HUAWEI-100GE1/0/2] ipv6 address 2001:db8::2 64",
            "[*HUAWEI-100GE1/0/2] vrrp6 vrid 2 virtual-ip FE80::7 link-local",
            "[*HUAWEI-100GE1/0/2] vrrp6 vrid 2 track bfd session-name atob reduce 20"
        ]
    ],
    "ExtraInfo": "If the link between routers in a VRRP6 backup group fails, the VRRP6 backup group performs a master/backup VRRP switchover only after a period of three times the interval at which VRRP6 Advertisement packets are sent. During this period, service data may be lost. BFD can rapidly detect link faults. You can run the vrrp6 vrid track bfd-session command to enable a VRRP6 backup group to monitor a BFD session. When the status of the monitored BFD session changes, the BFD module notifies the VRRP6 module of the change. The VRRP6 module changes the priority or status based on configurations to implement a rapid master/backup VRRP switchover."
}