{
    "PageTitle": "vrrp6 vrid track admin-vrrp",
    "FuncDef": "The vrrp6 vrid track admin-vrrp command binds a common Virtual Router Redundancy Protocol for IPv6 (VRRP6) backup group to a management Virtual Router Redundancy Protocol for IPv6 (mVRRP6) backup group. After the binding is complete, the common VRRP6 backup group becomes a service VRRP6 backup group.\nThe undo vrrp6 vrid track admin-vrrp vrrp command unbinds a service VRRP6 backup group from an mVRRP6 backup group. After the unbinding is complete, the service VRRP6 backup group restores to a common VRRP6 backup group. The vrrp6 vrid track admin-vrrp command binds a common Virtual Router Redundancy Protocol for IPv6 (VRRP6) backup group to a management Virtual Router Redundancy Protocol for IPv6 (mVRRP6) backup group. After the binding is complete, the common VRRP6 backup group becomes a service VRRP6 backup group. The undo vrrp6 vrid track admin-vrrp vrrp command unbinds a service VRRP6 backup group from an mVRRP6 backup group. After the unbinding is complete, the service VRRP6 backup group restores to a common VRRP6 backup group. By default, no common VRRP6 backup group is bound to an mVRRP6 backup group. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "vrrp6 vrid <virtual-router-id1> trackadmin-vrrpinterface { <interface-name> | <interface-type> <interface-number> } vrid <virtual-router-id2> [ unflowdown ]",
        "undo vrrp6 vrid <virtual-router-id1> trackadmin-vrrp"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<virtual-router-id1>",
            "Info": "Specifies the ID of a common VRRP6 backup group.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Specifies the type and number of the interface on which an mVRRP6 backup group resides.\n-"
        },
        {
            "Parameters": "<virtual-router-id2>",
            "Info": "Specifies the ID of an mVRRP6 group.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "unflowdown",
            "Info": "Binds a common VRRP6 backup group to an mVRRP6 backup group in unflowdown mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/7",
            "[~HUAWEI-100GE1/0/7] undo portswitch",
            "[*HUAWEI-100GE1/0/7] ipv6 enable",
            "[*HUAWEI-100GE1/0/7] ipv6 address 2001:db8:1:1::200 64",
            "[*HUAWEI-100GE1/0/7] vrrp6 vrid 1 virtual-ip FE80::1 link-local",
            "[*HUAWEI-100GE1/0/7] vrrp6 vrid 1 virtual-ip 2001:db8:1:1::201",
            "[*HUAWEI-100GE1/0/7] vrrp6 vrid 1 admin",
            "[*HUAWEI-100GE1/0/7] quit",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/7] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] ipv6 address 2001:db8:1::1/64",
            "[*HUAWEI-100GE1/0/1] vrrp6 vrid 1 virtual-ip FE80::7 link-local",
            "[*HUAWEI-100GE1/0/1] vrrp6 vrid 1 virtual-ip 2001:db8:1::2/64",
            "[*HUAWEI-100GE1/0/1] vrrp6 vrid 1 track admin-vrrp interface 100GE 1/0/7 vrid 1"
        ]
    ],
    "ExtraInfo": "When multiple VRRP6 backup groups are configured on a router to forward traffic, each VRRP6 backup group maintains its own state machine, which causes a large number of VRRP6 Advertisement packets to be transmitted. To reduce the impact of these packets on network bandwidths and CPU performance, run the vrrp6 vrid track admin-vrrp6 command to bind a common VRRP6 backup group to an mVRRP6 backup group.\nA common VRRP6 backup group can be bound to an mVRRP6 backup group in either of the following modes:"
}