{
    "PageTitle": "vrrp6 vrid track interface",
    "FuncDef": "The vrrp6 vrid track interface command enables a Virtual Router Redundancy Protocol for IPv6 (VRRP6) backup group to monitor a VRRP6-disabled interface.\nThe undo vrrp6 vrid track interface command disables a VRRP6 backup group from monitoring a VRRP6-disabled interface. The vrrp6 vrid track interface command enables a Virtual Router Redundancy Protocol for IPv6 (VRRP6) backup group to monitor a VRRP6-disabled interface. The undo vrrp6 vrid track interface command disables a VRRP6 backup group from monitoring a VRRP6-disabled interface. By default, a VRRP6 backup group does not monitor a VRRP6-disabled interface. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "vrrp6 vrid <virtual-router-id> track [ ipv6 ] interface { <interface-name> | <interface-type> <interface-number> } [ increase <value-increased> | reduce <value-reduced> ]",
        "undo vrrp6 vrid <virtual-router-id> trackinterface [ <interface-name> | <interface-type> <interface-number> ]",
        "undo vrrp6 vrid <virtual-router-id> trackipv6interface [ { <interface-name> | <interface-type> <interface-number> } [ increase <value-increased> | reduce <value-reduced> ] ]"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,1200ge sub-interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<virtual-router-id>",
            "Info": "Specifies the ID of a VRRP6 group.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "ipv6",
            "Info": "Tracks the IPv6 status of an interface.\n-"
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Specifies the type and number of a monitored VRRP6-disabled interface.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of the monitored interface.\n-"
        },
        {
            "Parameters": "increase <value-increased>",
            "Info": "Specifies a value by which the priority of a router in a VRRP6 backup group increases when a monitored VRRP6-disabled interface goes Down.\nThe value is an integer ranging from 1 to 255. As 255 is the priority of an IP address owner, the largest priority can be set to 254."
        },
        {
            "Parameters": "reduce <value-reduced>",
            "Info": "Specifies a value by which the priority of a router in a VRRP6 backup group decreases when a monitored VRRP6-disabled interface goes Down.\nThe value is an integer ranging from 1 to 255. The smallest value can be set to 1. By default, the priority decreases by 10 when a monitored VRRP6-disabled interface goes Down."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] ipv6 address 2001:db8::1 64",
            "[*HUAWEI-100GE1/0/1] vrrp6 vrid 1 virtual-ip FE80::7 link-local",
            "[*HUAWEI-100GE1/0/1] vrrp6 vrid 1 track interface 100GE 1/0/2 reduce 20"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] ipv6 address 2001:db8::1 64",
            "[*HUAWEI-100GE1/0/1] vrrp6 vrid 1 virtual-ip FE80::7 link-local",
            "[*HUAWEI-100GE1/0/1] vrrp6 vrid 1 track  ipv6 interface 100GE 1/0/2 reduce 20"
        ]
    ],
    "ExtraInfo": "A VRRP6 backup group cannot detect changes in the status of a VRRP6-disabled interface. If a VRRP-disabled interface connected to a network fails, the VRRP6 backup group is unable to detect the fault and still forwards user packets through the failed interface, which results in service interruptions.\nTo enable a VRRP6 backup group to monitor a VRRP6-disabled interface, run the\nvrrp6 vrid track interface command. If a router or VRRP6-disabled interface connected to a network fails, a VRRP6 backup group detects the fault and performs a master/backup VRRP switchover."
}