{
    "PageTitle": "vrrp6 vrid track ipv6 route",
    "FuncDef": "The vrrp6 vrid track ipv6 route vpn-instance command configures a VRRP6 group to track a specified route.\nThe undo vrrp6 vrid track ipv6 route vpn-instance command disables a VRRP6 group from tracking a specified route. The vrrp6 vrid track ipv6 route vpn-instance command configures a VRRP6 group to track a specified route. The undo vrrp6 vrid track ipv6 route vpn-instance command disables a VRRP6 group from tracking a specified route. By default, a VRRP6 group is not configured to track a specified route. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "vrrp6 vrid <virtual-router-ID> trackipv6route <ip-address> <mask-length> vpn-instance <vpn-name> [ { reduce <reduced-value> | increase <increased-value> } ]",
        "vrrp6 vrid <virtual-router-ID> trackipv6route <ip-address> <mask-length> [ { reduce <reduced-value> | increase <increased-value> } ]",
        "undo vrrp6 vrid <virtual-router-ID> trackipv6route <ip-address> <mask-length> vpn-instance <vpn-name>",
        "undo vrrp6 vrid <virtual-router-ID> trackipv6route [ <ip-address> <mask-length> ]"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<virtual-router-ID>",
            "Info": "Specifies the ID of a VRRP6 group.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies the IPv6 address of a route to be tracked.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<mask-length>",
            "Info": "Specifies the mask length of the IPv6 address of the route to be tracked.\nIt is an integer ranging from 0 to 128."
        },
        {
            "Parameters": "vpn-instance <vpn-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "reduce <reduced-value>",
            "Info": "Indicates that the master device reduces its priority if the tracked route is withdrawn or becomes inactive.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "increase <increased-value>",
            "Info": "Specifies the value by which the master device's priority increases if the tracked route is withdrawn or becomes inactive.\nThe value is an integer ranging from 1 to 255. The default value is 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] vrrp6 vrid 1 virtual-ip 2001:db8:1::1",
            "[*HUAWEI-100GE1/0/1] vrrp6 vrid 1 track ipv6 route 2001:db8:1::2 64 reduce 20"
        ]
    ],
    "ExtraInfo": "To improve device reliability, user gateways are connected to a Layer 3 network in master/backup mode, and VRRP6 is deployed to determine the master/backup status of the gateways. However, after a VRRP6 group is configured, the uplink route may still change frequently due to a link fault, but users on the access side are unaware of the route change. As a result, service traffic is lost.\nA VRRP6 group can be configured to track an uplink route to resolve the preceding problem. If the uplink route is withdrawn or becomes inactive, the RM module instructs the VRRP6 group to reduce the master's priority to trigger a master/backup switchover."
}