{
    "PageTitle": "dhcpv6 interface-id format",
    "FuncDef": "The dhcpv6 interface-id format command configures the Interface-ID format in DHCPv6 packets.\nThe undo dhcpv6 interface-id format command restores the default Interface-ID format in DHCPv6 packets. The dhcpv6 interface-id format command configures the Interface-ID format in DHCPv6 packets. The undo dhcpv6 interface-id format command restores the default Interface-ID format in DHCPv6 packets. By default, the Interface-ID format in DHCPv6 packets is default. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "dhcpv6 interface-id format { default | user-defined <user-defined-text> }",
        "undo dhcpv6 interface-id format"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "default",
            "Info": "Specifies the default Interface-ID format.\nThe default Interface-ID format is %04svlan.%04cvlan.%mac:%portname. The values of the S-VLAN and C-VLAN are integers containing four characters. If the length is fewer than four characters, the value is prefixed with 0s. For example, if the outer VLAN value in the DHCPv6 packets received by the device is 11, the inner VLAN value is 22, the inbound interface is VLANIF100, and the device MAC address is 00-e0-fc-12-34-56, the Interface-ID generated during the system parsing process is 0011.0022.00e0fc123456:vlanif100.\n-"
        },
        {
            "Parameters": "user-defined <user-defined-text>",
            "Info": "Specifies a user-defined format as the Interface-ID format. A user-defined format can be:\nFormat defined by keywords: The Interface-ID is defined based on the keywords supported by the user-defined format. For example, if the name of the device to which the users are connected and the outer VLAN to which the users belong need to be recorded, the user-defined format can be %sysname %svlan. If the device name is HUAWEI and the S-VLAN is 100, the user location information recorded by the Interface-ID is HUAWEI 100.\nFor description of the keywords supported by the user-defined format, see Table 1.\nFormat defined by common character strings: The Interface-ID is directly defined as a character string. For example, if all users on an interface are located in the office building named N8, the Interface-ID can be directly defined as N8.Mixed format: The Interface-ID is defined by both the keywords and common character strings. For example, the Interface-ID can be defined as %sysname N8.\nThe value is a string of 1 to 251 case-sensitive characters, spaces not supported. When quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] dhcpv6 interface-id format user-defined \"%mac\""
        ]
    ],
    "ExtraInfo": "The Interface-ID option records user access information such as the inbound interface of DHCPv6 request packets received by the device from clients. In scenarios where a device functions as a lightweight DHCPv6 relay agent (LDRA), it can insert the Interface-ID option into a DHCPv6 request packet received from a DHCPv6 client to identify the location of the client before forwarding the packet to the DHCPv6 server. The DHCPv6 server assigns an IPv6 address and network parameters based on the location. You can run the dhcpv6 interface-id format command to configure the format of the Interface-ID option inserted into DHCPv6 packets.\nThe keywords supported by the user-defined option format and their meanings are as follows:\nduid: indicates the client ID, including information such as the MAC address of a client.\nsysname: indicates the device name of a client.\nportname: indicates the name of the device's inbound interface that receives the DHCPv6 packets from a client.\nporttype: indicates the type of the device's inbound interface that receives the DHCPv6 packets from a client. In certain scenarios, the interface type is specified when the NAS interface is configured.\niftype: indicates the type of the device's inbound interface that receives the DHCPv6 packets from a client.\nmac: indicates the MAC address of the device.\nslot: indicates the ID of the device's slot that receives the DHCPv6 packets from a client.\nsubslot: indicates the ID of the device's subslot that receives the DHCPv6 packets from a client.\nport: indicates the number of the device's interface that receives the DHCPv6 packets from a client.\nsvlan: indicates the outer VLAN ID of the DHCPv6 packets sent by a client.\ncvlan: indicates the inner VLAN ID of the DHCPv6 packets sent by a client.\nlength: indicates the total length of the content following the length keyword, excluding the length of the length keyword.\nThe content of the user-defined option format must be enclosed in double quotation marks (\"\"). For example, to configure the content of the user-defined option format as mac, run the dhcpv6 interface-id format user-defined \"%mac\" command. Separators that cannot be digits must be added between the keywords in the user-defined option format. Otherwise, the keywords cannot be parsed. The symbol % must be prefixed to the keywords in the user-defined option format to differentiate them from common character strings. If a digit exists before the symbol % and keyword, the digit refers to the number of characters in the keyword. The self-defined content is encapsulated in ASCII format. In addition to the preceding precautions, note the following rules: - The symbol \\ is an escape character. The symbols % and [] following the escape character indicate themselves. For example, \\ represents the character . - An ASCII character string can contain Arabic numerals, uppercase letters, lowercase letters, and the following symbols: ! @ # $ % ^ & * ( ) _ + | - = [ ] { } ; : ' \" / ? . , `. - By default, the length of each keyword in an ASCII character string is the actual length of the keyword."
}