{
    "PageTitle": "dhcpv6 relay source-interface",
    "FuncDef": "The dhcpv6 relay source-interface command configures the IPv6 address of an interface as the source IPv6 address of packets.\nThe undo dhcpv6 relay source-interface command restores the default setting. The dhcpv6 relay source-interface command configures the IPv6 address of an interface as the source IPv6 address of packets. The undo dhcpv6 relay source-interface command restores the default setting. By default, the IPv6 address of an interface is not configured as the source IPv6 address of packets. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "dhcpv6 relay source-interface { <interface-type> <interface-number> | <interface-name> }",
        "undo dhcpv6 relay source-interface"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,VBDIF interface view,VLANIF interface view,System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies an interface name.\n-"
        },
        {
            "Parameters": "source-interface <interface-type> <interface-number>",
            "Info": "Specifies the interface type and interface number.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface loopback 5",
            "[*HUAWEI-LoopBack5] ipv6 enable",
            "[*HUAWEI-LoopBack5] ipv6 address fc01:1::1/128",
            "[*HUAWEI-LoopBack5] quit",
            "[~HUAWEI] interface 100GE1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] dhcpv6 relay destination fc00:1::1",
            "[*HUAWEI-100GE1/0/1] dhcpv6 relay source-interface loopback 5"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface loopback 5",
            "[*HUAWEI-LoopBack5] ipv6 enable",
            "[*HUAWEI-LoopBack5] ipv6 address fc01:1::1/128",
            "[*HUAWEI-LoopBack5] quit",
            "[*HUAWEI] dhcpv6 relay source-interface loopback 5"
        ]
    ],
    "ExtraInfo": "When forwarding packets from DHCPv6 clients, a DHCPv6 relay agent uses the IPv6 address of the inbound interface as the source IPv6 address of the packets. In this case, each interface on the DHCPv6 relay agent must be configured with an IPv6 address, which complicates the configuration process and wastes IPv6 addresses. Run the dhcpv6 relay source-interface command on the DHCPv6 relay agent to specify the IPv6 address of the interface as the source IPv6 address of DHCPv6 relay packets. This simplifies the configuration and saves IPv6 addresses.\nIn addition, if a distributed gateway functions as a DHCPv6 relay agent, the IPv6 address of the interface on each distributed gateway is the same. If the IPv6 address is used to communicate with the server, the response packet from the server is sent to an incorrect distributed gateway (that is, the device that does not send DHCPv6 request packets). To solve this problem, run the dhcpv6 relay source-interface command on each distributed gateway to specify the IPv6 address of an interface as the source IPv6 address of DHCPv6 relay packets. This ensures that response packets from the server can be sent back to the correct distributed gateway."
}