{
    "PageTitle": "dhcpv6 relay source-ip-address",
    "FuncDef": "The dhcpv6 relay source-ip-address command configures the source IPv6 address for DHCPv6 messages relayed by a DHCPv6 relay agent.\nThe undo dhcpv6 relay source-ip-address command restores the default source IPv6 address of DHCPv6 messages relayed by a DHCPv6 relay agent. The dhcpv6 relay source-ip-address command configures the source IPv6 address for DHCPv6 messages relayed by a DHCPv6 relay agent. The undo dhcpv6 relay source-ip-address command restores the default source IPv6 address of DHCPv6 messages relayed by a DHCPv6 relay agent. By default, a DHCPv6 relay agent uses the IPv6 address of the gateway as the source IPv6 address for DHCPv6 messages. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "dhcpv6 relay source-ip-address <ipv6-address>",
        "undo dhcpv6 relay source-ip-address [ <ipv6-address> ]"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies a source IPv6 address for DHCPv6 messages relayed by a DHCPv6 relay agent. The address must be the IPv6 address to which a local interface is bound.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] dhcpv6 relay destination 2001:db8::1",
            "[*HUAWEI-100GE1/0/1] dhcpv6 relay source-ip-address 2001:db8::1"
        ]
    ],
    "ExtraInfo": ""
}