{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "ip rcmd domain-lookup",
    "FuncDef": [
        "To reenable the basic Domain Name Service (DNS) security check for rcp and rsh, use the **ip rcmd domain-lookup** command in global configuration mode. To disable the basic DNS security check for remote copy protocol (rcp) and remote shell protoco (rsh), use the **no** form of this command. "
    ],
    "CLIs": [
        "ip rcmd domain-lookup",
        "no ip rcmd domain-lookup"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "In the following example, the DNS security check is disabled for RCMD (rsh/rcp):",
            "```",
            "Router(config)# no ip rcmd domain-lookup",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "The abbreviation RCMD (remote command) is used to indicate both rsh and rcp.DNS lookup for RCMD is enabled by default (provided general DNS services are enabled on the system using the **ip domain-lookup** command).The **no ip rcmd domain-lookup** command is used to disable the DNS lookup for RCMD. The **ip rcmd domain-lookup** command is used to reenable the DNS lookup for RCMD.DNS lookup for RCMD is performed as a basic security check. This check is performed using a host authentication process. When enabled, the system records the address of the requesting client. That address is mapped to a host name using DNS. Then a DNS request is made for the IP address for that host name. The IP address received is then checked against the original requesting address. If the address does not match with any of the addresses received from DNS, the RCMD request will not be serviced.This reverse lookup is intended to help protect against spoofing. However, please note that the process only confirms that the IP address is a valid \"routable\" address; it is still possible for a hacker to spoof the valid IP address of a known host.The DNS lookup is done after the TCP handshake but before the router (which is acting as a rsh/rcp server) sends any data to the remote client.The **no ip rcmd domain-lookup** will turn off DNS lookups for rsh and rcp only. The**no****ip domain-lookup** command takes precedence over the **ip rcmd domain-lookup** command. This means that if the **no ip domain-lookup** command is in the current configuration, DNS will be bypassed for rcp and rsh even if the **ip rcmd domain-lookup** command is enabled.",
    "RelatedCmds": [
        {
            "cmd": " **ip domain-lookup** ",
            "description": " Enables the IP DNS-based host name-to-address translation. "
        }
    ]
}