{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "ip rcmd rcp-enable",
    "FuncDef": [
        "To configure the Cisco IOS software to allow remote users to copy files to and from the router using remote copy protocol (rcp), use the **ip rcmd rcp-enable** command in global configuration mode. To disable rcp on the device, use the **no** form of this command. "
    ],
    "CLIs": [
        "ip rcmd rcp-enable",
        "no ip rcmd rcp-enable"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "In the following example, the rcp service is enabled on the system, the IP address assigned to the Loopback0 interface is used as the source address for outbound rcp and rsh packets, and access is granted to the user \"netadmin3\"on the remote host 172.16.101.101:",
            "```",
            "Router(config)# ip rcmd rcp-enable",
            "```",
            "```",
            "Router(config)# ip rcmd source-interface Loopback0",
            "```",
            "```",
            "Router(config)# ip rcmd remote-host router1 172.16.101.101 netadmin3",
            "```"
        ]
    ],
    "ExtraInfo": "To allow a remote user to execute rcp commands on the router, you must also create an entry for the remote user in the local authentication database using the **ip rcmd remote-host** command.The **no****ip rcmd rcp-enable**command does not prohibit a local user from using rcp to copy system images and configuration files to and from the router.To protect against unauthorized users copying the system image or configuration files, the router is not enabled for rcp by default.",
    "RelatedCmds": [
        {
            "cmd": " **ip rcmd remote-host** ",
            "description": " Creates an entry for the remote user in a local authentication database so that remote users can execute commands on the router using rsh or rcp. "
        }
    ]
}