{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "ip tftp source-interface",
    "FuncDef": [
        "To specify the IP address of an interface as the source address for TFTP connections, use the **ip tftp source-interface** command in global configuration mode. To return to the default, use the **no** form of this command. "
    ],
    "CLIs": [
        "ip tftp source-interface <interface-type interface-number>",
        "noip tftp source-interface"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *interface-type interface-number* ",
            "Info": " The interface type and number whose address is to be used as the source for TFTP connections. "
        }
    ],
    "Examples": [
        [
            "The following example shows how to configure the router to use the IP address associated with loopback interface 0 as the source address for TFTP connections:",
            "```",
            "configure terminal",
            "```",
            "```",
            "!",
            "```",
            "```",
            "ip tftp source-interface loopback0",
            "```",
            "```",
            "```",
            "The following example shows how to configure the router to use the VRF table named vpn1 to look for the destination IP address for TFTP connections:",
            "```",
            "configure terminal",
            "```",
            "```",
            "!",
            "```",
            "```",
            "ip tftp source-interface ethernet 1/0",
            "```",
            "```",
            "!",
            "```",
            "```",
            "ip vrf vpn1",
            "```",
            "```",
            "rd 100:1",
            "```",
            "```",
            "route-target both 100:1",
            "```",
            "```",
            "!",
            "```",
            "```",
            "interface ethernet 1/0",
            "```",
            "```",
            "ip vrf forwarding vpn1",
            "```",
            "```",
            "end",
            "```",
            "```",
            "```",
            "In this example, file transfer using TFTP is accomplished across an interface within a VRF (VRF vpn1) link."
        ]
    ],
    "ExtraInfo": "Use this command to set the IP address of an interface as the source for all TFTP connections.If the specified interface is not up, the Cisco IOS software selects the address of the interface closest to the destination as the source address.In Cisco IOS 12.3(6) and later releases, TFTP is VRF-aware, which means that TFTP transfer is supported across an interface within a Virtual Private Network (VPN) routing and forwarding (VRF) instance. To specify a VRF as a source for TFTP connections, the VRF must be associated with the same interface that you configure with the **ip tftp source-interface** command. In this configuration, TFTP looks for the destination IP address for file transfer in the specified VRF table.",
    "RelatedCmds": [
        {
            "cmd": " **ip ftp source-interface** ",
            "description": " Forces outgoing FTP packets to use the IP address of a specified interface as the source address. "
        },
        {
            "cmd": " **ip radius source-interface** ",
            "description": " Forces outgoing RADIUS packets to use the IP address of a specified interface as the source address. "
        }
    ]
}