{
    "PageTitle": "ip urpf",
    "FuncDef": "The ip urpf command configures the URPF check mode on an interface.\nThe undo ip urpf command cancels the configuration of the URPF check mode on an interface. The ip urpf command configures the URPF check mode on an interface. The undo ip urpf command cancels the configuration of the URPF check mode on an interface. By default, URPF check is disabled on an interface. If URPF check is enabled on an interface, URPF loose check is enabled on the interface by default. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ip urpf { loose | strict | allowdefault-route }",
        "undo ip urpf { strict | allowdefault-route }"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,VLANIF interface view,Sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "loose",
            "Info": "Indicates URPF check in loose mode. If the source address of a packet exists in the FIB table, the packet is forwarded regardless of whether the outbound interface of the packet is the same as the inbound interface of the packet.\n-"
        },
        {
            "Parameters": "strict",
            "Info": "Indicates URPF check in strict mode. A packet can be forwarded only when the source address of the packet exists in the FIB table and the outbound interface of the packet is the same as the inbound interface of the packet. ( The ECMP and local loopback address support only the loose mode. Even if the strict mode is configured, packets are still forwarded in loose mode.).\n-"
        },
        {
            "Parameters": "allow",
            "Info": "Allows special processing for the default route.\n-"
        },
        {
            "Parameters": "default-route",
            "Info": "Allows special processing for the default route.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] undo ip urpf strict"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ip urpf enable",
            "[*HUAWEI-100GE1/0/1] ip urpf strict",
            "[*HUAWEI-100GE1/0/1] ip urpf allow default-route"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 25",
            "[*HUAWEI-vlan25] interface vlanif 25",
            "[*HUAWEI-vlanif25] ip urpf enable",
            "[*HUAWEI-vlanif25] ip urpf strict",
            "[*HUAWEI-vlanif25] ip urpf allow default-route"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ip urpf enable",
            "[*HUAWEI-100GE1/0/1] ip urpf strict"
        ]
    ],
    "ExtraInfo": "The ip urpf command configures the URPF check mode on an interface.\nThe undo ip urpf command cancels the configuration of the URPF check mode on an interface.\nBy default, URPF check is disabled on an interface. If URPF check is enabled on an interface, URPF loose check is enabled on the interface by default."
}