{
    "PageTitle": "ip-subnet-vlan",
    "FuncDef": "The ip-subnet-vlan command configures an IP subnet-based VLAN and 802.1p priority for this VLAN.\nThe undo ip-subnet-vlan command deletes the IP subnet-based VLAN configuration. The ip-subnet-vlan command configures an IP subnet-based VLAN and 802.1p priority for this VLAN. The undo ip-subnet-vlan command deletes the IP subnet-based VLAN configuration. By default, no IP subnet-based VLAN is configured. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ip-subnet-vlan [ <ip-subnet-index> ] ip <ip-address> { <mask> | <mask-length> } [ priority <priority> ]",
        "undo ip-subnet-vlan { <ip-subnet-index> [ to <ip-subnet-end> ] | all }"
    ],
    "ParentView": [
        "VLAN view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-subnet-index>",
            "Info": "Specifies the start subnet number.\nThe value is an integer that ranges from 1 to 12."
        },
        {
            "Parameters": "ip <ip-address>",
            "Info": "Specifies a source IP address or network segment to be associated with a VLAN.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<mask>",
            "Info": "Specifies a subnet mask.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<mask-length>",
            "Info": "Specifies the subnet mask length.\nThe value is an integer that ranges from 1 to 12."
        },
        {
            "Parameters": "priority <priority>",
            "Info": "Specifies the 802.1p priority of a VLAN associated with the specified IP address or network segment.\nThe value is an integer that ranges from 0 to 7. The greater the value, the higher the priority. The default value is 0."
        },
        {
            "Parameters": "to <ip-subnet-end>",
            "Info": "Specifies the end subnet number.\nThe value is an integer that ranges from 1 to 12."
        },
        {
            "Parameters": "all",
            "Info": "Indicates all IP subnet-based VLANs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 3",
            "[*HUAWEI-vlan3] ip-subnet-vlan ip 10.10.10.1 255.255.255.0"
        ]
    ],
    "ExtraInfo": "IP subnet-based VLAN division is also called network layer-based VLAN division.\nNetwork layer-based VLAN division greatly reduces the workload of manual configurations and allows users to easily join a VLAN, move from one VLAN to another VLAN, or leave a VLAN.\nIP subnet-based VLAN division is applicable to networks that have traveling users and require simple management."
}