{
    "PageTitle": "port hybrid pvid vlan",
    "FuncDef": "The port hybrid pvid vlan command sets a default VLAN ID for a hybrid interface.\nThe undo port hybrid pvid vlan command restores the default VLAN ID of a hybrid interface. The port hybrid pvid vlan command sets a default VLAN ID for a hybrid interface. The undo port hybrid pvid vlan command restores the default VLAN ID of a hybrid interface. By default, the VLAN ID of all interfaces is 1.",
    "CLIs": [
        "port hybrid pvid vlan <vlan-id>",
        "undo port hybrid pvid vlan [ <vlan-id> ]"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,Layer 2 10GE interface view,Layer 2 200GE interface view,25GE-L2 view,400GE-L2 view,Layer 2 50GE interface view,Layer 2 Eth-Trunk interface view,Layer 2 GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<vlan-id>",
            "Info": "Specifies a default VLAN ID of a hybrid interface.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] portswitch",
            "[~HUAWEI-100GE1/0/1] port link-type hybrid",
            "[*HUAWEI-100GE1/0/1] port hybrid pvid vlan 5"
        ]
    ],
    "ExtraInfo": "All Ethernet frames are forwarded in tagged forms on a switching device. A device must add tags to received untagged frames. To implement this, run the port hybrid pvid vlan command to configure a default VLAN ID for an interface. If the interface receives untagged frames, it adds a default VLAN ID to the frames.\nAfter a default VLAN ID is set on a hybrid interface:"
}