{
    "PageTitle": "vlan-mapping (traffic behavior view)",
    "FuncDef": "The vlan-mapping command configures an action of replacing the VLAN ID in a traffic behavior.\nThe undo vlan-mapping command cancels the configuration. The vlan-mapping command configures an action of replacing the VLAN ID in a traffic behavior. The undo vlan-mapping command cancels the configuration. By default, an action of replacing the VLAN ID in a traffic behavior is not configured. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "vlan-mapping vlan <vlan-id>",
        "vlan-mapping inner-vlan <inner-vlan-id>",
        "undo vlan-mapping vlan",
        "undo vlan-mapping inner-vlan"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "inner-vlan <inner-vlan-id>",
            "Info": "Specifies the inner VLAN tag in VLAN packets.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "vlan <vlan-id>",
            "Info": "Specifies the outer VLAN tag in VLAN packets.\nThe value is an integer ranging from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior tb",
            "[*HUAWEI-behavior-tb] vlan-mapping vlan 200"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior tb",
            "[*HUAWEI-behavior-tb] vlan-mapping vlan 200",
            "[*HUAWEI-behavior-tb] vlan-mapping inner-vlan 300"
        ]
    ],
    "ExtraInfo": "To allow user packets to be transmitted on the ISP network, configure the device to change VLAN tags in the user packets to VLAN tags supported by the ISP network before the user packets enter the ISP network. This technology is called VLAN mapping. The vlan-mapping command configures VLAN mapping based on services or users in a traffic behavior."
}