{
    "PageTitle": "vlan range",
    "FuncDef": "The vlan range command creates a temporary VLAN range and displays the VLAN-range view. The vlan range command creates a temporary VLAN range and displays the VLAN-range view. By default, no temporary VLAN ranges are created.",
    "CLIs": [
        "vlan range { <vlan-id1> [ to <vlan-id2> ] } &<1-10>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<vlan-id1>",
            "Info": "Specifies the start VLAN ID.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "to <vlan-id2>",
            "Info": "Specifies the end VLAN ID.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan range 10 to 20"
        ]
    ],
    "ExtraInfo": "If a great number of VLANs need to be created on devices on a large Layer 2 network, the configuration and maintenance workload is heavy, and configuration inconsistencies may occur. To improve maintenance efficiency and simply configurations, run the vlan range command to create a temporary VLAN range. You can then configure services in the VLAN-range view. After services are configured, they are delivered in batches to all the VLANs in the VLAN range."
}