{
    "PageTitle": "edge-port transit-port interface",
    "FuncDef": "The edge-port interface command configures a port as the edge port for IFIT.\nThe transit-port interface command configures a port as the transparent transmission port for IFIT.\nThe undo edge-port interface command restores the port function based on the NE role.\nThe undo transit-port interface command restores the port function based on the NE role. The edge-port interface command configures a port as the edge port for IFIT. The transit-port interface command configures a port as the transparent transmission port for IFIT. The undo edge-port interface command restores the port function based on the NE role. The undo transit-port interface command restores the port function based on the NE role. By default, the IFIT capability of an interface is determined by the role of the IFIT NE. This command is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "{ edge-port | transit-port } { interface { <interface-type> <interface-number> | <interface-name> } } &<1-8>",
        "undo { edge-port | transit-port } { interface { <interface-type> <interface-number> | <interface-name> } } &<1-8>"
    ],
    "ParentView": [
        "IFIT dcn-instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface <interface-name>",
            "Info": "Specifies an interface name.\n-"
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Specifies the type and number of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ifit",
            "[*HUAWEI-ifit] dcn-instance",
            "[*HUAWEI-ifit-dcn-instance] edge-port interface 100GE1/0/1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ifit",
            "[*HUAWEI-ifit] dcn-instance",
            "[*HUAWEI-ifit-dcn-instance] transit-port interface 100GE1/0/1"
        ]
    ],
    "ExtraInfo": "To configure IFIT on an interface, you can run this command. If the interface is specified as an edge port, the IFIT header is removed from outgoing traffic on the interface. If the interface is specified as a transit port, the IFIT header is retained in outgoing traffic on the interface."
}