{
    "PageTitle": "bpdu bridge enable",
    "FuncDef": "The bpdu bridge enable command enables a Layer 2 interface to forward bridge protocol data units (BPDUs) when the device forwards BPDUs through the hardware.\nThe undo bpdu bridge enable or bpdu bridge disable command disables a Layer 2 interface from forwarding BPDUs when the device forwards BPDUs through the hardware. The bpdu bridge enable command enables a Layer 2 interface to forward bridge protocol data units (BPDUs) when the device forwards BPDUs through the hardware. The undo bpdu bridge enable or bpdu bridge disable command disables a Layer 2 interface from forwarding BPDUs when the device forwards BPDUs through the hardware. By default, a Layer 2 interface is not allowed to forward BPDUs when the device forwards BPDUs through the hardware. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "bpdu bridge enable",
        "bpdu bridge disable",
        "undo bpdu bridge enable"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,Layer 2 10GE interface view,Layer 2 200GE interface view,25GE-L2 view,400GE-L2 view,Layer 2 50GE interface view,Layer 2 Eth-Trunk interface view,Layer 2 GE interface view,Interface group view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] bpdu bridge enable"
        ]
    ],
    "ExtraInfo": "When the backbone edge device connects to many user edge devices, to improve efficiency in forwarding BPDUs, the backbone device forwards BPDUs through the hardware.\nBy default, a Layer 2 interface is not allowed to forward BPDUs when the device forwards BPDUs through the hardware. User edge devices connected to the backbone edge device cannot communicate. Run the bpdu bridge enable command to enable a Layer 2 interface to forward BPDUs when the device forwards BPDUs through the hardware."
}