{
    "PageTitle": "display l2protocol-tunnel statistics",
    "FuncDef": "The display l2protocol-tunnel statistics command displays statistics about tunneled Layer 2 protocol data units (PDUs) on an interface. The display l2protocol-tunnel statistics command displays statistics about tunneled Layer 2 protocol data units (PDUs) on an interface. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "display l2protocol-tunnel statistics { <interface-type> <interface-number> | <interface-name> } [ { <protocol> } &<1-19> | user-defined-protocol <protocol-name> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies an interface type.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the interface number.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the interface name.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "<protocol>",
            "Info": "Displays statistics about tunneled Layer 2 PDUs of a specified protocol on an interface.\nThe following protocols are supported:\ncdpdldpdtpeoam3ahgmrpgvrphgmplacplldppagppvst+stpudldvtp\nOne or more of the preceding Layer 2 protocols can be specified."
        },
        {
            "Parameters": "user-defined-protocol <protocol-name>",
            "Info": "Displays statistics about tunneled Layer 2 PDUs of a user-defined Layer 2 protocol on an interface.\nThe value is a string of 1 to 31 case-insensitive characters, spaces not supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display l2protocol-tunnel statistics 10GE 1/0/1 stp"
        ]
    ],
    "ExtraInfo": "After you configure Layer 2 protocol tunneling, run the display l2protocol-tunnel statistics command to view statistics about tunneled Layer 2 PDUs on an interface. The statistics include:"
}