{
    "PageTitle": "l2protocol-tunnel vlan",
    "FuncDef": "The l2protocol-tunnel vlan command enables Layer 2 protocol tunneling on a tagged interface.\nThe undo l2protocol-tunnel vlan command disables Layer 2 protocol tunneling on a tagged interface. The l2protocol-tunnel vlan command enables Layer 2 protocol tunneling on a tagged interface. The undo l2protocol-tunnel vlan command disables Layer 2 protocol tunneling on a tagged interface. By default, Layer 2 protocol tunneling is disabled on tagged interfaces. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "l2protocol-tunnel { all | user-defined-protocol <protocol-name> | { <protocol> } &<1-19> } vlan { <low-vid> [ to <high-vid> ] } &<1-10>",
        "undo l2protocol-tunnel { all | user-defined-protocol <protocol-name> | { <protocol> } &<1-19> } vlan { <low-vid> [ to <high-vid> ] } &<1-10>"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,Layer 2 10GE interface view,Layer 2 200GE interface view,25GE-L2 view,400GE-L2 view,Layer 2 50GE interface view,Layer 2 Eth-Trunk interface view,Layer 2 GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Enables or disables Layer 2 protocol tunneling for all supported standard and user-defined Layer 2 protocols.\n-"
        },
        {
            "Parameters": "user-defined-protocol <protocol-name>",
            "Info": "Enables or disables Layer 2 protocol tunneling for a user-defined protocol.\nThe value is a string of 1 to 31 case-insensitive characters, spaces not supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "<protocol>",
            "Info": "Enables or disables Layer 2 protocol tunneling for a specified Layer 2 protocol.\nThe following protocols are supported:\ncdpdldpdtpeoam3ahgmrpgvrphgmplacplldppagppvst+stpudldvtp\nYou must select at least one protocol and at most all protocols."
        },
        {
            "Parameters": "<low-vid>",
            "Info": "Specifies a start VLAN ID.\nThe value is an integer ranging from 1 to 4094. It must be smaller than the end VLAN ID."
        },
        {
            "Parameters": "<high-vid>",
            "Info": "Specifies an end VLAN ID.\nThe value is an integer ranging from 1 to 4094. It must be greater than the start VLAN ID."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] l2protocol-tunnel stp group-mac 00e0-fc12-3456",
            "[*HUAWEI] vlan batch 100 to 200",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] portswitch",
            "[*HUAWEI-100GE1/0/1] port link-type trunk",
            "[*HUAWEI-100GE1/0/1] l2protocol-tunnel stp vlan 100 to 200"
        ]
    ],
    "ExtraInfo": "Layer 2 protocols running between user networks, such as Multiple Spanning Tree protocol (MSTP), Link Aggregation Control Protocol (LACP), must traverse a backbone network to perform Layer 2 protocol calculation.\nWhen each edge device interface on a backbone network connects to more than one user network and Layer 2 protocol data units (PDUs) from the user networks carry VLAN tags, run the l2protocol-tunnel vlan command to configure Layer 2 protocol tunneling on tagged interfaces to allow the Layer 2 PDUs from the user networks to be tunneled across the backbone network."
}