{
    "PageTitle": "l2protocol-tunnel drop-threshold",
    "FuncDef": "The l2protocol-tunnel drop-threshold command configures a drop threshold for Layer 2 protocol data units (PDUs) on an interface enabled with Layer 2 protocol tunneling.\nThe undo l2protocol-tunnel drop-threshold command restores the default drop threshold for Layer 2 PDUs on an interface enabled with Layer 2 protocol tunneling. The l2protocol-tunnel drop-threshold command configures a drop threshold for Layer 2 protocol data units (PDUs) on an interface enabled with Layer 2 protocol tunneling. The undo l2protocol-tunnel drop-threshold command restores the default drop threshold for Layer 2 PDUs on an interface enabled with Layer 2 protocol tunneling. By default, the drop threshold is 0, meaning that the drop threshold for Layer 2 protocol data units (PDUs) on an interface enabled with Layer 2 protocol tunneling is not set. This command is supported only on the CE6863H, CE6863H-K, CE8855, CE8851-32CQ4BQ, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "l2protocol-tunnel drop-threshold <rate> [ user-defined-protocol <protocol-name> | { <protocol> } &<1-16> ]",
        "undo l2protocol-tunnel drop-threshold [ { <rate> { { user-defined-protocol <protocol-name> } | <protocol> } } | { user-defined-protocol <protocol-name> } | { <protocol> } &<1-16> ]"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,Layer 2 10GE interface view,Layer 2 200GE interface view,25GE-L2 view,400GE-L2 view,Layer 2 50GE interface view,Layer 2 Eth-Trunk interface view,Layer 2 GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<rate>",
            "Info": "Specifies the threshold for dropping Layer 2 PDUs per second on an interface enabled with Layer 2 protocol tunneling.\nThe value is an integer ranging from 1 to 4096, in pps."
        },
        {
            "Parameters": "user-defined-protocol <protocol-name>",
            "Info": "Specifies a user-defined Layer 2 protocol of which the drop threshold is configured for Layer 2 PDUs.\nThe value is a string of 1 to 31 case-insensitive characters, spaces not supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "<protocol>",
            "Info": "Specifies the Layer 2 protocol of which the drop threshold is configured for Layer 2 PDUs.\nThe following protocols are supported:\ncdpdldpdtpeoam3ahgmrpgvrphgmplacplldppagppvst+stpudldvtp\nOne or more of the preceding protocols can be specified."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE1/0/1",
            "[~HUAWEI-100GE1/0/1] portswitch",
            "[*HUAWEI-100GE1/0/1] l2protocol-tunnel stp enable",
            "[*HUAWEI-100GE1/0/1] l2protocol-tunnel drop-threshold 10 stp"
        ]
    ],
    "ExtraInfo": "When an interface enabled with Layer 2 protocol transparent transmission receives a large number of Layer 2 protocol packets, you can run this command to set a drop threshold for Layer 2 PDUs to prevent malicious attacks.\nIf the number of Layer 2 PDUs that pass through an inbound interface (on which Layer 2 protocol tunneling is enabled) within a period (1s) exceeds the configured threshold, the inbound interface discards excess Layer 2 PDUs."
}