{
    "PageTitle": "l2protocol-tunnel enable (Layer 2 interface view)",
    "FuncDef": "The l2protocol-tunnel enable command enables Layer 2 protocol tunneling on an untagged interface.\nThe undo l2protocol-tunnel enable command disables Layer 2 protocol tunneling on an untagged interface.\nThe l2protocol-tunnel disable command disables Layer 2 protocol tunneling on an untagged interface. The l2protocol-tunnel enable command enables Layer 2 protocol tunneling on an untagged interface. The undo l2protocol-tunnel enable command disables Layer 2 protocol tunneling on an untagged interface. The l2protocol-tunnel disable command disables Layer 2 protocol tunneling on an untagged interface. By default, Layer 2 protocol tunneling is disabled on untagged interfaces. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "l2protocol-tunnel { all | user-defined-protocol <protocol-name> | { <protocol> } &<1-16> } enable",
        "l2protocol-tunnel { all | user-defined-protocol <protocol-name> | { <protocol> } &<1-16> } disable",
        "undo l2protocol-tunnel { all | user-defined-protocol <protocol-name> | { <protocol> } &<1-16> } enable"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,Layer 2 10GE interface view,Layer 2 200GE interface view,25GE-L2 view,400GE-L2 view,Layer 2 50GE interface view,Layer 2 Eth-Trunk interface view,Layer 2 GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Enables or disables transparent transmission of packets of all standard Layer 2 protocols and user-defined Layer 2 protocols.\n-"
        },
        {
            "Parameters": "user-defined-protocol <protocol-name>",
            "Info": "Enables or disables the user-defined protocol.\nThe name is a string of 1 to 31 case-insensitive characters, spaces not supported.\nIf spaces are used, the string must be enclosed in double quotation marks (\" \")."
        },
        {
            "Parameters": "<protocol>",
            "Info": "Enables or disables Layer 2 protocol tunneling for a specified Layer 2 protocol.\nThe following protocols are supported:\ncdpdldpdtpeoam3ahgmrpgvrphgmplacplldppagppvst+stpudldvtp\nYou must select at least one protocol and at most all protocols."
        },
        {
            "Parameters": "enable",
            "Info": "Enables Layer 2 protocol transparent transmission.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Disables Layer 2 protocol transparent transmission.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE1/0/1",
            "[~HUAWEI-100GE1/0/1] l2protocol-tunnel stp enable"
        ]
    ],
    "ExtraInfo": "Layer 2 protocols running between user networks, such as Multiple Spanning Tree protocol (MSTP), Link Aggregation Control Protocol (LACP), must traverse a backbone network to perform Layer 2 protocol calculation.\nWhen each edge device interface on a backbone network connects to only one user network and Layer 2 protocol data units (PDUs) from the user networks do not carry VLAN tags, run the l2protocol-tunnel enable command to configure Layer 2 protocol tunneling on untagged interfaces to allow the Layer 2 PDUs from the user networks to be tunneled across the backbone network. Layer 2 PDUs from the user networks then travel through different Layer 2 tunnels to reach the destinations to perform Layer 2 protocol calculation."
}