{
    "PageTitle": "l2protocol-tunnel user-defined-protocol",
    "FuncDef": "The l2protocol-tunnel user-defined-protocol command configures parameters for a user-defined Layer 2 protocol. The parameters include the protocol name, Ethernet encapsulation type, multicast destination MAC address, and multicast MAC address used to replace the multicast destination MAC address.\nThe undo l2protocol-tunnel user-defined-protocol command deletes parameters for a user-defined Layer 2 protocol. The l2protocol-tunnel user-defined-protocol command configures parameters for a user-defined Layer 2 protocol. The parameters include the protocol name, Ethernet encapsulation type, multicast destination MAC address, and multicast MAC address used to replace the multicast destination MAC address. The undo l2protocol-tunnel user-defined-protocol command deletes parameters for a user-defined Layer 2 protocol. By default, no parameters are configured for user-defined Layer 2 protocols. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "l2protocol-tunnel user-defined-protocol <protocol-name> protocol-mac <protocol-mac> [ encap-type { { ethernetiiprotocol-type <protocol-type> } | { llcdsap <dsap-value> ssap <ssap-value> } | { snapprotocol-type <protocol-type> } } ] group-mac { <group-mac> | default-group-mac }",
        "undo l2protocol-tunnel user-defined-protocol <protocol-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<protocol-name>",
            "Info": "Specifies a user-defined protocol name.\nThe value is a string of 1 to 31 case-insensitive characters, spaces not supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "protocol-mac <protocol-mac>",
            "Info": "Specifies the destination MAC address in Layer 2 protocol data units (PDUs). The destination MAC address cannot be one in use on the local device.\nThe value is in the H-H-H format, where H is a 4-digit hexadecimal number."
        },
        {
            "Parameters": "encap-type",
            "Info": "Specifies an Ethernet encapsulation type of user-defined Layer 2 PDUs.\nWhen user-defined Layer 2 PDUs have the same destination MAC address and protocol type, specify a different encap-type to differentiate these Layer 2 PDUs.\n-"
        },
        {
            "Parameters": "ethernetii",
            "Info": "Specifies Ethernet II for user-defined Layer 2 PDUs.\n-"
        },
        {
            "Parameters": "protocol-type <protocol-type>",
            "Info": "Specifies the Ethernet encapsulation value.\nThe value is a hexadecimal integer.\nThe value ranges from 0600 to FFFF for Ethernet II encapsulation type.The value ranges from 0000 to FFFF for SNAP encapsulation type."
        },
        {
            "Parameters": "<protocol-type>",
            "Info": "Specifies the SNAP encapsulation value.\nThe value is a hexadecimal integer ranging from 0x00 to 0xff."
        },
        {
            "Parameters": "llc",
            "Info": "Specifies Logical Link Control (LLC) for user-defined Layer 2 PDUs.\n-"
        },
        {
            "Parameters": "dsap <dsap-value>",
            "Info": "Specifies a destination service access point.\nThe value is a hexadecimal integer ranging from 0x00 to 0xff."
        },
        {
            "Parameters": "ssap <ssap-value>",
            "Info": "Specifies a source service access point.\nThe value is a hexadecimal integer ranging from 0x00 to 0xff."
        },
        {
            "Parameters": "snap",
            "Info": "Specifies the Sub-Network Access Protocol (SNAP) for user-defined Layer 2 PDUs.\n-"
        },
        {
            "Parameters": "group-mac <group-mac>",
            "Info": "Specifies the multicast MAC address which is used to replace the destination MAC address in Layer 2 PDUs.\nThe value is in the H-H-H format, where H is a 4-digit hexadecimal number.group-mac must start with 0x01 and cannot be any of the following multicast MAC addresses:\n\nMulticast MAC addresses that are in use on the local device0180-C200-0000 to 0180-C200-002F, which are used for BPDUs010F-E200-0004, which is used for Smart Link packets0100-0CCC-CCCC and 0100-0CCC-CCCD, which are reserved for specific purposes"
        },
        {
            "Parameters": "default-group-mac",
            "Info": "Indicates the default group MAC address, which has a fixed value of 0100-0ccd-cdd0.\nMost Layer 2 protocols can be identified by protocol type. You can configure a group MAC address for this type of protocol to reduce configuration workload.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] l2protocol-tunnel user-defined-protocol huawei protocol-mac 0180-c200-0017 group-mac 0100-5e00-0012"
        ]
    ],
    "ExtraInfo": "To transparently transmit non-standard Layer 2 PDUs with specific multicast destination MAC addresses from user networks across a backbone network, run the l2protocol-tunnel user-defined-protocol command on backbone network devices."
}