{
    "PageTitle": "reset l2protocol-tunnel statistics",
    "FuncDef": "The reset l2protocol-tunnel statistics command deletes statistics about tunneled Layer 2 protocol data units (PDUs) on a specified interface. The reset l2protocol-tunnel statistics command deletes statistics about tunneled Layer 2 protocol data units (PDUs) on a specified interface. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "reset l2protocol-tunnel statistics { <interface-type> <interface-number> | <interface-name> } [ { user-defined-protocol <protocol-name> } | { <protocol> } &<1-19> ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the interface type.\nThe value is a string of 1 to 63 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the interface number.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the interface name.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "user-defined-protocol <protocol-name>",
            "Info": "Specifies Layer 2 protocol tunneling for a user-defined protocol.\nThe name is a string of 1 to 31 case-insensitive characters, spaces not supported.\nIf spaces are used, the string must start and end with double quotation marks (\")."
        },
        {
            "Parameters": "<protocol>",
            "Info": "Deletes statistics about tunneled Layer 2 PDUs of a specified protocol on an interface.\nThe following protocols are supported:\ncdpdldpdtpeoam3ahgmrpgvrphgmplacplldppagppvst+stpudldvtp\nOne or more of the preceding Layer 2 protocols can be specified."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset l2protocol-tunnel statistics 100GE 1/0/1"
        ]
    ],
    "ExtraInfo": "Before collecting statistics about tunneled Layer 2 PDUs on an interface, run the reset l2protocol-tunnel statistics command to delete the existing statistics so that the interface can re-collect the statistics."
}