{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "ping ip",
    "FuncDef": [
        "To test network connectivity on IP networks, use the **ping ip** command inprivileged EXEC mode. "
    ],
    "CLIs": [
        "ping ip { <host-name> | <ip-address> } [ data [ <hex-data-pattern> ] | df-bit | repeat [ <repeat-count> ] | size [ <datagram-size> ] [ source { <source-address> | source-interface } ] [ timeout <seconds> ] [ validate ] [ verbose ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *host-name* ",
            "Info": " Host name of the system to ping. "
        },
        {
            "Parameters": " *system-address* ",
            "Info": " Address of the system to ping. "
        },
        {
            "Parameters": " **data** *hex-data-pattern* ",
            "Info": " (Optional) Specifies the data pattern. Range is from 0 to FFFF. "
        },
        {
            "Parameters": " **df-bit** ",
            "Info": " (Optional) Enables the \"do-not-fragment\" bit in the IP header. "
        },
        {
            "Parameters": " **repeat** *repeat-count* ",
            "Info": " (Optional) Specifies the number of pings sent. The range is from 1 to 2147483647. The default is 5. "
        },
        {
            "Parameters": " **size** ",
            "Info": " (Optional) Specifies the datagram size. Datagram size is the number of bytes in each ping. "
        },
        {
            "Parameters": " *datagram-size* ",
            "Info": " (Optional) Range is from 40 to 18024. "
        },
        {
            "Parameters": " **source** ",
            "Info": " (Optional) Specifies the source address or source interface. "
        },
        {
            "Parameters": " *source-address* ",
            "Info": " (Optional) IP address to use as the source in the ping packets. "
        },
        {
            "Parameters": " *source-interface* ",
            "Info": " (Optional) Name of the interface from which the ping should be sent, and the Interface ID (slot/port/number). Interface name keywords include the following:  •**async** (Asynchronous Interface)  •**bvi** (Bridge-Group Virtual Interface)  •**ctunnel**  •**dialer**  •**ethernet**  •**fastEthernet**  •**lex**  •**loopback**  •**multilink** (Multilink-group interface)  •**null**  •**port-channel** (Ethernet channel of interfaces)  •**tunnel**  •**vif** (PGM Multicast Host interface)  •**virtual-template**  •**virtual-tokenring**  •**xtagatm** (Extended Tag ATM interface)  The availability of these keywords depends on your system hardware. "
        },
        {
            "Parameters": " **timeout** *seconds* ",
            "Info": " (Optional) Specifies the timeout interval in seconds. The default is 2 seconds. Range is from 0 to 3600. "
        },
        {
            "Parameters": " **validate** ",
            "Info": " (Optional) Validates the reply data. "
        },
        {
            "Parameters": " **verbose** ",
            "Info": " (Optional) Enables verbose output, which lists individual ICMP packets, as well as Echo Responses. "
        }
    ],
    "Examples": [
        [
            "After you enter the ping command in privileged mode, the system prompts you for a protocol keyword. The default protocol is IP.",
            "If you enter a host name or address on the same line as the ping command, the default action is taken as appropriate for the protocol type of that name or address.",
            "The optional data, df-bit, repeat, size, source, timeout, and validate keywords can be used to avoid extended ping command output. You can use as many of these keywords as you need, and you can use them in any order after the <host-name> or <system-address> arguments.",
            "Although the precise dialog varies somewhat from protocol to protocol, all are similar to the ping session using default values shown in the following output:",
            "```",
            "Router# ping",
            "```",
            "```",
            "```",
            "```",
            "Protocol [ ip ] :",
            "```",
            "```",
            "Target IP address: 192.168.7.27",
            "```",
            "```",
            "Repeat count [ 5 ] :",
            "```",
            "```",
            "Datagram size [ 100 ] :",
            "```",
            "```",
            "Timeout in seconds [ 2 ] :",
            "```",
            "```",
            "Extended commands [ n ] :",
            "```",
            "```",
            "Sweep range of sizes [ n ] :",
            "```",
            "```",
            "Type escape sequence to abort.",
            "```",
            "```",
            "Sending 5, 100-byte ICMP Echos to 192.168.7.27, timeout is 2 seconds:",
            "```",
            "```",
            "!!!!!",
            "```",
            "```",
            "Success rate is 100 percent, round-trip min/avg/max = 1/2/4 ms",
            "```",
            "```",
            "```",
            "[ Table 45 ] (#wp1040326) describes the default ping fields shown in the display.",
            "Table 45 ping Field Descriptions",
            "| Field | Description |",
            "| --- | --- |",
            "| Protocol [ ip ] : | Prompts for a supported protocol. The default is IP. |",
            "| Target IP address: | Prompts for the IP address or host name of the destination node you plan to ping. If you have specified a supported protocol other than IP, enter an appropriate address for that protocol here. The default is none. |",
            "| Repeat count [ 5 ] : | Prompts for the number of ping packets that will be sent to the destination address. The default is 5 packets. |",
            "| Datagram size [ 100 ] : | Prompts for the size of the ping packet (in bytes). The default is 100 bytes. |",
            "| Timeout in seconds [ 2 ] : | Prompts for the timeout interval. The default is 2 seconds. |",
            "| Extended commands [ n ] : | Specifies whether a series of additional commands appears. |",
            "| Sweep range of sizes [ n ] : | Allows you to vary the sizes of the echo packets being sent. This capability is useful for determining the minimum sizes of the MTUs configured on the nodes along the path to the destination address. Packet fragmentation contributing to performance problems can then be reduced. |",
            "| !!!!! | Each exclamation point (!) indicates receipt of a reply. A period (.) indicates that the network server timed out while waiting for a reply. Other characters may appear in the ping output display, depending on the protocol type. |",
            "| Success rate is 100 percent | Indicates the percentage of packets successfully echoed back to the router. Anything less than 80 percent is usually considered problematic. |",
            "| round-trip min/avg/max = 1/2/4 ms | Indicates the round-trip travel time intervals for the protocol echo packets, including minimum/average/maximum (in milliseconds). |"
        ]
    ],
    "ExtraInfo": "The **ping** command sends an echo request packet to an address, then awaits a reply. Ping output can help you evaluate path-to-host reliability, delays over the path, and whether the host can be reached or is functioning.To abnormally terminate a ping session, type the escape sequence—by default, **Ctrl-^ X**. You type the default by simultaneously pressing and releasing the **Ctrl**, **Shift**, and **6** keys, and then pressing the **X** key.[Table 44](#wp1040260) describes the test characters that the ping facility sends.Table 44 ping Test Characters| Character | Description || --- | --- || ! | Each exclamation point indicates receipt of a reply. || . | Each period indicates that the network server timed out while waiting for a reply. || U | A destination unreachable error protocol data unit (PDU) was received. || C | A congestion experienced packet was received. || I | User interrupted test. || ? | Unknown packet type. || & | Packet lifetime exceeded. |  ![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)Not all protocols require hosts to support pings. For some protocols, the pings are Cisco-defined and are only answered by another Cisco router.---",
    "RelatedCmds": [
        {
            "cmd": " **ping ipv6** ",
            "description": " Tests the connection to a remote host on the network using IPv6. "
        },
        {
            "cmd": " **ping vrf** ",
            "description": " Tests the connection in the context of a specific VPN (VRF). "
        }
    ]
}