{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "archive config",
    "FuncDef": [
        "To save a copy of the current running configuration to the Cisco IOS configuration archive, use the **archive config** command in privileged EXEC mode. "
    ],
    "CLIs": [
        "archive config"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "The following example shows how to save the current running configuration to the Cisco IOS configuration archive using the archive config command. Before using the archive config command, you must configure the path command to specify the location and filename prefix for the files in the Cisco IOS configuration archive. In this example, the location and filename prefix are specified as disk0:myconfig as follows:",
            "```",
            "configure terminal",
            "```",
            "```",
            "!",
            "```",
            "```",
            "archive",
            "```",
            "```",
            "path disk0:myconfig",
            "```",
            "```",
            "end",
            "```",
            "```",
            "```",
            "You then save the current running configuration in the configuration archive, as follows:",
            "```",
            "archive config",
            "```",
            "```",
            "```",
            "The show archive command displays information on the files saved in the configuration archive as shown in the following sample output:",
            "```",
            "Router# show archive",
            "```",
            "```",
            "```",
            "```",
            "There are currently 1 archive configurations saved.",
            "```",
            "```",
            "The next archive file will be named disk0:myconfig-2",
            "```",
            "```",
            "Archive # Name",
            "```",
            "```",
            "0",
            "```",
            "```",
            "1 disk0:myconfig-1 <- Most Recent",
            "```",
            "```",
            "2",
            "```",
            "```",
            "3",
            "```",
            "```",
            "4",
            "```",
            "```",
            "5",
            "```",
            "```",
            "6",
            "```",
            "```",
            "7",
            "```",
            "```",
            "8",
            "```",
            "```",
            "9",
            "```",
            "```",
            "10",
            "```"
        ]
    ],
    "ExtraInfo": "![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)Before using this command, you must configure the **path** command in order to specify the location and filename prefix for the files in the Cisco IOS configuration archive.---The Cisco IOS configuration archive is intended to provide a mechanism to store, organize, and manage an archive of Cisco IOS configuration files to enhance the configuration rollback capability provided by the **configure replace** command. Before this feature was introduced, you could save copies of the running configuration using the **copy running-config** *destination-url* command, storing the target file either locally or remotely. However, this method lacked any automated file management. On the other hand, the Configuration Replace and Configuration Rollback feature provides the capability to automatically save copies of the running configuration to the Cisco IOS configuration archive. These archived files serve as checkpoint configuration references and can be used by the **configure replace** command to revert to previous configuration states.The **archive config** command allows you to save Cisco IOS configurations in the configuration archive using a standard location and filename prefix that is automatically appended with an incremental version number (and optional time stamp) as each consecutive file is saved. This functionality provides a means for consistent identification of saved Cisco IOS configuration files. You can specify how many versions of the running configuration are kept in the archive. After the maximum number of files has been saved in the archive, the oldest file is automatically deleted when the next, most recent file is saved. The **show archive** command displays information for all configuration files saved in the Cisco IOS configuration archive.",
    "RelatedCmds": [
        {
            "cmd": " **archive** ",
            "description": " Enters archive configuration mode. "
        },
        {
            "cmd": " **configure confirm** ",
            "description": " Confirms replacement of the current running configuration with a saved Cisco IOS configuration file. "
        },
        {
            "cmd": " **configure replace** ",
            "description": " Replaces the current running configuration with a saved Cisco IOS configuration file. "
        },
        {
            "cmd": " **maximum** ",
            "description": " Sets the maximum number of archive files of the running configuration to be saved in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **path** ",
            "description": " Specifies the location and filename prefix for the files in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **show archive** ",
            "description": " Displays information about the files saved in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **time-period** ",
            "description": " Sets the time increment for automatically saving an archive file of the current running configuration in the Cisco IOS configuration archive. "
        }
    ]
}