{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "async-bootp",
    "FuncDef": [
        "To configure extended BOOTP requests for asynchronous interfaces as defined in RFC 1084, use the **async-bootp** command in global configuration mode. To restore the default, use the **no** form of this command. "
    ],
    "CLIs": [
        "async-bootp <tag> [ :<hostname> ] <data>",
        "no async-bootp"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *tag* ",
            "Info": " Item being requested; expressed as filename, integer, or IP dotted decimal address. See [Table 12](#wp1013542)for possible keywords. "
        },
        {
            "Parameters": " **:***hostname* ",
            "Info": " (Optional) This entry applies only to the specified host. The :hostname argument accepts both an IP address and a logical host name. "
        },
        {
            "Parameters": " *data* ",
            "Info": " List of IP addresses entered in dotted decimal notation or as logical host names, a number, or a quoted string. "
        }
    ],
    "Examples": [
        [
            "The following example illustrates how to specify different boot files: one for a PC, and one for a Macintosh. With this configuration, a BOOTP request from the host on 172.30.1.1 results in a reply listing the boot filename as pcboot. A BOOTP request from the host named \"mac\" results in a reply listing the boot filename as \"macboot.\"",
            "```",
            "async-bootp bootfile :172.30.1.1 \"pcboot\"",
            "```",
            "```",
            "async-bootp bootfile :mac \"macboot\"",
            "```",
            "```",
            "```",
            "The following example specifies a subnet mask of 255.255.0.0:",
            "```",
            "async-bootp subnet-mask 255.255.0.0",
            "```",
            "```",
            "```",
            "The following example specifies a negative time offset of the local subnetwork of 3600 seconds:",
            "```",
            "async-bootp time-offset -3600",
            "```",
            "```",
            "```",
            "The following example specifies the IP address of a time server:",
            "```",
            "async-bootp time-server 172.16.1.1",
            "```"
        ]
    ],
    "ExtraInfo": "Use the **show async-bootp** EXEC command to list the configured parameters. Use the **no****async-bootp** command to clear the list.",
    "RelatedCmds": [
        {
            "cmd": " **show async bootp** ",
            "description": " Displays the extended BOOTP request parameters that have been configured for asynchronous interfaces. "
        }
    ]
}