{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "service-module wlan-ap session",
    "FuncDef": [
        "To begin a configuration session with a service module through a console connection use the **service-module wlan-ap session** command in privileged EXEC mode. "
    ],
    "CLIs": [
        "service-module wlan-ap <interface number> session [ clear | disconnect ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *interface number* ",
            "Info": " The interface number for the wireless device. Always use 0. "
        },
        {
            "Parameters": " **clear** ",
            "Info": " (Optional) Clears the wireless device configuration session. "
        }
    ],
    "Examples": [
        [
            "The following example shows a session being opened on a service-module in an ISR:",
            "Router# service-module wlan-ap 0 session",
            "```",
            "```",
            "Trying 1.2.3.4, 2002 ... Open",
            "AP#",
            "```",
            "```",
            "The following example clears the session on the service-module in the ISR:",
            "Router#service-module wlan-ap 0 session clear",
            "[ confirm ]",
            "[ OK ]"
        ]
    ],
    "ExtraInfo": "Only one session is allowed at a time into the wireless device from a router console-port connection. After starting a session, perform configuration tasks on the wireless device. You first access the router in a user-level shell. To access the privileged EXEC command shell, where most commands are available, use the **enable** command.When you finish configuring the device, and would like to exit the console session, type Ctrl-Shift 6x to return to the router's console. Type service-module wlan-ap session **clear** or disconnect to close the session with the device. At the confirmation prompt, press **Enter** twiceto confirm the action or **n** to cancel.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)If you do not **clear** or **disconnect** the session on the service module, it will remain open in the background after you return to the router's console prompt. When the session is open in the background, pressing **Enter** will toggle you back to the wireless device prompt.---",
    "RelatedCmds": [
        {
            "cmd": " enable ",
            "description": " Enters privileged EXEC mode. "
        },
        {
            "cmd": " interface wlan-ap ",
            "description": " Enters wireless interface configuration mode to configure an interface. "
        }
    ]
}