{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "service config",
    "FuncDef": [
        "To enable autoloading of configuration files from a network server, use the**service config** command in global configuration mode. To restore the default, use the **no** form of this command. "
    ],
    "CLIs": [
        "service config",
        "no service config"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "In the following example, a router is configured to autoload the default network and host configuration files. Because no boot host or boot network commands are specified, the router uses the broadcast address to request the files from a TFTP server.",
            "```",
            "Router(config)# service config",
            "```",
            "```",
            "```",
            "The following example changes the network configuration filename to bridge_9.1, specifies that rcp is to be used as the transport mechanism, and gives 172.16.1.111 as the IP address of the server on which the network configuration file resides:",
            "```",
            "Router(config)# service config",
            "```",
            "```",
            "Router(config)# boot network rcp://172.16.1.111/bridge_9.1",
            "```"
        ]
    ],
    "ExtraInfo": "Usually, the service config command is used in conjunction with the boot host or boot network command. You must enter the service config command to enable the router to automatically configure the system from the file specified by the boot host or boot network command.     With Cisco IOS software Releases 12.3(2)T, 12.3(1)B, and later releases, you no longer have to specify the service config command for the boot host or boot network command to be active.    If you specify both the no service config command and the boot host command, the router attempts to find the specified host configuration file. The service config command can also be used without the boot host or boot network command. If you do not specify host or network configuration filenames, the router uses the default configuration files. The default network configuration file is network-confg. The default host configuration file is host-confg, where host is the hostname of the router. If the Cisco IOS software cannot resolve its hostname, the default host configuration file is router-confg.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)You must issue the **reload** command for the **service config** command to take effect.---",
    "RelatedCmds": [
        {
            "cmd": " **boot host** ",
            "description": " Changes the default name of the host configuration filename from which to load configuration commands. "
        },
        {
            "cmd": " **boot network** ",
            "description": " Changes the default name of the network configuration file from which to load configuration commands. "
        },
        {
            "cmd": " **Reload** ",
            "description": " Reloads the operating system. "
        }
    ]
}