{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "service compress-config",
    "FuncDef": [
        "To compress startup configuration files, use the**service compress-config** command in global configuration mode. To disable compression, use the **no** form of this command. "
    ],
    "CLIs": [
        "service compress-config",
        "no service compress-config"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [],
    "ExtraInfo": "After you configure the **service compress-config** command, the router will compress configuration files every time you save a configuration to the startup configuration. For example, when you enter the **copy system:running-config nvram:startup-config** command, the running configuration will be compressed before storage in NVRAM.If the file compression succeeds, the following message is displayed:```Compressing configuration from configuration-size to compressed-size``````[OK]``````  ```If the boot ROMs do not recognize a compressed configuration, the following message is displayed:```Boot ROMs do not support NVRAM compression Config NOT written to NVRAM``````  ```If the file compression fails, the following message is displayed:```Error trying to compress nvram``````  ```One way to determine whether a configuration file will be compressed enough to fit into NVRAM is to use a text editor to enter the configuration, then use the UNIX **compress** command to check the compressed size. To get a closer approximation of the compression ratio, use the UNIX **compress -b12** command.Once the configuration file has been compressed, the router functions normally. At boot time, the system recognizes that the configuration file is compressed, uncompresses it, and proceeds normally. A **partition nvram:startup-config**command uncompresses the configuration before displaying it.To disable compression of the configuration file, enter configuration mode and specify the **no** **service compress-config** command. Then, exit global configuration mode and enter the **copy system:running-config nvram:startup-config**command. The router displays an OK message if it is able to write the uncompressed configuration to NVRAM. Otherwise, the router displays an error message indicating that the configuration is too large to store. If the configuration file is larger than the physical NVRAM, the following message is displayed:```",
    "RelatedCmds": []
}