{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "slave image",
    "FuncDef": [
        "To specify the image that the slave Route Switch Processor (RSP) runs on a Cisco 7507 or Cisco 7513 router, use the**slave image** command in global configuration mode. "
    ],
    "CLIs": [
        "slave image { system | <file-url> }"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **system** ",
            "Info": " Loads the slave image that is bundled with the master system image. This is the default. "
        },
        {
            "Parameters": " *file-url* ",
            "Info": " The specified file in Flash file system from which the slave image will be load. If you do not specify a filename, the first file in the specified Flash file system is the default file. "
        }
    ],
    "Examples": [
        [
            "In the following example, the slave RSP is specified to run the rsp-dw-mz.ucode.111-3.2 image from slot 0:",
            "```",
            "Router(config)# slave image slot0:rsp-dw-mz.ucode.111-3.2",
            "```"
        ]
    ],
    "ExtraInfo": "Use this command for a Cisco 7507 or Cisco 7513 router that is configured for Dual RSP Cards. On the Cisco 7507 and Cisco 7513 router, you can install two RSP cards in a single router to improve system availability. Dual RSP Cards is a High System Availability (HSA) feature.Use the **slave image** command to override the slave image that is bundled with the master image.When using HSA for simple hardware backup, ensure that the slave image is in the same location on the master and the slave RSP card. Thus, if the slave RSP card becomes the master, it will be able to find the slave image and download it to the new slave.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)The default length of the bootstring filename is 64 characters. Depending on the platform a longer bootstring filename can be used and supported.---",
    "RelatedCmds": [
        {
            "cmd": " **show controller cbus** ",
            "description": " Displays detailed information on the cards connected to the CBus controller. "
        },
        {
            "cmd": " **show stack**s ",
            "description": " Displays the stack trace and version information of the master and slave RSP cards. "
        },
        {
            "cmd": " **show version** ",
            "description": " Displays the software version running on the master and slave RSP cards. "
        },
        {
            "cmd": " slave reload ",
            "description": " Forces a reload of the image that the slave RSP card is running on a Cisco 7507 or Cisco 7513 router. "
        }
    ]
}