{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "slave terminal",
    "FuncDef": [
        "To enable access to the slave Route Switch Processor (RSP) console, use the **slave terminal** global configuration command. To disable access to the slave RSP console, use the **no** form of this command. "
    ],
    "CLIs": [
        "slave terminal",
        "no slave terminal"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "In the following example, the user disables console access to the slave RSP:",
            "```",
            "c7507(config)# no slave terminal",
            "```"
        ]
    ],
    "ExtraInfo": "The slave console does not have enable password protection. Thus, an individual connected to the slave console port can enter privileged EXEC mode and view or erase the configuration of the router. Use the **no****slave terminal** command to disable slave console access and prevent security problems. When the slave console is disabled, users cannot enter commands.If slave console access is disabled, the following message appears periodically on the slave console:```%%Slave terminal access is disabled. Use \"slave terminal\" command in master RSP configuration mode to enable it.```",
    "RelatedCmds": [
        {
            "cmd": " **show controller cbus** ",
            "description": " Displays detailed information on the cards connected to the CBus controller. "
        },
        {
            "cmd": " **show stack**s ",
            "description": " Displays the stack trace and version information of the master and slave RSP cards. "
        },
        {
            "cmd": " **show version** ",
            "description": " Displays the software version running on the master and slave RSP cards. "
        },
        {
            "cmd": " slave auto-sync config ",
            "description": " Turns on automatic synchronization of configuration files for a Cisco 7507 or Cisco 7513 router that is configured for Dual RSP Cards. "
        }
    ]
}