{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "slave auto-sync config",
    "FuncDef": [
        "To turn on automatic synchronization of configuration files for a Cisco 7507 or Cisco 7513 router that is configured for High System Availability (HSA) using Dual RSP Cards, use the **slave auto-sync config**global configuration command. To turn off automatic synchronization, use the **no** form of the command. "
    ],
    "CLIs": [
        "slave auto-sync config",
        "noslave auto-sync config"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "The following example turns on automatic configuration file synchronization. When the copy system:running-config nvram:startup-config command is entered, the running configuration is saved to the startup configurations of both the master RSP and the slave RSP.",
            "```",
            "Router(config)# slave auto-sync config",
            "```",
            "```",
            "Router(config)# end",
            "```",
            "```",
            "Router# copy system:running-config nvram:startup-config",
            "```"
        ]
    ],
    "ExtraInfo": "Use this command for a Cisco 7507 or Cisco 7513 router that is configured for dual RSP cards. On the Cisco 7507 and Cisco 7513 router, you can install two RSP cards in a single router to improve system availability. Dual RSP Cards is a High System Availability (HSA) feature.In automatic synchronization mode, when you issue a **copy** EXEC command that specifies the master's startup configuration (**nvram:startup-config**) as the target, the master also copies the same file to the slave's startup configuration (**slavenvram:startup-config**). Use this command when implementing HSA for simple hardware backup or for software error protection to ensure that the master and slave RSP contain the same configuration files.",
    "RelatedCmds": [
        {
            "cmd": " **show controller cbus** ",
            "description": " Displays detailed information on the cards connected to the CBus controller. "
        },
        {
            "cmd": " **show stacks** ",
            "description": " Displays the stack trace and version information of the master and slave RSP cards. "
        },
        {
            "cmd": " **show version** ",
            "description": " Displays the software version running on the master and slave RSP cards. "
        },
        {
            "cmd": " **slave sync config** ",
            "description": " Manually synchronizes configuration files on the master and slave RSP cards of a Cisco 7507 or Cisco 7513 router. "
        }
    ]
}