{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "squeeze",
    "FuncDef": [
        "To permanently erase files tagged as \"deleted\" or \"error\" on Class A flash file systems, use the **squeeze** command in privileged EXEC mode. "
    ],
    "CLIs": [
        "squeeze [ /nolog ] [ /quiet ] <filesystem>:",
        "<><>Cisco<><> <><>7600<><> <><>Series<><> <><>Router<><>",
        "squeeze <filesystem>:"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **/nolog** ",
            "Info": " (Optional) Disables the squeeze log (recovery data) and accelerates the squeeze process. "
        },
        {
            "Parameters": " **/quiet** ",
            "Info": " (Optional) Disables status messages during the squeeze process. "
        },
        {
            "Parameters": " *filesystem*: ",
            "Info": " The flash file system, followed by a colon.  For the Cisco 7600 series router, the valid values for the flash file system are **bootflash:** and **flash:**. "
        }
    ],
    "Examples": [
        [
            "Supported Platforms Other tha the Cisco 7600 Series Router",
            "In the following example, the file named config1 is deleted, and then the squeeze command is used to reclaim the space used by that file. The /nolog option is used to speed up the squeeze process.",
            "```",
            "Router# delete config1",
            "```",
            "```",
            "```",
            "```",
            "Delete filename [ config1 ] ?",
            "```",
            "```",
            "Delete slot0:conf? [ confirm ]",
            "```",
            "```",
            "```",
            "```",
            "Router# dir slot0:",
            "```",
            "```",
            "```",
            "```",
            "! Note that the deleted file name appears in square brackets",
            "```",
            "```",
            "Directory of slot0:/",
            "```",
            "```",
            "```",
            "```",
            "1 -rw- 4300244 Apr 02 2001 03:18:07 c7200-boot-mz.122-0.14",
            "```",
            "```",
            "2 -rw- 2199 Apr 02 2001 04:45:15 [ config1 ]",
            "```",
            "```",
            "3 -rw- 4300244 Apr 02 2001 04:45:23 image",
            "```",
            "```",
            "20578304 bytes total (11975232 bytes free)",
            "```",
            "```",
            "!20,578,304 - 4,300,244 - 4,300,244 - 2,199 - 385 = 11975232",
            "```",
            "```",
            "```",
            "```",
            "Router# squeeze /nolog slot0:",
            "```",
            "```",
            "```",
            "```",
            "%Warning: Using /nolog option would render squeeze operation uninterruptible.",
            "```",
            "```",
            "All deleted files will be removed. Continue? [ confirm ]",
            "```",
            "```",
            "Squeeze operation may take a while. Continue? [ confirm ]",
            "```",
            "```",
            "```",
            "```",
            "Squeeze of slot0 completed in 291.832 secs .",
            "```",
            "```",
            "```",
            "```",
            "Router# dir slot0:",
            "```",
            "```",
            "```",
            "```",
            "Directory of slot0:/",
            "```",
            "```",
            "```",
            "```",
            "1 -rw- 4300244 Apr 02 2001 03:18:07 c7200-boot-mz.122-0.14",
            "```",
            "```",
            "2 -rw- 4300244 Apr 02 2001 04:45:23 image",
            "```",
            "```",
            "```",
            "```",
            "20578304 bytes total (11977560 bytes free)",
            "```",
            "```",
            "!20,578,304 - 4,300,244 - 4,300,244 - 256 = 11977560",
            "```",
            "Cisco 7600 Series Router"
        ],
        [
            "```",
            "Router# squeeze flash:",
            "```"
        ]
    ],
    "ExtraInfo": "When flash memory is full, you might need to rearrange the files so that the space used by the files marked \"deleted\" can be reclaimed. (This \"squeeze\" process is required for linear flash memory cards to make sectors contiguous; the free memory must be in a \"block\" to be usable.)When you enter the **squeeze** command, the router copies all valid files to the beginning of flash memory and erases all files marked \"deleted.\" After the squeeze process is completed, you can write to the reclaimed flash memory space.![](/c/dam/en/us/td/i/templates/caut.gif)---**Caution** ![](/c/dam/en/us/td/i/templates/blank.gif)After performing the squeeze process, you cannot recover deleted files using the**undelete** EXEC mode command.---In addition to removing deleted files, use the **squeeze** command to remove any files that the system has marked as \"error\". An error file is created when a file write fails (for example, the device is full). To remove error files, you must use the **squeeze** command.Rewriting flash memory space during the squeeze operation may take several minutes.Using the **/nolog** keyword disables the log for the squeeze process. In most cases, this process will speed up the squeeze process. However, if power is lost or the flash card is removed during the squeeze process, all the data on the flash card will be lost, and the device will have to be reformatted.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)Using the **/nolog** keyword makes the squeeze process uninterruptible.---Using the **/quiet** keyword disables the output of status messages to the console during the squeeze process.If the optional keywords are not used, the progress of the squeeze process will be displayed to the console, a log for the process will be maintained, and the squeeze process is interruptible.On Cisco 2600 or Cisco 3600 series routers, the entire file system has to be erased once before the **squeeze** command can be used. After being erased once, the **squeeze** command should operate properly on the flash file system for the rest of the flash file system's history.To erase an entire flash file system on a Cisco 2600 or 3600 series router, perform the following steps:---**Step 1** ![](/c/dam/en/us/td/i/templates/blank.gif)If the flash file system has multiple partitions, enter the **no partition** command to remove the partitions. The reason for removing partitions is to ensure that the entire flash file system is erased. The **squeeze** command can be used in a flash file system with partitions after the flash file system is erased once.**Step 2** ![](/c/dam/en/us/td/i/templates/blank.gif)Enter the **erase** command to erase the flash file system.---",
    "RelatedCmds": [
        {
            "cmd": " **delete** ",
            "description": " Deletes a file on a flash memory device. "
        },
        {
            "cmd": " **dir** ",
            "description": " Displays a list of files on a file system. "
        },
        {
            "cmd": " **erase** ",
            "description": " Erases a file system. "
        },
        {
            "cmd": " **undelete** ",
            "description": " Recovers a file marked \"deleted\" on a Class A or Class B flash file system. "
        }
    ]
}