{
    "PageTitle": "ecmp universal-id",
    "FuncDef": "For the CE6820H, CE6820H-K, CE6820S, CE6863H, CE6863H-K, CE6881H, and CE6881H-K:\nThe ecmp universal-id command configures a hash algorithm offset for ECMP load balancing.\nThe undo ecmp universal-id command restores the default hash algorithm offset of ECMP load balancing.\nFor the CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-T, CE6885-LL in standard forwarding mode, CE6885-SAN, and CE6885-LL in low latency mode:\nThe ecmp underlay universal-id command configures a hash algorithm offset for underlay ECMP load balancing.\nThe undo ecmp underlay universal-id command restores the default hash algorithm offset for underlay ECMP load balancing.\nThe ecmp overlay universal-id command configures a hash algorithm offset for overlay ECMP load balancing.\nThe undo ecmp overlay universal-id command restores the default hash algorithm offset for overlay ECMP load balancing. For the CE6820H, CE6820H-K, CE6820S, CE6863H, CE6863H-K, CE6881H, and CE6881H-K: The ecmp universal-id command configures a hash algorithm offset for ECMP load balancing. The undo ecmp universal-id command restores the default hash algorithm offset of ECMP load balancing. For the CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-T, CE6885-LL in standard forwarding mode, CE6885-SAN, and CE6885-LL in low latency mode: The ecmp underlay universal-id command configures a hash algorithm offset for underlay ECMP load balancing. The undo ecmp underlay universal-id command restores the default hash algorithm offset for underlay ECMP load balancing. The ecmp overlay universal-id command configures a hash algorithm offset for overlay ECMP load balancing. The undo ecmp overlay universal-id command restores the default hash algorithm offset for overlay ECMP load balancing. For the CE6863H-48S6CQ, CE6863H-48S6CQ-K, CE6881H-48S6CQ, CE6881H-48S6CQ-K, CE6881H-48T6CQ, and CE6881H-48T6CQ-K:\n\n\nBy default, the hash algorithm offset of ECMP load balancing is 1.\n\n\nFor the CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-T, CE6885-LL in standard forwarding mode, CE6885-SAN, and CE6885-LL in low latency mode:\n\n\nBy default, the hash algorithm offset of ECMP overlay load balancing is 1.\n\n\nBy default, the hash algorithm offset for ECMP underlay load balancing is 0. For the CE6863H-48S6CQ, CE6863H-48S6CQ-K, CE6881H-48S6CQ, CE6881H-48S6CQ-K, CE6881H-48T6CQ, and CE6881H-48T6CQ-K: By default, the hash algorithm offset of ECMP load balancing is 1. For the CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-T, CE6885-LL in standard forwarding mode, CE6885-SAN, and CE6885-LL in low latency mode: By default, the hash algorithm offset of ECMP overlay load balancing is 1. By default, the hash algorithm offset for ECMP underlay load balancing is 0. This command is supported only on the CE6863H, CE6863H-K, CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ecmp universal-id <universal-id1>",
        "undo ecmp universal-id [ <universal-id1> ]",
        "ecmp underlay universal-id <under-universal-id>",
        "undo ecmp underlay universal-id [ <under-universal-id> ]",
        "ecmp overlay universal-id <over-universal-id>",
        "undo ecmp overlay universal-id [ <over-universal-id> ]"
    ],
    "ParentView": [
        "ECMP load balancing view"
    ],
    "ParaDef": [
        {
            "Parameters": "<universal-id1>",
            "Info": "Sets the Hash algorithm offset of ECMP load balancing.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.\nThe value is an integer ranging from 1 to 16."
        },
        {
            "Parameters": "underlay",
            "Info": "Indicates underlay load balancing.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "<under-universal-id>",
            "Info": "Specifies the hash algorithm offset for ECMP underlay load balancing.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer ranging from 0 to 15. The default value is 0."
        },
        {
            "Parameters": "overlay",
            "Info": "Indicates overlay load balancing.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "<over-universal-id>",
            "Info": "Specifies the hash algorithm offset for ECMP overlay load balancing.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer ranging from 0 to 15. The default value is 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance ecmp",
            "[~HUAWEI-ecmp] ecmp universal-id 2"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance ecmp",
            "[~HUAWEI-ecmp] ecmp overlay universal-id 2"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance ecmp",
            "[~HUAWEI-ecmp] ecmp underlay universal-id 2"
        ]
    ],
    "ExtraInfo": "If there are multiple equal-cost routes to the same destination, the device uses the hash algorithm to select a forwarding path based on the IP address, MAC address, and port number of each received packet. If four equal-cost routes to the destination IP address exist on the device, all traffic destined for the IP address is evenly distributed to the four forwarding paths. By default, a flow (with the same IP address, MAC address, and port number) is forwarded along the same path calculated using the hash algorithm.\nThe hash algorithm offset affects the forwarding path calculated by the hash algorithm. That is, if the hash algorithm offsets of two devices are different, the outbound interfaces calculated by the hash algorithm for the same traffic on the two devices are different.\nIf you want to select different forwarding paths for the same traffic on different devices, configure different hash algorithm offsets on the devices."
}