{
    "PageTitle": "ecmp mode(ECMP load balancing view)",
    "FuncDef": "The ecmp mode command configures the dynamic load balancing mode for an ECMP.\nThe undo ecmp mode command restores the default dynamic load balancing mode for an ECMP. The ecmp mode command configures the dynamic load balancing mode for an ECMP. The undo ecmp mode command restores the default dynamic load balancing mode for an ECMP. By default, the dynamic load balancing mode of an ECMP is eligible, and the interval in a flowlet is 2000. This command is supported only on the CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "ecmp mode { spray | fixed | eligible [ flowlet-gap-time <gap-time> ] }",
        "undo ecmp mode { spray | fixed | eligible [ flowlet-gap-time <gap-time> ] }"
    ],
    "ParentView": [
        "ECMP load balancing view"
    ],
    "ParaDef": [
        {
            "Parameters": "spray",
            "Info": "Enables the spray dynamic load balancing mode for an ECMP.\nIn spray dynamic load balancing mode, a device selects a member link with the lightest load to forward data packets.\n-"
        },
        {
            "Parameters": "fixed",
            "Info": "Sets the dynamic load balancing mode of an ECMP to fixed.\nIn this mode, the to-be-forwarded data packet is forwarded along the forwarding path of the previous data packet in the flow to which the to-be-forwarded data packet belongs at an interval of 2 seconds. If the data packet to be forwarded is the first data packet in the flow to which the data packet belongs, the device selects a member link to forward the data packet based on the hash result in static load balancing mode.\n-"
        },
        {
            "Parameters": "eligible",
            "Info": "Enables the eligible dynamic load balancing mode for an ECMP.\nIn eligible dynamic load balancing mode, based on the flowlet, a device selects a member link with the lightest load to forward data packets. Data packets in the same flowlet are forwarded through the same link.\n-"
        },
        {
            "Parameters": "flowlet-gap-time <gap-time>",
            "Info": "Specifies the interval at which data packets in a flowlet are transmitted.  The device splits data flows into flowlets based on the flowlet interval.\nThe value is an integer that ranges from 16 to 32000. The unit is 1024 nanoseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance ecmp",
            "[*HUAWEI-ecmp] ecmp mode fixed"
        ]
    ],
    "ExtraInfo": "You can change the dynamic load balancing mode for an ECMP based on the network traffic to provide maximum load balancing between member links. The eligible dynamic load balancing mode is recommended."
}