{
    "PageTitle": "hashmode",
    "FuncDef": "The hashmode command configures a hash mode for ECMP load balancing.\nThe undo hashmode command restores the default hash mode for ECMP load balancing. The hashmode command configures a hash mode for ECMP load balancing. The undo hashmode command restores the default hash mode for ECMP load balancing. By default, the hash mode of ECMP load balancing is 0.",
    "CLIs": [
        "undo hashmode",
        "hashmode <value1>",
        "hashmode <value2>",
        "hashmode { overlay | underlay } <value3>",
        "undo hashmode { overlay | underlay } [ <value3> ]",
        "hashmode underlay <value3>",
        "undo hashmode underlay <value3>"
    ],
    "ParentView": [
        "ECMP load balancing view"
    ],
    "ParaDef": [
        {
            "Parameters": "<value3>",
            "Info": "Specifies a hash algorithm for ECMP load balancing.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer ranging from 0 to 15. The default value is 0.\n0: default per-flow load balancing algorithm1: polynomial A2: polynomial B3: polynomial C4: polynomial D5: polynomial E6: polynomial F7: polynomial G8: polynomial H9: polynomial I10: polynomial J11: polynomial K12: polynomial L13: polynomial M14: polynomial N15: polynomial O"
        },
        {
            "Parameters": "<value1>",
            "Info": "Specifies a hash algorithm for ECMP load balancing.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.\nThe value is an integer ranging from 0 to 5. The default value is 0.\n0: default per-flow load balancing algorithm1: symmetric hash algorithm2: polynomial A3: polynomial B4: polynomial C5: polynomial D"
        },
        {
            "Parameters": "<value2>",
            "Info": "Specifies a hash algorithm for ECMP load balancing.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.\nThe value is an integer ranging from 0 to 2. The default value is 0.\n0: default per-flow load balancing algorithm1: symmetric hash algorithm2: per-packet load balancing algorithm"
        },
        {
            "Parameters": "overlay",
            "Info": "Indicates overlay load balancing.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "underlay",
            "Info": "Indicates underlay load balancing.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance ecmp",
            "[~HUAWEI-ecmp] hashmode 1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance ecmp",
            "[~HUAWEI-ecmp] hashmode overlay 1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance ecmp",
            "[~HUAWEI-ecmp] hashmode underlay 1"
        ]
    ],
    "ExtraInfo": "In ECMP load balancing scenarios, if traffic is unevenly load balanced, you can change the hashmode value to adjust the hash mode so that traffic is evenly load balanced.\nThe load balancing result varies according to the hash algorithm. You can select a proper hash mode for load balancing based on the traffic model.\nFor the CE8851-32CQ8DQ-P, CE8850-HAM, CE8850-SAN, CE8851K, CE6860-SAN, CE6866, CE6860-HAM, CE6866K, and CE6855-48XS8CQ, the polynomial calculation result is closely related to the change rule of packet characteristics, number of ECMP members, and number of packets. The following conclusions are for reference only:"
}