{
    "PageTitle": "ip-tunnel(ECMP load balancing view)",
    "FuncDef": "The ip-tunnel command configures the load balancing mode of tunnel packets.\nThe undo ip-tunnel command restores the default load balancing mode of tunnel packets. The ip-tunnel command configures the load balancing mode of tunnel packets. The undo ip-tunnel command restores the default load balancing mode of tunnel packets. For the CE8855, CE6885, CE6885-T, and CE6885-LL in common forwarding mode and the CE6885-SAN and CE6885-LL in low-latency mode:\n\n\nBy default, tunnel packets are load balanced based on outer src-ip, dst-ip, l4-src-port, and l4-dst-port.\n\n\nFor the CE6866, CE6860-SAN, CE6860-HAM, CE6866K, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE8851-32CQ8DQ-P, CE8850-SAN, CE8850-HAM, CE8851K, CE6820H, CE6820H-K, CE6820S, CE6863H, CE6863H-K, CE6881H, and CE6881H-K:\n\n\nBy default, tunnel packets are load balanced based on the inner inner-src-ip, inner-dst-ip, inner-l4-sport, and inner-l4-dport. For the CE8855, CE6885, CE6885-T, and CE6885-LL in common forwarding mode and the CE6885-SAN and CE6885-LL in low-latency mode: By default, tunnel packets are load balanced based on outer src-ip, dst-ip, l4-src-port, and l4-dst-port. For the CE6866, CE6860-SAN, CE6860-HAM, CE6866K, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE8851-32CQ8DQ-P, CE8850-SAN, CE8850-HAM, CE8851K, CE6820H, CE6820H-K, CE6820S, CE6863H, CE6863H-K, CE6881H, and CE6881H-K: By default, tunnel packets are load balanced based on the inner inner-src-ip, inner-dst-ip, inner-l4-sport, and inner-l4-dport. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ip-tunnel { inner-src-ip | inner-dst-ip | inner-l4-sport | inner-l4-dport | inner-protocol | src-interface | include-erspan }",
        "undo ip-tunnel { inner-src-ip | inner-dst-ip | inner-l4-sport | inner-l4-dport | inner-protocol | src-interface | include-erspan }",
        "ip-tunnel { inner-src-ip | inner-dst-ip | inner-l4-sport | inner-l4-dport | src-mac | dst-mac }",
        "undo ip-tunnel { inner-src-ip | inner-dst-ip | inner-l4-sport | inner-l4-dport | src-mac | dst-mac }"
    ],
    "ParentView": [
        "ECMP load balancing view"
    ],
    "ParaDef": [
        {
            "Parameters": "inner-src-ip",
            "Info": "Performs load balancing based on the inner source IP address.\n-"
        },
        {
            "Parameters": "inner-dst-ip",
            "Info": "Performs load balancing based on the inner destination IP address.\n-"
        },
        {
            "Parameters": "inner-l4-sport",
            "Info": "Performs load balancing based on the inner transport-layer source port.\n-"
        },
        {
            "Parameters": "inner-l4-dport",
            "Info": "Performs load balancing based on the inner transport-layer destination port.\n-"
        },
        {
            "Parameters": "inner-protocol",
            "Info": "Performs load balancing based on the inner transport-layer protocol.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "src-interface",
            "Info": "Performs load balancing based on the source interface.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "include-erspan",
            "Info": "Performs load balancing based on the source IP address, destination IP address, source port, and destination port of ERSPAN inner packets.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "src-mac",
            "Info": "Performs load balancing based on the source mac.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.\n-"
        },
        {
            "Parameters": "dst-mac",
            "Info": "Performs load balancing based on the destination mac.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance ecmp",
            "[~HUAWEI-ecmp] ip-tunnel inner-src-ip"
        ]
    ],
    "ExtraInfo": "When the device functions as an intermediate node of a tunnel and there is a load balancing link, you can run the ip-tunnel command to enable the device to perform load balancing based on the inner IP header fields of packets. This prevents uneven load balancing due to the use of the outer IP header for load balancing."
}