{
    "PageTitle": "cipher-suite exclude",
    "FuncDef": "The cipher-suite exclude key-exchange rsa command excludes RSA key exchange algorithms from the cipher-suite-list.\nThe undo cipher-suite exclude key-exchange rsa command includes RSA key exchange algorithms from the cipher-suite-list.\nThe cipher-suite exclude cipher mode cbc command excludes CBC encryption mode algorithms from the cipher-suite-list.\nThe undo cipher-suite exclude cipher mode cbc command includes CBC encryption mode algorithms from the cipher-suite-list.\nThe cipher-suite exclude hmac sha1 command excludes HMAC-SHA1 algorithms from the cipher-suite-list.\nThe undo cipher-suite exclude hmac sha1 command includes HMAC-SHA1 algorithms from the cipher-suite-list. The cipher-suite exclude key-exchange rsa command excludes RSA key exchange algorithms from the cipher-suite-list. The undo cipher-suite exclude key-exchange rsa command includes RSA key exchange algorithms from the cipher-suite-list. The cipher-suite exclude cipher mode cbc command excludes CBC encryption mode algorithms from the cipher-suite-list. The undo cipher-suite exclude cipher mode cbc command includes CBC encryption mode algorithms from the cipher-suite-list. The cipher-suite exclude hmac sha1 command excludes HMAC-SHA1 algorithms from the cipher-suite-list. The undo cipher-suite exclude hmac sha1 command includes HMAC-SHA1 algorithms from the cipher-suite-list. By default, RSA key exchange algorithm, CBC mode algorithm and HMAC-SHA1 algorithm are not supported in an SSL cipher suite bound to an SSL policy.",
    "CLIs": [
        "cipher-suite exclude key-exchange rsa",
        "cipher-suite exclude cipher mode cbc",
        "cipher-suite exclude hmac sha1",
        "undo cipher-suite exclude key-exchange [ rsa ]",
        "undo cipher-suite exclude cipher mode [ cbc ]",
        "undo cipher-suite exclude hmac [ sha1 ]"
    ],
    "ParentView": [
        "SSL policy view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy abc",
            "[*HUAWEI-ssl-policy-abc] cipher-suite exclude key-exchange rsa"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy abc",
            "[*HUAWEI-ssl-policy-abc] cipher-suite exclude cipher mode cbc"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy abc",
            "[*HUAWEI-ssl-policy-abc] cipher-suite exclude hmac sha1"
        ]
    ],
    "ExtraInfo": "During client and server authentication, an algorithm list is provided for the client and server to perform SSL algorithm negotiation. To exclude RSA/CBC/SHA1 key exchange algorithms, run the cipher-suite exclude key-exchange rsa, cipher-suite exclude cipher mode cbc or cipher-suite exclude hmac sha1 command."
}