{
    "PageTitle": "ssl verify enable",
    "FuncDef": "The ssl verify enable command enables digital certificate verification.\nThe undo ssl verify enable command disables digital certificate verification. The ssl verify enable command enables digital certificate verification. The undo ssl verify enable command disables digital certificate verification. By default, digital certificate verification is disabled.",
    "CLIs": [
        "ssl verify basic-constrain enable",
        "ssl verify version cert-version3 enable",
        "ssl verify version crl-version2 enable",
        "ssl verify key-usage enable",
        "undo ssl verify basic-constrain enable",
        "undo ssl verify version cert-version3 enable",
        "undo ssl verify version crl-version2 enable",
        "undo ssl verify key-usage enable"
    ],
    "ParentView": [
        "SSL policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "version",
            "Info": "Indicates the basic constraint fields of a digital certificate.\n-"
        },
        {
            "Parameters": "cert-version3",
            "Info": "Indicates the X.509v3 digital certificate.\n-"
        },
        {
            "Parameters": "crl-version2",
            "Info": "Indicates the X.509v2 certificate revocation list (CRL).\n-"
        },
        {
            "Parameters": "key-usage",
            "Info": "Indicates the extended key usage field of a digital certificate.\n-"
        },
        {
            "Parameters": "basic-constrain",
            "Info": "Indicates the basic constraint fields of a digital certificate.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy abc",
            "[*HUAWEI-ssl-policy-abc] ssl verify basic-constrain enable"
        ]
    ],
    "ExtraInfo": "The digital certificate is verified to check the validity of the digital certificate path. This prevents invalid digital certificates from being used and improves security.The ssl verify version cert-version3 enable command is used to check whether a locally loaded digital certificate is of the X.509v3 version.The ssl verify version crl-version2 enable command is used to check whether the locally loaded CRL is of the X.509v2 version.The ssl verify key-usage enable command is used to verify only the enhanced key usage field of the peer digital certificate. If this field exists, the verification is performed. If this field does not exist, the verification is not performed. When the local end functions as a client, it checks whether the digital certificate sent by the server contains SSL server (id-kp 1, OID 1.3.6.1.5.5.7.3.1). When the local end functions as a server, it checks whether the digital certificate sent by the client contains SSL client (id-kp 2, OID 1.3.6.1.5.5.7.3.2).The ssl verify basic-constrain enable command is used only to verify the basic constraint fields of the CA certificate sent by the peer end to determine whether the body type is CA. If the basic constraint field does not exist or the basic constraint field exists but the entity type is not CA, the validation fails."
}