{
    "PageTitle": "display igmp snooping port-info",
    "FuncDef": "The display igmp snooping port-info command displays information about member ports on the router, including static member ports, SSM mapping-enabled ports, and dynamic member ports. The display igmp snooping port-info command displays information about member ports on the router, including static member ports, SSM mapping-enabled ports, and dynamic member ports.",
    "CLIs": [
        "display igmp snooping port-info [ vlan <vlan-id> [ group-address <group-address> ] ] [ verbose ]",
        "display igmp snooping port-info bridge-domain <bd-id> [ group-address <group-address> ] [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan <vlan-id>",
            "Info": "Displays information about multicast interfaces in a specified VLAN.\nThe value is an integer that ranges from 1 to 4094."
        },
        {
            "Parameters": "group-address <group-address>",
            "Info": "Displays information about interfaces related to a specified multicast group.\nThe group-address value ranges from 224.0.1.0 to 239.255.255.255."
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about member ports.\n-"
        },
        {
            "Parameters": "bridge-domain <bd-id>",
            "Info": "Displays information about member ports in a specified BD.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe bd-id value is an integer ranging from 1 to 16777215."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display igmp snooping port-info vlan 10"
        ]
    ],
    "ExtraInfo": "The command output is displayed only after IGMP snooping is enabled globally and in a VLAN.\nInformation about member interfaces is displayed only when the member interfaces are in Up state."
}