{
    "PageTitle": "display igmp snooping",
    "FuncDef": "The display igmp snooping command displays all parameters of IGMP snooping running in a VLAN. These parameters include default and non-default parameters. The display igmp snooping command displays all parameters of IGMP snooping running in a VLAN. These parameters include default and non-default parameters.",
    "CLIs": [
        "display igmp snooping vlan <vlanid> [ configuration ]",
        "display igmp snooping vlan [ configuration ]",
        "display igmp snooping [ configuration ]",
        "display igmp snooping bridge-domain <bdid> [ configuration ]",
        "display igmp snooping bridge-domain [ configuration ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "configuration",
            "Info": "Display non-default IGMP snooping configurations in a specified VLAN.\n-"
        },
        {
            "Parameters": "vlan <vlanid>",
            "Info": "Displays IGMP snooping configurations in a specified VLAN.\nThe value is an integer that ranges from 1 to 4094."
        },
        {
            "Parameters": "bridge-domain <bdid>",
            "Info": "Displays IGMP snooping configurations in a specified BD.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer ranging from 1 to 1677215."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display igmp snooping vlan 10"
        ],
        [
            "<HUAWEI> display igmp snooping vlan 10 configuration"
        ]
    ],
    "ExtraInfo": "To locate a fault that occurs during multicast service transmission, run the display igmp-snooping command.\nThis command is used to display IGMP snooping configurations of a VLAN in the Up state.\nWhen running the display igmp snooping command, note the following points:"
}