{
    "PageTitle": "display igmp snooping invalid-packet",
    "FuncDef": "The display igmp snooping invalid-packet command displays statistics about received invalid IGMP snooping messages. The display igmp snooping invalid-packet command displays statistics about received invalid IGMP snooping messages.",
    "CLIs": [
        "display igmp snooping invalid-packet vlan [ <vlanid> ] [ message-type { report | leave | query | hello } ]",
        "display igmp snooping invalid-packet bridge-domain [ <bdid> ] [ message-type { report | leave | query | hello } ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "message-type",
            "Info": "Displays statistics about the specified type of invalid packet.\n-"
        },
        {
            "Parameters": "report",
            "Info": "Displays statistics about invalid Leave packets.\n-"
        },
        {
            "Parameters": "leave",
            "Info": "Displays statistics about invalid Query packets.\n-"
        },
        {
            "Parameters": "query",
            "Info": "Displays statistics about invalid Report packets.\n-"
        },
        {
            "Parameters": "hello",
            "Info": "Displays statistics about invalid Hello packets.\n-"
        },
        {
            "Parameters": "bridge-domain <bdid>",
            "Info": "Displays the ID of a bridge domain.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer ranging from 1 to 16777215."
        },
        {
            "Parameters": "vlan <vlanid>",
            "Info": "Displays statistics about invalid IGMP Snooping packets received from the specified VLAN:\nIf vlan-id is not specified, statistics about invalid IGMP Snooping packets received from all VLANs are displayed.If vlan-id is specified, statistics about invalid IGMP Snooping packets received from the specified VLAN are displayed.\nThe value is an integer that ranges from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display igmp snooping invalid-packet vlan"
        ]
    ],
    "ExtraInfo": ""
}