{
    "PageTitle": "igmp snooping ip-source-policy (Bridge domain view)",
    "FuncDef": "The igmp snooping ip-source-policy command configures a policy for filtering Report messages by source IP address.\nThe undo igmp snooping ip-source-policy command restores the default setting. The igmp snooping ip-source-policy command configures a policy for filtering Report messages by source IP address. The undo igmp snooping ip-source-policy command restores the default setting. By default, no policy is configured. This means that any user can enjoy multicast services. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "igmp snooping ip-source-policy { <acl-number> | acl-name <acl-name> }",
        "undo igmp snooping ip-source-policy"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "<acl-number>",
            "Info": "Specifies the number of an ACL.\nThe value is an integer ranging from 2000 to 3999."
        },
        {
            "Parameters": "acl-name <acl-name>",
            "Info": "Specifies the name of an ACL.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl 3000",
            "[*HUAWEI-acl-adv-3000] rule deny ip destination 225.0.0.1 0 source 10.0.0.1 0",
            "[*HUAWEI-acl-adv-3000] rule permit ip",
            "[*HUAWEI-acl-adv-3000] quit",
            "[*HUAWEI] igmp snooping enable",
            "[*HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] igmp snooping ip-source-policy 3000"
        ]
    ],
    "ExtraInfo": "To improve multicast service deployment security, configure a policy to filter out IGMP Report or Leave messages sent by specific hosts.\nIf a basic ACL is specified in the igmp snooping ip-source-policy command, IGMP Report or Leave messages with specified source IP addresses are accepted or rejected. If an advanced ACL is specified in this command, IGMP Report or Leave messages with specified source IP addresses are accepted or rejected."
}