{
    "PageTitle": "igmp snooping explicit-tracking",
    "FuncDef": "The igmp snooping explicit-tracking command enables host tracking on interfaces in a specified VLAN or VLAN range.\nThe undo igmp snooping explicit-tracking command restores the default configuration. The igmp snooping explicit-tracking command enables host tracking on interfaces in a specified VLAN or VLAN range. The undo igmp snooping explicit-tracking command restores the default configuration. By default, host tracking is disabled on interfaces in VLANs.",
    "CLIs": [
        "igmp snooping explicit-tracking [ all-version ]",
        "undo igmp snooping explicit-tracking [ all-version ]"
    ],
    "ParentView": [
        "VLAN range view,VLAN view"
    ],
    "ParaDef": [
        {
            "Parameters": "all-version",
            "Info": "Enables the host tracking function for IGMP of all versions.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] igmp snooping enable",
            "[*HUAWEI] vlan 10",
            "[*HUAWEI-vlan10] igmp snooping enable",
            "[*HUAWEI-vlan10] igmp snooping version 3",
            "[*HUAWEI-vlan10] igmp snooping explicit-tracking"
        ]
    ],
    "ExtraInfo": "In Layer 2 multicast scenarios, after a device receives a VLAN host's Leave message for a group, the device sends a Group-specific Query message and considers that the host has left the group and deletes the corresponding forwarding entry only if the device does not receive a response from the user within a specified wait period.\nTo speed up the device's response to VLAN users' leave requests, run the igmp snooping explicit-tracking command to enable host tracking. After this function takes effect, the device records group join status of each multicast host and does not send a group-specific Query message any more after receiving a Leave message. The device considers that a host has left a group immediately after receiving a Leave message from the host. This function shortens the leave process and reduces network bandwidth consumption."
}