{
    "PageTitle": "igmp snooping static-group group-address to vlan",
    "FuncDef": "The igmp snooping static-group group-address to vlan command configures a static member port of a multicast group.\nThe undo igmp snooping static-group group-address to vlan command deletes a static member port of a multicast group. The igmp snooping static-group group-address to vlan command configures a static member port of a multicast group. The undo igmp snooping static-group group-address to vlan command deletes a static member port of a multicast group. By default, no static member interfaces are configured for a multicast group.",
    "CLIs": [
        "igmp snooping static-group [ source-address <SrcIpAddr> ] group-address <GrpIpAddr1> to <GrpIpAddr2> vlan <VlanId>",
        "undo igmp snooping static-group [ source-address <SrcIpAddr> ] group-address <GrpIpAddr1> to <GrpIpAddr2> vlan <VlanId>"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,Layer 2 10GE interface view,Layer 2 200GE interface view,25GE-L2 view,400GE-L2 view,Layer 2 50GE interface view,Layer 2 Eth-Trunk interface view,Layer 2 GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "source-address <SrcIpAddr>",
            "Info": "Specifies the address of the multicast source.\nThe value is a string of case-sensitive characters ranging from 1.0.0.0 to 223.255.255.255.255, spaces not supported."
        },
        {
            "Parameters": "<GrpIpAddr1>",
            "Info": "Specifies the address of a multicast group.\nThe value is a string of case-sensitive characters ranging from 224.0.1.0 to 239.255.255.255, spaces not supported."
        },
        {
            "Parameters": "<GrpIpAddr2>",
            "Info": "Specifies a multicast group address and the value is larger than GrpIpAddr1.\nThe value is a string of case-sensitive characters ranging from 224.0.1.0 to 239.255.255.255, spaces not supported."
        },
        {
            "Parameters": "<VlanId>",
            "Info": "Specifies a VLAN ID.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer in the range 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] igmp snooping enable",
            "[*HUAWEI] vlan 2",
            "[*HUAWEI-vlan2] quit",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] portswitch",
            "[*HUAWEI-100GE1/0/1] igmp snooping static-group group-address 224.1.1.1 to 224.1.1.9 vlan 2"
        ]
    ],
    "ExtraInfo": "If hosts connected to an interface need to regularly receive data for a multicast group or a source-specific multicast group, the igmp snooping static-group group-address to vlan command can be used to configure the interface as a static member interface.\nStatic member interfaces can be configured on different positions on a network to enable users to receive data for specific multicast groups or source-specific multicast groups regularly. The commands listed in the following table can be run in any order. Run one or more commands as required to configure static member interfaces. For details, see Table Description of the igmp snooping static-group group-address to vlan command in different scenarios."
}