{
    "PageTitle": "igmp snooping query ip-source-policy (Bridge domain view)",
    "FuncDef": "The igmp snooping query ip-source-policy command configures a policy to filter IGMP Query messages based on source IP addresses in a BD.\nThe undo igmp snooping query ip-source-policy deletes the IGMP Query message filtering policy from a BD. The igmp snooping query ip-source-policy command configures a policy to filter IGMP Query messages based on source IP addresses in a BD. The undo igmp snooping query ip-source-policy deletes the IGMP Query message filtering policy from a BD. By default, no IGMP Query message filtering policy is configured in a BD. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "igmp snooping query ip-source-policy { <acl-number> | acl-name <acl-name> }",
        "undo igmp snooping query ip-source-policy"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "<acl-number>",
            "Info": "Specifies the number of a basic ACL or an advanced ACL.\nThe value is an integer that ranges from 2000 to 3999."
        },
        {
            "Parameters": "acl-name <acl-name>",
            "Info": "Specifies the name of a basic ACL or an advanced ACL.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl 2000",
            "[*HUAWEI-acl4-basic-2000] rule permit source 10.0.0.1 0",
            "[*HUAWEI-acl4-basic-2000] rule deny source any",
            "[*HUAWEI-acl4-basic-2000] quit",
            "[*HUAWEI] igmp snooping enable",
            "[*HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] igmp snooping enable",
            "[*HUAWEI-bd10] igmp snooping query ip-source-policy 2000"
        ]
    ],
    "ExtraInfo": "If an attacker sends Query messages with a smaller IP address than the real IGMP querier on the network, switches running IGMP snooping consider the attacker as a querier and forward IGMP Membership Report messages to the attacker. In this case, multicast traffic cannot be forwarded correctly. You can configure an IGMP Query message filtering policy to defend against such attacks. An IGMP Query message filtering policy permits only IGMP Query messages with specified source IP addresses and rejects other IGMP Query messages. This improves security of a Layer 2 multicast network."
}