{
    "PageTitle": "igmp snooping query lastmember-queryinterval",
    "FuncDef": "The igmp snooping query lastmember-queryinterval command sets the interval at which a querier sends Group-Specific Query messages or Source- and Group-Specific Query messages.\nThe undo igmp snooping query lastmember-queryinterval command restores the interval at which a querier sends Group-Specific Query messages or Source- and Group-Specific Query messages to 1 second. The igmp snooping query lastmember-queryinterval command sets the interval at which a querier sends Group-Specific Query messages or Source- and Group-Specific Query messages. The undo igmp snooping query lastmember-queryinterval command restores the interval at which a querier sends Group-Specific Query messages or Source- and Group-Specific Query messages to 1 second. By default, a querier sends group-specific query messages or source/group-specific query messages at an interval of 1s. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "igmp snooping query lastmember-queryinterval <LastMemQIValue>",
        "undo igmp snooping query lastmember-queryinterval"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "<LastMemQIValue>",
            "Info": "Specifies the interval at which a querier sends group-specific query messages or source/group-specific query messages.\nThe value ranges from 1 to 5, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] igmp snooping enable",
            "[*HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] igmp snooping query lastmember-queryinterval 4"
        ]
    ],
    "ExtraInfo": "The igmp snooping query last-member-interval command has the following functions:"
}