{
    "PageTitle": "dldp authentication-mode",
    "FuncDef": "The dldp authentication-mode command configures a DLDP authentication mode for DLDPDUs exchanged between the local port and the peer port.\nThe undo dldp authentication-mode command restores the default mode. The dldp authentication-mode command configures a DLDP authentication mode for DLDPDUs exchanged between the local port and the peer port. The undo dldp authentication-mode command restores the default mode. By default, DLDP are not authenticated.",
    "CLIs": [
        "dldp authentication-mode simple <simplePassword>",
        "dldp authentication-mode md5 <md5Password>",
        "dldp authentication-mode sha <shaPassword>",
        "dldp authentication-mode hmac-sha256 <hmacPassword>",
        "undo dldp authentication-mode"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "md5 <md5Password>",
            "Info": "Uses MD5 mode to authenticate DLDPDUs exchanged between the local and peer ports.\nFor the sake of security, using the HMAC-SHA256 algorithm rather than the MD5 algorithm is recommended.\nThe value is a string of 1 to 16 non-cipher text characters or a string of 24, 32, 48, 108, or 128 ciphertext characters (excluding question marks). The value is case sensitive.\nCiphertext passwords with various lengths configured in an earlier version are also supported in the target version."
        },
        {
            "Parameters": "sha <shaPassword>",
            "Info": "Uses SHA256 to authenticate DLDP packets exchanged between the local and peer interfaces.\nTo ensure high security, using the HMAC SHA256 algorithm instead of the SHA256 algorithm is recommended.\nThe value is a string of 1 to 16 non-cipher text characters or a string of 24, 32, 48, 108, or 128 ciphertext characters (excluding question marks). The value is case sensitive.\nCiphertext passwords with various lengths configured in an earlier version are also supported in the target version."
        },
        {
            "Parameters": "hmac-sha256 <hmacPassword>",
            "Info": "Uses HMAC-SHA256 mode to authenticate DLDPDUs exchanged between the local and peer ports.\nThe value is a string of 1 to 16 non-cipher text characters or a string of 24, 32, 48, 108, or 128 ciphertext characters (excluding question marks). The value is case sensitive."
        },
        {
            "Parameters": "simple <simplePassword>",
            "Info": "Uses simple mode to authenticate DLDPDUs exchanged between the local and peer ports.\nThe new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters.For security purposes, you are advised to configure a password in ciphertext mode. To further improve device security, periodically change the password.\nThe value is a string of 1 to 16 non-cipher text characters or a string of 24, 32, 48, 108, or 128 ciphertext characters (excluding question marks). The value is case sensitive.\nCiphertext passwords with various lengths configured in an earlier version are also supported in the target version."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dldp authentication-mode hmac-sha256 YsHsjx_202206"
        ]
    ],
    "ExtraInfo": "To prevent network attacks and malicious detection, you can run this command to configure DLDP packet authentication on an interface as follows:"
}