{
    "PageTitle": "display multicast ipv6 rpf-info",
    "FuncDef": "The display multicast ipv6 rpf-info command displays Reverse Path Forwarding (RPF) routing information of an IPv6 source or an IPv6 source group, including currently used topology name and information about all routes. The display multicast ipv6 rpf-info command displays Reverse Path Forwarding (RPF) routing information of an IPv6 source or an IPv6 source group, including currently used topology name and information about all routes. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display multicast ipv6 rpf-info <ipv6-source-address> [ <ipv6-group-address> ] [ rpt | spt ] [ verbose ]",
        "display multicast ipv6 { vpn-instance <instance-name> | all-instance } rpf-info <ipv6-source-address> [ <ipv6-group-address> ] [ rpt | spt ] [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-source-address>",
            "Info": "Specifies the IPv6 address of a multicast source. If this parameter is specified, RPF routing information of this multicast source is displayed.\nThe address is in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<ipv6-group-address>",
            "Info": "Specifies the IPv6 address of a multicast group. If this parameter is specified, RPF routing information of this source group is displayed.\nThe address ranges from FF00::0 to FFFF:FFFF:FFFF:FFFF:FFFF:FFFF:FFFF:FFFF."
        },
        {
            "Parameters": "rpt",
            "Info": "Display the information of shortest path tree (SPT).\n-"
        },
        {
            "Parameters": "spt",
            "Info": "Display the information of rendezvous point tree (RPT).\n-"
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed RPF information.\n-"
        },
        {
            "Parameters": "vpn-instance <instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "all-instance",
            "Info": "Specifies all VPN instance.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display multicast ipv6 all-instance rpf-info 2001:DB8:1:: verbose"
        ],
        [
            "<HUAWEI> display multicast ipv6 rpf-info 2001:db8:1:: verbose"
        ],
        [
            "<HUAWEI> display multicast ipv6 rpf-info 2001:db8:1::1"
        ]
    ],
    "ExtraInfo": ""
}