{
    "PageTitle": "display multicast ipv6 fib port-info",
    "FuncDef": "The display multicast ipv6 fib port-info command displays entries of a specified multicast group and outbound interfaces on which both Layer 2 and Layer 3 services are configured. The display multicast ipv6 fib port-info command displays entries of a specified multicast group and outbound interfaces on which both Layer 2 and Layer 3 services are configured. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display multicast ipv6 fib [ vpn-instance <vpn-instance-name> ] group <group-address-v6> source <source-address-v6> port-info"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance to be queried.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "group <group-address-v6>",
            "Info": "Displays forwarding information corresponding to the specified multicast group address.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "source <source-address-v6>",
            "Info": "Displays forwarding information corresponding to the specified multicast source address.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diagnose",
            "[HUAWEI-diagnose] display multicast ipv6 fib group ff1e::1 source 2001:db8::100 port-info"
        ]
    ],
    "ExtraInfo": ""
}