{
    "PageTitle": "multicast ipv6 global limit pim sm",
    "FuncDef": "The multicast ipv6 global limit pim sm command sets a limit on the number of global IPv6 PIM entries.\nThe undo multicast ipv6 global limit pim sm command restores the default configuration. The multicast ipv6 global limit pim sm command sets a limit on the number of global IPv6 PIM entries. The undo multicast ipv6 global limit pim sm command restores the default configuration. By default, no limit is set on the number of global IPv6 PIM entries. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "multicast ipv6 global limit pim sm { star-group-number | source-group-number } <limit-count6> [ threshold-alarmupper-limit <upper-limit-value> lower-limit <lower-limit-value> ]",
        "undo multicast ipv6 global limit pim sm { star-group-number | source-group-number }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "star-group-number",
            "Info": "Configures the specified limit to take effect for (*, G) multicast entries.\n-"
        },
        {
            "Parameters": "source-group-number",
            "Info": "Configures the specified limit to take effect for (S, G) multicast entries.\n-"
        },
        {
            "Parameters": "<limit-count6>",
            "Info": "Specifies a limit on the number of PIM entries.\nThe value is an integer ranging from 1 to 16384."
        },
        {
            "Parameters": "threshold-alarm",
            "Info": "threshold-alarm.\n-"
        },
        {
            "Parameters": "upper-limit <upper-limit-value>",
            "Info": "Sets an alarm trigger threshold, in percentage. An alarm is generated when the percentage ratio of created PIM entries to limit-count reaches upper-limit-value. Setting upper-limit-value to a value greater than 95% is not recommended.\nThe value is an integer ranging from 1 to 100. The default value is 80."
        },
        {
            "Parameters": "lower-limit <lower-limit-value>",
            "Info": "Sets an alarm clear threshold, in percentage. An alarm is cleared when the percentage ratio of created PIM entries to limit-count falls below lower-limit-value.\nlower-limit-value must be less than upper-limit-value.To prevent alarms from being frequently generated and cleared due to route flapping, setting lower-limit-value to a value at least 10 less than upper-limit-value is recommended.\nThe value is an integer ranging from 1 to 100. The default value is 70."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 global limit pim sm star-group-number 2000 threshold-alarm upper-limit 80 lower-limit 70"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 global limit pim sm source-group-number 1000"
        ]
    ],
    "ExtraInfo": "To set a limit on the number of PIM entries on the device, run the multicast ipv6 global limit pim sm command."
}