{
    "PageTitle": "multicast ipv6 load-splitting(VPN instance view)",
    "FuncDef": "The multicast ipv6 load-splitting command configures an IPv6 multicast load splitting policy.\nThe undo multicast ipv6 load-splitting command restores the default configuration. The multicast ipv6 load-splitting command configures an IPv6 multicast load splitting policy. The undo multicast ipv6 load-splitting command restores the default configuration. By default, no IPv6 multicast load splitting policy is configured. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "multicast ipv6 load-splitting { group | source | source-group | stable-preferred | balance-ucmp }",
        "undo multicast ipv6 load-splitting"
    ],
    "ParentView": [
        "VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "group",
            "Info": "Indicates group address-based load splitting. This policy applies to the scenario where one multicast source has multiple multicast groups.\n-"
        },
        {
            "Parameters": "source",
            "Info": "Indicates source address-based load splitting. This policy applies to the scenario where one multicast group has multiple multicast sources.\n-"
        },
        {
            "Parameters": "source-group",
            "Info": "Indicates source and group addresses-based load splitting. This policy is applicable to the scenario where multiple multicast sources and multicast groups exist.\n-"
        },
        {
            "Parameters": "stable-preferred",
            "Info": "Indicates stable-preferred load splitting, which is applicable to a stable multicast networking.\n-"
        },
        {
            "Parameters": "balance-ucmp",
            "Info": "Indicates link bandwidth-based load splitting. This policy is applicable to the scenario in which links have different bandwidth.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance abcde",
            "[*HUAWEI-vpn-instance-abcde] ipv6-family",
            "[*HUAWEI-vpn-instance-abcde-af-ipv6] route-distinguisher 200:200",
            "[*HUAWEI-vpn-instance-abcde-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-abcde] multicast ipv6 routing-enable",
            "[*HUAWEI-vpn-instance-abcde] multicast ipv6 load-splitting stable-preferred"
        ]
    ],
    "ExtraInfo": ""
}