{
    "PageTitle": "buffer optimization mode",
    "FuncDef": "The buffer optimization mode command configures the plane buffer optimization mode and enables the plane buffer optimization function.\nThe undo buffer optimization mode command disables the plane buffer optimization function. The buffer optimization mode command configures the plane buffer optimization mode and enables the plane buffer optimization function. The undo buffer optimization mode command disables the plane buffer optimization function. By default, the plane buffer optimization function is disabled. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "buffer optimization mode long-distance",
        "undo buffer optimization mode long-distance",
        "buffer optimization mode enhanced-long-distance",
        "undo buffer optimization mode enhanced-long-distance"
    ],
    "ParentView": [
        "AI Service view"
    ],
    "ParaDef": [
        {
            "Parameters": "long-distance",
            "Info": "Specifies the plane buffer optimization mode to long-distance mode.\n-"
        },
        {
            "Parameters": "enhanced-long-distance",
            "Info": "Specifies the plane buffer optimization mode to enhanced long-distance mode.\n\n NOTE: This parameter is supported only on the CE6860-SAN and CE8850-SAN.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ai-service",
            "[~HUAWEI-ai-service] buffer optimization mode long-distance"
        ]
    ],
    "ExtraInfo": "Plane buffer optimization can intelligently allocate buffer spaces for different planes based on the service mode of the live network, reducing the buffer space of the plane where interfaces with low usage reside and ensuring that the interfaces where lossless queues reside can obtain sufficient buffer space. This function can be configured when lossless services on the live network have a long communication distance, for example, storage services deployed across multiple data centers."
}