{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "vtp",
    "FuncDef": [
        "To configure the global VLAN Trunking Protocol (VTP) state, use the **vtp** command in global configuration mode. To return to the default value, use the **no** form of this command. "
    ],
    "CLIs": [
        "vtp { { domain <domain-name> } | file <filename> | interface <interface-name> [ only ] | mode { client | off | server | transparent } | password <password-value | > pruning | version { 1 | 2 } }",
        "no vtp"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **only** ",
            "Info": " (Optional) Specifies to use only this interface's IP address as the VTP-IP updater address. "
        },
        {
            "Parameters": " **mode client** ",
            "Info": " Sets the type of VTP-device mode to client mode. "
        },
        {
            "Parameters": " **mode off** ",
            "Info": " Sets the type of VTP-device mode to off mode. "
        },
        {
            "Parameters": " **mode server** ",
            "Info": " Sets the type of VTP-device mode to server mode. "
        },
        {
            "Parameters": " **mode transparent** ",
            "Info": " Sets the type of VTP-device mode to transparent mode. "
        },
        {
            "Parameters": " **pruning** ",
            "Info": " Enables the administrative domain to permit pruning. "
        },
        {
            "Parameters": " **version** {**1** ",
            "Info": " **2**} "
        }
    ],
    "Examples": [
        [
            "```",
            "Router(config)# vtp domain DomainName1",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "Router(config)# vtp file vtpconfig",
            "```",
            "```",
            "```",
            "```",
            "Setting device to store VLAN database at filename vtpconfig.",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "Router(config)# vtp mode client",
            "```",
            "```",
            "```",
            "```",
            "Setting device to VTP CLIENT mode.",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "Router(config)# vtp mode off",
            "```",
            "```",
            "```",
            "```",
            "Setting device to VTP OFF mode.",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "Router(config)# no vtp mode off",
            "```",
            "```",
            "```",
            "```",
            "Setting device to VTP OFF mode.",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)The **vtp pruning**, **vtp password**, and **vtp version** commands are also available in privileged EXEC mode. We recommend that you use these commands in global configuration mode only; do not use these commands in privileged EXEC mode.---Extended-range VLANs are not supported by VTP.When you define the domain-name value, the domain name is case sensitive and can be from 1 to 32 characters.The *filename* and *interface-name* values are ASCII strings from 1 to 255 characters.You must configure a password on each network device in the management domain when the switch is in secure mode.![](/c/dam/en/us/td/i/templates/caut.gif)---**Caution** ![](/c/dam/en/us/td/i/templates/blank.gif)If you configure VTP in secure mode, the management domain does not function properly if you do not assign a management domain password to each network device in the domain.---A VTP version 2-capable network device can operate in the same VTP domain as a network device running VTP version 1 if VTP version 2 is disabled on the VTP version 2-capable network device (VTP version 2 is disabled by default).Do not enable VTP version 2 on a network device unless all of the network devices in the same VTP domain are version 2-capable. When you enable VTP version 2 on a network device, all of the version 2-capable network devices in the domain enable VTP version 2.In a Token Ring environment, you must enable VTP version 2 for VLAN switching to function properly.Enabling or disabling VTP pruning on a VTP server enables or disables VTP pruning for the entire management domain.Configuring VLANs as pruning eligible or pruning ineligible on a Cisco 7600 series router affects pruning eligibility for those VLANs on that switch only; it does not affect pruning eligibility on all network devices in the VTP domain.The **vtp password**, **vtp pruning**, and **vtp version** commands are not placed in startup memory but are included in the VTP transparent-mode startup configuration file.Extended-range VLANs are not supported by VTP.You can configure the **pruning** keyword in VTP-server mode; the **version** keyword is configurable in VTP-server mode or VTP transparent mode.The password*-*value argument is an ASCII string from 8 to 64 characters identifying the administrative domain for the device.VTP pruning causes information about each pruning-eligible VLAN to be removed from VTP updates if there are no stations belonging to that VLAN.All Cisco 7600 series routers in a VTP domain must run the same version of VTP. VTP version 1 and VTP version 2 do not operate on Cisco 7600 series routers in the same VTP domain.If all Cisco 7600 series routers in a domain are VTP version 2-capable, you need only to enable VTP version 2 on one Cisco 7600 series router; the version number is then propagated to the other version 2-capable Cisco 7600 series routers in the VTP domain.If you toggle the version 2 mode, certain default VLAN parameters are modified.If you enter the **vtp mode off** command, it sets the device to off. If you enter the **no vtp mode off** command, it resets the device to the VTP server mode.",
    "RelatedCmds": [
        {
            "cmd": " **show vtp** ",
            "description": " Displays the VTP statistics and domain information. "
        },
        {
            "cmd": " **vtp (interface configuration)** ",
            "description": " Enables VTP on a per-port basis. "
        }
    ]
}