{
    "PageTitle": "bfd bind vxlan peer-ip",
    "FuncDef": "The bfd bind vxlan peer-ip command creates BFD for VXLAN session binding information and displays the BFD session view. The bfd bind vxlan peer-ip command creates BFD for VXLAN session binding information and displays the BFD session view. By default, no BFD for VXLAN sessions are created. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "bfd <session-name> bindvxlanpeer-ip <peer-ip-address> source-ip <source-ip-address> peer-mac <peer-mac-address> auto"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<session-name>",
            "Info": "Specifies·the·name·of·a·BFD·session.\nThe·value·is·a·string·of·1·to·64·case-sensitive·characters·without·spaces.·When·double·quotation·marks·are·used·around·the·string,·spaces·are·allowed·in·the·string."
        },
        {
            "Parameters": "peer-ip <peer-ip-address>",
            "Info": "Specifies the destination VTEP IP address of a VXLAN tunnel to be monitored by a BFD session.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "source-ip <source-ip-address>",
            "Info": "Specifies the source VTEP IP address of a VXLAN tunnel to be monitored by a BFD session.\nThe value is a unicast address in dotted decimal notation."
        },
        {
            "Parameters": "peer-mac <peer-mac-address>",
            "Info": "Specifies the destination VTEP MAC address of a VXLAN tunnel to be monitored by a BFD session.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0.A MAC address cannot be all 0s, all 1s, or a multicast MAC address."
        },
        {
            "Parameters": "auto",
            "Info": "Enables the auto-negotiation function for static discriminators.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd atob bind vxlan peer-ip 4.4.4.4 source-ip 2.2.2.2 peer-mac 00e0-fc12-3456 auto"
        ]
    ],
    "ExtraInfo": "To use BFD to monitor VXLAN tunnel connectivity for VXLAN tunnel protection switching, create a BFD for VXLAN session on a VXLAN gateway.\npeer-ip-address and source-ip-address respectively represent the destination and source VTEP IP addresses of a VXLAN tunnel to be monitored by a BFD session and are written into the inner IP headers of BFD packets.\nA destination VTEP bridge MAC address or multicast MAC address must be specified for peer-mac-address. The value of this parameter is written into the inner destination MAC address field of BFD packets, so that the peer VTEP can receive and process the BFD packets."
}