{
    "PageTitle": "bfd authentication-mode",
    "FuncDef": "The bfd authentication-mode command enables negotiation authentication for a BFD session with a specified peer IP address and configures authentication information.\nThe undo bfd command disables negotiation authentication for a BFD session with a specified peer IP address. The bfd authentication-mode command enables negotiation authentication for a BFD session with a specified peer IP address and configures authentication information. The undo bfd command disables negotiation authentication for a BFD session with a specified peer IP address. By default, negotiation authentication is disabled for a BFD session. You are advised to configure BFD negotiation authentication to reduce security risks.",
    "CLIs": [
        "bfd single-hop peer-ip <ip-address> [ vpn-instance <vpn-name> ] authentication-modemet-sha1key-id <key-id-value> cipher <cipher-text> nego-packet",
        "bfd multi-hop peer-ip <ip-address> [ vpn-instance <vpn-name> ] authentication-modemet-sha1key-id <key-id-value> cipher <cipher-text> nego-packet",
        "undo bfd single-hop peer-ip <ip-address> [ vpn-instance <vpn-name> ]",
        "undo bfd multi-hop peer-ip <ip-address> [ vpn-instance <vpn-name> ]",
        "bfd single-hop peer-ipv6 <ipv6-address> [ vpn-instance <vpn-name> ] authentication-modemet-sha1key-id <key-id-value> cipher <cipher-text> nego-packet",
        "bfd multi-hop peer-ipv6 <ipv6-address> [ vpn-instance <vpn-name> ] authentication-modemet-sha1key-id <key-id-value> cipher <cipher-text> nego-packet",
        "undo bfd single-hop peer-ipv6 <ipv6-address> [ vpn-instance <vpn-name> ]",
        "undo bfd multi-hop peer-ipv6 <ipv6-address> [ vpn-instance <vpn-name> ]"
    ],
    "ParentView": [
        "BFD view"
    ],
    "ParaDef": [
        {
            "Parameters": "met-sha1",
            "Info": "Specifies the M-SHA1 algorithm.\n-"
        },
        {
            "Parameters": "key-id <key-id-value>",
            "Info": "Specifies the key ID.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "cipher <cipher-text>",
            "Info": "Specifies the encryption password.\nThe value is a string of case-sensitive characters, spaces not supported.\nIf a plaintext authentication password is entered, the value is a string of 1 to 20 characters.A ciphertext authentication password is a string of 20 to 148 characters."
        },
        {
            "Parameters": "nego-packet",
            "Info": "Authenticates BFD negotiation packets.\n-"
        },
        {
            "Parameters": "single-hop",
            "Info": "Specifies the BFD for IP single-hop session type.\n-"
        },
        {
            "Parameters": "peer-ipv6 <ipv6-address>",
            "Info": "Specifies the peer IPv6 address of the BFD sessions with negotiation authentication.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "multi-hop",
            "Info": "Specifies the BFD for IP multi-hop session type.\n-"
        },
        {
            "Parameters": "peer-ip <ip-address>",
            "Info": "Specifies the peer IPv4 address of the BFD sessions with negotiation authentication.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpn-instance <vpn-name>",
            "Info": "Specifies the name of a VPN instance for the BFD sessions with negotiation authentication.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] bfd single-hop peer-ip 10.1.1.1 authentication-mode met-sha1 key-id 1 cipher YsHsjx_202206 nego-packet"
        ]
    ],
    "ExtraInfo": "When configuring negotiation authentication for BFD sessions, you need to select different commands according to the type of the target BFD sessions."
}