{
    "PageTitle": "bfd bind peer-ip default-ip",
    "FuncDef": "The bfd bind peer-ip default-ip command creates a multicast BFD session. The bfd bind peer-ip default-ip command creates a multicast BFD session. By default, no multicast BFD session is created.",
    "CLIs": [
        "bfd <sessname-value> bindpeer-ipdefault-ipinterface { <interface-name> | <interface-type> <interface-number> } [ source-ip <source-ip> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<sessname-value>",
            "Info": "Specifies·the·name·of·a·BFD·session.\nThe value is a string of 1 to 64 case-insensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "interface <interface-name> <interface-type> <interface-number>",
            "Info": "Specifies the local interface to which a BFD session is bound.\n-"
        },
        {
            "Parameters": "source-ip <source-ip>",
            "Info": "Specifies the source IPv4 address carried in BFD packets.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd atob bind peer-ip default-ip interface 100GE 1/0/1"
        ]
    ],
    "ExtraInfo": "A BFD session is established to rapidly detect link faults. If the physical status of a link is to be monitored and the peer IP address is unavailable (for example, when no peer IP address exists on an Eth-Trunk member link), the bfd bind peer-ip default-ip command can be used to create a BFD session to monitor the physical status.\nIf the source IP address is configured for the interface whose physical status is to be monitored by BFD, BFD packets are correctly forwarded after URPF has been enabled. The source-ip parameter must be configured correctly because the system checks only the validity of the source IP address. A multicast or broadcast address is an invalid source IP address."
}