{
    "PageTitle": "display bfd session verbose (IPv6)",
    "FuncDef": "The display bfd session verbose command displays the detailed information of the BFD session for monitoring an IPv6 link. The display bfd session verbose command displays the detailed information of the BFD session for monitoring an IPv6 link. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display bfd session peer-ipv6 <peer-ipv6> [ vpn-instance <vpn-name> ] verbose",
        "display bfd session all for-ipv6 verbose",
        "display bfd session static for-ipv6 verbose"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-ipv6 <peer-ipv6>",
            "Info": "Displays information about the BFD session with a specified peer IPv6 address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "vpn-instance <vpn-name>",
            "Info": "Displays information about the BFD session bound to a specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about BFD sessions.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Displays information about all BFD sessions.\n-"
        },
        {
            "Parameters": "for-ipv6",
            "Info": "Displays information about the BFD session for detecting faults in IPv6 links.\n-"
        },
        {
            "Parameters": "static",
            "Info": "Displays information about all static BFD sessions.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bfd session all for-ipv6 verbose"
        ]
    ],
    "ExtraInfo": "To view the detailed information of the BFD session for monitoring an IPv6 link, run the display bfd session verbose (IPv6) command."
}