{
    "PageTitle": "display bfd session verbose",
    "FuncDef": "The display bfd session verbose command displays detailed information about BFD sessions. The display bfd session verbose command displays detailed information about BFD sessions.",
    "CLIs": [
        "display bfd session all [ for-ip | for-srv6-segment-list ] verbose",
        "display bfd session passive-dynamic [ peer-ip <peer-ip> remote-discriminator <discr-value> ] verbose",
        "display bfd session dynamic verbose",
        "display bfd session discriminator <discr-value> verbose",
        "display bfd session peer-ip { <peer-ip> [ vpn-instance <vpn-name> ] | default-ip } verbose",
        "display bfd session static-auto verbose"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "for-ip",
            "Info": "Displays detailed information about the BFD session for detecting faults in IP links.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Displays detailed information about all BFD sessions.\n-"
        },
        {
            "Parameters": "static",
            "Info": "Displays detailed information about all static BFD sessions.\n-"
        },
        {
            "Parameters": "passive-dynamic",
            "Info": "Displays detailed information about the BFD sessions that are passively created.\n-"
        },
        {
            "Parameters": "peer-ip <peer-ip>",
            "Info": "Displays detailed information about the BFD session with a specified peer IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "remote-discriminator <discr-value>",
            "Info": "Displays detailed information about a BFD session with a specified remote discriminator.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "dynamic",
            "Info": "Displays detailed information about dynamic and statically self-negotiated BFD sessions.\n-"
        },
        {
            "Parameters": "discriminator <discr-value>",
            "Info": "Displays detailed information about a BFD session with a specified local discriminator.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "vpn-instance <vpn-name>",
            "Info": "Displays detailed information about the BFD session bound to a specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "default-ip",
            "Info": "Displays statistics about BFD sessions with the default multicast address.\n-"
        },
        {
            "Parameters": "static-auto",
            "Info": "Displays detailed information about static BFD sessions with automatically negotiated discriminators.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bfd session all verbose"
        ]
    ],
    "ExtraInfo": "To view detailed information about BFD sessions, run the display bfd session verbose command with one or more parameters."
}