{
    "PageTitle": "process-interface-status reboot-no-impact",
    "FuncDef": "The process-interface-status reboot-no-impact command cancels the association between a BFD session in the initial Down state with the Down state of the interface or sub-interface to which the BFD session is bound after the device restarts.\nThe undo process-interface-status reboot-no-impact command restores the default configuration. A single-hop BFD session with a multicast IP address configured as the peer address is not associated with the status of the interface to which the BFD session is bound. After the device restarts, the session in the initial Down state is not associated with the interface or sub-interface. A single-hop BFD for link-bundle session is associated with the status of the interface to which the BFD session is bound. After the device restarts, the session in the initial Down state is associated with the interface or sub-interface. The process-interface-status reboot-no-impact command cancels the association between a BFD session in the initial Down state with the Down state of the interface or sub-interface to which the BFD session is bound after the device restarts. The undo process-interface-status reboot-no-impact command restores the default configuration. A single-hop BFD session with a multicast IP address configured as the peer address is not associated with the status of the interface to which the BFD session is bound. After the device restarts, the session in the initial Down state is not associated with the interface or sub-interface. A single-hop BFD for link-bundle session is associated with the status of the interface to which the BFD session is bound. After the device restarts, the session in the initial Down state is associated with the interface or sub-interface. By default, a single-hop BFD session with a multicast IP address configured as the peer address is not associated with the status of the interface to which the BFD session is bound. After the device restarts, a session in the initial Down state is not associated with the interface or sub-interface. A single-hop BFD for link-bundle session is associated with the interface to which the BFD session is bound. After the device restarts, a session in the initial Down state is associated with the interface or sub-interface.",
    "CLIs": [
        "process-interface-status reboot-no-impact",
        "undo process-interface-status reboot-no-impact"
    ],
    "ParentView": [
        "BFD session view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 1",
            "[*HUAWEI-Eth-Trunk1] ip address 10.1.1.1 24",
            "[*HUAWEI-Eth-Trunk1] quit",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] eth-trunk 1",
            "[*HUAWEI-100GE1/0/1] quit",
            "[*HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd test bind link-bundle peer-ip 10.1.1.2 interface Eth-Trunk 1 source-ip 10.1.1.1",
            "[*HUAWEI-bfd-session-test] process-interface-status reboot-no-impact"
        ]
    ],
    "ExtraInfo": "After associating the status of a multicast BFD session or a BFD for link-bundle session with the status of an interface, you can run the process-interface-status reboot-no-impact command to cancel the association between the initial Down state and the Down state of the interface or sub-interface after the device restarts."
}