{
    "PageTitle": "process-interface-status",
    "FuncDef": "The process-interface-status command associates the status of a BFD session with the status of the interface to which the BFD session is bound.\nThe undo process-interface-status command cancels the association between the status of a BFD session and the status of the interface to which the BFD session is bound. The process-interface-status command associates the status of a BFD session with the status of the interface to which the BFD session is bound. The undo process-interface-status command cancels the association between the status of a BFD session and the status of the interface to which the BFD session is bound. By default, the status of the multicast IP single-hop BFD session is not associated with the status of the bound interface, and the status of the link-bundle single-hop BFD session is associated with the status of the bound interface.",
    "CLIs": [
        "process-interface-status [ sub-if ] [ reboot-no-impact ]",
        "undo process-interface-status [ sub-if ] [ reboot-no-impact ]"
    ],
    "ParentView": [
        "BFD session view"
    ],
    "ParaDef": [
        {
            "Parameters": "sub-if",
            "Info": "Associates a BFD session with a sub-interface. If a BFD session is bound to an interface, the BFD session status change affects the status of this interface and its sub-interfaces.\nThis parameter applies only to multicast IP single-hop BFD sessions.\n-"
        },
        {
            "Parameters": "reboot-no-impact",
            "Info": "Indicates that the BFD session bound to an interface or sub-interface does not trigger the interface or sub-interface to go down when the initial state is Down after configuration restoration.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 1",
            "[*HUAWEI-Eth-Trunk1] ip address 10.1.1.1 24",
            "[*HUAWEI-Eth-Trunk1] quit",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] eth-trunk 1",
            "[*HUAWEI-100GE1/0/1] quit",
            "[*HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd test bind link-bundle peer-ip 10.1.1.2 interface Eth-Trunk 1 source-ip 10.1.1.1",
            "[*HUAWEI-bfd-session-test] process-interface-status reboot-no-impact"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd s1 bind peer-ip default-ip interface 100GE 1/0/1",
            "[*HUAWEI-bfd-session-s1] process-interface-status"
        ]
    ],
    "ExtraInfo": "When transmission devices exist on a link and a fault occurs on the link, the devices on both ends of the link need a long time to detect the fault. To shorten the fault detection time, run the process-interface-status command to associate a multicast BFD session with an interface to trigger fast route convergence."
}