{
    "PageTitle": "tos-exp (BFD view)",
    "FuncDef": "The tos-exp command sets priorities of BFD control packets for all dynamic or static BFD sessions.\nThe undo tos-exp command restores the default setting. The tos-exp command sets priorities of BFD control packets for all dynamic or static BFD sessions. The undo tos-exp command restores the default setting. By default, the priority is 7, which is the highest priority of BFD control packets.",
    "CLIs": [
        "tos-exp <tos-value> dynamic",
        "tos-exp <tos-value> static",
        "undo tos-exp <tos-value> dynamic",
        "undo tos-exp dynamic",
        "undo tos-exp <tos-value> static",
        "undo tos-exp static"
    ],
    "ParentView": [
        "BFD view"
    ],
    "ParaDef": [
        {
            "Parameters": "<tos-value>",
            "Info": "Sets the ToS or EXP field. The default value is 7.\nThe value is an integer ranging from 0 to 7."
        },
        {
            "Parameters": "dynamic",
            "Info": "Indicates the priority of BFD control packets for dynamic BFD sessions.\n-"
        },
        {
            "Parameters": "tos-exp",
            "Info": "Specifies a priority for BFD control packets.\nThe value is an integer ranging from 0 to 7."
        },
        {
            "Parameters": "static",
            "Info": "Indicates the priority of BFD control packets for static BFD sessions.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] tos-exp 5 dynamic",
            "[*HUAWEI-bfd] tos-exp 6 static"
        ]
    ],
    "ExtraInfo": "Priorities of BFD sessions can be set based on the importance of services bound to BFD sessions. For an important service, run the tos-exp command to set a high priority for BFD control packets. When the system is congested, BFD control packets with a higher priority are preferentially sent.\nChanging the priorities of BFD control packets helps check whether BFD control packets with different priorities can be forwarded properly."
}