{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "banner login",
    "FuncDef": [
        "To define and enable a customized banner to be displayed before the username and password login prompts, use the **banner login** command in global configuration mode. To disable the login banner, use **no** form of this command. "
    ],
    "CLIs": [
        "banner login <d message d>",
        "no banner login"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *d* ",
            "Info": " Delimiting character of your choice—a pound sign (#), for example. You cannot use the delimiting character in the banner message. "
        },
        {
            "Parameters": " *message* ",
            "Info": " Message text. You can include tokens in the form *$(token)* in the message text. Tokens will be replaced with the corresponding configuration variable. Tokens are described in [Table 15](#wp1014472). "
        }
    ],
    "Examples": [
        [
            "The following example sets a login banner. Double quotes (\") are used as the delimiting character.",
            "```",
            "Router# banner login \" Access for authorized users only. Please enter your username and",
            "password. \"",
            "```",
            "```",
            "```",
            "The following example sets a login banner that uses several tokens. The percent sign (%) is used as the delimiting character.",
            "```",
            "darkstar(config)# banner login %",
            "```",
            "```",
            "Enter TEXT <message>. End with the character '%'.",
            "```",
            "```",
            "You have entered $(hostname).$(domain) on line $(line) ($(line-desc)) %",
            "```",
            "```",
            "```",
            "When the login banner is executed, the user will see the following banner. Notice that the $(token) syntax is replaced by the corresponding configuration variable.",
            "```",
            "You have entered darkstar.ourdomain.com on line 5 (Dialin Modem)",
            "```"
        ]
    ],
    "ExtraInfo": "Follow the **banner login** command with one or more blank spaces and a delimiting character of your choice. Then enter one or more lines of text, terminating the message with the second occurrence of the delimiting character.When a user connects to the router, the message-of-the-day (MOTD) banner (if configured) appears first, followed by the login banner and prompts. After the user successfully logs in to the router, the EXEC banner or incoming banner will be displayed, depending on the type of connection. For a reverse Telnet login, the incoming banner will be displayed. For all other connections, the router will display the EXEC banner.To customize the banner, use tokens in the form $(*token*) in the message text. Tokens will display current Cisco IOS configuration variables, such as the router's host name and IP address. The tokens are described in [Table 15](#wp1014472).Table 15 banner login Tokens| Token | Information Displayed in the Banner || --- | --- || **$(hostname)** | Displays the host name for the router. || **$(domain)** | Displays the domain name for the router. || **$(line)** | Displays the vty or tty (asynchronous) line number. || **$(line-desc)** | Displays the description attached to the line. |  ",
    "RelatedCmds": [
        {
            "cmd": " **banner exec** ",
            "description": " Defines a customized banner to be displayed whenever the EXEC process is initiated. "
        },
        {
            "cmd": " **banner incoming** ",
            "description": " Defines a customized message to be displayed when there is an incoming connection to a terminal line from a host on the network. "
        },
        {
            "cmd": " **banner motd** ",
            "description": " Defines a customized message-of-the-day banner. "
        },
        {
            "cmd": " **banner slip-ppp** ",
            "description": " Defines a customized banner to be displayed when a serial-line IP or point-to-point connection is made. "
        }
    ]
}