{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "boot config",
    "FuncDef": [
        "To specify the device and filename of the configuration file from which the system configures itself during initialization (startup), use the **boot config** command in global configuration mode. To return to the default location for the configuration file, use the **no** form of this command. "
    ],
    "CLIs": [
        "boot config <file-system-prefix>: [ <directory>/ ] <filename> [ nvbypass ]",
        "no boot config",
        "Cisco 7600 Series Router",
        "boot config <device>:<filename> [ nvbypass ]",
        "no boot config"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *file-system-prefix*: ",
            "Info": " File system, followed by a colon (for example, **nvram:**, **flash:**, **slot0:**, **usbflash**[**0**-**9**]**:**, or **usbtoken**[**0**-**9**]**:**). The default is **nvram:**. "
        },
        {
            "Parameters": " *directory*/ ",
            "Info": " (Optional) File system directory where the configuration file is located, followed by a forward slash (/). "
        },
        {
            "Parameters": " *filename* ",
            "Info": " Name of the configuration file. "
        },
        {
            "Parameters": " *device*: ",
            "Info": " Device identification, followed by a colon; see the \"Usage Guidelines\" section for a list of the valid values. "
        },
        {
            "Parameters": " **nvbypass** ",
            "Info": " (Optional) Specifies that the distilled configuration is not written to nonvolatile random access memory (NVRAM). "
        }
    ],
    "Examples": [
        [
            "The following example shows how to set the configuration file that is located in internal flash memory to configure itself during initialization. The third line copies the specification to the startup configuration, ensuring that this specification will take effect upon the next reload.",
            "```",
            "Router(config)# boot config flash:router-config",
            "```",
            "```",
            "Router(config)# end",
            "```",
            "```",
            "Router# copy system:running-config nvram:startup-config",
            "```",
            "```",
            "```",
            "The following example instructs a Cisco 7500 series router to use the configuration file named router-config located on the flash memory card inserted in the second Personal Computer Memory Card Industry Association (PCMCIA) slot of the Route Switch Processor (RSP) card during initialization. The third line copies the specification to the startup configuration, ensuring that this specification will take effect upon the next reload.",
            "```",
            "Router (config)# boot config slot1:router-config",
            "```",
            "```",
            "Router (config)# end",
            "```",
            "```",
            "Router# copy system:running-config nvram:startup-config",
            "```"
        ]
    ],
    "ExtraInfo": null,
    "RelatedCmds": [
        {
            "cmd": " **copy system:running-config nvram:startup-config** ",
            "description": " Saves the environment variable from the running configuration to the startup configuration. "
        },
        {
            "cmd": " **show bootvar** ",
            "description": " Displays the contents of the BOOT environment variable, the name of the configuration file pointed to by the CONFIG_FILE environment variable, the contents of the BOOTLDR environment variable, and the configuration register setting. "
        }
    ]
}