{
    "PageTitle": "ipv4-address port priority",
    "FuncDef": "The ipv4-address port priority command configures an IP address, a port number, a transport protocol, an encryption mode, and a priority for a destination collector.\nThe undo ipv4-address port priority command deletes the IP address, port number, transport protocol, encryption mode, and priority of a destination collector. The ipv4-address port priority command configures an IP address, a port number, a transport protocol, an encryption mode, and a priority for a destination collector. The undo ipv4-address port priority command deletes the IP address, port number, transport protocol, encryption mode, and priority of a destination collector. By default, no IP address, port number, transport protocol, encryption mode, or priority is configured for the destination collector.",
    "CLIs": [
        "ipv4-address <ip-address-ipv4> port <port-value> [ vpn-instance <vpn-name> ] [ protocolgrpc [ no-tls ] [ compressiongzip ] ] priority { low | medium | high }",
        "undo ipv4-address <ip-address-ipv4> port <port-value> [ vpn-instance <vpn-name> ] [ protocolgrpc [ no-tls ] [ compressiongzip ] ] priority { low | medium | high }"
    ],
    "ParentView": [
        "Destination group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-address-ipv4>",
            "Info": "Specifies an IPv4 address for the destination collector.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "<port-value>",
            "Info": "Specifies a port number for the destination collector.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "vpn-instance <vpn-name>",
            "Info": "Specifies a VPN instance name for the destination collector.\nThe value is a string of 1 to 31 characters. The value must be the name of an existing VPN instance."
        },
        {
            "Parameters": "protocol",
            "Info": "Indicates the data sending protocol.\n-"
        },
        {
            "Parameters": "grpc",
            "Info": "Specifies gRPC as the data reporting protocol.\n-"
        },
        {
            "Parameters": "no-tls",
            "Info": "Indicates whether to use TLS encryption.\nIf this parameter is set, TLS encryption is not used.If this parameter is not set, TLS encryption can be used.\n-"
        },
        {
            "Parameters": "compression",
            "Info": "Specifies the data reporting compression type.\n-"
        },
        {
            "Parameters": "gzip",
            "Info": "Sets the data compression type to gzip.\n-"
        },
        {
            "Parameters": "low",
            "Info": "Sets the priority of the destination collector to low.\n-"
        },
        {
            "Parameters": "medium",
            "Info": "Sets the priority of the destination collector to medium.\n-"
        },
        {
            "Parameters": "high",
            "Info": "Sets the priority of the destination collector to high.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telemetry",
            "[~HUAWEI-telemetry] destination-group test",
            "[*HUAWEI-telemetry-destination-group-test] work-mode priority",
            "[*HUAWEI-telemetry-destination-group-test] ipv4-address 10.1.1.1 port 10001 protocol grpc no-tls priority high"
        ]
    ],
    "ExtraInfo": "After a destination group is created, you can run this command to configure the IP address, port number, transport protocol, encryption mode, and priority of the destination collector."
}