{
    "PageTitle": "ipv6-address port",
    "FuncDef": "The ipv6-address port command configures an IPv6 address, port number, transport protocol, and encryption mode for a destination collector.\nThe undo ipv6-address port command deletes the IPv6 address, port number, transport protocol, and encryption mode of the destination collector. The ipv6-address port command configures an IPv6 address, port number, transport protocol, and encryption mode for a destination collector. The undo ipv6-address port command deletes the IPv6 address, port number, transport protocol, and encryption mode of the destination collector. By default, no IP address, port number, transport protocol, or encryption mode is configured for the destination collector.",
    "CLIs": [
        "ipv6-address <ip-address-ipv6> port <port-value> [ vpn-instance <vpn-name> ] [ protocol { grpc [ no-tls ] [ compressiongzip ] | udp } ]",
        "undo ipv6-address <ip-address-ipv6> port <port-value> [ vpn-instance <vpn-name> ] [ protocol { grpc [ no-tls ] [ compressiongzip ] | udp } ]"
    ],
    "ParentView": [
        "Destination group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-address-ipv6>",
            "Info": "Specifies an IPv6 address for the destination collector.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<port-value>",
            "Info": "Specifies a port number for the destination collector.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "vpn-instance <vpn-name>",
            "Info": "Specifies a VPN instance name for the destination collector.\nThe value is a string of 1 to 31 characters. The value must be the name of an existing VPN instance on the device."
        },
        {
            "Parameters": "protocol",
            "Info": "Indicates the data sending protocol.\n-"
        },
        {
            "Parameters": "grpc",
            "Info": "Specifies gRPC as the data reporting protocol.\n-"
        },
        {
            "Parameters": "no-tls",
            "Info": "Parameter indicating whether to use TLS encryption.\nIf this parameter is set, TLS encryption is not used.If this parameter is not set, TLS encryption can be used.\n-"
        },
        {
            "Parameters": "compression",
            "Info": "Specifies the data reporting compression type.\n-"
        },
        {
            "Parameters": "gzip",
            "Info": "Set the data compression type to gzip.\n-"
        },
        {
            "Parameters": "udp",
            "Info": "Indicates that the data sending protocol is UDP.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telemetry",
            "[~HUAWEI-telemetry] destination-group test",
            "[*HUAWEI-telemetry-destination-group-test] ipv6-address 2001:DB8:2::1 port 10001 protocol grpc"
        ]
    ],
    "ExtraInfo": "After a destination group is created, you can run this command to configure the IP address, port number, transport protocol, and encryption mode of the destination collector."
}