{
    "PageTitle": "local-source-interface",
    "FuncDef": "The local-source-interface command sets a source interface and a source port number when a protocol is used for data sending.\nThe undo local-source-interface command deletes the source interface and source port number configured when a protocol is used for data sending. The local-source-interface command sets a source interface and a source port number when a protocol is used for data sending. The undo local-source-interface command deletes the source interface and source port number configured when a protocol is used for data sending. By default, the source interface and source port are not configured.",
    "CLIs": [
        "local-source-interface { <if-name> | <if-type> <if-number> } [ port <port-value> ]",
        "undo local-source-interface { <if-name> | <if-type> <if-number> } [ port <port-value> ]"
    ],
    "ParentView": [
        "Subscription view"
    ],
    "ParaDef": [
        {
            "Parameters": "<if-name>",
            "Info": "Specifies an interface name.\nThe value is a string of 1 to 63 characters without spaces."
        },
        {
            "Parameters": "<if-type>",
            "Info": "Interface type.\n-"
        },
        {
            "Parameters": "<if-number>",
            "Info": "Specifies an interface number.\nThe value is a string of 1 to 63 characters without spaces."
        },
        {
            "Parameters": "port <port-value>",
            "Info": "Specifies the IPv4 source port number in protocol-based packet sending mode.\nThe value is an integer ranging from 1 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telemetry",
            "[~HUAWEI-telemetry] subscription test",
            "[*HUAWEI-telemetry-subscription-test] local-source-interface LoopBack0 port 2345"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telemetry",
            "[~HUAWEI-telemetry] subscription test",
            "[*HUAWEI-telemetry-subscription-test] local-source-interface LoopBack0"
        ]
    ],
    "ExtraInfo": "To statically subscribe to the data sampled, you need to run the local-source-interface command to configure a source interface and a source port number (a source port number is required only when UDP is used for data sending) in the subscription view for data sending. This ensures that devices can communicate with the collector.\nOnly one combination that consists of a source interface and a source port number can be configured for a subscription. After the configuration is complete:"
}