{
    "PageTitle": "local-source-address",
    "FuncDef": "The local-source-address ipv4 command sets a source IPv4 address and a source port number when UDP or gRPC is used for data sending.\nThe undo local-source-address ipv4 command deletes the source IPv4 address and source port number configured when UDP or gRPC is used for data sending.\nThe local-source-address ipv6 command sets a source IPv6 address and a source port number when UDP or gRPC is used for data sending.\nThe undo local-source-address ipv6 command deletes the source IPv6 address and source port number configured when UDP or gRPC is used for data sending. The local-source-address ipv4 command sets a source IPv4 address and a source port number when UDP or gRPC is used for data sending. The undo local-source-address ipv4 command deletes the source IPv4 address and source port number configured when UDP or gRPC is used for data sending. The local-source-address ipv6 command sets a source IPv6 address and a source port number when UDP or gRPC is used for data sending. The undo local-source-address ipv6 command deletes the source IPv6 address and source port number configured when UDP or gRPC is used for data sending. By default, the source IP address is the IP address of route's outbound interface selected by UDP or gRPC and the source port number is randomly selected.",
    "CLIs": [
        "local-source-address ipv4 <ipv4-address> [ port <port-value> ]",
        "local-source-address ipv6 <ipv6-address> [ port <port-value6> ]",
        "undo local-source-address ipv4",
        "undo local-source-address ipv4 <ipv4-address> [ port <port-value> ]",
        "undo local-source-address ipv6",
        "undo local-source-address ipv6 <ipv6-address> [ port <port-value6> ]"
    ],
    "ParentView": [
        "Subscription view"
    ],
    "ParaDef": [
        {
            "Parameters": "port <port-value>",
            "Info": "Specifies a IPv4 source port number when UDP is used for data sending.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "port <port-value6>",
            "Info": "Specifies a IPv6 source port number when UDP is used for data sending.\nThe value is an integer ranging from 1025 to 65535."
        },
        {
            "Parameters": "ipv4 <ipv4-address>",
            "Info": "Specifies a source IPv4 address for data sending.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6 <ipv6-address>",
            "Info": "Specifies a source IPv6 address for data sending.\nThe value is a 32-bit hexadecimal string in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telemetry",
            "[~HUAWEI-telemetry] subscription test",
            "[*HUAWEI-telemetry-subscription-test] local-source-address ipv4 10.10.1.1 port 11111"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telemetry",
            "[~HUAWEI-telemetry] subscription test",
            "[*HUAWEI-telemetry-subscription-test] local-source-address ipv4 10.10.1.1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telemetry",
            "[~HUAWEI-telemetry] subscription test",
            "[*HUAWEI-telemetry-subscription-test] local-source-address ipv6 2001:db8:4::1"
        ]
    ],
    "ExtraInfo": "To statically subscribe to sampled data, you need to configure the source IP address and source port number (only for UDP) in the subscription view to ensure that the device and collector can communicate with each other.\nOnly one combination of the source IP address and source port number can be configured for a subscription. After the configuration is complete:"
}