{
    "PageTitle": "protocol (Subscription view)",
    "FuncDef": "The protocol command configures a protocol and encryption mode for the target collector that is associated with the current subscription.\nThe undo protocol command deletes the protocol and encryption mode configured for the target collector that is associated with the current subscription. The protocol command configures a protocol and encryption mode for the target collector that is associated with the current subscription. The undo protocol command deletes the protocol and encryption mode configured for the target collector that is associated with the current subscription. By default, no protocol and encryption mode are configured for the target collector that is associated with the current subscription.",
    "CLIs": [
        "protocol { grpc [ no-tls ] [ compressiongzip ] | udp }",
        "undo protocol",
        "undo protocol { grpc [ no-tls ] [ compressiongzip ] | udp }"
    ],
    "ParentView": [
        "Subscription view"
    ],
    "ParaDef": [
        {
            "Parameters": "grpc",
            "Info": "Specifies gRPC as the data reporting protocol.\n-"
        },
        {
            "Parameters": "no-tls",
            "Info": "Parameter indicating whether to use TLS encryption.\nIf this parameter is set, TLS encryption is not used.If this parameter is not set, TLS encryption can be used.\n-"
        },
        {
            "Parameters": "compression",
            "Info": "Specifies the data reporting compression type.\n-"
        },
        {
            "Parameters": "gzip",
            "Info": "Set the data compression type to gzip.\n-"
        },
        {
            "Parameters": "udp",
            "Info": "Specifies UDP as the data reporting protocol.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telemetry",
            "[~HUAWEI-telemetry] subscription a",
            "[*HUAWEI-telemetry-subscription-a] protocol grpc"
        ]
    ],
    "ExtraInfo": "To configure a protocol and encryption mode for the target collector associated with a created subscription, run the protocol command."
}