{
    "PageTitle": "sensor-group (Subscription view)",
    "FuncDef": "The sensor-group command associates a sampling sensor group and configures a sampling interval, redundancy suppression, and a heartbeat interval for the sensor group.\nThe undo sensor-group command cancels the association of a sampling sensor group. The sensor-group command associates a sampling sensor group and configures a sampling interval, redundancy suppression, and a heartbeat interval for the sensor group. The undo sensor-group command cancels the association of a sampling sensor group. By default, no sampling sensor group is associated.",
    "CLIs": [
        "sensor-group <sensor-name> [ sample-interval <sample-interval> { [ suppress-redundant ] | [ heartbeat-interval <heartbeat-interval> ] } ]",
        "undo sensor-group <sensor-name> [ sample-interval <sample-interval> { [ suppress-redundant ] | [ heartbeat-interval <heartbeat-interval> ] } ]"
    ],
    "ParentView": [
        "Subscription view"
    ],
    "ParaDef": [
        {
            "Parameters": "<sensor-name>",
            "Info": "Specifies the name of a sampling sensor group to be associated.\nThe value is a string of 1 to 64 characters. The value must be the name of a sampling sensor group created in the telemetry view."
        },
        {
            "Parameters": "sample-interval <sample-interval>",
            "Info": "Specifies a sampling interval.\nThe value is an integer ranging from 0 to 1800000, in milliseconds. Currently, only 0, 100, 500, 1000, 5000, 10000, 30000, 60000, 180000, 300000, 900000, and 1800000 are supported. The default value is 60000. If the value is set to 0, real-time sampling is performed."
        },
        {
            "Parameters": "suppress-redundant",
            "Info": "Indicates that redundancy suppression is enabled for sampling. If the data remains unchanged during a heartbeat interval after the data is sent last time, no more data is sent.\n-"
        },
        {
            "Parameters": "heartbeat-interval <heartbeat-interval>",
            "Info": "Specifies a heartbeat interval.\nThe value is an integer that ranges from 1 to 60, in seconds. The value of heartbeat-interval must be an integer multiple of the value of sample-interval in the same dimension. The default value is 60."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telemetry",
            "[~HUAWEI-telemetry] sensor-group 1",
            "[*HUAWEI-telemetry-sensor-group-1] quit",
            "[*HUAWEI-telemetry] subscription test",
            "[*HUAWEI-telemetry-subscription-test] sensor-group 1 sample-interval 100 suppress-redundant heartbeat-interval 30"
        ]
    ],
    "ExtraInfo": "A sampling sensor group created in the telemetry view must be associated in the subscription view to perform sampling tasks.\nA maximum of five sampling sensor groups can be associated for each subscription using this command."
}