{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "upgrade automatic getversion",
    "FuncDef": [
        "To download a Cisco IOS software image directly from www.cisco.com or from a non-Cisco server, use the **upgrade automatic getversion** command in privileged EXEC mode. "
    ],
    "CLIs": [
        "upgrade automatic getversion { cisco username <username> password <password> image <image> | <url> } [ at <hh:mm> | <now> | in <hh:mm> ] [ disk-management { auto | confirm | no } ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **cisco** ",
            "Info": " Downloads the image from www.cisco.com. "
        },
        {
            "Parameters": " **username** *username* ",
            "Info": " Username for logging in to www.cisco.com. "
        },
        {
            "Parameters": " **password** *password* ",
            "Info": " Password for logging in to www.cisco.com. "
        },
        {
            "Parameters": " **image** ",
            "Info": " Specifies the Cisco IOS software image to which the router is to be upgraded. "
        },
        {
            "Parameters": " *image* ",
            "Info": " Name of the Cisco IOS software image to which the router is to be upgraded. "
        },
        {
            "Parameters": " *url* ",
            "Info": " URL from where the Cisco IOS Auto-Upgrade Manager can download the image that has already been downloaded to a non-Cisco server. "
        },
        {
            "Parameters": " **at** ",
            "Info": " (Optional) Schedules a reload at a specified time. Use either of the following arguments with this keyword:  •*hh:mm—*Hour and minute. The time entered must be in 24-hour format.  •*now—*Immediately after the download of the Cisco IOS software image. "
        },
        {
            "Parameters": " **in** *hh:mm* ",
            "Info": " (Optional) Schedules a reload in a specified length of time after downloading the Cisco IOS software image. "
        },
        {
            "Parameters": " **disk-management** ",
            "Info": " (Optional) Cisco IOS Auto-Upgrade Manager disk cleanup utility. You must configure one of the following keywords:  •**auto**—Deletes the files without asking for confirmation.  •**confirm**—Asks for confirmation before deleting a file.  •**no**—Never deletes any file. "
        }
    ],
    "Examples": [
        [
            "Downloading the Cisco IOS Image from the Cisco Website",
            "The following example shows how to download a Cisco IOS software <image> from the Cisco website (www.cisco.com). Here, the reloading of the router with the downloaded Cisco IOS software <image> is not scheduled. Also, the disk-cleanup utility is not enabled.",
            "```",
            "Router# upgrade automatic getversion cisco username myusername password mypassword <image>",
            "c3825-adventerprisek9-mz.124-2.XA.bin",
            "```",
            "Downloading the Cisco IOS Image from a Non-Cisco TFTP Server",
            "The following example shows how to download the Cisco IOS software <image> from a non-Cisco TFTP server and reload the router immediately after the download. It also shows how to delete the files automatically if there is not enough disk space.",
            "```",
            "Router# upgrade automatic getversion tftp://abc/tom/c3825-adventerprisek9-mz.124-2.XA.bin",
            "at now disk-management auto",
            "```",
            "Downloading the Cisco IOS Image from a Non-Cisco TFTP Server Using the Interactive Mode",
            "The following example shows how to use this command in interactive mode to download a Cisco IOS software <image> from a non-Cisco server. Here, the reloading of the device with the downloaded Cisco IOS software <image> is not scheduled.",
            "```",
            "Router# upgrade automatic",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "Use the **upgrade automatic getversion** command to download the Cisco IOS software image to a router. You can either download the image from the Cisco website (www.cisco.com) or from a non-Cisco server to which the Cisco IOS software image has already been downloaded from the Cisco website.You can also use this command to schedule a reload. Additionally, this command can use the disk cleanup utility to delete files if there is not enough space to download the new Cisco IOS software image.",
    "RelatedCmds": [
        {
            "cmd": " **upgrade automatic abortversion** ",
            "description": " Cancels upgrading the router with a new Cisco IOS software image. "
        },
        {
            "cmd": " **upgrade automatic runversion** ",
            "description": " Reloads the router with a new Cisco IOS software image. "
        }
    ]
}