{
    "PageTitle": "info-center source channel",
    "FuncDef": "The info-center source channel command sets rules for outputting information through information channels.\nThe undo info-center source channel command deletes the rules for outputting information through information channels. The info-center source channel command sets rules for outputting information through information channels. The undo info-center source channel command deletes the rules for outputting information through information channels. By default, the default values of logs, traps, and debugging information vary according to information channels. You can run the display info-center channel command to view the value of the default module of the corresponding channel.",
    "CLIs": [
        "info-center source { <module-name> | default } channel { <channel-number> | <channel-name> } [ log { state { off | on } | level <log-level> } | trap { state { off | on } | level <trap-level> } | debug { state { off | on } | level <dbg-level> } ]",
        "undo info-center source { <module-name> | default } channel { <channel-number> | <channel-name> } [ log { state | level } | trap { state | level } | debug { state | level } ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<module-name>",
            "Info": "Specifies the name of a module.\nYou can query all the currently supported modules in Log Reference. In this manual, the log format is simplified as module name/log severity/information keyword, such as INFO/4/FILE_DELETE. (INFO indicates the module name.).\nThe value is a string of 1 to 31 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "default",
            "Info": "Sets default information records.\n-"
        },
        {
            "Parameters": "<channel-number>",
            "Info": "Specifies the number of the channel to be set.\nThe value ranges from 0 to 9."
        },
        {
            "Parameters": "<channel-name>",
            "Info": "Specifies the name of the channel to be set.\nEnumerated type. The options are as follows:\nconsolemonitorloghosttrapbufferlogbuffersnmpagentchannel6channel7channel8channel9"
        },
        {
            "Parameters": "log",
            "Info": "Indicates logs.\n-"
        },
        {
            "Parameters": "state",
            "Info": "Indicates the state of logs.\n-"
        },
        {
            "Parameters": "off",
            "Info": "Disables logs.\n-"
        },
        {
            "Parameters": "on",
            "Info": "Enables logs.\n-"
        },
        {
            "Parameters": "level <trap-level>",
            "Info": "Specifies the severity of the trap information.\nInformation management is classified into eight levels according to the severity or urgency of the information. The values are as follows:\nemergenciesalertcriticalerrorwarningnotificationinformationaldebugging\nThe default value is debugging."
        },
        {
            "Parameters": "level <dbg-level>",
            "Info": "Specifies the severity of the dbg information.\nInformation management is classified into eight levels according to the severity or urgency of the information. The values are as follows:\nemergenciesalertcriticalerrorwarningnotificationinformationaldebugging\nThe default value is debugging."
        },
        {
            "Parameters": "level <log-level>",
            "Info": "Specifies the severity of the log information.\nInformation management is classified into eight levels according to the severity or urgency of the information. The values are as follows:\nemergenciesalertcriticalerrorwarningnotificationinformationaldebugging\nIf channel-number is set to 0, 1, or 4, or channel-name is set to console, monitor, or logbuffer, the default value is warning.\nIf channel-number is set to 2 or 3, or channel-name is set to loghost or trapbuffer, the default value is informational.\nIf channel-number is set to 5, 6, 7, 8, or 9, or channel-name is set to snmpagent, channel6, channel7, channel8 or channel9, the default value is debugging."
        },
        {
            "Parameters": "trap",
            "Info": "Indicates traps.\n-"
        },
        {
            "Parameters": "debug",
            "Info": "Indicates debugging information.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] info-center source cli channel snmp log level emergencies"
        ]
    ],
    "ExtraInfo": "A default record for each information channel exists. The module name is default, and the module ID is 0xffffffff.  The default settings of this record for logs, traps, and debugging information may vary according to information channels.  When there is no explicit configuration record for a module in a channel, the default record is used.\nAll command operation logs are generated by the IM module. You can run the display info-center channel [ <channel-number> | <channel-name> ] command (the value of channel-name is loghost) to view the value of the default module of the loghost channel. The status of the default module is on for log information and the allowed information level is informational. The status of the default module is on for trap information and the allowed information level is debugging. The status of the default module is off for debugging information.\nIf the configuration of the IM module of the loghost channel does not exist on the device, the IM module of the loghost channel uses the value of the default module of the loghost channel.\nIf the info-center source <module-name> channel <channel-name> log level <severitylog> trap state off debug state off command is executed (module-name is im, channel-name is loghost, and severitylog is informational), the value of the IM module of the loghost channel is changed to log information, the status is on, and the allowed information level is informational. For trap information, the status is off. For debugging information, the status is off. That is, the IM module in the loghost direction records only logs with the severity level of informational or higher, but does not record trap or debugging information.\nIn this case, if you run the info-center source <module-name> channel <channel-name> log level <severitylog> debug state on trap state off debug state off command with module-name set to im, channel-name set to loghost, and severitylog set to debugging, the IM module status of the loghost channel is changed to log information, the status is on, and the allowed information severity is debugging. For trap information, the status is off. For debugging information, the status is off. That is, the IM module in the loghost direction records all logs, but does not record trap or debugging information.\nIf a module generates a large number of logs, traps, or debugging information in a short period of time, you can specify the following parameters to suppress the generation of such information. Specifically, modify level severity to adjust the information channel level. In this way, the information of lower levels is filtered. You can also configure the state off parameter to disable all the information sent by the specified module."
}