{
    "PageTitle": "info-center loghost domain",
    "FuncDef": "The info-center loghost domain command configures a device to output logs to a syslog server.\nThe undo info-center loghost domain command disables a device from outputting logs to a syslog server. The info-center loghost domain command configures a device to output logs to a syslog server. The undo info-center loghost domain command disables a device from outputting logs to a syslog server. A device does not output logs to any syslog server by default.",
    "CLIs": [
        "info-center loghost domain <domain-name> [ { local-time | utc } | channel { <channel-number> | <channel-name> } | { public-net | vpn-instance <vpn-instance-name> } | source-ip <source-ip-address> | facility <local-num> | level <level-num> | port <server-port> | transport { udp | tcp { [ versionrfc6587 ] [ ssl-policy <policy-name> [ [ security ] | [ verify-dns-name <dns-name> ] ] ] } } | brief ]",
        "undo info-center loghost domain <domain-name> [ vpn-instance <vpn-instance-name> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "local-time",
            "Info": "Specifies the local time. If this parameter is not specified, the UTC time is used by default.\nThe default value is UTC."
        },
        {
            "Parameters": "utc",
            "Info": "Specifies the UTC time. If this parameter is not specified, the UTC time is used by default.\n-"
        },
        {
            "Parameters": "channel",
            "Info": "Specifies a channel number.\n-"
        },
        {
            "Parameters": "<channel-number>",
            "Info": "Specifies a channel number.\nThe value is an integer ranging from 0 to 9.\n0: console1: monitor2: loghost3: trapbuffer4: logbuffer5: snmpagent6: channel67: channel78: channel89: channel9"
        },
        {
            "Parameters": "<channel-name>",
            "Info": "Specifies a channel name.\nThe value is a string:\nconsole: consolemonitor: remote terminalloghost: syslog servertrapbuffer: trap bufferlogbuffer: log buffersnmpagent: SNMP agentchannel6: unspecifiedchannel7: unspecifiedchannel8: unspecifiedchannel9: information file"
        },
        {
            "Parameters": "public-net",
            "Info": "Indicates the logs sent to a syslog server over the public network.\n-"
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies name of a virtual private network (VPN) instance of a syslog server.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "source-ip <source-ip-address>",
            "Info": "Specifies the source IPv4 address of packets to be sent to a syslog server.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "facility <local-num>",
            "Info": "Specifies a syslog server facility that is used to identify the log information source. You can use this parameter to plan a local value for the log information of a specified device, so that the syslog server can handle received log information based on the parameter.\nThe value is of the enumerated type and can be local0, local1, local2, local3, local4, local5, local6, or local7. The default value is local7."
        },
        {
            "Parameters": "level <level-num>",
            "Info": "Specifies a log level.\nThe value is an enumerated type:\nemergencies: an emergency error.alert: an error that needs to be corrected immediatelycritical: a major errorerror: a minor errorwarning: a potential errornotification: information that needs to be noticedinformational: an informational messagedebugging: detailed information for debugging use"
        },
        {
            "Parameters": "port <server-port>",
            "Info": "Specifies the destination port number of packets to be sent to a syslog server.\nThe value is an integer ranging from 1 to 65535.\nIf UDP is used, the default port number is 514.If the transmission mode is TCP, the default port number is 601.If the TCP-based SSL encryption mode is used, the default port number is 6514."
        },
        {
            "Parameters": "transport",
            "Info": "Specifies the information transmission mode. If this parameter is not specified, the default transmission mode is UDP.\n-"
        },
        {
            "Parameters": "udp",
            "Info": "Indicates that the information transport mode is UDP.\n-"
        },
        {
            "Parameters": "tcp",
            "Info": "Indicates that the information transport mode is TCP.\n-"
        },
        {
            "Parameters": "version",
            "Info": "Specifies an RFC version.\n-"
        },
        {
            "Parameters": "rfc6587",
            "Info": "Specifies RFC 6587.If this parameter is specified, TCP packets are sent in RFC 6587 format and carry packet length information. If this parameter is not specified, TCP packets are sent in RFC 5424 format by default and do not carry packet length information.\n-"
        },
        {
            "Parameters": "ssl-policy <policy-name>",
            "Info": "Specifies the name of a Secure Sockets Layer (SSL) policy when packets are transmitted using TCP.\nSSL encrypted transmission provides high security. If packets are transmitted on insecure networks, configure SSL encrypted transmission by specifying ssl-policy policy-name. If packets are transmitted on secure networks, configure UDP transmission mode by specifying udp or TCP transmission mode by specifying tcp.\nThe value is a string of 1 to 23 characters that can contain case-insensitive letters, underscores (_), and digits."
        },
        {
            "Parameters": "security",
            "Info": "Specifies a security log host.\nIf the security parameter is set, the system sends only security logs to the log host.\n-"
        },
        {
            "Parameters": "verify-dns-name <dns-name>",
            "Info": "Specifies the DNS server certificate name for the logging host.\nThe value is a string of 1 to 255 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "brief",
            "Info": "Sends logs to a log host in brief mode.\n-"
        },
        {
            "Parameters": "domain <domain-name>",
            "Info": "Specifies the DNS domain name of a log host.\nThe value is a string of 1 to 255 case-sensitive characters without a blank space."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] info-center loghost 3.3.3.3 level critical",
            "[~HUAWEI] info-center loghost domain www.huawei.com level critical"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] info-center loghost domain www.huawei.com vpn-instance vrf1"
        ]
    ],
    "ExtraInfo": "To configure a device to output logs to a syslog server, run the info-center loghost command. The system logs information about device operations in real time. These logs can be output to the syslog servers for storage and query. If a problem occurs, you can check the logs to learn about what happened to the device during device operation and analyze fault causes.\nYou can choose whether to set brief as needed:"
}