{
    "PageTitle": "info-center statistic-suppress enable",
    "FuncDef": "The info-center statistic-suppress enable command enables the suppression of statistics about consecutive identical logs.\nThe undo info-center statistic-suppress enable command disables the suppression of statistics about consecutive identical logs. The info-center statistic-suppress enable command enables the suppression of statistics about consecutive identical logs. The undo info-center statistic-suppress enable command disables the suppression of statistics about consecutive identical logs. Suppressing the statistics about consecutive identical logs is enabled by default.",
    "CLIs": [
        "info-center statistic-suppress enable",
        "undo info-center statistic-suppress enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo info-center statistic-suppress enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] info-center statistic-suppress enable"
        ]
    ],
    "ExtraInfo": "Plenty of repeated logs may be generated in a short time in some scenarios, for example, when service features such as Address Resolution Protocol (ARP) are enabled. This wastes both the storage space and CPU resources, and users do not want to view these redundant logs.  To suppress statistics about consecutive identical logs without affecting other logs, run the info-center statistic-suppress enable command. The device outputs a log immediately after receiving it. If the information center receives repeatedly generated logs within a period, it outputs  only the number of these logs and will output log information only when it receives a new log (a log with a different log ID).\nFor example, if the sequence of logs generated by a module is A(T1) A(T2) A(T2) B(T3) B(T4) B(T4) C(T5) D(T6) A(T7) B(T8) B(T8) B(T8) B(T9) A(T9) B(T10) E(T11) A(T11) A(T12) A(T12) A(T13) A(T14) A(T15) A(T16) A(T17) A(T18) B(T18), the output is as follows (A, B, C, D, and E are different logs, and T1, T2, T3, ..., and Tn are serial numbers):\nT1:A\nT3: last message repeated 2 times\nT3: B\nT5: last message repeated 2 times\nT5:C\nT6:D\nT8:B\nT9: last message repeated 3 times\nT9:A\nT10:B\nT11:E\nT11:A\nT13: last message repeated 3 times\nT18: last message repeated 5 times\nT18:B\nThere are two methods to trigger the output of consecutive repeated logs:"
}