{
    "PageTitle": "auto-defend action",
    "FuncDef": "The auto-defend action command enables the punishment function of attack source tracing and specify the punishment action.\nThe undo auto-defend action command disables the punishment function of attack source tracing. The auto-defend action command enables the punishment function of attack source tracing and specify the punishment action. The undo auto-defend action command disables the punishment function of attack source tracing. By default, the attack source punish function is low-priority.",
    "CLIs": [
        "auto-defend action { deny [ timeout <timeout-num> ] | error-down }",
        "undo auto-defend action [ deny [ timeout <timeout-num> ] | error-down ]"
    ],
    "ParentView": [
        "Attack defense policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "deny",
            "Info": "Discards packets sent from an attack source.\n-"
        },
        {
            "Parameters": "timeout <timeout-num>",
            "Info": "Specifies the period during which packets sent from an identified attack source are discarded.\nThe value is an integer that ranges from 1 to 86400. The default value is 300,in second."
        },
        {
            "Parameters": "error-down",
            "Info": "Sets an interface that receives attack packets to the error-down state.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cpu-defend policy test",
            "[*HUAWEI-cpu-defend-policy-test] auto-defend enable",
            "[*HUAWEI-cpu-defend-policy-test] auto-defend action deny timeout 10"
        ]
    ],
    "ExtraInfo": "The attack source tracing process consists of four phases: packet parsing, traffic analysis, attack source identification, and taking attack source punish actions. The auto-defend action command is applied to taking attack source punish actions. The device discards the packets sent from the identified source or Error-Down the interface receiving attack packets.\nThe device records the status of an interface as Error-Down when it detects that a fault occurs. The interface in Error-Down state cannot receive or send packets and the interface indicator is off."
}