{
    "PageTitle": "cpu-defend dynamic-adjust enable",
    "FuncDef": "The cpu-defend dynamic-adjust enable command enables adaptive CPCAR adjustment for protocol packets.\nThe undo cpu-defend dynamic-adjust enable command disables adaptive CPCAR adjustment for protocol packets and restores the default CPCAR values of protocol packets. The cpu-defend dynamic-adjust enable command enables adaptive CPCAR adjustment for protocol packets. The undo cpu-defend dynamic-adjust enable command disables adaptive CPCAR adjustment for protocol packets and restores the default CPCAR values of protocol packets. By default, adaptive CPCAR adjustment for protocol packets is enabled.",
    "CLIs": [
        "cpu-defend dynamic-adjust [ packet-type { arp-reply | arp-request | arp-request-uc | dhcp-reply | dhcp-request | nd } ] enable",
        "undo cpu-defend dynamic-adjust [ packet-type { arp-reply | arp-request | arp-request-uc | dhcp-reply | dhcp-request | nd } ] enable",
        "cpu-defend dynamic-adjust [ packet-type { arp-reply | arp-request | arp-request-uc | dhcp-reply | dhcp-request } ] enable",
        "undo cpu-defend dynamic-adjust [ packet-type { arp-reply | arp-request | arp-request-uc | dhcp-reply | dhcp-request } ] enable",
        "cpu-defend dynamic-adjust [ packet-type { arp-reply | arp-request | arp-request-uc | dhcp-discovery | dhcp-reply | dhcp-request | nd } ] enable",
        "undo cpu-defend dynamic-adjust [ packet-type { arp-reply | arp-request | arp-request-uc | dhcp-discovery | dhcp-reply | dhcp-request | nd } ] enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "packet-type",
            "Info": "Specifies the packet type.\n-"
        },
        {
            "Parameters": "arp-reply",
            "Info": "Specifies ARP reply packets.\n-"
        },
        {
            "Parameters": "arp-request",
            "Info": "Specifies ARP request packets.\n-"
        },
        {
            "Parameters": "arp-request-uc",
            "Info": "Specifies unicast ARP request packets.\n-"
        },
        {
            "Parameters": "dhcp-discovery",
            "Info": "Specifies DHCP discovery packets.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.\n-"
        },
        {
            "Parameters": "dhcp-reply",
            "Info": "Specifies DHCP reply packets.\n-"
        },
        {
            "Parameters": "dhcp-request",
            "Info": "Specifies DHCP request packets.\n-"
        },
        {
            "Parameters": "nd",
            "Info": "Specifies the ND packets.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cpu-defend dynamic-adjust packet-type arp-request enable"
        ]
    ],
    "ExtraInfo": "If the fixed default CPCAR value cannot meet the dynamic requirements on the rate at which protocol packets are sent, you can run this command to enable the switch to dynamically adjust the default CPCAR value for protocol packets.\nIf adaptive adjustment of the default CPCAR value is enabled for a specific type of protocol packets, the device checks for packet loss of such protocol packets at a specified interval. When detecting a packet loss, the device dynamically adjusts the CPCAR value for the protocol packets based on the CPU usage. When the CPU usage is lower than 50%, increase the CPCAR value. The adjusted CPCAR value cannot exceed the maximum CPCAR value. When the CPU usage is higher than 68%, decrease the CPCAR value. The adjusted CPCAR value cannot be smaller than the default value. If packet loss occurs due to congestion in the queue where the detected protocol packets reside, the device restores the default CPCAR value for the protocol packets. You can run the display cpu-defend dynamic-adjust history-record command to view records of dynamic CPCAR adjustment.\nThe following table lists the types of protocol packets for which CPCAR values can be dynamically adjusted and the maximum CPCAR values after adjustment."
}