{
    "PageTitle": "cpu-defend host-car",
    "FuncDef": "The cpu-defend host-car command specifies the types of packets to be limited in user-level rate limiting.\nThe undo cpu-defend host-car command deletes the configuration. The cpu-defend host-car command specifies the types of packets to be limited in user-level rate limiting. The undo cpu-defend host-car command deletes the configuration. By default, user-level rate limiting can apply to ARP, ND, DHCP Request, and DHCPv6 Request packets. For the CE6885-LL in low latency mode, by default, user-level rate limiting can apply to ARP and DHCP Request packets.",
    "CLIs": [
        "cpu-defend host-car { { arp | dhcp-request | dhcpv6-request | nd } | all }",
        "undo cpu-defend host-car { { arp | dhcp-request | dhcpv6-request | nd } }",
        "cpu-defend host-car { { arp | dhcp-request } | all }",
        "undo cpu-defend host-car { { arp | dhcp-request } }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "arp",
            "Info": "Applies user-level rate limiting to ARP packets.\n-"
        },
        {
            "Parameters": "dhcp-request",
            "Info": "Applies user-level rate limiting to DHCP Request packets.\n-"
        },
        {
            "Parameters": "dhcpv6-request",
            "Info": "Applies user-level rate limiting to DHCPv6 Request packets.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "nd",
            "Info": "Applies user-level rate limiting to ND packets.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Applies all user-level rate limiting packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cpu-defend host-car enable",
            "[~HUAWEI] cpu-defend host-car arp dhcp-request nd"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cpu-defend host-car enable",
            "[~HUAWEI] cpu-defend host-car arp dhcp-request"
        ]
    ],
    "ExtraInfo": "After user-level rate limiting is enabled, the device limits the rate of ARP, ND, DHCP Request, and DHCPv6 Request packets based on user MAC addresses by default. If the number of the preceding types of packets received by the device from the same source MAC address exceeds the rate limit, the device discards the excess packets. To limit the rate of some types of packets, run this command to configure the types of packets for which user-level rate limiting is performed."
}