{
    "PageTitle": "display cpu-defend configuration",
    "FuncDef": "The display cpu-defend configuration command displays CAR configurations. The display cpu-defend configuration command displays CAR configurations.",
    "CLIs": [
        "display cpu-defend configuration [ packet-type <packet-type> ] { all | slot <slot-id> }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "packet-type <packet-type>",
            "Info": "Displays the configuration of rate limiting for packets of a specified type.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value can be acl-logging, arn, arn-logging, arp-miss, arp-mlagpeer, arp-reply, arp-request, arp-request-uc, bfd, bgp, bgp4plus, bgp4plus-overlay, bgp-overlay, buffer-drop, cdp, dhcp-reply, dhcp-request, dhcpv6-discovery, dhcpv6-reply, dhcpv6-request, dldp, dns-reply, dpfr-downlink-outbound, dpfr-notification, dpfr-uplink-sampling, fib-hit, fib-miss, ftp, gre-keepalive, headroom-detect, hw-tacacs, icmp, icmpv6, ifit, igmp, inof-rpfr, ipv4-multicast-registration, ip-option, isis, isis-overlay, lacp, ldap, lldp, macsec, mld, mtu, m-lag, m-lag-heart, m-lag-sync, nd, nd-dad, nd-mlagpeer, netstream, ntp, ospf, ospf-hello, ospf-hello-overlay, ospf-overlay, ospfv3, ospfv3-overlay, pim, pimv6, pimv6-mc, pim-mc, ptp-1588, ptp-ann-change, ptp-ann-timeout, radius, rip, ripng, rip-terminated, sampling, scnp, snmp, ssh, ssm, stp, tcp, telnet, ttl-expired, udp, unknown-multicast, vbst, vrrp, vrrp6 or vxlan-detect.\nThe macsec parameter is supported only after the MACsec feature package is installed on the device.\n\nFor the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM:The value can be acl-logging, any-flow, arn, arn-logging, arp-miss, arp-mlagpeer, arp-reply, arp-request, arp-request-uc, bfd, bgp, bgp4plus, bgp4plus-overlay, bgp-overlay, buffer-drop, cdp, cnp, dhcp-reply, dhcp-request, dhcpv6-discovery, dhcpv6-reply, dhcpv6-request, dldp, dns-reply, fib-hit, fib-miss, forward-drop, ftp, gre-keepalive, headroom-detect, hw-tacacs, icmp, icmpv6, igmp, inof-rpfr, ioam, ipv4-multicast-registration, ip-option, iqcn-sync, isis, isis-overlay, lacp, latency, ldap, lldp, macsec, mld, mtu, m-lag, m-lag-heart, m-lag-sync, nd, nd-dad, nd-mlagpeer, netstream, npcc-roce, ntp, ospf, ospf-hello, ospf-hello-overlay, ospf-overlay, ospfv3, ospfv3-overlay, pim, pimv6, pimv6-mc, pim-mc, ptp-1588, ptp-ann-change, ptp-ann-timeout, radius, rip, ripng, rip-terminated, sampling, scnp, snmp, ssh, ssm, stp, tcp, telnet, traffic-analysis, ttl-expired, udp, unknown-multicast, vbst, vrrp, vrrp6 or vxlan-detect.\nThe macsec parameter is supported only after the MACsec feature package is installed on the device.\n\nFor the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S:The value can be 8021x, 8021x-ident, 8021x-start, acl-logging, arp-miss, arp-malgpeer, arp-reply, arp-request, arp-request-uc, bfd, bgp, bgp4plus, bgp4plus-overlay, bgp-overlay, buffer-drop, cdp, dhcp-discovery, dhcp-reply, dhcp-request, dhcpv6-discovery, dhcpv6-reply, dhcpv6-request, dldp, dns-reply, erps, fib-hit, fib-miss, forward-drop, ftp, gre-keepalive, headroom-detect, hw-tacacs, icmp, icmpv6, igmp, ipv4-multicast-registration, ip-option, isis, isis-overlay, l2pt, lacp, ldap, lldp, mac-miss, mice-elephant-flow, mice-elephant-flow-statistics, mld, m-lag, m-lag-heart, m-lag-sync, mtu, nac-arp-reply, nac-arp-request, nac-dhcp, nac-dhcpv6, nac-nd, nd, nd-dad, nd-miss, nd-mlagpeer, ntp, ospf, ospf-hello, ospf-hello-overlay, ospf-overlay, ospfv3, ospfv3-overlay, pim, pim-mc, ptp-ann-change, ptp-ann-timeout, pimv6, pimv6-mc, radius, rip, ripng, rip-terminated, said-ping, smart-link, snmp, ssh, stp, tcp, telnet, ttl-expired, udp, unknown-multicast, vbst, vrrp, vrrp6 or vxlan-detect.\nFor the CE6885-LL (low latency mode):The value can be acl-logging, arn, arn-logging, arp-miss, arp-mlagpeer, arp-reply, arp-request, arp-request-uc, bfd, bgp, buffer-drop, cdp, dhcp-reply, dhcp-request, dldp, dns-reply, fib-hit, fib-miss, ftp, hw-tacacs, icmp, igmp, ipv4-multicast-registration, ip-option, isis, lacp, ldap, lldp, mac-learning, m-lag, m-lag-heart, m-lag-sync, netstream, ntp, ospf, pim, pim-mc, ptp-1588, ptp-ann-change, ptp-ann-timeout, radius, rip, sampling, scnp, snmp, ssh, ssm, stp, tcp, telnet, traffic-analysis, ttl-expired, udp, unknown-multicast, vbst or vrrp."
        },
        {
            "Parameters": "all",
            "Info": "Displays CAR configurations of all slots.\n-"
        },
        {
            "Parameters": "slot <slot-id>",
            "Info": "Displays CAR configurations of a specified slot.\nThe value must be set according to the device configuration."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display cpu-defend configuration all"
        ]
    ],
    "ExtraInfo": ""
}