{
    "PageTitle": "linkup-car",
    "FuncDef": "The linkup-car command sets the CPCAR value for packets of a protocol connection.\nThe undo linkup-car command restores the default CPCAR rate limit. The linkup-car command sets the CPCAR value for packets of a protocol connection. The undo linkup-car command restores the default CPCAR rate limit. By default, the CAR for M-LAG connections is 1024 pps, that for M-LAG-SYNC connections is 2048 pps, and that for connections of other protocols is 1536 pps.",
    "CLIs": [
        "linkup-car packet-type { bgp | bgp4plus | ftp | isis | m-lag | m-lag-sync | ospf | ospfv3 | ssh | telnet | tftp } pps <pps-value>",
        "undo linkup-car packet-type { bgp | bgp4plus | ftp | isis | m-lag | m-lag-sync | ospf | ospfv3 | ssh | telnet | tftp }",
        "linkup-car packet-type { bgp | ftp | isis | m-lag | m-lag-sync | ospf | ssh | telnet | tftp } pps <pps-value>",
        "undo linkup-car packet-type { bgp | ftp | isis | m-lag | m-lag-sync | ospf | ssh | telnet | tftp }"
    ],
    "ParentView": [
        "Attack defense policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "bgp",
            "Info": "Indicates that the protocol type is BGP.\n-"
        },
        {
            "Parameters": "bgp4plus",
            "Info": "Indicates that the protocol type is BGP4+.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "ftp",
            "Info": "Indicates that the protocol type is FTP.\n-"
        },
        {
            "Parameters": "isis",
            "Info": "Indicates that the protocol type is ISIS.\n-"
        },
        {
            "Parameters": "ssh",
            "Info": "Indicates the protocol type is SSH.\n-"
        },
        {
            "Parameters": "telnet",
            "Info": "Indicates the protocol type is TELNET.\n-"
        },
        {
            "Parameters": "tftp",
            "Info": "Indicates the protocol type is TFTP.\n-"
        },
        {
            "Parameters": "pps <pps-value>",
            "Info": "Specifies the CAR value. The value is an integer that ranges from 64 to 10000, in pps.\nThe value is an integer ranging from 64 to 10000. The default value is 1024 for M-LAG packets, 2048 for M-LAG synchronization packets, and 1536 for other packets."
        },
        {
            "Parameters": "packet-type",
            "Info": "Indicates the protocol type.\n-"
        },
        {
            "Parameters": "ospf",
            "Info": "Indicates the protocol type is OSPF.\n-"
        },
        {
            "Parameters": "ospfv3",
            "Info": "Indicates the protocol type is OSPFv3.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "m-lag",
            "Info": "Indicates that the protocol type is M-LAG.\n-"
        },
        {
            "Parameters": "m-lag-sync",
            "Info": "Indicates that the protocol type is M-LAG-SYNC.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cpu-defend policy test",
            "[*HUAWEI-cpu-defend-policy-test] linkup-car packet-type ftp pps 5000"
        ]
    ],
    "ExtraInfo": "The default CPCAR value of protocol is small. When a switch uses these protocols to transfer files or set up connections with other hosts or devices, the number of protocol packets sharply increases in a short period. When the packet rate exceeds the limit, the protocol packets are dropped. The switch may also undergo attacks of other protocols. This affects data transmission and causes service interruption.\nYou can run the cpu-defend application-apperceive command to enable active link protection, ensuring normal operation of these protocols related services when attacks occur. When a connection is set up, the switch sends packets at the rate of the CPCAR value configured using the linkup-car command. The CPCAR value can be set as required."
}