{
    "PageTitle": "display msdp invalid-packet",
    "FuncDef": "The display msdp invalid-packet command displays statistics about received invalid Multicast Source Discovery Protocol (MSDP) messages and details about these messages. The display msdp invalid-packet command displays statistics about received invalid Multicast Source Discovery Protocol (MSDP) messages and details about these messages.",
    "CLIs": [
        "display msdp invalid-packet [ message-type { keepalive | notification | sa-request | sa-response | source-active } | peer <peer-address> ]",
        "display msdp { all-instance | vpn-instance <vpn-instance-name> } invalid-packet [ message-type { keepalive | notification | sa-request | sa-response | source-active } | peer <peer-address> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "message-type",
            "Info": "Displays statistics about invalid messages of a specified type.\n-"
        },
        {
            "Parameters": "keepalive",
            "Info": "Displays statistics about received invalid Keepalive messages.\n-"
        },
        {
            "Parameters": "notification",
            "Info": "Displays statistics about invalid Notification messages.\n-"
        },
        {
            "Parameters": "sa-request",
            "Info": "Displays statistics about received invalid Source-Active Request messages.\n-"
        },
        {
            "Parameters": "sa-response",
            "Info": "Displays statistics about received invalid Source-Active Response messages.\n-"
        },
        {
            "Parameters": "source-active",
            "Info": "Displays statistics about received invalid Source-Active messages.\n-"
        },
        {
            "Parameters": "peer <peer-address>",
            "Info": "Displays statistics about invalid MSDP messages received from a specified peer. peer-address specifies an MSDP peer address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "all-instance",
            "Info": "Displays statistics about received invalid MSDP messages in all instances.\n-"
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Displays statistics about received invalid MSDP messages in a specified VPN instance.\nvpn-instance-name specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The VPN instance name \"_public_\" cannot be used. The string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display msdp invalid-packet peer 1.1.1.1"
        ]
    ],
    "ExtraInfo": ""
}