{
    "PageTitle": "peer sa-policy import",
    "FuncDef": "The peer sa-policy import command configures a policy for filtering (S, G) information in source active (SA) messages to be received from a specified Multicast Source Discovery Protocol (MSDP) peer.\nThe undo peer sa-policy import command restores the default configuration. The peer sa-policy import command configures a policy for filtering (S, G) information in source active (SA) messages to be received from a specified Multicast Source Discovery Protocol (MSDP) peer. The undo peer sa-policy import command restores the default configuration. By default, (S, G) information in SA messages is not filtered, so that all (S, G) entry information can be received from an MSDP peer.",
    "CLIs": [
        "peer <peer-address> sa-policyimport { <advanced-acl-number> | acl-name <acl-name> }",
        "peer <peer-address> sa-policyimport",
        "undo peer <peer-address> sa-policyimport"
    ],
    "ParentView": [
        "VPN instance MSDP view,MSDP view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "<peer-address>",
            "Info": "Specifies the address of an MSDP peer.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "<advanced-acl-number>",
            "Info": "Specifies the number of an advanced ACL.\nThe value is an integer that ranges from 3000 to 3999. If this parameter is not specified, all the SA messages that carry (S, G) entries are filtered out."
        },
        {
            "Parameters": "acl-name <acl-name>",
            "Info": "Specifies the name of a named ACL.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported. The value must start with a letter (a to z or A to Z, case sensitive)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl number 3100",
            "[*HUAWEI-acl4-advance-3100] rule permit ip source 10.15.0.0 0.0.255.255 destination 225.1.0.0 0.0.255.255",
            "[*HUAWEI-acl4-advance-3100] quit",
            "[*HUAWEI] multicast routing-enable",
            "[*HUAWEI] msdp",
            "[*HUAWEI-msdp] peer 10.10.7.6 connect-interface Vlanif 1",
            "[*HUAWEI-msdp] peer 10.10.7.6 sa-policy import 3100"
        ]
    ],
    "ExtraInfo": "To filter (S, G) information in SA messages to be received from or forwarded to a specified MSDP peer, run the peer sa-policy import command, implementing control over the receiving of multicast source information.\nIn addition, you can run the import-source command on an MSDP peer to specify (S, G) information that can be advertised by SA messages."
}