{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "parser config partition",
    "FuncDef": [
        "To enable configuration partitioning, use the **parser config partition** command. To disable the partitioning of the running configuration, use the **no** form of thiscommand. "
    ],
    "CLIs": [
        "parser config partition",
        "no parser config partition"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "The following example shows how to disable partitioning of the system running configuration:",
            "```",
            "Router> enable",
            "```",
            "```",
            "Router# config t",
            "```",
            "```",
            "Enter configuration commands, one per line. End with CNTL/Z.",
            "```",
            "```",
            "```",
            "```",
            "Router(config)# no parser config partition",
            "```",
            "```",
            "System configured",
            "```"
        ]
    ],
    "ExtraInfo": "This command controls (enables or disables) the Configuration Partitioning feature.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)This command is not related to disk partitions or disk partitioning.---To display the list of commands that make up the current running configuration for a specific part (\"partition\") of the system's global running configuration, use the **show running-config partition** command in privileged Exec mode.The Configuration Partitioning feature uses a small amount of system resources. The **no parser config partition** command allows you to disable this feature if the feature is not needed on your system.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)Only the **no** form of this command will appear in configuration files. To determine if config partitioning is supported on your system and whether it is enabled, use the **show running-config parser ?** command.---",
    "RelatedCmds": [
        {
            "cmd": " **show running-config partition** ",
            "description": " Displays the list of commands that make up the current running configuration for a specific part of the system's global running configuration. When used with the **?** CLI help keyword, can also be used to determine the availability and status of the Configuration Partitioning feature. "
        }
    ]
}