{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "parser cache",
    "FuncDef": [
        "To reenable the Cisco IOS software parser cache after disabling it, use the **parser cache** command in global configuration mode. To disable the parser cache, use the **no** form of this command. "
    ],
    "CLIs": [
        "parser cache",
        "no parser cache"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "In the following example, the Cisco IOS software Parser Cache feature is disabled:",
            "```",
            "Router(config)# no parser cache",
            "```"
        ]
    ],
    "ExtraInfo": "The Parser Cache feature optimizes the parsing (translation and execution) of Cisco IOS software configuration command lines by remembering how to parse recently encountered command lines, decreasing the time required to process large configuration files.The parser cache is enabled by default. However, if you wish to disable the parser cache, you may do so using the **no parser cache** command in global configuration mode. To reenable the parser cache after it has been disabled, use the **parser cache** command.When the **no parser cache** is issued, the command line appears in the running configuration file. However, if the parser cache is reenabled, no command line appears in the running configuration file.",
    "RelatedCmds": [
        {
            "cmd": " **clear parser cache** ",
            "description": " Clears the parse cache entries and hit/miss statistics stored for the Parser Cache feature. "
        },
        {
            "cmd": " **show parser statistics** ",
            "description": " Displays statistics about the last configuration file parsed and the status of the Parser Cache feature. "
        }
    ]
}