{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "file verify auto",
    "FuncDef": [
        "To enable automatic image verification, use the **file verify auto** command in global configuration mode. To disable automatic image verification, use the **no** form of this command. "
    ],
    "CLIs": [
        "file verify auto",
        "no file verify auto"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "The following example shows how to enable automatic image verification:",
            "```",
            "Router(config)# file verify auto",
            "```"
        ]
    ],
    "ExtraInfo": "Image verification is accomplished by verifying the compressed Cisco IOS image checksum.Image verification allows users to automatically verify the integrity of all Cisco IOS images. Thus, users can be sure that the image is protected from accidental corruption, which can occur at any time during transit, starting from the moment the files are generated by Cisco until they reach the user.The **file verify auto** command enables image verification globally; that is, all images that are to be copied (via the **copy** command) or reloaded (via the **reload** command) are automatically verified. Although both the **copy** and **reload** commands have a **/verify** keyword that enables image verification, you must issue the keyword each time you want to copy or reload an image. The **file verify auto** command enables image verification by default so you no longer have to specify image verification multiple times.If you have enabled image verification by default but prefer to disable verification for a specific image copy or reload, the **/noverify** keyword along with either the **copy** or the **reload** command will override the **file verify auto** command.",
    "RelatedCmds": [
        {
            "cmd": " **copy** ",
            "description": " Copies any file from a source to a destination. "
        },
        {
            "cmd": " **copy/noverify** ",
            "description": " Disables the automatic image verification for the current copy operation. "
        },
        {
            "cmd": " reload ",
            "description": " Reloads the operating system. "
        },
        {
            "cmd": " **verify** ",
            "description": " Verifies the checksum of a file on a Flash memory file system or computes an MD5 signature for a file. "
        }
    ]
}