{
    "PageTitle": "bandwidth",
    "FuncDef": "The bandwidth command sets configuration bandwidth for an interface.\nThe undo bandwidth command cancels the configuration bandwidth set for an interface. The bandwidth command sets configuration bandwidth for an interface. The undo bandwidth command cancels the configuration bandwidth set for an interface. By default, no configuration bandwidth is set for an interface.",
    "CLIs": [
        "bandwidth <bandwidth>",
        "undo bandwidth"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,100ge sub-interface view,100GE interface view,Layer 2 10GE interface view,10GE sub-interface view,10GE interface view,Layer 2 200GE interface view,200GE sub-interface view,200GE interface view,25GE-L2 view,25GE sub-interface view,25GE interface view,400GE-L2 view,400GE sub-interface view,400GE interface view,Layer 2 50GE interface view,50GE sub-interface view,50GE interface view,Layer 2 Eth-Trunk interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,Layer 2 GE interface view,Tunnel interface view,Sub-interface view,Management interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<bandwidth>",
            "Info": "Specifies configuration bandwidth for an interface. The bandwidth configured using this command is the expected bandwidth of an interface and does not directly affect traffic forwarding on the device. The bandwidth is generally used for traffic statistics collection on the NMS or route calculation using routing protocols.\nThe value is an integer ranging from 1 to 1000000, and the default unit is Mbit/s."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] bandwidth 10000"
        ]
    ],
    "ExtraInfo": "The interface bandwidth can be classified into physical bandwidth and configuration bandwidth. This command is used to set the configuration bandwidth of an interface without changing the physical bandwidth of the interface. The NMS can view the configuration through the ifSpeed and ifHighSpeed objects in IF-MIB."
}