{
    "PageTitle": "display interface description",
    "FuncDef": "The display interface description command displays the description of the interfaces on a device. The display interface description command displays the description of the interfaces on a device.",
    "CLIs": [
        "display interface description [ <interface-name> | <interface-type> [ <interface-number> ] | slot <slot-id> [ card <card-number> ] ] [ full-name ]",
        "display interface description [ <interface-type> | slot <slot-id> [ card <card-number> ] ] [ full-name ] main"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-name>",
            "Info": "Displays the description of a specified interface.\n-"
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an interface.\nIf no interface type is specified, the description of all interfaces is displayed.\nThe value is of the enumerated type."
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of an interface.\nIf an interface type is specified but no interface number is specified, the description of all interfaces of this type is displayed.\n-"
        },
        {
            "Parameters": "slot <slot-id>",
            "Info": "Specifies the slot number.\nIf no slot number is specified, the description of all slots is displayed.\nThe value is a string of 1 to 23 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "card <card-number>",
            "Info": "Specifies the subcard number.\nIf a slot ID is specified but no interface number is specified, the description of the interfaces on all the subcards in the specified slot is displayed.\n-"
        },
        {
            "Parameters": "full-name",
            "Info": "Indicates the full name of an interface.\n-"
        },
        {
            "Parameters": "main",
            "Info": "Displays the description of a main interface not a sub-interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display interface description 100GE"
        ],
        [
            "<HUAWEI> display interface description 100GE 1/0/1"
        ],
        [
            "<HUAWEI> display interface description"
        ]
    ],
    "ExtraInfo": "For simplifying interface management, run the description command to record the use of each interface. In the case of many interfaces, run the display interface description command to view the description of these interfaces.\nIf the interface is Down, check whether the link connection is correct or whether interface negotiation succeeds."
}