{
    "PageTitle": "display ip interface brief",
    "FuncDef": "The display ip interface brief command displays brief interface IP configurations, including the IP address, mask, status of the physical link and protocol, and interface description.\nIf no parameter is specified, brief IP configurations of all interfaces are displayed. The display ip interface brief command displays brief interface IP configurations, including the IP address, mask, status of the physical link and protocol, and interface description. If no parameter is specified, brief IP configurations of all interfaces are displayed.",
    "CLIs": [
        "display ip interface brief [ <interface-type> <interface-number> | slot <slot-number> [ card <card-number> ] ]",
        "display ip interface brief <interface-type>",
        "display ip interface brief ip-configured [ except <interface-type> ]",
        "display ip interface brief <interface-name>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-type>",
            "Info": "Displays brief IP configurations of a specified type of interface.\nIf no interface type is specified, the system displays IP configurations of and statistics on all interfaces.\nThe value is of the enumerated type."
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Displays brief IP configurations of a specified interface.\nifNum and ifType define an interface. If an interface type is specified but no interface number is specified, statistics on and IP configurations of all the interfaces of the specified type are displayed.\n-"
        },
        {
            "Parameters": "slot <slot-number>",
            "Info": "Displays the IP configuration and statistics of interfaces on the specified slot.\nIf the slot number is not specified, brief IP configurations of the interfaces on all interface boards and main control boards are displayed.\n-"
        },
        {
            "Parameters": "card <card-number>",
            "Info": "Displays the IP configuration and statistics of interfaces on the specified slot.\nIf the slot number is not specified, brief IP configurations of the interfaces on all interface boards and main control boards are displayed.\n-"
        },
        {
            "Parameters": "ip-configured",
            "Info": "Displays the IP configuration of interfaces assigned IP addresses.\n-"
        },
        {
            "Parameters": "except",
            "Info": "Displays the IP configuration of interfaces, excluding the interfaces of the specified type.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Displays brief IP-related information about a specified interface.\nIf no interface is specified, IP-related configurations and statistics on all interfaces are displayed.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ip interface brief"
        ]
    ],
    "ExtraInfo": "To view the physical status, protocol status, and IP address of an interface, run the display ip interface brief command. The obtained information about interface status and configurations helps you diagnose interface faults."
}