{
    "PageTitle": "display ipv6 interface",
    "FuncDef": "The display ipv6 interface command displays IPv6 information about an interface.\nThe display ipv6 interface description command displays brief information on and descriptions of IPv6-related interfaces. The display ipv6 interface command displays IPv6 information about an interface. The display ipv6 interface description command displays brief information on and descriptions of IPv6-related interfaces. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display ipv6 interface [ <interface-name> | <interface-type> <interface-number> ]",
        "display ipv6 interface description [ <interface-name> | <interface-type> [ <interface-number> ] | slot <slot-number> [ card <card-number> ] ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the interface name. If no interface name is specified, the command displays brief information on and descriptions of all IPv6-related interfaces.\n-"
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the interface type. If no interface type is specified, the command displays brief information on and descriptions of all IPv6-related interfaces.\nThe value is of the enumerated type."
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the interface number, which is used with interface-type to identify an interface. If no interface number is specified, the command displays brief information on and descriptions of all IPv6-related interfaces of the specified interface type.\n-"
        },
        {
            "Parameters": "slot <slot-number>",
            "Info": "Specifies the slot number. If this parameter is not specified, the command displays brief information and descriptions of all IPv6-related interfaces.\n-"
        },
        {
            "Parameters": "card <card-number>",
            "Info": "Specifies the interface subcard number. If no interface subcard number is specified, the command displays brief information on and descriptions of all IPv6-related interfaces on the specified slot.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ipv6 interface description",
            "[IPv6 Address/Prefix Length] 2001:db8:3c4d::/48"
        ],
        [
            "<HUAWEI> display ipv6 interface Vlanif 1"
        ],
        [
            "<HUAWEI> display ipv6 interface 100GE 1/0/8"
        ]
    ],
    "ExtraInfo": "If an interface is assigned an IPv6 address, run the display ipv6 interface command to view the IPv6 status and configuration on this interface.\nTo view brief information on and descriptions of IPv6-related interfaces, run the display ipv6 interface description command."
}