{
    "PageTitle": "display ip interface description",
    "FuncDef": "The display ip interface description command displays brief information on and descriptions of IP-related interfaces.\nIf no parameter is specified, brief IP configurations of all interfaces are displayed. The display ip interface description command displays brief information on and descriptions of IP-related interfaces. If no parameter is specified, brief IP configurations of all interfaces are displayed.",
    "CLIs": [
        "display ip interface description [ <interface-type> <interface-number> | slot <slot-number> [ card <card-number> ] ]",
        "display ip interface description <interface-type>",
        "display ip interface description ip-configured [ except <interface-type> ]",
        "display ip interface description <interface-name>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-type>",
            "Info": "Displays IP description configurations of a specified type of interface.\nIf no interface type is specified, the system displays IP configurations of and statistics on all interfaces.\nThe value is of the enumerated type."
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Displays IP description configurations of a specified interface.\nifNum and ifType define an interface. If an interface type is specified but no interface number is specified, statistics on and IP description configurations of all the interfaces of the specified type are displayed.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "slot <slot-number>",
            "Info": "Displays the IP configuration and statistics of interfaces on the specified slot.\nIf the slot number is not specified, description IP configurations of the interfaces on all interface boards and main control boards are displayed.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "card <card-number>",
            "Info": "Displays the IP configuration and statistics of interfaces on the specified slot.\nIf the slot number is not specified, description IP configurations of the interfaces on all interface boards and main control boards are displayed.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "ip-configured",
            "Info": "Displays the IP configuration of interfaces assigned IP addresses.\n-"
        },
        {
            "Parameters": "except",
            "Info": "Displays the IP configuration of interfaces, excluding the interfaces of the specified type.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ip interface description"
        ]
    ],
    "ExtraInfo": "To view brief information on and descriptions of IP-related interfaces, run the display ip interface description command."
}