{
    "PageTitle": "display interface",
    "FuncDef": "The display interface command displays the running status of and traffic statistics on an interface. The display interface command displays the running status of and traffic statistics on an interface.",
    "CLIs": [
        "display interface [ <interface-type> [ <interface-number> ] | slot <slot-number> ]",
        "display interface <interface-name>",
        "display interface main",
        "display interface <interface-type> main"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an interface.\nIf no interface type is specified, the description of all interfaces is displayed.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of an interface.\nIf an interface type is specified but no interface number is specified, the description of all interfaces of this type is displayed.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "slot <slot-number>",
            "Info": "Specifies the slot number.\nIf no slot number is specified, the description of all slots is displayed.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Displays the description of a specified interface.\n-"
        },
        {
            "Parameters": "main",
            "Info": "Displays the running status of and traffic statistics on an interface.\nIf an interface has no Layer 2 or Layer 3 sub-interfaces, the status of and traffic statistics on the interface are displayed whether you specify this parameter or not.If an interface has Layer 2 or Layer 3 sub-interfaces, the status of and traffic statistics on the interface and its Layer 2 or Layer 3 sub-interfaces are displayed if you do not specify this parameter.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display interface 100ge1/0/1.1"
        ],
        [
            "<HUAWEI> display interface main"
        ],
        [
            "<HUAWEI> display interface 10GE 1/0/1"
        ],
        [
            "<HUAWEI> display  interface Eth-Trunk 11"
        ]
    ],
    "ExtraInfo": "Before you monitor the status of an interface or locate an interface fault, use the display interface command to collect the running status of and statistics on the interface. You can troubleshoot the interface based on the command output.\nPerform any of following operations based on the interface status and statistics:"
}