{
    "PageTitle": "ipv6 mtu",
    "FuncDef": "The ipv6 mtu command sets the maximum transfer unit (MTU) value for an interface to send IPv6 packets.\nThe undo ipv6 mtu command restores the default MTU value for an interface to send IPv6 packets. The ipv6 mtu command sets the maximum transfer unit (MTU) value for an interface to send IPv6 packets. The undo ipv6 mtu command restores the default MTU value for an interface to send IPv6 packets. The default MTU value varies according to the hardware and interface. For details, see the parameter description field. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 mtu <mtu>",
        "undo ipv6 mtu"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,Tunnel interface view,VBDIF interface view,VLANIF interface view,Management interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<mtu>",
            "Info": "Specifies the MTU for an interface to send IPv6 packets.\nThe value is an integer. The value ranges and default values of common interfaces are as follows:\nEthernet interface and its sub-interface: The value is an integer ranging from 1280 to 9600, in bytes. The default value is 1500.Tunnel interface: The value is an integer ranging from 1280 to 9600, in bytes. The default value is 1500.Eth-Trunk interface and its sub-interfaces: The value is an integer ranging from 1280 to 9600, in bytes. The default value is 1500.VBDIF interface: The value is an integer ranging from 1280 to 9600, in bytes. The default value is 1500.VLANIF interface: The value is an integer ranging from 1280 to 9600, in bytes. The default value is 1500.\nThe preceding values are for reference only. The value ranges and default values vary according to hardware and interfaces. The supported interface types, value ranges, and default values depend on the actual device."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] undo portswitch",
            "[*HUAWEI-Eth-Trunk1] ipv6 enable",
            "[*HUAWEI-Eth-Trunk1] ipv6 mtu 1400"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] ipv6 mtu 1400"
        ]
    ],
    "ExtraInfo": "If the traffic capability on a link between the source and destination ends changes, this ipv6 mtu command is used to set the MTU value for sending IPv6 packets. If the packet length is greater than the IPv6 MTU of the interface, the system fragments the packet based on the set MTU value before forwarding the packet."
}