{
    "PageTitle": "monitor interface counters",
    "FuncDef": "The monitor interface counters command enables a device to monitor traffic statistics on an interface. The monitor interface counters command enables a device to monitor traffic statistics on an interface.",
    "CLIs": [
        "monitor interface counters [ rate ] { <interface-name> | <interface-type> <interface-number> } [ [ interval <interval-value> ] [ times { <times-value> | infinity } ] | [ times { <times-value> | infinity } ] [ interval <interval-value> ] ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "rate",
            "Info": "Displays the traffic rate on an interface. If rate is not specified, the number of packets on an interface is displayed.\nThis parameter is supported only on an interface whose physical status is Up.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of an interface.\n-"
        },
        {
            "Parameters": "<interface-type> <interface-number>",
            "Info": "Specifies the type and number of an interface.\n-"
        },
        {
            "Parameters": "interval <interval-value>",
            "Info": "Specifies the interval at which the running status and traffic statistics of an interface are monitored.\nThe value is an integer ranging from 2 to 600, in seconds. The default value is 10."
        },
        {
            "Parameters": "times <times-value>",
            "Info": "Specifies the number of times that the running status and traffic statistics of an interface are monitored.\nThe value is an integer ranging from 1 to 999. The default value is 5."
        },
        {
            "Parameters": "infinity",
            "Info": "Monitors the running status and traffic statistics of an interface for indefinite times. To stop the statistics display, press Ctrl+C.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> monitor interface counters 100GE 1/0/1 interval 3 times 2"
        ],
        [
            "<HUAWEI> monitor interface counters rate 100GE 1/0/1 interval 3 times 2"
        ]
    ],
    "ExtraInfo": "To view real-time traffic statistics on an interface, run the monitor counters interface command to enable a device to monitor traffic statistics on the interface at a specified interval and display the statistics in real time. The traffic statistics include the number of unicast, multicast, and broadcast packets sent or received by the interface and the packet transmission rate. The number of such packets is counted in the period from the last time when the interface statistics were cleared using the reset interface counters command to this time the monitor counters interface command is run.\nBy default, once this command is run, the system displays real-time traffic statistics at an interval of 10s for five times. To stop the statistics display, press Ctrl+C."
}