{
    "PageTitle": "arp broadcast-suppress mismatch-discard enable",
    "FuncDef": "The arp broadcast-suppress mismatch-discard enable command enables ARP broadcast suppression in a BD. This function allows a gateway to unicast the ARP broadcast packets received in a BD, preventing network congestion.\nThe undo arp broadcast-suppress mismatch-discard enable command disables ARP broadcast suppression in a BD. The arp broadcast-suppress mismatch-discard enable command enables ARP broadcast suppression in a BD. This function allows a gateway to unicast the ARP broadcast packets received in a BD, preventing network congestion. The undo arp broadcast-suppress mismatch-discard enable command disables ARP broadcast suppression in a BD. By default, ARP broadcast suppression is disabled in a BD. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "arp broadcast-suppress mismatch-discard enable",
        "undo arp broadcast-suppress mismatch-discard enable"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "mismatch-discard",
            "Info": "Indicates that the device drops packets that do not match any entries in the ARP broadcast suppression table.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 20",
            "[*HUAWEI-bd20] arp broadcast-suppress mismatch-discard enable"
        ]
    ],
    "ExtraInfo": "If a gateway receives a large number of ARP requests within a short period and broadcasts the ARP requests in a BD, excessive ARP requests are forwarded. As a result, excessive network resources are used, and traffic congestion may occur. ARP broadcast suppression can effectively ease the pressure on gateways in handling ARP packets.\nARP broadcast suppression can effectively ease the pressure on gateways in handling ARP packets. After receiving an ARP request, a gateway searches the broadcast suppression table that contains the mapping between the IP and MAC addresses of each destination device."
}