{
    "PageTitle": "authentication trigger-condition (802.1X access profile view)",
    "FuncDef": "The authentication trigger-condition command configures the packet types that can trigger 802.1X authentication.\nThe undo authentication trigger-condition command restores the default configuration. The authentication trigger-condition command configures the packet types that can trigger 802.1X authentication. The undo authentication trigger-condition command restores the default configuration. By default, DHCP, ARP, DHCPv6, and ND packets can trigger 802.1X authentication. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "authentication trigger-condition { dhcp | arp | dhcpv6 | nd | any-l2-packet }",
        "undo authentication trigger-condition [ dhcp | arp | dhcpv6 | nd | any-l2-packet ]"
    ],
    "ParentView": [
        "802.1X access profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "dhcp",
            "Info": "Triggers 802.1X authentication through DHCP packets.\n-"
        },
        {
            "Parameters": "arp",
            "Info": "Triggers 802.1X authentication through ARP packets.\n-"
        },
        {
            "Parameters": "dhcpv6",
            "Info": "Triggers 802.1X authentication through DHCPv6 packets.\n-"
        },
        {
            "Parameters": "nd",
            "Info": "Triggers 802.1X authentication through ND packets.\n-"
        },
        {
            "Parameters": "any-l2-packet",
            "Info": "Triggers 802.1X authentication through any packet. For multicast packets, the corresponding protocol must be enabled. Otherwise, 802.1X authentication cannot be triggered.\nIf this parameter is configured but other optional parameters are not configured, DHCP, ARP, DHCPv6, and ND packets cannot trigger 802.1X authentication."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dot1x-access-profile name d1",
            "[*HUAWEI-dot1x-access-profile-d1] authentication trigger-condition dhcp"
        ]
    ],
    "ExtraInfo": "After 802.1X authentication is enabled, the device can trigger 802.1X authentication for users by default when receiving DHCP, DHCPv6, ND, or ARP packets. The administrator can adjust the packet types that can trigger 802.1X authentication based on user information on the actual network. For example, if all users on the network dynamically obtain IPv4 addresses, you can configure the device to trigger 802.1X authentication only through DHCP packets. This prevents unauthorized users from continuously sending ARP packets to trigger 802.1X authentication after static IPv4 addresses are configured for the users."
}