{
    "PageTitle": "authentication mode",
    "FuncDef": "The authentication mode command configures the user access mode.\nThe undo authentication mode command restores the default setting. The authentication mode command configures the user access mode. The undo authentication mode command restores the default setting. By default, the user access mode is multi-authen. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "authentication mode { single-terminal | multi-share | multi-authen [ max-user <max-user-number> [ dot1x | none ] ] }",
        "undo authentication mode [ multi-authenmax-user [ dot1x | none ] ]"
    ],
    "ParentView": [
        "Authentication profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "single-terminal",
            "Info": "Indicates that an authentication profile allows only one user to go online.\n-"
        },
        {
            "Parameters": "multi-share",
            "Info": "Indicates that an authentication profile allows multiple users to go online.\nIn this mode, the device authenticates only the first user. If the authentication succeeds, subsequent users share the network access rights of the first user. If the first user goes offline, other users also go offline.\n-"
        },
        {
            "Parameters": "multi-authen",
            "Info": "Indicates that an authentication profile allows multiple users to go online.\nIn this mode, the device authenticates each user. If the authentication succeeds, the device grants independent network access rights to the user. After a user goes offline, other users are not affected.\n-"
        },
        {
            "Parameters": "max-user <max-user-number>",
            "Info": "Specifies the maximum number of access users allowed in an authentication profile in multi-authen mode.\nThe value is an integer that ranges from 1 to 4096. The default value is 4096."
        },
        {
            "Parameters": "dot1x",
            "Info": "Specifies the maximum number of 802.1X authentication users allowed in an authentication profile in multi-authen mode.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Specifies the maximum number of pre-connection users allowed in an authentication profile in multi-authen mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] authentication-profile name p1",
            "[*HUAWEI-authen-profile-p1] authentication mode multi-authen"
        ]
    ],
    "ExtraInfo": "After enabling NAC authentication, you can configure a user access mode based on the user access on the interface. The user access modes include:"
}