{
    "PageTitle": "authentication timer handshake-period",
    "FuncDef": "The authentication timer handshake-period handshake-times command sets the handshake interval of the device with pre-connection users and authorized users.\nThe undo authentication timer handshake-period command restores the default setting. The authentication timer handshake-period handshake-times command sets the handshake interval of the device with pre-connection users and authorized users. The undo authentication timer handshake-period command restores the default setting. By default, the handshake interval between the device and pre-connection users and between the device and authorized users is 100 seconds, and the number of handshakes is 3. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "authentication timer handshake-period <handshake-period-value> [ handshake-times <handshake-times-value> ]",
        "undo authentication timer handshake-period"
    ],
    "ParentView": [
        "Authentication profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "<handshake-period-value>",
            "Info": "Specifies the handshake interval.\nThe value is an integer that ranges from 5 to 7200. The default value is 100."
        },
        {
            "Parameters": "handshake-times <handshake-times-value>",
            "Info": "Specifies the number of handshakes.\nThe value is an integer that ranges from 1 to 255. The default value is 3."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] authentication-profile name p1",
            "[*HUAWEI-authen-profile-p1] authentication timer handshake-period 200 handshake-times 3"
        ]
    ],
    "ExtraInfo": "After enabling the handshake with pre-connection users and authorized users using the authentication handshake command, you can run this command to set the handshake interval. After that, if a user does not respond to the handshake request from the device within the handshake interval, the device deletes the user entry."
}