{
    "PageTitle": "authentication timer pre-authen-aging",
    "FuncDef": "The authentication timer pre-authen-aging command configures the aging time for entries of the users who fail to be authenticated.\nThe undo authentication timer pre-authen-aging command restores the default aging time for entries of the users who fail to be authenticated. The authentication timer pre-authen-aging command configures the aging time for entries of the users who fail to be authenticated. The undo authentication timer pre-authen-aging command restores the default aging time for entries of the users who fail to be authenticated. By default, the aging time for pre-connection user entries is 23 hours. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "authentication timer pre-authen-aging <aging-time>",
        "undo authentication timer pre-authen-aging"
    ],
    "ParentView": [
        "Authentication profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "<aging-time>",
            "Info": "Specifies the aging time.\nThe value is an integer that ranges from 0 or 60 to 4294860, in seconds.\nThe value 0 indicates that the entry does not age."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] authentication-profile name p1",
            "[*HUAWEI-authen-profile-p1] authentication timer pre-authen-aging 3600"
        ]
    ],
    "ExtraInfo": "When a pre-connection is established between the device and a user, the device creates the pre-connection user entry. If the user still fails to be authenticated when the user aging time expires, the user entry is deleted.\nThe pre-connection user entries share device resources with the entries of the users who are authenticated. If there are excess pre-connection user entries, other users fail to be authenticated. To solve this problem, run the authentication timer pre-authen-aging command to reduce the aging time for the pre-connection user entries. In addition, if the time that the pre-connection users have network access policies should be extended, you can run this command to increase the aging time for the pre-connection user entries."
}