{
    "PageTitle": "authentication event action authorize",
    "FuncDef": "The authentication event action authorize command configures authentication event authorization information.\nThe undo authentication event action authorize command restores the default setting. The authentication event action authorize command configures authentication event authorization information. The undo authentication event action authorize command restores the default setting. By default, authentication event authorization information is not configured. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "authentication event authen-fail action authorize { vlan <vlan-id> | service-scheme <scheme-name> } [ response-fail ]",
        "authentication event pre-authen action authorize { vlan <vlan-id> | service-scheme <scheme-name> }",
        "authentication event authen-server-down action authorize { vlan <vlan-id> | service-scheme <scheme-name> } [ response-fail ]",
        "undo authentication event authen-fail action authorize",
        "undo authentication event pre-authen action authorize",
        "undo authentication event authen-server-down action authorize"
    ],
    "ParentView": [
        "Authentication profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan <vlan-id>",
            "Info": "Specifies a VLAN ID. When this parameter is specified, users can access only the resources in the VLAN.\nThe VLAN must exist on the device. Otherwise, the configuration does not take effect. The value is an integer that ranges from 1 to 4094."
        },
        {
            "Parameters": "service-scheme <scheme-name>",
            "Info": "Specifies the name of the service scheme based on which network access rights are assigned to users.\nThe value must be an existing service scheme name on the device. The value is a string of 1 to 32 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "response-fail",
            "Info": "Configures the device to send authentication failure packets to users after network access rights are assigned to the users. If this parameter is specified, the client does not send a logoff packet to log out the user. This prevents the client from automatically sending a logoff packet to log out the user.\nIf this parameter is not specified, the device sends an authentication success packet to the user by default. As a result, the user is unaware of the authentication failure. In this case, if a user who fails to be authenticated needs to know its authentication status after obtaining network access rights, you can configure the device to send an authentication failure packet to the user.\n-"
        },
        {
            "Parameters": "pre-authen",
            "Info": "Configures the device to assign network access rights to users when the users establish pre-connections with the device.\n-"
        },
        {
            "Parameters": "authen-server-down",
            "Info": "Configures the device to assign network access rights to users when the authentication server is Down or the server is in the forcible Up state.\n-"
        },
        {
            "Parameters": "authen-fail",
            "Info": "Configures the device to assign network access rights to users when the authentication server sends authentication failure packets to the device.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan batch 10",
            "[*HUAWEI] authentication-profile name authen1",
            "[*HUAWEI-authen-profile-authen1] authentication event pre-authen action authorize vlan 10"
        ]
    ],
    "ExtraInfo": "If users establish pre-connections with the device or fail to be authenticated, they have no network access rights.\nTo meet these users' basic network access requirements such as updating the antivirus database and downloading the client, configure authentication event authorization information. The device will assign network access rights to these users based on the authentication phase."
}