{
    "PageTitle": "authentication timer re-authen",
    "FuncDef": "The authentication timer re-authen command configures the interval for re-authenticating pre-connection users or users who fail the authentication.\nThe undo authentication timer re-authen command restores the default setting. The authentication timer re-authen command configures the interval for re-authenticating pre-connection users or users who fail the authentication. The undo authentication timer re-authen command restores the default setting. By default, pre-connection users and users who fail the authentication are re-authenticated at an interval of 60 seconds. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "authentication timer re-authen { pre-authen <pre-authen-time> | authen-fail <authen-fail-time> }",
        "undo authentication timer re-authen { pre-authen | authen-fail }"
    ],
    "ParentView": [
        "Authentication profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "pre-authen <pre-authen-time>",
            "Info": "Specifies the interval for re-authenticating pre-connection users.\nThe value is 0 or an integer ranging from 30 to 7200, in seconds. The default value is 60s.\nThe value 0 indicates that the re-authentication function is disabled for pre-connection users."
        },
        {
            "Parameters": "authen-fail <authen-fail-time>",
            "Info": "Specifies the interval for re-authenticating users who fail the authentication.\nThe value is 0 or an integer ranging from 30 to 7200, in seconds. The default value is 60s.\nThe value 0 indicates that the re-authentication function is disabled for users who fail to be authenticated."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] authentication-profile name authen1",
            "[*HUAWEI-authen-profile-authen1] authentication timer re-authen authen-fail 300"
        ]
    ],
    "ExtraInfo": "The device creates the mapping user entries when network access policies are assigned to users who are in the pre-connection phase or fail the authentication. To enable users to pass authentication in real time, the device periodically re-authenticates the users who are in the pre-connection phase or fail the authentication according to the user entries. The administrator can adjust the re-authentication interval based on the actual network requirements."
}