{
    "PageTitle": "authentication handshake",
    "FuncDef": "The authentication handshake command enables the handshake with pre-connection users and authorized users.\nThe undo authentication handshake command disables the handshake with pre-connection users and authorized users. The authentication handshake command enables the handshake with pre-connection users and authorized users. The undo authentication handshake command disables the handshake with pre-connection users and authorized users. By default, the handshake with pre-connection users and authorized users is enabled. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "authentication handshake",
        "undo authentication handshake"
    ],
    "ParentView": [
        "Authentication profile view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] authentication-profile name p1",
            "[*HUAWEI-authen-profile-p1] authentication handshake"
        ]
    ],
    "ExtraInfo": "The device creates entries for pre-connection users, users who fail to be authenticated and are assigned network access rights, and users who are authenticated. After users go offline in normal situations, the system immediately deletes the corresponding user entries. However, if some users go offline due to exceptions such as network disconnections, the system cannot immediately delete the corresponding user entries. If there are a large number of such user entries, other users may fail to access the network.\nTo solve this problem, run the authentication handshake command to enable the handshake with pre-connection users and authorized users. If a user does not respond to the handshake request from the device within the handshake period (handshake interval x number of handshakes) (configured using the authentication timer handshake-period handshake-times command), the device deletes the user entry."
}