{
    "PageTitle": "dot1x authentication-method",
    "FuncDef": "The dot1x authentication-method command configures an 802.1X authentication mode.\nThe undo dot1x authentication-method command restores the default configuration. The dot1x authentication-method command configures an 802.1X authentication mode. The undo dot1x authentication-method command restores the default configuration. The default 802.1X authentication mode is eap, which indicates Extensible Authentication Protocol (EAP) relay authentication. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "dot1x authentication-method { chap | eap | pap }",
        "undo dot1x authentication-method"
    ],
    "ParentView": [
        "802.1X access profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "chap",
            "Info": "Specifies EAP termination authentication using the Challenge Handshake Authentication Protocol (CHAP).\n-"
        },
        {
            "Parameters": "eap",
            "Info": "Specifies Extensible Authentication Protocol (EAP) relay authentication.\n-"
        },
        {
            "Parameters": "pap",
            "Info": "Specifies EAP termination authentication using the Password Authentication Protocol (PAP).\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dot1x-access-profile name d1",
            "[*HUAWEI-dot1x-access-profile-d1] dot1x authentication-method pap",
            "Warning: Changing the configuration will cause online users to go offline. Continue? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "During 802.1X authentication, users exchange authentication information with the device using EAP packets. The device uses two modes to exchange authentication information with the RADIUS server.\nEAP termination: The device directly parses EAP packets, encapsulates user authentication information into a RADIUS packet, and sends the packet to the RADIUS server for authentication. EAP termination is classified into PAP or CHAP authentication.\nPAP is a two-way handshake authentication protocol. It transmits passwords in plain text format in RADIUS packets.\nCHAP is a three-way handshake authentication protocol. It transmits only user names but not passwords in RADIUS packets. CHAP is more secure and reliable than PAP. If higher security is required, CHAP is recommended.\nEAP relay (specified by eap): The device encapsulates EAP packets into RADIUS packets and sends the RADIUS packets to the RADIUS server. The device does not parse the received EAP packets but encapsulates them into RADIUS packets. This mechanism is called EAP over Radius (EAPoR).\nThe processing capability of the RADIUS server determines whether EAP termination or EAP relay is used. If the RADIUS server has a higher processing capability and can parse a large number of EAP packets before authentication, the EAP relay mode is recommended. If the RADIUS server has a processing capability not good enough to parse a large number of EAP packets and complete authentication, the EAP termination mode is recommended and the device parses EAP packets for the RADIUS server. When the authentication packet processing method is configured, ensure that the client and server both support this method; otherwise, the users cannot pass authentication."
}