{
    "PageTitle": "dot1x timer",
    "FuncDef": "The dot1x timer command configures 802.1X timer parameters.\nThe undo dot1x timer command restores the default settings. The dot1x timer command configures 802.1X timer parameters. The undo dot1x timer command restores the default settings. For the default 802.1X timer parameter settings, see the parameter description. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "dot1x timer { client-timeout <client-timeout-value> | reauthenticate-period <reauthenticate-period-value> }",
        "undo dot1x timer { client-timeout | reauthenticate-period }"
    ],
    "ParentView": [
        "802.1X access profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "client-timeout <client-timeout-value>",
            "Info": "Sets the client authentication timeout period.\nIf there are some terminals on the network, the terminals wait for a long time to respond to the EAP-Request/MD5 Challenge packets sent by the device. In this case, you can increase the value of client-timeout client-timeout-value to prevent user login failures caused by slow response of terminals. The adjustment principle is as follows: 3 x client-timeout-value > Response delay of terminals.\nThe value is an integer that ranges from 1 to 120, in seconds.\nBy default, the client authentication timeout period is 5 seconds."
        },
        {
            "Parameters": "reauthenticate-period <reauthenticate-period-value>",
            "Info": "Specifies the periodic re-authentication period for online 802.1X users.\nThe value is an integer that ranges from 1 to 65535, in seconds.\nBy default, the periodic re-authentication period is 3600 seconds for online 802.1X users."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dot1x-access-profile name d1",
            "[~HUAWEI-dot1x-access-profile-d1] dot1x timer client-timeout 90"
        ]
    ],
    "ExtraInfo": "During 802.1X authentication, multiple timers are started to implement proper and orderly interactions between access users, access devices, and the authentication server. You can change the values of some timers by running this command to adjust the interaction process. (The values of some timers cannot be changed.) This command is necessary in special network environments. Generally, the default settings of the timers are recommended.\nThis command only sets the values of the timers. To enable the timers, perform corresponding configurations or use default settings."
}