{
    "PageTitle": "exclude interface(access-filter)",
    "FuncDef": "The exclude interface command configures an exception interface for the iNOF host access interface whitelist.\nThe undo exclude interface command deletes an exception interface from the iNOF host access interface whitelist. The exclude interface command configures an exception interface for the iNOF host access interface whitelist. The undo exclude interface command deletes an exception interface from the iNOF host access interface whitelist. By default, no exception interface is configured for the iNOF host access interface whitelist. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6885-SAN, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "exclude interface { <interface-name> | <interface-type> <interface-number> } [ to { <interface-name> | <interface-type> <interface-number> } ]",
        "undo exclude interface { <interface-name> | <interface-type> <interface-number> } [ to { <interface-name> | <interface-type> <interface-number> } ]"
    ],
    "ParentView": [
        "iNOF host access interface whitelist view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of an exception interface to be configured for the iNOF host access interface whitelist.\n-"
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an exception interface to be configured for the iNOF host access interface whitelist.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of an exception interface to be configured for the iNOF host access interface whitelist.\n-"
        },
        {
            "Parameters": "to",
            "Info": "Specifies an interface range that includes all interfaces between the two interfaces.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ai-service",
            "[*HUAWEI-ai-service] inof",
            "[*HUAWEI-ai-service-inof] access-filter",
            "[*HUAWEI-ai-service-inof-access-filter] exclude interface 100GE 1/0/1"
        ]
    ],
    "ExtraInfo": "You can run this command to configure an exception interface for the iNOF host access interface whitelist."
}