{
    "PageTitle": "host interface (iNOF host access interface whitelist view)",
    "FuncDef": "The host interface command configures a whitelist of interfaces through which hosts access the iNOF.\nThe undo host interface command deletes interfaces from the iNOF host access interface whitelist. The host interface command configures a whitelist of interfaces through which hosts access the iNOF. The undo host interface command deletes interfaces from the iNOF host access interface whitelist. By default, no interface whitelist is configured for hosts to connect to the iNOF. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6885-SAN, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "host <ip-address> [ to <ip-address> ] interface { <interface-name> | <interface-type> <interface-number> }",
        "undo host <ip-address> [ to <ip-address> ] interface { <interface-name> | <interface-type> <interface-number> }"
    ],
    "ParentView": [
        "iNOF host access interface whitelist view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies the IP address of a host.\nFor IPv4 address, the value is in the decimal format.For IPv6 address, the value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "to",
            "Info": "Specifies the IP address range of the hosts.\n-"
        },
        {
            "Parameters": "interface",
            "Info": "Specifies the interface through which hosts can access the iNOF.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies an interface name.\n-"
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies an interface type.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies an interface number.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ai-service",
            "[*HUAWEI-ai-service] inof",
            "[*HUAWEI-ai-service-inof] access-filter",
            "[*HUAWEI-ai-service-inof-access-filter] host 192.168.1.1 to 192.168.1.2 interface 100GE 1/0/1"
        ]
    ],
    "ExtraInfo": "You can run this command to configure a whitelist of interfaces through which hosts access the iNOF."
}