{
    "PageTitle": "service-address",
    "FuncDef": "The service-address command configures the local IP address of a device in an iNOF system.\nThe undo service-address command deletes the local IP address of a device in an iNOF system. The service-address command configures the local IP address of a device in an iNOF system. The undo service-address command deletes the local IP address of a device in an iNOF system. By default, no local IP address is configured for a device in an iNOF system. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6885-SAN, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "service-address { <ip-address> | <ipv6-address> } [ port-id <port-id> ]",
        "undo service-address { <ip-address> | <ipv6-address> } [ port-id <port-id> ]"
    ],
    "ParentView": [
        "iNOF view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies the local IPv4 address of an iNOF device.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the local IPv6 address of an iNOF device.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "port-id <port-id>",
            "Info": "Specifies the port number used by the local device to transmit iNOF packets.\nThe value is an integer ranging from 10000 to 57999. The default value is 19516. All devices in an iNOF system must be configured with the same port number."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ai-service",
            "[*HUAWEI-ai-service] inof",
            "[*HUAWEI-ai-service-inof] service-address 2001:DB8:1::5 port-id 10002"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ai-service",
            "[*HUAWEI-ai-service] inof",
            "[*HUAWEI-ai-service-inof] service-address 192.168.1.5 port-id 10002"
        ]
    ],
    "ExtraInfo": "You need to specify the local IP address and port number for a device in an iNOF system so that the device can transmit iNOF packets."
}