{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "boot system",
    "FuncDef": [
        "To specify the system image that the router loads at startup, use one of the following **boot system** command in global configuration mode. To remove the startup system image specification, use the **no** form of this command. "
    ],
    "CLIs": [
        "boot system { <file-url | filename> }",
        "no boot system { <file-url | filename> }",
        "Booting from a System Image in Internal Flash",
        "boot system flash [ <flash-fs>: ] [ <partition-number>: ] [ <filename> ]",
        "no boot system flash [ <flash-fs>: ] [ <partition-number>: ] [ <filename> ]",
        "Booting from a MOP Server",
        "boot system mop <filename> [ <mac-address> ] [ <interface> ]",
        "no boot system mop <filename> [ <mac-address> ] [ <interface> ]",
        "Booting from ROM",
        "boot system rom",
        "no boot system rom",
        "Booting System Image from Network, TFTP, or FTP Server",
        "boot system { rcp | tftp | ftp } <filename> [ <ip-address> ]",
        "no boot system { rcp | tftp | ftp } <filename> [ <ip-address> ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *file-url* ",
            "Info": " The URL of the system image to load at system startup. "
        },
        {
            "Parameters": " *filename* ",
            "Info": " The TFTP filename of the system image to load at system startup. "
        },
        {
            "Parameters": " **flash** ",
            "Info": " On all platforms except the Cisco 1600 series, Cisco 3600 series, and Cisco 7000 family routers, this keyword boots the router from internal flash memory. If you omit all arguments that follow this keyword, the system searches internal Flash for the first bootable image.  On the Cisco 1600 series, Cisco 3600 series, and Cisco 7000 family routers, this keyword boots the router from the flash system specified by the *flash-fs*: argument. On the Cisco 1600 series and Cisco 3600 series routers, if you omit all optional arguments, the router searches internal flash memory for the first bootable image. On the Cisco 7000 family routers, when you omit all arguments that follow this keyword, the system searches the Personal Computer Memory Card Industry Association (PCMCIA) slot 0 for the first bootable image. "
        },
        {
            "Parameters": " *flash-fs*: ",
            "Info": " (Optional) Flash file system containing the system image to load at startup. The colon is required. Valid file systems are as follows:  •**flash:**—Internal flash memory on the Cisco 1600 series and Cisco 3600 series routers. For the Cisco 1600 series and Cisco 3600 series routers, this file system is the default if you do not specify a file system. This is the only valid file system for the Cisco 1600 series.  •**bootflash:**—Internal flash memory in the Cisco 7000 family.  •**slot0:**—First PCMCIA slot on the Cisco 3600 series and Cisco 7000 family routers. For the Cisco 7000 family routers, this file system is the default if you do not specify a file system.  •**slot1:**—Flash memory card in the second PCMCIA slot on the Cisco 3600 series and Cisco 7000 family routers.  On the Cisco 2600 series routers, a file system should be specified. Otherwise, the router may attempt to load the Cisco IOS software twice with unexpected results. "
        },
        {
            "Parameters": " *partition-number*: ",
            "Info": " (Optional) Number of the flash memory partition that contains the system image to boot, specified by the optional *filename* argument. If you do not specify a filename, the router loads the first valid file in the specified partition of flash memory. This argument is valid only on routers that can be partitioned. "
        },
        {
            "Parameters": " *filename* ",
            "Info": " (Optional when used with the **boot system****flash** command) Name of the system image to load at startup. This argument is case sensitive. If you do not specify a value for the *filename* argument, the router loads the first valid file in the following:  •The specified flash file system  •The specified partition of flash memory  •The default flash file system if you also omitted the *flash-fs*: argument "
        },
        {
            "Parameters": " **mop** ",
            "Info": " Boots the router from a system image stored on a DECNET Maintenance Operations Protocol (MOP) server. Do not use this keyword with the Cisco 3600 series or Cisco 7000 family routers. "
        },
        {
            "Parameters": " *mac-address* ",
            "Info": " (Optional) MAC address of the MOP server containing the specified system image file. If you do not include the MAC address argument, the router sends a broadcast message to all MOP boot servers. The first MOP server to indicate that it has the specified file is the server from which the router gets the boot image. "
        },
        {
            "Parameters": " *interface* ",
            "Info": " (Optional) Interface the router uses to send out MOP requests to the MOP server. The interface options are async, dialer, ethernet, serial, and tunnel. If you do not specify the *interface* argument, the router sends a request out on all interfaces that have MOP enabled. The interface that receives the first response is the interface the router uses to load the software. "
        },
        {
            "Parameters": " **rom** ",
            "Info": " Boots the router from ROM. Do not use this keyword with the Cisco 3600 series or the Cisco 7000 family routers. "
        },
        {
            "Parameters": " **rcp** ",
            "Info": " Boots the router from a system image stored on a network server using rcp. "
        },
        {
            "Parameters": " **tftp** ",
            "Info": " Boots the router from a system image stored on a TFTP server. "
        },
        {
            "Parameters": " **ftp** ",
            "Info": " Boots the router from a system image stored on an FTP server. "
        },
        {
            "Parameters": " *ip-address* ",
            "Info": " (Optional) IP address of the server containing the system image file. If omitted, this value defaults to the IP broadcast address of 255.255.255.255. "
        }
    ],
    "Examples": [
        [
            "The following example illustrates a configuration that specifies two possible internetwork locations for a system image, with the ROM software being used as a backup:",
            "```",
            "Router(config)# boot system tftp://192.168.7.24/cs3-rx.90-1",
            "```",
            "```",
            "Router(config)# boot system tftp://192.168.7.19/cs3-rx.83-2",
            "```",
            "```",
            "Router(config)# boot system rom",
            "```",
            "```",
            "```",
            "The following example boots the system boot relocatable image file named igs-bpx-l from partition 2 of the flash device:",
            "```",
            "Router(config)# boot system flash:2:igs-bpx-l",
            "```",
            "```",
            "```",
            "The following example instructs the router to boot from an image located on the flash memory card inserted in slot 0:",
            "```",
            "Router(config)# boot system slot0:new-config",
            "```",
            "```",
            "```",
            "The following example specifies the file named new-ios-image as the system image for a Cisco 3600 series router to load at startup. This file is located in the fourth partition of the flash memory card in slot 0.",
            "```",
            "```",
            "```",
            "Router(config)# boot system slot0:4:dirt/images/new-ios-image",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "```",
            "```",
            "Router(config)# boot system flash:2:c1600-y-l",
            "```"
        ]
    ],
    "ExtraInfo": "For this command to work, the **config-register** command must be set properly.Enter several **boot system** commands to provide a fail-safe method for booting your router. The router stores and executes the **boot system**commands in the order in which you enter them in the configuration file. If you enter multiple boot commands of the same type—for example, if you enter two commands that instruct the router to boot from different network servers—then the router tries them in the order in which they appear in the configuration file. If a **boot system** command entry in the list specifies an invalid device, the router omits that entry. Use the **boot system****rom** command to specify use of the ROM system image as a backup to other **boot** system commands in the configuration.For some platforms, the boot image must be loaded before the system image is loaded. However, on many platforms, the boot image is loaded only if the router is booting from a network server or if the flash file system is not specified. If the file system is specified, the router will boot faster because it need not load the boot image first.This section contains the following topics:•![](/c/dam/en/us/td/i/templates/blank.gif)Changing the List of Boot System Commands•![](/c/dam/en/us/td/i/templates/blank.gif)Booting Compressed Images•![](/c/dam/en/us/td/i/templates/blank.gif)Understanding rcp•![](/c/dam/en/us/td/i/templates/blank.gif)Understanding TFTP•![](/c/dam/en/us/td/i/templates/blank.gif)Understanding FTP•![](/c/dam/en/us/td/i/templates/blank.gif)Stopping Booting and Entering ROM Monitor Mode•![](/c/dam/en/us/td/i/templates/blank.gif)Cisco 1600 Series, Cisco 3600 Series, Cisco 7000 Family, and Cisco 7600 Series Router NotesChanging the List of Boot System CommandsTo remove a single entry from the bootable image list, use the **no** form of the command with an argument. For example, to remove the entry that specifies a bootable image on a flash memory card inserted in the second slot, use the **no****boot system****flash slot1:**[*filename*] command. All other entries in the list remain.To eliminate all entries in the bootable image list, use the **no** **boot system**command. At this point, you can redefine the list of bootable images using the previous **boot system** commands. Remember to save your changes to your startup configuration by issuing the **copy system:running-config nvram:startup-config** command.Each time you write a new software image to flash memory, you must delete the existing filename in the configuration file with the **no** **boot system****flash***filename* command. Then add a new line in the configuration file with the **boot system****flash** *filename* command.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)If you want to rearrange the order of the entries in the configuration file, you must first issue the **no** **boot system** command and then redefine the list.---Booting Compressed ImagesYou can boot the router from a compressed image on a network server. When a network server boots software, both the image being booted and the running image must be able to fit into memory. Use compressed images to ensure that enough memory is available to boot the router. You can compress a software image on any UNIX platform using the **compress** command. Refer to your UNIX platform's documentation for the exact usage of the **compress** command. (You can also uncompress data with the UNIX **uncompress** command.)Understanding rcpThe rcp requires that a client send the remote username in an rcp request to a server. When the router executes the **boot system rcp** command, the Cisco IOS software sends the hostname as both the remote and local usernames by default. Before the rcp can execute properly, an account must be defined on the network server for the remote username configured on the router.If the server has a directory structure, the rcp software searches for the system image to boot from the remote server relative to the directory of the remote username.By default, the router software sends the hostname as the remote username. You can override the default remote username by using the **ip rcmd remote-username** command. For example, if the system image resides in the home directory of a user on the server, you can specify that user's name as the remote username.Understanding TFTPYou need a TFTP server running to retrieve the router image from the host.Understanding FTPYou need an FTP server running to retrieve the router image from the host. You also need an account on the server or anonymous file access to the server.Stopping Booting and Entering ROM Monitor ModeDuring the first 60 seconds of startup, you can force the router to stop booting by pressing the Break key. The router will enter ROM monitor mode, where you can change the configuration register value or boot the router manually.Cisco 1600 Series, Cisco 3600 Series, Cisco 7000 Family, and Cisco 7600 Series Router NotesFor the Cisco 3600 series and Cisco 7000 family, the **boot system**command modifies the BOOT variable in the running configuration. The BOOT variable specifies a list of bootable images on various devices.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)When you use the **boot system** command on the Cisco 1600 series, Cisco 3600 series, Cisco 7000 family, and Cisco 7600 series, you affect only the running configuration. You must save the BOOT variable settings to your startup configuration to place the information under ROM monitor control and to have the variable function as expected. Use the **copy system:running-config nvram:startup-config** privileged EXEC command to save the variable from your running configuration to your startup configuration.---To display the contents of the BOOT variable, use the **show bootvar** EXEC command.",
    "RelatedCmds": [
        {
            "cmd": " **boot** ",
            "description": " Boots the router manually. "
        },
        {
            "cmd": " **config-register** ",
            "description": " Changes the configuration register settings. "
        },
        {
            "cmd": " **confreg** ",
            "description": " Changes the configuration register settings while in ROM monitor mode. "
        },
        {
            "cmd": " **copy** ",
            "description": " Copies any file from a source to a destination. "
        },
        {
            "cmd": " **copy** **system:running-config nvram:startup-config** ",
            "description": " Copies the running configuration to the startup configuration. "
        },
        {
            "cmd": " **ip rcmd remote username** ",
            "description": " Configures the remote username to be used when requesting a remote copy using rcp. "
        },
        {
            "cmd": " **show bootvar** ",
            "description": " Displays the contents of the BOOT variable, the name of the configuration file pointed to by the CONFIG_FILE variable, the contents of the BOOTLDR variable, and the configuration register setting. "
        }
    ]
}