{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "boot bootldr",
    "FuncDef": [
        "To specify the location of the boot image that ROM uses for booting, use the **boot bootldr** command in global configuration mode. To remove this boot image specification, use the **no** form of this command. "
    ],
    "CLIs": [
        "boot bootldr <file-url>",
        "no boot bootldr"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *file-url* ",
            "Info": " URL of the boot image on a Flash file system. "
        }
    ],
    "Examples": [
        [
            "In the following example, the internal Flash memory contains the boot image:",
            "```",
            "boot bootldr bootflash:boot-image",
            "```",
            "```",
            "```",
            "The following example specifies that the Flash memory card inserted in slot 0 contains the boot image:",
            "```",
            "boot bootldr slot0:boot-image",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "The **boot bootldr** command sets the BOOTLDR variable in the current running configuration. You must specify both the Flash file system and the filename.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)When you use this global configuration command, you affect only the running configuration. You must save the variable setting to your startup configuration to place the information under ROM monitor control and to have the variable function as expected. Use the **copy system:running-config nvram:startup-config** command to save the variable from your running configuration to your startup configuration.---![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)The default length of the bootstring filename is 64 characters. Depending on the platform a longer bootstring filename can be used and supported.---The **no** form of the command sets the BOOTLDR variable to a null string. On the Cisco 7000 family routers, a null string causes the first image file in boot Flash memory to be used as the boot image that ROM uses for booting.Use the **show boot** command to display the current value for the BOOTLDR variable.",
    "RelatedCmds": [
        {
            "cmd": " **copy system:running-config nvram:startup-config** ",
            "description": " Copies any file from a source to a destination. "
        },
        {
            "cmd": " **show (flash file system)** ",
            "description": " Displays the layout and contents of a Flash memory file system. "
        },
        {
            "cmd": " **show bootvar** ",
            "description": " Displays the contents of the BOOT variable, the name of the configuration file pointed to by the CONFIG_FILE variable, the contents of the BOOTLDR variable, and the configuration register setting. "
        }
    ]
}