{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "boot bootstrap",
    "FuncDef": [
        "To configure the filename that is used to boot a secondary bootstrap image, use the **boot bootstrap** command in global configuration mode. To disable booting from a secondary bootstrap image, use the **no** form of this command. "
    ],
    "CLIs": [
        "boot bootstrap <file-url>",
        "no boot bootstrap <file-url>",
        "boot bootstrap flash [ <filename> ]",
        "no boot bootstrap flash [ <filename> ]",
        "boot bootstrap [ tftp ] <filename> [ <ip-address> ]",
        "no boot bootstrap [ tftp ] <filename> [ <ip-address> ]",
        "boot bootstrap mop <filename> [ <interface-type> <interface-number> ]",
        "no boot bootstrap mop <filename> [ <interface-type interface-number> ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *file-url* ",
            "Info": " URL of the bootstrap image. "
        },
        {
            "Parameters": " **flash** ",
            "Info": " Boots the router from flash memory. "
        },
        {
            "Parameters": " *filename* ",
            "Info": " (Optional with **flash**) Name of the system image to boot from a network server or from flash memory. If you omit the filename when booting from flash memory, the router uses the first system image stored in flash memory. "
        },
        {
            "Parameters": " **tftp** ",
            "Info": " (Optional) Boots the router from a system image stored on a TFTP server. "
        },
        {
            "Parameters": " *ip-address* ",
            "Info": " (Optional) IP address of the TFTP server on which the system image resides. If the *ip-address* argument is omitted, this value defaults to the IP broadcast address of 255.255.255.255. "
        },
        {
            "Parameters": " **mop** ",
            "Info": " Boots the router from a DECnet Maintenance Operation Protocol (MOP) server. "
        },
        {
            "Parameters": " *interface-type* ",
            "Info": " (Optional) Interface type. For more information, use the question mark (?) online help function. "
        },
        {
            "Parameters": " *interface-number* ",
            "Info": " (Optional) Interface or subinterface number. For more information about the numbering syntax for your networking device, use the question mark (?) online help function. "
        }
    ],
    "Examples": [
        [
            "The following example shows how to load the system image file named sysimage-2 by using a secondary bootstrap image:",
            "```",
            "Router# configure terminal",
            "```",
            "```",
            "Router(config)# boot bootstrap bootflash:sysimage-2",
            "```"
        ]
    ],
    "ExtraInfo": "The **boot bootstrap** command causes the router to load a secondary bootstrap image from the specied URL, such as from a remote server. After the bootstrap image is loaded, the bootstrap image loads the specified system image file. See the appropriate hardware installation guide for details on setting the configuration register and secondary bootstrap filename.Use this command when you have attempted to load a system image but have run out of memory even after compressing the system image. Secondary bootstrap images allows you to load a larger system image through a smaller secondary image.",
    "RelatedCmds": [
        {
            "cmd": " **boot** ",
            "description": " Boots the router manually. "
        },
        {
            "cmd": " **boot system** ",
            "description": " Specifies the system image that the router loads at startup. "
        }
    ]
}