{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "boot network",
    "FuncDef": [
        "To change the default name of the network configuration file from which to load configuration commands, use the **boot network** command in global configuration mode. To restore the network configuration filename to the default, use the **no** form of this command. "
    ],
    "CLIs": [
        "boot network <remote-url>",
        "no boot network <remote-url>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *remote-url* ",
            "Info": " Location of the configuration file. Use the following syntax:  •**ftp:**[[[**//**[*username*[**:***password*]**@**]*location*]**/***directory*]**/***filename*]  •**rcp:**[[[**//**[*username*@]*location*]**/***directory*]**/***filename*]  •**tftp:**[[[**//***location*]**/***directory*]**/***filename*] "
        }
    ],
    "Examples": [
        [
            "The following example changes the network configuration filename to bridge_9.1 and uses the default broadcast address:",
            "```",
            "Router(config)# boot network tftp:bridge_9.1",
            "```",
            "```",
            "Router(config)# service config",
            "```",
            "```",
            "```",
            "The following example changes the network configuration filename to bridge_9.1, specifies that rcp is to be used as the transport mechanism, and gives 172.16.1.111 as the IP address of the server on which the network configuration file resides:",
            "```",
            "Router(config)# service config",
            "```",
            "```",
            "Router(config)# boot network rcp://172.16.1.111/bridge_9.1",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "This command instructs the system to \"Boot using network configuration file *x*,\" where *x* is the filename specified in the *remote-url* argument. This command specifies the remote location and filename of the network configuration file to be used at the next system startup, as well as the protocol to be used to obtain the file.When booting from a network server, routers ignore routing information, static IP routes, and bridging information. As a result, intermediate routers are responsible for handling FTP, rcp, or TFTP requests. Before booting from a network server, verify that a server is available by using the **ping** command.Use the **service config** command to enable the loading of the specified configuration file at reboot time. Without this command, the router ignores the **boot network** command and uses the configuration information in NVRAM. If the configuration information in NVRAM is invalid or missing, the **service config** command is enabled automatically.The network server will attempt to load two configuration files from remote hosts. The first is the network configuration file containing commands that apply to all network servers on a network. Use the **boot network** command to identify the network configuration file. The second is the host configuration file containing commands that apply to one network server in particular. Use the **boot host**command to identify the host configuration file.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)Usually, the service config command is used in conjunction with the boot host or boot network command. You must enter the service config command to enable the router to automatically configure the system from the file specified by the boot host or boot network command.     With IOS software versions 12.3(2)T , 12.3(1)B, and later, you no longer have to specify the service config command for the boot host or boot network command to be active.     If you specify both the no service config command and the boot host command, the router attempts to find the specified host configuration file. The service config command can also be used without the boot host or boot network command. If you do not specify host or network configuration filenames, the router uses the default configuration files. The default network configuration file is network-confg. The default host configuration file is host-confg, where host is the hostname of the router. If the Cisco IOS software cannot resolve its hostname, the default host configuration file is router-confg.---Loading a Configuration File Using rcpThe rcp software requires that a client send the remote username on each rcp request to the network server. If the server has a directory structure (such as UNIX systems), the rcp implementation searches for the configuration files starting in the directory associated with the remote username.When you load a configuration file from a server using rcp, the Cisco IOS software sends the first valid username in the following list: **1.** ![](/c/dam/en/us/td/i/templates/blank.gif)The username specified in the file-URL, if a username is specified. **2.** ![](/c/dam/en/us/td/i/templates/blank.gif)The username set by the **ip rcmd remote-username** command, if the command is configured. **3.** ![](/c/dam/en/us/td/i/templates/blank.gif)The router host name.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)An account for the username must be defined on the destination server. If the network administrator of the destination server did not establish an account for the username, this command will not execute successfully.---Loading a Configuration File Using FTPThe FTP protocol requires a client to send a remote username and password on each FTP request to a server. The username and password must be associated with an account on the FTP server. If the server has a directory structure, the configuration file or image copied from the directory associated with the username on the server. Refer to the documentation for your FTP server for more details.When you load a configuration file from a server using FTP, the Cisco IOS software sends the first valid username in the following list: **1.** ![](/c/dam/en/us/td/i/templates/blank.gif)The username specified in the **boot network**command, if a username is specified. **2.** ![](/c/dam/en/us/td/i/templates/blank.gif)The username set by the **ip ftp username** command, if the command is configured. **3.** ![](/c/dam/en/us/td/i/templates/blank.gif)Anonymous.The router sends the first valid password in the following list: **1.** ![](/c/dam/en/us/td/i/templates/blank.gif)The password specified in the **boot network**command, if a password is specified. **2.** ![](/c/dam/en/us/td/i/templates/blank.gif)The password set by the **ip ftp password** command, if the command is configured. **3.** ![](/c/dam/en/us/td/i/templates/blank.gif)The router forms a password *username*@*routername*.*domain*. The variable *username* is the username associated with the current session, *routername* is the configured host name, and *domain* is the domain of the router.",
    "RelatedCmds": [
        {
            "cmd": " **boot host** ",
            "description": " Specifies the remote location and filename of the host-specific configuration file to be used at the next system boot (startup). "
        },
        {
            "cmd": " **service config** ",
            "description": " Enables autoloading of configuration files from a remote host. "
        }
    ]
}