{
    "PageTitle": "ztp certificate-remote",
    "FuncDef": "The ztp certificate-remote command configures the device to download a CA certificate from a bootstrap server.\nThe undo ztp certificate-remote command disables the device from downloading a CA certificate from a bootstrap server. The ztp certificate-remote command configures the device to download a CA certificate from a bootstrap server. The undo ztp certificate-remote command disables the device from downloading a CA certificate from a bootstrap server. By default, a device is not configured to download a CA certificate from a bootstrap server.",
    "CLIs": [
        "ztp certificate-remote { <ipv4-addr> | ipv6 <ipv6-addr> } [ vpn-instance <vpnvalue> ] port <portvalue> ssl-policy <policyname> [ verify-typeesn ]",
        "undo ztp certificate-remote { <ipv4-addr> | ipv6 <ipv6-addr> } [ vpn-instance <vpnvalue> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6 <ipv6-addr>",
            "Info": "IPv6 address of the bootstrap server.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "vpn-instance <vpnvalue>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. _public_ cannot be used as the VPN instance name."
        },
        {
            "Parameters": "port <portvalue>",
            "Info": "Port number of the bootstrap server.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "ssl-policy <policyname>",
            "Info": "Specifies the name of an SSL policy.\nThe value is a string of 1 to 23 case-insensitive characters, including letters, digits, and underscores (_). It cannot contain spaces."
        },
        {
            "Parameters": "verify-type",
            "Info": "Authentication type.\nIf this parameter is not specified, the IP address pair is used for authentication.\n-"
        },
        {
            "Parameters": "esn",
            "Info": "Indicates that the authentication type is ESN.\n-"
        },
        {
            "Parameters": "certificate-remote <ipv4-addr>",
            "Info": "IP address of the bootstrap server.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy ztp_policy",
            "[*HUAWEI-ssl-policy-ztp_policy] pki-domain default",
            "Warning: A preset certificate is loaded to the specified PKI domain. The current operation has security risks. Continue? [Y/N]:y",
            "[*HUAWEI-ssl-policy-ztp_policy] quit",
            "[*HUAWEI] ztp certificate-remote 10.1.1.1 port 30217 ssl-policy ztp_policy"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy ztp_policy",
            "[*HUAWEI-ssl-policy-ztp_policy] pki-domain default",
            "Warning: A preset certificate is loaded to the specified PKI domain. The current operation has security risks. Continue? [Y/N]:y",
            "[*HUAWEI-ssl-policy-ztp_policy] quit",
            "[*HUAWEI] ztp certificate-remote ipv6 2001:db8:1::1 port 30217 ssl-policy ztp_policy verify-type esn"
        ]
    ],
    "ExtraInfo": "If NCE does not initialize a certificate, run the ztp certificate-remote command to enable the device to download a CA certificate from the BootStrap server. The certificate name is NCE-bootstrap.pem. During ZTP deployment, the CA certificate is used for certificate authentication and NETCONF connection establishment with NCE. Currently, NCE integrates the functions of the BootStrap server.\nA maximum of 10 BootStrap servers can be configured on the device. The BootStrap servers with the same IP address and VPN instance name are considered as one BootStrap server. The interaction process between the device and BootStrap server is as follows:"
}