{
    "PageTitle": "dir",
    "FuncDef": "The dir command displays information about a specified file or a directory of a storage device on the device. The dir command displays information about a specified file or a directory of a storage device on the device. By default, information about files in the current directory is displayed.",
    "CLIs": [
        "dir",
        "dir /all",
        "dir <filename>",
        "dir /all <filename>",
        "dir /all-filesystems",
        "dir /all /all-filesystems"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "/all",
            "Info": "Displays all files, including the dumped files in the recycle bin.\n-"
        },
        {
            "Parameters": "/all <filename>",
            "Info": "Displays all files (including files that have been deleted to the recycle bin).\nThe value is a character string in the format of [ <drive> ][ <path>  ][ <file-name>  ]. An absolute <path>  name is a string of 1 to 255 characters. A relative <path>  name is a string of 1 to 128 characters. Up to 8 levels of directories are supported.\nAn absolute <path>  is in the format of <drive> [ <path>  ][ <file-name>  ], and a relative <path>  is in the format of [ <path>  ][ <file-name>  ]. That is, a relative <path>  is the root <path>  of the current working <path> ."
        },
        {
            "Parameters": "<filename>",
            "Info": "Displays all files (excluding files that have been deleted to the recycle bin).\nThe value is a character string in the format of [ <drive> ][ <path>  ][ <file-name>  ]. An absolute <path>  name is a string of 1 to 255 characters. A relative <path>  name is a string of 1 to 128 characters. Up to 8 levels of directories are supported.\nAn absolute <path>  is in the format of <drive> [ <path>  ][ <file-name>  ], and a relative <path>  is in the format of [ <path>  ][ <file-name>  ]. That is, a relative <path>  is the root <path>  of the current working <path> ."
        },
        {
            "Parameters": "/all-filesystems",
            "Info": "Displays information about all files in the root directory of storage medium.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> dir"
        ]
    ],
    "ExtraInfo": "You can run the dir /all command to view information about all files, including the dumped files in the recycle bin. The name of a deleted file is enclosed in square brackets ([]), for example, [text].\nThe wildcard * can be used for matching.\nTable 1 lists the file information displayed in the dir command output.\nThe displayed files are related to the system software version and service configuration. Only common files are listed here.\nHidden files occupy disk space.\n** Table 1 ** File information description table"
}