{
    "PageTitle": "export route-policy (VPN instance view)",
    "FuncDef": "The export route-policy command associates the current VPN instance IPv4 address family with an export route-policy.\nThe undo export route-policy command disassociates the current VPN instance IPv4 address family from the export route-policy. The export route-policy command associates the current VPN instance IPv4 address family with an export route-policy. The undo export route-policy command disassociates the current VPN instance IPv4 address family from the export route-policy. By default, the current VPN instance IPv4 address family is not associated with any export route-policy.",
    "CLIs": [
        "export route-policy <policy-name> [ add-ert-first ]",
        "undo export route-policy"
    ],
    "ParentView": [
        "VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "<policy-name>",
            "Info": "Specifies the name of the export route-policy to be associated with the VPN instance IPv4 address family.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "add-ert-first",
            "Info": "Adds ERTs to VPN routes before these routes are matched against an export routing policy.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy poly-1 permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vrf1] export route-policy poly-1"
        ]
    ],
    "ExtraInfo": "To advertise the routes of a VPN instance IPv4 address family in a way more precise than the way based on the extended community attribute, use the export route-policy. An export route-policy can filter routes advertised by the VPN instance IPv4 address family and set the attributes for routes that pass the filtering.\nThe export route-policy command controls the advertisement of local routes from the VPN instance IPv4 address family to the BGP-VPNv4 address family. The peer route-policy or filter-policy command run in the BGP VPN instance IPv4 address family view filters the routes in the VPN instance IPv4 address family advertised to or received from CE peers.\nBy default, export VPN targets are added to VPN routes after these routes are matched against an export route-policy. If the export route-policy contains VPN target-related filtering rules, it cannot apply to VPN routes. If you want to apply the VPN target-related filtering rules defined in an export route-policy to VPN routes, configure the add-ert-first parameter for the device to add export VPN targets to VPN routes before matching these routes against the export route-policy.\nIn local route leaking scenarios, you can run the export route-policy command to filter out locally leaked routes and set the attributes of these routes. Locally leaked routes include locally imported routes and routes learned from VPN peers."
}