{
    "PageTitle": "import-rib protocol direct",
    "FuncDef": "The import-rib protocol direct command imports public network or other VPN instance routes to a VPN instance routing table.\nThe undo import-rib protocol direct command restores the default configuration. The import-rib protocol direct command imports public network or other VPN instance routes to a VPN instance routing table. The undo import-rib protocol direct command restores the default configuration. By default, public network or other VPN instance routes are not imported to VPN instance routing tables.",
    "CLIs": [
        "import-rib { vpn-instance <vpn-instance-name> | public } protocoldirect [ route-policy <route-policy-name> ]",
        "undo import-rib { vpn-instance <vpn-instance-name> | public } protocoldirect"
    ],
    "ParentView": [
        "VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. The VPN instance name cannot be _public_. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "public",
            "Info": "Indicates the public network instance.\n-"
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies a route-policy to filter routes to be imported.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv4-family",
            "[*HUAWEI-vpn-instance-vrf1] import-rib public protocol direct"
        ]
    ],
    "ExtraInfo": "In a L3VPN scenario, one VPN can communicate with another VPN if they have matching VPN targets, but VPNs cannot communicate with the public network. To enable a VPN to communicate with the public network, you have to ensure that the VPN and public network can obtain routes to each other. To import public network routes to a VPN instance, run the import-rib public command.\nIn an intelligent traffic control scenario, traffic of different users are distributed to different VPNs. To enable the traffic to reach the public network, run the import-rib public command to import public network routes to each VPN instance routing table.\nTraffic forwarding relies on direct routes (Vlink direct routes) generated based on user entries."
}