{
    "PageTitle": "area-authentication-mode (IS-IS view)",
    "FuncDef": "The area-authentication-mode command enables an IS-IS device to authenticate received Level-1 packets (LSPs and SNPs) based on the pre-defined authentication mode and password and to add authentication information to the Level-1 packets to be sent.\nThe undo area-authentication-mode command disables the function.\nIt is recommended that you enable authentication and use the HMAC-SHA256 algorithm to improve security, preventing route information from being modified by unauthorized users. The area-authentication-mode command enables an IS-IS device to authenticate received Level-1 packets (LSPs and SNPs) based on the pre-defined authentication mode and password and to add authentication information to the Level-1 packets to be sent. The undo area-authentication-mode command disables the function. It is recommended that you enable authentication and use the HMAC-SHA256 algorithm to improve security, preventing route information from being modified by unauthorized users. By default, the system neither encapsulates the generated Level-1 routing packets with authentication information nor authenticates received Level-1 routing packets. Configuring area authentication is recommended to ensure system security.",
    "CLIs": [
        "area-authentication-mode { simple { plain <simple-plain> | [ cipher ] <simple-cipher> } | md5 { plain <plain> | [ cipher ] <cipher> } } [ ip | osi ] [ [ snp-packet { send-only | authentication-avoid } ] | all-send-only ]",
        "area-authentication-mode keychain <keychain-name> [ [ snp-packet { send-only | authentication-avoid } ] | all-send-only ]",
        "area-authentication-mode hmac-sha256 key-id <key-id> { plain <plain> | [ cipher ] <cipher> } [ [ snp-packet { send-only | authentication-avoid } ] | all-send-only ]",
        "undo area-authentication-mode"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "simple",
            "Info": "Indicates the simple authentication.\nFor security purposes, you are advised to configure a password in ciphertext mode. To further improve device security, periodically change the password.\n-"
        },
        {
            "Parameters": "plain",
            "Info": "Indicates the simple text mode. Only the simple text can be entered. The password in the configuration file is displayed as a simple text. Simple authentication used the simple text mode by default.\nWhen configuring an authentication password, select the ciphertext mode because the password is saved in the configuration file as a simple text if you select the simple text mode, which has a high risk. To ensure device security, change the password periodically.\n-"
        },
        {
            "Parameters": "<plain>",
            "Info": "Specifies a cleartext password.\nThe value is a string of case-sensitive characters, which can be letters or digits.\nWhen the authentication mode is simple, the value is a string of 1 to 16 characters. When the authentication mode is MD5 or HMAC-SHA256, the value is a string of 1 to 255 characters.\nThe value cannot contain question marks (?) or spaces. However, when double quotation marks are used around the password, spaces are allowed in the password. In this case, the double quotation marks are used as a part of the password."
        },
        {
            "Parameters": "<simple-plain>",
            "Info": "Specifies a simple-text password.\nThe value is a string of case-sensitive characters that can be letters or digits.\nIn simple authentication, the value is a string of 1 to 16 characters.In MD5 or HMAC-SHA256 authentication, the value is a string of 1 to 255 characters.\nA password cannot contain a question mark (?), but can contain spaces if surrounded by double quotation marks (\"\"). In this case, the double quotation marks are a part of the password."
        },
        {
            "Parameters": "cipher",
            "Info": "Indicates that the password is in ciphertext mode. You can enter a cleartext or ciphertext. When you view the configuration file, the password is displayed in ciphertext. The ciphertext mode is used by default.\n-"
        },
        {
            "Parameters": "cipher <simple-cipher>",
            "Info": "Indicates the ciphertext mode. The simple text or ciphertext can be entered. The password in the configuration file is displayed as a ciphertext. MD5 authentication uses the ciphertext mode by default.\nA ciphertext password is a character string that is encrypted using a special algorithm. A ciphertext is used for configuration restoration. The parameter value must be the same as the ciphertext in the configuration file.\nThe value is a string of case-sensitive characters that can be letters or digits.\nIn simple authentication, the value is a string of 1 to 16 characters in plain text or a string of 24 to 128 characters in cipher text. In md5 or hmac-sha256 authentication, the value is a string of 1 to 255 characters in plain text or a string of 20 to 432 characters in cipher text.\nA 24-character ciphertext password configured in an earlier version is also supported in this version.\nThe value cannot contain question marks (?) or spaces. However, when double quotation marks are used around the password, spaces are allowed in the password. In this case, the double quotation marks are used as a part of the password."
        },
        {
            "Parameters": "<cipher>",
            "Info": "Specifies a ciphertext password.\nA ciphertext password is a character string that is encrypted using a special algorithm. A ciphertext is used for configuration restoration. The parameter value must be the same as the ciphertext in the configuration file.\nThe value is a string of case-sensitive characters that can be letters or digits. When double quotation marks are used around the string, spaces are allowed in the string.\nIn simple authentication, the value is a string of 1 to 16 characters in plain text or a string of 24 to 128 characters in cipher text.When the authentication mode is MD5 or HMAC-SHA256, the value is a string of 1 to 255 characters in plain text or a string of 20 to 432 characters in cipher text.If a 24-character ciphertext password can be configured in the source version, the target version is compatible with the source version.The value cannot contain question marks (?) or spaces. However, when double quotation marks are used around the password, spaces are allowed in the password. In this case, the double quotation marks are used as a part of the password."
        },
        {
            "Parameters": "<simple-cipher>",
            "Info": "Specifies a simple-text or ciphertext password.\nA ciphertext password is a character string that is encrypted using a special algorithm. A ciphertext is used for configuration restoration. The parameter value must be the same as the ciphertext in the configuration file.\nThe value is a string of case-sensitive characters that can be letters or digits When quotation marks are used around the string, spaces are allowed in the string.\nIn simple authentication, the value is a string of 1 to 16 characters in a simple text, or a string of 24 to 128 characters in a ciphertext.In MD5 or HMAC-SHA256 authentication, the value is a string of 1 to 255 characters in a simple text, or a string of 20 to 432 characters in a ciphertext.\nA 24-character ciphertext password configured in an earlier version is also supported in this version.\nA password cannot contain a question mark (?), but can contain spaces if surrounded by double quotation marks (\"\"). In this case, the double quotation marks are a part of the password."
        },
        {
            "Parameters": "md5",
            "Info": "Indicates that the password is transmitted after being encrypted using HMAC-MD5.\nFor the sake of security, using the HMAC-SHA256 algorithm rather than the MD5 algorithm is recommended.\n-"
        },
        {
            "Parameters": "ip",
            "Info": "Indicates the IP authentication password. This parameter is not specified in most cases.\n-"
        },
        {
            "Parameters": "osi",
            "Info": "Indicates the OSI authentication password. By default, the OSI authentication password is specified.\n-"
        },
        {
            "Parameters": "snp-packet",
            "Info": "Enables the device to authenticate SNPs.\n-"
        },
        {
            "Parameters": "send-only",
            "Info": "Encapsulates generated LSPs and SNPs with authentication information and authenticates received LSPs instead of the SNPs.\n-"
        },
        {
            "Parameters": "authentication-avoid",
            "Info": "Prevents the device from encapsulating the generated SNP packets with authentication information and authenticating received SNPs. After the parameter is configured, the device encapsulates only the generated LSPs with authentication information and authenticates received LSPs.\n-"
        },
        {
            "Parameters": "all-send-only",
            "Info": "Encapsulates authentication information in generated LSPs and SNPs but does not check authentication information in the received LSPs or SNPs.\n-"
        },
        {
            "Parameters": "keychain <keychain-name>",
            "Info": "Specifies the keychain that changes with time.\nBefore configuring keychain authentication, run the keychain command to create a keychain, the key-id command to configure a key ID, the key-string command to configure a password, and the algorithm command to configure an algorithm. Otherwise, the authentication fails.\nKeychain authentication supports only HMAC-MD5, SM3, HMAC-SHA256, HMAC-SHA384, and HMAC-SHA512 algorithms. If any other algorithm is used, authentication fails.\nIf the dependent keychain is deleted, the neighbor relationship may be interrupted. Therefore, exercise caution when deleting the keychain.\nThe value is a string of 1 to 47 characters. When quotation marks are used around the string, spaces are allowed in the string.\nA password cannot contain a question mark (?), but can contain spaces if surrounded by double quotation marks (\"\"). In this case, the double quotation marks are a part of the password."
        },
        {
            "Parameters": "hmac-sha256",
            "Info": "Encapsulates generated packets with the HMAC-SHA256 authentication and a password encrypted using the HMAC-SHA256 algorithm and authenticates received packets.\n-"
        },
        {
            "Parameters": "key-id <key-id>",
            "Info": "Specifies the key ID in MD5, HMAC-MD5, or HMAC-SHA256 authentication mode. The key ID must be the same as the key ID on the peer device.\nThe value is an integer ranging from 0 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] area-authentication-mode keychain YsHsjx_202206"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] area-authentication-mode hmac-sha256 key-id 2 YsHsjx_202206"
        ]
    ],
    "ExtraInfo": "To ensure network security, you can enable a router to authenticate received packets based on the pre-defined authentication mode or add authentication information to the packets to be sent. Only the packets that are authenticated can be forwarded on the network.\nThe area-authentication-mode command is valid only on Level-1 or Level-1-2 routers, and it is for all topologies in an IS-IS process."
}