{
    "PageTitle": "bfd all-interfaces incr-cost (IS-IS view)",
    "FuncDef": "The bfd all-interfaces incr-cost command configures each interface in an IS-IS process to adjust its cost based on the status of an associated BFD session.\nThe undo bfd all-interfaces incr-cost command restores the default configuration. The bfd all-interfaces incr-cost command configures each interface in an IS-IS process to adjust its cost based on the status of an associated BFD session. The undo bfd all-interfaces incr-cost command restores the default configuration. By default, no interface in an IS-IS process adjusts its cost based on the status of an associated BFD session.\n\n\nBy default, an IS-IS process does not cancel the cost adjusted by BFD after a delay. By default, no interface in an IS-IS process adjusts its cost based on the status of an associated BFD session. By default, an IS-IS process does not cancel the cost adjusted by BFD after a delay.",
    "CLIs": [
        "bfd all-interfaces incr-cost { <cost-value> | max-reachable }",
        "undo bfd all-interfaces incr-cost [ <cost-value> | max-reachable ]"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "<cost-value>",
            "Info": "Specifies a cost increment value for all interfaces in the IS-IS process.\nThe value is an integer ranging from 1 to 16777213."
        },
        {
            "Parameters": "max-reachable",
            "Info": "Changes the cost of each interface in the IS-IS process to the maximum value 16777214.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 100",
            "[*HUAWEI-isis-100] bfd all-interfaces incr-cost 5"
        ]
    ],
    "ExtraInfo": "Either a link fault or topology change on a network will cause routes to be re-calculated within an area. As such, speeding up the convergence of a routing protocol is critical to improving the network performance.\nAs link faults are inevitable, rapidly detecting these faults and notifying routing protocols is an effective way to quickly resolve such issues. This includes associating BFD with a routing protocol to speed up convergence of the routing protocol once a link fault occurs.\nOn a network where BFD detects a link fault, even if the fault is rectified quickly, the involved interface is disconnected due to the fact that the associated BFD session is down. As a result, the link is unstable and traffic is lost. To ensure network reliability and solve the preceding problems, you can run the bfd all-interfaces incr-cost command in an IS-IS process to adjust the link cost. When an interface in the IS-IS process detects that the BFD session goes Down, the interface automatically increases the link cost, the link whose BFD status is Down is not preferentially selected, and traffic can be transmitted over other links.\nWhen an interface detects that a BFD session goes Up, the cost of the interface is automatically restored to the original value. To prevent frequent BFD status changes caused by link quality, traffic loss may occur due to link instability. To solve the preceding problem, you can set the bfd all-interfaces incr-cost wtr parameter in the IS-IS process to delay the interface cost recovery. A BFD status change within the delay does not cause a path calculation change, ensuring network reliability."
}