{
    "PageTitle": "cost-style",
    "FuncDef": "The cost-style command sets a cost type for the routes that can be received and those to be sent by an IS-IS device.\nThe undo cost-style command restores the default value. The cost-style command sets a cost type for the routes that can be received and those to be sent by an IS-IS device. The undo cost-style command restores the default value. By default, the cost type of IS-IS routes is narrow.",
    "CLIs": [
        "cost-style { narrow | wide | wide-compatible | { compatible | narrow-compatible } [ relax-spf-limit ] }",
        "undo cost-style"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "narrow",
            "Info": "Indicates that the cost type for the routes that can be received and those to be sent by an IS-IS device is narrow.\n-"
        },
        {
            "Parameters": "wide",
            "Info": "Indicates that the cost type for the routes that can be received and those to be sent by an IS-IS device is wide.\n-"
        },
        {
            "Parameters": "wide-compatible",
            "Info": "Indicates that the route with the cost type of narrow or wide can be received, but only the route with the cost type of wide can be sent.\n-"
        },
        {
            "Parameters": "compatible",
            "Info": "Indicates the route with the cost type of narrow or wide can be received and sent.\n-"
        },
        {
            "Parameters": "narrow-compatible",
            "Info": "Indicates that the route with the cost type of wide or narrow can be received, but only the route with the cost type of narrow can be sent.\n-"
        },
        {
            "Parameters": "relax-spf-limit",
            "Info": "Enables an IS-IS device to accept routes with cost greater than 1023.\nIf relax-spf-limit is not specified:If the cost of a route is smaller than or equal to 1023 and the link costs of all interfaces through which the route passes are smaller than or equal to 63:\nThe cost of the route is the sum of the link costs of all the interfaces through which the route passes.\nIf the cost of a route is smaller than or equal to 1023 but the link costs of some interfaces through which the route passes are greater than 63:\nThe device can learn only the direct routes of other interfaces on the device where the interface resides and the routes imported by the interface. The cost of the route is the actual value. The interface through which the route passes discards the route. The routes after the interface are discarded.\nIf the cost of a route is greater than 1023:\nThe device can receive all the routes to the network segment where the interface whose cost is smaller than 1023 resides. If the cost of a route is greater than 1023, the device receives the route as 1023. The device cannot receive all the routes to the network segment where the interface whose cost is greater than 1023 resides.\nSet relax-spf-limit.\nThere is no limit on the link costs of interfaces or route costs. The route is received according to the actual cost.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] cost-style narrow-compatible"
        ]
    ],
    "ExtraInfo": "By default, the cost style of IS-IS routes is narrow. In this mode, routes with the interface cost ranging from 1 to 63 can be advertised, and routes with the interface cost ranging from 1 to 1023 can be accepted. When IS-IS needs to carry tag information to apply a routing policy, LSPs carry additional information. As a result, these LSPs cannot be flooded in narrow mode. You can run the cost-style command to change the cost style of IS-IS routes according to network requirements so that LSPs can be transmitted successfully.\nIn actual applications, the cost style of IS-IS routes is usually set to wide to facilitate the implementation of extended IS-IS functions.\nrelax-spf-limit is valid only when the cost-style is compatible or narrow-compatible."
}