{
    "PageTitle": "ipv6 filter-policy export",
    "FuncDef": "The ipv6 filter-policy export command configures IS-IS to filter imported IPv6 routes before route advertisement.\nThe undo ipv6 filter-policy export command disables such filtering. The ipv6 filter-policy export command configures IS-IS to filter imported IPv6 routes before route advertisement. The undo ipv6 filter-policy export command disables such filtering. By default, IS-IS does not filter imported IPv6 routes before route advertisement. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 filter-policy { <acl6-number> | acl6-name <acl6-name-string> | ipv6-prefix <ipv6-prefix-name> | route-policy <route-policy-name> } { export [ direct | static | ripng <process-id> | bgp | ospfv3 <process-id> | isis <process-id> ] }",
        "undo ipv6 filter-policy [ <acl6-number> | acl6-name <acl6-name-string> | ipv6-prefix <ipv6-prefix-name> | route-policy <route-policy-name> ] { export [ direct | static | ripng <process-id> | bgp | ospfv3 <process-id> | isis <process-id> ] }"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "<acl6-number>",
            "Info": "Specifies a basic ACL6 number.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "acl6-name <acl6-name-string>",
            "Info": "Specifies the name of a named basic ACL6.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "ipv6-prefix <ipv6-prefix-name>",
            "Info": "Specifies the name of an IPv6 address prefix list.\nThe value is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a route-policy to filter routes based on tags and other protocol parameters.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "direct",
            "Info": "Specifies to filter the imported direct routes before route advertisement.\n-"
        },
        {
            "Parameters": "static",
            "Info": "Specifies to filter the imported static routes before route advertisement.\n-"
        },
        {
            "Parameters": "ripng <process-id>",
            "Info": "Specifies the ID of an RIPng process.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "bgp",
            "Info": "Specifies to filter the imported BGP routes before route advertisement.\n-"
        },
        {
            "Parameters": "ospfv3 <process-id>",
            "Info": "Specifies the OSPFv3 process ID.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "isis <process-id>",
            "Info": "Specifies an IS-IS process ID.\nThe value is an integer ranging from 1 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 2002",
            "[*HUAWEI-acl6-basic-2002] quit",
            "[*HUAWEI] isis",
            "[*HUAWEI-isis-1] ipv6 enable",
            "[*HUAWEI-isis-1] ipv6 filter-policy 2002 export"
        ]
    ],
    "ExtraInfo": ""
}