{
    "PageTitle": "ipv6 default-route-advertise",
    "FuncDef": "The ipv6 default-route-advertise command enables a device to advertise a default IPv6 route.\nThe undo ipv6 default-route-advertise command disables a device from advertising a default IPv6 route. The ipv6 default-route-advertise command enables a device to advertise a default IPv6 route. The undo ipv6 default-route-advertise command disables a device from advertising a default IPv6 route. By default, a device does not advertise default IPv6 routes. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 default-route-advertise [ always | matchdefault | { route-policy <route-policy-name> } ] [ [ cost <cost> ] | [ tag <tag> ] | [ level-1 | level-2 | level-1-2 ] ] [ avoid-learning ]",
        "undo ipv6 default-route-advertise"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "always",
            "Info": "Enables an IS-IS device to advertise the default IPv6 route unconditionally. This parameter is specified by default when the ipv6 default-route-advertise command is run. In this case, if the avoid-learning parameter is not specified, the device is allowed to calculate the IS-IS default IPv6 routes advertised by other devices, which may cause routing loops.\n-"
        },
        {
            "Parameters": "match",
            "Info": "Advertises a default route in the local LSP when the default route generated by another routing protocol or another IS-IS process exists in the IPv6 routing table.\n-"
        },
        {
            "Parameters": "default",
            "Info": "Configures the device to advertises the default routes in local LSPs if it has active default IPv6 routes of other routing protocols or IS-IS processes. The priority of the matched default route must be higher than that of the routes in the IS-IS process on the local device. Otherwise, the IS-IS process on the local device changes the default route on which the IS-IS process depends to inactive after calculating the received default route.\n-"
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a route-policy.\nIf the routes that match the route-policy include non-default routes, a default IPv6 route that belongs to a process of another routing protocol, or a default IPv6 route that belongs to another IS-IS process, the device advertises a default route through a local LSP. In this case, if the avoid-learning parameter is not specified, the device is allowed to calculate the IS-IS default routes advertised by other devices, which may cause routing loops.If only the default IPv6 route in the current local IS-IS process matches the route-policy, the device does not advertise a default route through a local LSP.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "cost <cost>",
            "Info": "Specifies a cost for the default route.\nThe value is an integer ranging from 0 to 4261412864."
        },
        {
            "Parameters": "tag <tag>",
            "Info": "Specifies a tag for the default route to be advertised.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "level-1",
            "Info": "Sets the level as Level-1.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Sets the level as Level-2.\n-"
        },
        {
            "Parameters": "level-1-2",
            "Info": "Sets the level as Level-1-2.\nIf you do not specify a level, Level-2 routes are generated by default.\n-"
        },
        {
            "Parameters": "avoid-learning",
            "Info": "Prevents the specified IS-IS process from adding a learned default IPv6 route to the routing table.\nIf the local device has advertised a default route in the specified IS-IS process, the device no longer adds a learned IS-IS default route to the routing table.If the device has not advertised a default route in the specified IS-IS process, the device can still add a learned IS-IS default route to the routing table even if avoid-learning is specified.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] ipv6 enable",
            "[*HUAWEI-isis-1] ipv6 default-route-advertise"
        ]
    ],
    "ExtraInfo": "This command can be run on a Level-1 or Level-2 device.\nBy using a route-policy, you can configure IS-IS to generate default routes only when there is a matched entry in the routing table."
}