{
    "PageTitle": "ipv6 enable (IS-IS view)",
    "FuncDef": "The ipv6 enable command enables the IPv6 capability for an IS-IS process.\nThe undo ipv6 enable command disables the IPv6 capability. The ipv6 enable command enables the IPv6 capability for an IS-IS process. The undo ipv6 enable command disables the IPv6 capability. By default, the IPv6 capability is disabled. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 enable [ topology { compatible [ enable-mt-spf ] | ipv6 | standard } ]",
        "undo ipv6 enable"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "topology",
            "Info": "Indicates a topology of the network.\n-"
        },
        {
            "Parameters": "compatible",
            "Info": "Sets the compatible mode for the topology. If the compatible mode is specified, after an IPv6 IS-IS neighbor relationship is established, IS-IS advertises the neighbor information in both standard and IPv6 topologies but uses the standard topology to calculate IPv4 and IPv6 routes.\n-"
        },
        {
            "Parameters": "enable-mt-spf",
            "Info": "Configures the device to use the IPv6 topology to calculate IPv6 routes when the topology mode is compatible.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Sets the IPv6 mode for the topology. If the IPv6 mode is specified, after an IPv6 IS-IS neighbor relationship is established, IS-IS advertises the neighbor information only in the IPv6 topology and uses the IPv6 topology to calculate IPv6 routes.\n-"
        },
        {
            "Parameters": "standard",
            "Info": "Sets the standard mode for the topology. If the standard mode is specified, after an IPv6 IS-IS neighbor relationship is established, IS-IS advertises the neighbor information only in the standard topology and uses the standard topology to calculate IPv4 and IPv6 routes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] network-entity 10.0001.1010.1020.1030.00",
            "[*HUAWEI-isis-1] ipv6 enable topology ipv6"
        ]
    ],
    "ExtraInfo": "In IS-IS, if the topology mode is set to standard or compatible, the device advertises neighbor information about an interface in the standard topology when the interface establishes either IPv4 or IPv6 neighbor relationships with other devices. In this case, other devices cannot determine whether the interface is configured with both IPv4 and IPv6 addresses, and both the local device and other devices use the interface to calculate IPv4 and IPv6 routes in the standard topology. As a result, traffic of the interface on which the IPv4 or IPv6 address family is not configured may be interrupted. To prevent this problem, you are advised to set the topology mode to IPv6 to isolate IPv6 services from IPv4 services. If the current topology mode is standard, you are advised to change it to IPv6. Before you change the mode, ensure that both IPv4 and IPv6 addresses are configured for IS-IS interfaces on the entire network. The configuration procedure is as follows:"
}