{
    "PageTitle": "ipv6 bfd all-interfaces incr-cost (IS-IS view)",
    "FuncDef": "The ipv6 bfd all-interfaces incr-cost command configures each interface in an IPv6 IS-IS process to adjust its cost based on the status of an associated BFD session.\nThe undo ipv6 bfd all-interfaces incr-cost command restores the default configuration. The ipv6 bfd all-interfaces incr-cost command configures each interface in an IPv6 IS-IS process to adjust its cost based on the status of an associated BFD session. The undo ipv6 bfd all-interfaces incr-cost command restores the default configuration. By default, an IPv6 IS-IS process does not adjust the cost based on BFD.\n\n\nBy default, an IS-IS process does not delay withdrawing the cost adjusted by IPv6 BFD. By default, an IPv6 IS-IS process does not adjust the cost based on BFD. By default, an IS-IS process does not delay withdrawing the cost adjusted by IPv6 BFD. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 bfd all-interfaces incr-cost { <cost-value> | max-reachable }",
        "undo ipv6 bfd all-interfaces incr-cost [ <cost-value> | max-reachable ]"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "<cost-value>",
            "Info": "Specifies a cost increment value for all interfaces in the IS-IS process.\nThe value is an integer ranging from 1 to 16777213."
        },
        {
            "Parameters": "max-reachable",
            "Info": "Changes the cost of each interface in the IS-IS process to the maximum value 16777214.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 100",
            "[*HUAWEI-isis-100] ipv6 enable topology ipv6",
            "[*HUAWEI-isis-100] ipv6 bfd all-interfaces incr-cost 5"
        ]
    ],
    "ExtraInfo": "Either a link fault or topology change on a network will cause routes to be re-calculated within an area. As such, speeding up the convergence of a routing protocol is critical to improving the network performance.\nAs link faults are inevitable, rapidly detecting these faults and notifying routing protocols is an effective way to quickly resolve such issues. This includes associating BFD with a routing protocol to speed up convergence of the routing protocol once a link fault occurs.\nOn a network where BFD detects a link fault, even if the fault is rectified quickly, the involved interface is disconnected due to the fact that the associated BFD session is down. As a result, the link is unstable and traffic is lost. To ensure network reliability and solve the preceding problems, you can run the ipv6 bfd all-interfaces incr-cost command in the IPv6 IS-IS process to adjust the link cost. When an interface in the IPv6 IS-IS process detects that the BFD session goes Down, the cost of the interface is automatically increased, the link whose BFD status is Down is not preferentially selected, and traffic can be transmitted over other links.\nWhen an interface detects that an IPv6 BFD session goes Up, the cost of the interface is automatically restored to the original value. To prevent frequent BFD status changes caused by link quality, traffic loss may occur due to link instability. To solve the preceding problem, you can set the ipv6 bfd all-interfaces incr-cost wtr parameter in the IS-IS process to set a delay for restoring the interface cost. If the IPv6 BFD session status changes within the delay, route calculation does not change. This ensures network reliability."
}