{
    "PageTitle": "ipv6 bfd all-interfaces",
    "FuncDef": "The ipv6 bfd all-interfaces command configures parameters for IPv6 BFD sessions.\nThe undo ipv6 bfd all-interfaces command restores the default values. The ipv6 bfd all-interfaces command configures parameters for IPv6 BFD sessions. The undo ipv6 bfd all-interfaces command restores the default values. By default, the minimum interval at which IPv6 BFD packets are sent or received is 1000, in milliseconds; the IPv6 BFD local detection multiplier is 3. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 bfd all-interfaces { min-rx-interval <receive-interval> | min-tx-interval <transmit-interval> | detect-multiplier <multiplier-value> | frr-binding }",
        "undo ipv6 bfd all-interfaces { min-rx-interval [ <receive-interval> ] | min-tx-interval [ <transmit-interval> ] | detect-multiplier [ <multiplier-value> ] | frr-binding }"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "min-rx-interval <receive-interval>",
            "Info": "Specifies the minimum interval at which IPv6 BFD packets are received from the peer end.\nThe value is an integer ranging from 3 to 1000, in milliseconds. The default value is 1000."
        },
        {
            "Parameters": "min-tx-interval <transmit-interval>",
            "Info": "Specifies the minimum interval at which IPv6 BFD packets are sent to the peer end.\nThe value is an integer ranging from 3 to 1000, in milliseconds. The default value is 1000."
        },
        {
            "Parameters": "detect-multiplier <multiplier-value>",
            "Info": "Specifies the IPv6 BFD local detection multiplier.\nThe value ranges from 3 to 50. The default value is 3."
        },
        {
            "Parameters": "frr-binding",
            "Info": "Associates IPv6 BFD session status with IPv6 IS-IS auto FRR. If IPv6 BFD detects a link fault on an interface, the IPv6 BFD session goes Down, triggering FRR. Traffic is then quickly switched to the backup link, minimizing service loss.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] ipv6 enable",
            "[*HUAWEI-isis-1] ipv6 bfd all-interfaces enable",
            "[*HUAWEI-isis-1] ipv6 bfd all-interface min-tx-interval 300"
        ]
    ],
    "ExtraInfo": "BFD can provide millisecond-level fault detection, help IS-IS to detect the faults that occur on neighboring devices or links more quickly, and instruct IS-IS to recalculate routes for correct packet forwarding. The ipv6 bfd all-interfaces command can be used to configure parameters for IPv6 BFD sessions."
}