{
    "PageTitle": "isis timer csnp",
    "FuncDef": "The isis timer csnp command configures an interval at which CSNPs are sent on the broadcast network.\nThe undo isis timer csnp command restores the default value. The isis timer csnp command configures an interval at which CSNPs are sent on the broadcast network. The undo isis timer csnp command restores the default value. By default, the interval at which CSNPs are sent is 10 seconds.",
    "CLIs": [
        "isis timer csnp <csnp-interval> [ level-1 | level-2 ]",
        "undo isis timer csnp [ <csnp-interval> ] [ level-1 | level-2 ]"
    ],
    "ParentView": [
        "100GE interface view,10GE sub-interface view,10GE interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,Loopback interface view,Tunnel interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<csnp-interval>",
            "Info": "Specifies an interval at which CSNPs are sent on a broadcast network.\nThe value is an integer ranging from 1 to 65535, in seconds."
        },
        {
            "Parameters": "level-1",
            "Info": "Indicates the interval at which Level-1 CSNPs are sent.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Indicates the interval at which Level-2 CSNPs are sent.\nIf neither Level-1 nor Level-2 is specified, by default, the interval at which the CSNPs of the current level are sent is set.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface 100GE1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] isis enable 1",
            "[*HUAWEI-100GE1/0/1] isis timer csnp 15 level-2"
        ]
    ],
    "ExtraInfo": "On a broadcast network, a DIS sends CSNPs periodically to enable all devices to synchronize LSDBs with one another. If a device finds that the local LSDB does not have a specific LSP or an existing LSP is not the latest one after the device has received a CSNP, the device will send a PSNP to request the corresponding LSP.\nThe interval at which CSNPs are sent can be configured using the isis timer csnp command."
}