{
    "PageTitle": "isis cost (interface view)",
    "FuncDef": "The isis cost command sets a link cost for an IS-IS interface.\nThe undo isis cost command restores the default link cost. The isis cost command sets a link cost for an IS-IS interface. The undo isis cost command restores the default link cost. By default, the link cost of IS-IS interfaces is 10.",
    "CLIs": [
        "isis cost <cost> [ level-1 | level-2 ]",
        "isis process-id <process-id> cost <cost> [ level-1 | level-2 ]",
        "undo isis cost [ <cost> ] [ level-1 | level-2 ]",
        "undo isis process-id <process-id> cost [ <cost> ] [ level-1 | level-2 ]"
    ],
    "ParentView": [
        "100GE interface view,10GE sub-interface view,10GE interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,Loopback interface view,Tunnel interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "cost <cost>",
            "Info": "Specifies a link cost for the SPF calculation.\nThe value is an integer. The value range depends on the cost style.When the cost style is narrow, narrow-compatible, or compatible, the value ranges from 1 to 63.If the cost style is wide or wide-compatible, the value ranges from 1 to 16777214.maximum: sets the link cost of an interface to 16777215.The minimum value varies according to the interface type. When the interface type is Loopback, the minimum value is 0. For other interface types, the minimum value is 1.\nThis parameter can be configured only when the IS-IS cost style is wide or wide-compatible. After the cost of an interface is set to 16777215, the neighbor TLV generated on the link of the interface cannot be used for route calculation but can only be used to transmit TE information.\nThe cost style is configured using the cost-style command."
        },
        {
            "Parameters": "level-1",
            "Info": "Sets the link cost value for the Level-1 interface.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Sets the link cost value for the Level-2 interface.\nIf Level-1 or Level-2 is not specified in the command, the link cost is set for Level-1 and Level-2 interfaces by default.\n-"
        },
        {
            "Parameters": "process-id <process-id>",
            "Info": "Specifies the IID of an IS-IS multi-instance process.\nThe value is an integer ranging from 1 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface 100GE1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] isis enable",
            "[*HUAWEI-100GE1/0/1] isis cost 5 level-2"
        ]
    ],
    "ExtraInfo": "On a large-scale network, there may be multiple valid routes to the same destination. IS-IS uses the SPF algorithm to calculate an optimal route and transmits traffic over the optimal route, which causes the following problems:"
}