{
    "PageTitle": "isis timer holding-multiplier",
    "FuncDef": "The isis timer holding-multiplier command sets the IS-IS holdtime to be a multiple of the interval at which Hello packets are sent.\nThe undo isis timer holding-multiplier command restores the default value. The isis timer holding-multiplier command sets the IS-IS holdtime to be a multiple of the interval at which Hello packets are sent. The undo isis timer holding-multiplier command restores the default value. By default, the holdtime is three times the interval at which Hello packets are sent.",
    "CLIs": [
        "isis timer holding-multiplier <number>",
        "undo isis timer holding-multiplier [ <number> ]"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Loopback interface view,Tunnel interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<number>",
            "Info": "Sets the holdtime of a neighbor to a multiple of the interval at which Hello packets are sent.\nThe value is an integer ranging from 3 to 1000. The default value is 3."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface 100GE1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] isis enable 1",
            "[*HUAWEI-100GE1/0/1] isis circuit-type p2p",
            "[*HUAWEI-100GE1/0/1] isis timer holding-multiplier 6 level-2"
        ]
    ],
    "ExtraInfo": "Devices at both ends of a link establish a neighbor relationship by sending Hello packets to each other. After the neighbor relationship is established, both devices need to send Hello packets at a specified interval to maintain the neighbor relationship. If a device does not receive any Hello packet from its neighbor within a specified period of time, the device considers the neighbor to be Down. The specified time period is known as the neighbor holdtime.\nFor example, if you run the isis timer hello 20 command to set the interval for sending Hello packets to 20s on the local device, and then run the isis timer holding-multiplier 4 command, the holdtime is 80s (4\\ x 20 = 80). If the interval for sending Hello packets is changed using the isis timer hello command, the holdtime will be changed accordingly."
}