{
    "PageTitle": "isis circuit-type",
    "FuncDef": "The isis circuit-type command sets the network type of an interface to emulate a P2P interface.\nThe undo isis circuit-type command restores the default network type. The isis circuit-type command sets the network type of an interface to emulate a P2P interface. The undo isis circuit-type command restores the default network type. By default, the network type of an interface is determined by the physical type of the interface.",
    "CLIs": [
        "isis circuit-type p2p [ strict-snpa-check ]",
        "isis process-id <process-id> circuit-typep2p [ strict-snpa-check ]",
        "undo isis circuit-type",
        "undo isis process-id <process-id> circuit-type"
    ],
    "ParentView": [
        "100GE interface view,10GE sub-interface view,10GE interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,Loopback interface view,Tunnel interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "strict-snpa-check",
            "Info": "Enables IS-IS to check the SNPA address of each received LSP or SNP.\n-"
        },
        {
            "Parameters": "process-id <process-id>",
            "Info": "Specifies the IID of an IS-IS multi-instance process.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "p2p",
            "Info": "Sets the interface network type as P2P.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface 100GE1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] isis enable",
            "[*HUAWEI-100GE1/0/1] isis circuit-type p2p"
        ]
    ],
    "ExtraInfo": "The network type of IS-IS interfaces at the ends of a link must be the same. Otherwise, the two interfaces cannot set up a neighbor relationship.\nThe isis circuit-type command sets the network type of an interface to emulate a P2P interface so that the IS-IS interfaces at the ends of the link have the same network type and a neighbor relationship can be established between them.\nWhen an IS-IS neighbor relationship is established between a P2P interface and a simulated P2P interface and the simulated P2P interface has direct neighbors, the P2P interface may receive unneeded packets from these direct neighbors. To prevent the P2P interface from accepting these unneeded packets, specify strict-snpa-check in the isis circuit-type command to enable IS-IS to check the SNPA address of each received LSP or SNP. After the command is run, the P2P interface accepts only the packets whose SNPA addresses are included in the local neighbor address list, which improves network security."
}