{
    "PageTitle": "isis timer holding-multiplier (interface view)",
    "FuncDef": "The isis timer holding-multiplier command sets the IS-IS holdtime to be a multiple of the interval at which Hello packets are sent.\nThe undo isis timer holding-multiplier command restores the default value. The isis timer holding-multiplier command sets the IS-IS holdtime to be a multiple of the interval at which Hello packets are sent. The undo isis timer holding-multiplier command restores the default value. By default, the holdtime is three times the interval at which Hello packets are sent.",
    "CLIs": [
        "isis timer holding-multiplier <number> [ level-1 | level-2 ]",
        "undo isis timer holding-multiplier [ <number> ] [ level-1 | level-2 ]"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<number>",
            "Info": "Specifies the IS-IS holdtime to be a multiple of the interval at which Hello packets are sent.\nThe value is an integer ranging from 3 to 1000."
        },
        {
            "Parameters": "level-1",
            "Info": "Specifies the holdtime of a Level-1 neighbor.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Specifies the holdtime of a Level-2 neighbor.\nIf neither Level-1 nor Level-2 is specified, the default level is Level-1 and Level-2.\nlevel-1 and level-2 can be configured only on IS-IS broadcast interfaces.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface 100GE1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] isis enable 1",
            "[*HUAWEI-100GE1/0/1] isis timer holding-multiplier 6 level-2"
        ]
    ],
    "ExtraInfo": "Devices at both ends of a link establish a neighbor relationship by sending Hello packets. After the neighbor relationship is established, Hello packets need to be periodically sent to maintain the neighbor relationship. If a device at one end of a link does not receive Hello packets from the peer device within a specified period, the device considers the peer neighbor Down. The interval is called the neighbor holdtime.\nFor example, if the interval for sending Hello packets is set to 20 seconds using the isis timer hello 20 command and the isis timer holding-multiplier 4 command is run on the local device, the suppression time is 80 seconds (4 x 20 = 80). When you run the isis timer hello command to change the interval for sending Hello packets, the holdtime of the neighbor changes accordingly.\nOn a broadcast network, to ensure fast route convergence, the interval at which the DIS sends Hello packets is short, and the holdtime of the DIS neighbor observed on the DIS neighbor is also short. DIS neighbor holdtime = Interval at which Hello packets are sent x Number. The non-DIS neighbor holdtime is 1/3 of the DIS neighbor holdtime."
}