{
    "PageTitle": "set-overload",
    "FuncDef": "The set-overload command sets the overload bit for non-pseudonode LSPs.\nThe undo set-overload command clears the set overload bit. The set-overload command sets the overload bit for non-pseudonode LSPs. The undo set-overload command clears the set overload bit. By default, the overload bit is not set.",
    "CLIs": [
        "set-overload",
        "set-overload { allow { interlevel | external } }",
        "set-overload { on-startup [ <timeout1> | start-from-nbr <system-id> [ <timeout1> [ <timeout2> ] ] | wait-for-bgp [ <timeout1> ] ] [ route-delay-distribute <timeout4> ] [ send-sa-bit [ <timeout3> ] ] [ route-max-metric ] }",
        "set-overload { on-startup [ <timeout1> | start-from-nbr <system-id> [ <timeout1> [ <timeout2> ] ] | wait-for-bgp [ <timeout1> ] ] [ route-delay-distribute <timeout4> ] [ send-sa-bit [ <timeout3> ] ] [ route-max-metric ] } { allow { interlevel | external } }",
        "undo set-overload"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "allow",
            "Info": "Indicates that the learned address prefixes can be advertised. By default, when the system enters the overload state, the address prefixes learned from other protocols, other IS-IS processes, or IS-IS of a different level cannot be advertised.\n-"
        },
        {
            "Parameters": "interlevel",
            "Info": "Enables the device to advertise the IP prefixes learned from IS-IS of different levels when allow is configured.\n-"
        },
        {
            "Parameters": "external",
            "Info": "Indicates that if allow is configured, the IP address prefixes learned from other protocols or other IS-IS processes can be advertised.\n-"
        },
        {
            "Parameters": "on-startup",
            "Info": "Sets the overload bit within the specified period when a device is restarted or faulty.\n-"
        },
        {
            "Parameters": "<timeout1>",
            "Info": "Specifies the period during which the overload bit remains set after the device is started and the IS-IS component is registered.\nThe value is an integer ranging from 5 to 86400, in seconds. The default value is 600 seconds."
        },
        {
            "Parameters": "start-from-nbr <system-id>",
            "Info": "Sets the overload bit based on the status of the neighbor with the specified system ID.\nThe value is a string of 1 to 19 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "<timeout2>",
            "Info": "Specifies the period during which the overload bit remains set based on the neighbor status.If the specified neighbor does not go Up within timeout2, the overload bit of the system remains set over a period specified by timeout2.If the specified neighbor goes Up within timeout2, the overload bit of the system remains set over a period specified by timeout1.\nThe value is an integer ranging from 5 to 86400, in seconds. The default value is 1200 seconds."
        },
        {
            "Parameters": "wait-for-bgp",
            "Info": "Sets the duration of the overload bit to wait for the completing of BGP convergence. The duration can be set according to the BGP convergence time on the device.\nAfter this parameter is set, the device notifies other devices that it is in the Overload state and instruct them not to use itself as a traffic forwarding node. The overload bit set in the LSP is cleared only after timeout1 expires.\n-"
        },
        {
            "Parameters": "route-delay-distribute <timeout4>",
            "Info": "Configures delayed route advertisement.\nDescription:\nAfter the device is restarted, if other devices still use old LSPs to calculate the routes to the restarted device, traffic is imported to the restarted device. To prevent this problem, set this parameter with send-sa-bit.\nIf this parameter is used independently, due to residual LSPs on the network, traffic may fail to be prevented from being sent to the restarted device.\nThe value is an integer ranging from 5 to min (timeout1, 1000), in seconds."
        },
        {
            "Parameters": "send-sa-bit",
            "Info": "Indicates that Hello packets sent after the device restarts carry the SA bit. When a neighbor receives a Hello packet in which the SA bit is set to TRUE from the restarter, the LSP of the neighbor does not carry adjacency information. The SA bit is the Suppress Adjacency Bit field carried in the Restart Signaling flag TLV of an IS-IS Hello packet. The SA bit is used to prevent a faulty device from establishing adjacencies with neighboring devices.\n-"
        },
        {
            "Parameters": "<timeout3>",
            "Info": "Specifies the period during which the overload bit remains in Hello packets after the device is started.\nThe value is an integer ranging from 5 to 600, in seconds. The default value is 30 seconds."
        },
        {
            "Parameters": "route-max-metric",
            "Info": "Set the local originating route to the maximum metric.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] set-overload on-startup start-from-nbr 0000.0000.0002 300 1000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] set-overload"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] set-overload on-startup allow interlevel"
        ]
    ],
    "ExtraInfo": "If the system cannot store new LSPs or synchronize LSDBs due to insufficient memory, the routing information calculated by the system is incorrect. In this case, the system automatically enters the Overload state, regardless of the configuration.\nYou can run this command to configure an IS-IS process to enter the Overload state when the device starts or restarts and instruct other devices not to use it as a traffic forwarding node.\nTo prevent other devices from using the local device for SPF calculation (for example, when the local device is started for the first time or fails), run the set-overload command on the local device without specifying on-startup. In this case, the system immediately sets the overload bit in the LSPs to be sent. You can only run the undo set-overload command to cancel the overload bit.\nTo prevent other devices from using the local device for SPF calculation when the local device restarts, run the set-overload command with on-startup specified on the local device.\nWhen on-startup is specified, you can use the route-delay-distribute timeout4 parameter to control the delay in advertising routes. After the device configured with the route-delay-distribute timeout4 parameter is restarted, route advertisement is delayed until timeout4 expires or the overload bit disappears. After the device restarts, if routes need to be advertised immediately before timeout4 expires, you can use the following methods for timely route advertisement:"
}