{
    "PageTitle": "suppress-flapping lsp-flood",
    "FuncDef": "The suppress-flapping lsp-flood command configures a period for the system to delay LSP flooding during route flapping.\nThe suppress-flapping lsp-flood disable command restores the default configuration.\nThe undo suppress-flapping lsp-flood command restores the default configuration. The suppress-flapping lsp-flood command configures a period for the system to delay LSP flooding during route flapping. The suppress-flapping lsp-flood disable command restores the default configuration. The undo suppress-flapping lsp-flood command restores the default configuration. By default, if route flapping occurs, the device delays LSP flooding for 10s.",
    "CLIs": [
        "suppress-flapping lsp-flood { disable | timer <delay-interval> [ threshold <threshold-value> ] }",
        "undo suppress-flapping lsp-flood"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "timer <delay-interval>",
            "Info": "Specifies a period for the system to delay LSP flooding during route flapping.\nThe value is an integer ranging from 1 to 600, in seconds."
        },
        {
            "Parameters": "threshold <threshold-value>",
            "Info": "Specifies a route flapping threshold. If a route flaps for the specified number of times, LSP flooding is delayed.\nThe value is an integer ranging from 3 to 100, in times."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] suppress-flapping lsp-flood timer 5 threshold 10"
        ]
    ],
    "ExtraInfo": "On an IS-IS network, if a device receives an LSP with a routing information change, it floods LSPs to advertise the change. If routing information changes frequently, flooding LSPs immediately consumes a large number of system resources. To prevent this problem, run the suppress-flapping lsp-flood command to configure the device to suppress LSP flooding. That is, LSPs are flooded after a specified delay.\nThe flapping suppression process is as follows:"
}