{
    "PageTitle": "tiebreaker preference (IS-IS FRR view)",
    "FuncDef": "The tiebreaker preference command sets the solution of selecting a backup path for IS-IS Auto FRR.\nThe undo tiebreaker preference command restores the default solution of selecting a backup path for IS-IS Auto FRR. The tiebreaker preference command sets the solution of selecting a backup path for IS-IS Auto FRR. The undo tiebreaker preference command restores the default solution of selecting a backup path for IS-IS Auto FRR. By default, the node-protection path first solution is used in IS-IS Auto FRR.",
    "CLIs": [
        "tiebreaker { node-protecting | lowest-cost | non-ecmp | srlg-disjoint | hold-max-cost } preference <preference> [ level-1 | level-2 | level-1-2 ]",
        "undo tiebreaker { node-protecting | lowest-cost | non-ecmp | srlg-disjoint | hold-max-cost } [ preference <preference> ] [ level-1 | level-2 | level-1-2 ]"
    ],
    "ParentView": [
        "IS-IS FRR view"
    ],
    "ParaDef": [
        {
            "Parameters": "node-protecting",
            "Info": "Sets the solution of selecting a backup path for IS-IS Auto FRR to node-protection path first.\n-"
        },
        {
            "Parameters": "lowest-cost",
            "Info": "Sets the solution of selecting a backup path for IS-IS Auto FRR to smallest-cost path first.\n-"
        },
        {
            "Parameters": "non-ecmp",
            "Info": "Sets the solution of selecting a backup path for IS-IS Auto FRR to non-ECMP first.\n-"
        },
        {
            "Parameters": "srlg-disjoint",
            "Info": "Sets the solution of selecting a backup path for IS-IS Auto FRR to shared risk link group (SRLG) disjoint first.\n-"
        },
        {
            "Parameters": "hold-max-cost",
            "Info": "Sets the solution of selecting a backup path for IS-IS Auto FRR to the maximum cost path first.\n-"
        },
        {
            "Parameters": "preference <preference>",
            "Info": "Specifies a priority for the solution. The larger the value, the higher the priority.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "level-1",
            "Info": "Sets the solution of selecting a backup path for Level-1 IS-IS Auto FRR.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Sets the solution of selecting a backup path for Level-2 IS-IS Auto FRR.\n-"
        },
        {
            "Parameters": "level-1-2",
            "Info": "Sets the solution of selecting a backup path for both Level-1 and Level-2 IS-IS Auto FRR.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] frr",
            "[*HUAWEI-isis-1-frr] loop-free-alternate",
            "[*HUAWEI-isis-1-frr] tiebreaker hold-max-cost preference 255"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] frr",
            "[*HUAWEI-isis-1-frr] loop-free-alternate",
            "[*HUAWEI-isis-1-frr] tiebreaker lowest-cost preference 255"
        ]
    ],
    "ExtraInfo": "In IS-IS Auto FRR, the solution of protecting nodes is preferred for selecting a backup path. However, in an actual network, due to factors such as interface data capability or link cost, the solution of selecting a backup path may need to be adjusted to a path with the minimum cost or another optional path. In this case, you can run the tiebreaker command to adjust the value."
}