{
    "PageTitle": "lldp transmit fast-mode interval",
    "FuncDef": "The lldp transmit fast-mode interval command configures an interval for a device interface to send Link Layer Discovery Protocol (LLDP) packets.\nThe undo lldp transmit fast-mode interval command restores the default interval. The lldp transmit fast-mode interval command configures an interval for a device interface to send Link Layer Discovery Protocol (LLDP) packets. The undo lldp transmit fast-mode interval command restores the default interval. By default, the interval for a device interface to send LLDP packets is the same as the global interval for the device to send LLDP packets.",
    "CLIs": [
        "lldp transmit fast-mode interval <packet-interval>",
        "undo lldp transmit fast-mode interval [ <packet-interval> ]"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,100GE interface view,Layer 2 10GE interface view,10GE interface view,Layer 2 200GE interface view,200GE interface view,25GE-L2 view,25GE interface view,400GE-L2 view,400GE interface view,Layer 2 50GE interface view,50GE interface view,Layer 2 GE interface view,Interface group view,Management interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<packet-interval>",
            "Info": "Indicates packet Interval.\nThe value is an integer that ranges from 1 to 32768 ."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lldp enable",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] lldp transmit fast-mode interval 2"
        ]
    ],
    "ExtraInfo": "When the LLDP status of a device remains unchanged or no new neighbor is discovered, the interface module periodically sends LLDP packets to its neighbors at a specified interval. By periodically exchanging LLDP packets with neighbors, a device can notify neighbors of its own status to ensure the accuracy and timely discovery of network topology and communication stability.\nTo adjust the global frequency of network topology discovery, run the lldp transmit interval command to set a global interval for the device to send LLDP packets. Device interfaces may send LLDP packets at different intervals. If the network topology connected to an interface needs to be promptly discovered, run the lldp transmit fast-mode interval command to increase the LLDP packet exchange frequency."
}