{
    "PageTitle": "lldp admin-status",
    "FuncDef": "The lldp admin-status command configures the Link Layer Discovery Protocol (LLDP) working mode for an interface, or enables LLDP and configures an LLDP working mode for an LLDP-disabled interface.\nThe undo lldp admin-status command restores the default LLDP working mode for an interface. The lldp admin-status command configures the Link Layer Discovery Protocol (LLDP) working mode for an interface, or enables LLDP and configures an LLDP working mode for an LLDP-disabled interface. The undo lldp admin-status command restores the default LLDP working mode for an interface. By default, the LLDP working mode of a main interface is Tx/Rx, meaning that the interface both sends and receives LLDP packets.",
    "CLIs": [
        "lldp admin-status { tx | rx | txrx }",
        "undo lldp admin-status"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,100GE interface view,Layer 2 10GE interface view,10GE interface view,Layer 2 200GE interface view,200GE interface view,25GE-L2 view,25GE interface view,400GE-L2 view,400GE interface view,Layer 2 50GE interface view,50GE interface view,Layer 2 GE interface view,Interface group view,Management interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "tx",
            "Info": "Indicates the LLDP TX mode, meaning that an interface only sends LLDP packets.\n-"
        },
        {
            "Parameters": "rx",
            "Info": "Indicates the LLDP RX mode, meaning that an interface only receives LLDP packets.\n-"
        },
        {
            "Parameters": "txrx",
            "Info": "Indicates the LLDP TX/RX mode, meaning that an interface both sends and receives LLDP packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lldp enable",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] lldp admin-status tx"
        ]
    ],
    "ExtraInfo": "After LLDP is enabled globally, perform either of the following operations:"
}