{
    "PageTitle": "lldp mdn(interface view)",
    "FuncDef": "The lldp mdn enable command enables MAC Address Discovery Neighbor (MDN) on an interface.\nThe lldp mdn disable command disables MDN on an interface.\nThe undo lldp mdn command restores the MDN configuration on an interface to be the same as the global MDN configuration. The lldp mdn enable command enables MAC Address Discovery Neighbor (MDN) on an interface. The lldp mdn disable command disables MDN on an interface. The undo lldp mdn command restores the MDN configuration on an interface to be the same as the global MDN configuration. By default, the value is the same as the global MDN configuration.",
    "CLIs": [
        "lldp mdn enable",
        "lldp mdn disable",
        "undo lldp mdn { enable | disable }"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,100GE interface view,Layer 2 10GE interface view,10GE interface view,Layer 2 200GE interface view,200GE interface view,25GE-L2 view,25GE interface view,400GE-L2 view,400GE interface view,Layer 2 50GE interface view,50GE interface view,Layer 2 GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "disable",
            "Info": "Disables neighbor discovery based on MAC addresses.\n-"
        },
        {
            "Parameters": "enable",
            "Info": "Neighbor discovery based on MAC addresses.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] lldp mdn disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] lldp mdn enable"
        ]
    ],
    "ExtraInfo": "After MDN is enabled globally, all interfaces can receive packets discovered using non-standard protocols and identify MDN neighbors based on source MAC addresses of packets. This increases the consumption of system resources and affects the normal running of user services. You can run the lldp mdn disable command on a specified interface to disable MDN.\nTo ensure that the local device can discover and identify non-Huawei neighbors, run the lldp mdn enable command to enable MDN on the local device. After the MDN function is enabled, the device can receive non-standard discovery protocol packets from neighbors and identify neighbors based on the source MAC addresses and port names in the packets."
}