{
    "PageTitle": "lldp management-address ipv6",
    "FuncDef": "The lldp management-address ipv6 command configures an LLDP management IPv6 address.\nThe lldp management-address ipv6 bind interface command binds the LLDP management IPv6 address to a specified interface. The lldp management-address ipv6 command configures an LLDP management IPv6 address. The lldp management-address ipv6 bind interface command binds the LLDP management IPv6 address to a specified interface. By default, no management IPv6 address is configured, and the management IPv6 address is not bound to an interface. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "lldp management-address ipv6 <IPv6address>",
        "lldp management-address ipv6 bind interface { <interface-type> <interface-number> | <interface-name> }",
        "undo lldp management-address ipv6 [ <IPv6address> ]",
        "undo lldp management-address ipv6 bind [ interface { <interface-type> <interface-number> | <interface-name> } ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<IPv6address>",
            "Info": "LLDP management IPv6 address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an interface.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies an interface number.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of an interface.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lldp management-address ipv6 bind interface 100GE 1/0/8"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lldp management-address ipv6 2001:db8:1::1"
        ]
    ],
    "ExtraInfo": "The management IPv6 address is carried in the management address TLV field of LLDP packets. It is used by the NMS to identify and manage devices. To allocate an IPv6 management address to a specified neighbor, run the lldp management-address ipv6  command."
}