{
    "PageTitle": "dns server source-ip",
    "FuncDef": "The dns server source-ip command configures the source IP address for the DNS client to communicate with a server.\nThe undo dns server source-ip command deletes the source IP address for the DNS client to communicate with a server. The dns server source-ip command configures the source IP address for the DNS client to communicate with a server. The undo dns server source-ip command deletes the source IP address for the DNS client to communicate with a server. By default, no source IP address is configured for the DNS client to communicate with a server.",
    "CLIs": [
        "dns server source-ip [ vpn-instance <vpn-instance-name> ] <ip-address>",
        "undo dns server source-ip [ vpn-instance <vpn-instance-name> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the VPN instance used by the device to exchange DNS packets.\nThe value is a string of 1 to 31 case-sensitive characters. The VPN instance name cannot be _public_. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies the source IP address for the DNS client to communicate with a server.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] dns server source-ip vpn-instance vpn1 172.16.1.2"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dns server source-ip 172.16.1.1"
        ]
    ],
    "ExtraInfo": "When a DNS client communicates with a DNS server, you can specify a source IP address for the client to ensure communication security. The route from the DNS server to the specified source IP address must be reachable. The DNS server sends the DNS response packet to the client along the route with the specified source IP address. If you do not specify the source address, the source address is selected based on the destination address each time the client sends a DNS request."
}