{
    "PageTitle": "dns domain",
    "FuncDef": "The dns domain command configures a domain name suffix.\nThe undo dns domain command deletes a domain name suffix. The dns domain command configures a domain name suffix. The undo dns domain command deletes a domain name suffix. By default, no domain name suffix is configured.",
    "CLIs": [
        "dns domain <domain-name> [ vpn-instance <vpn-instance-name> ]",
        "undo dns domain [ <domain-name> [ vpn-instance <vpn-instance-name> ] ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<domain-name>",
            "Info": "Specifies the suffix of a domain name.\nThe value is a string of 1 to 63 case-insensitive characters without spaces. The value can contain digits, letters, underscores (_), hyphens (-), and periods (.)."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of the VPN instance to which the domain name suffix applies.\nThe value is a string of 1 to 31 case-sensitive characters. The VPN instance name cannot be _public_. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] dns domain com.cn vpn-instance vpn1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dns domain com.cn"
        ]
    ],
    "ExtraInfo": "The domain name suffixes of some servers or hosts accessed by the DNS client are usually the same. Pre-defining some domain name suffixes allows you to enter only parts of a domain name to be resolved. The system automatically adds a specific suffix to the domain name before resolving the domain name.\nFor instance, if you configure \"com\" in the suffix list and enter \"example\" in a domain name query, the system automatically associates \"example\" with the suffix \"com\" and searches for \"example.com.\" You may encounter the following situations during a resolution process:"
}