{
    "PageTitle": "dns server ipv6",
    "FuncDef": "The dns server ipv6 command specifies a DNS server IPv6 address.\nThe undo dns server ipv6 command deletes a DNS server IPv6 address. The dns server ipv6 command specifies a DNS server IPv6 address. The undo dns server ipv6 command deletes a DNS server IPv6 address. By default, no DNS server IPv6 address is specified. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "dns server ipv6 <ipv6-address> [ { <interface-type> <interface-number> | <interface-name> } ] [ vpn-instance <vpn-instance-name> ]",
        "undo dns server ipv6 [ <ipv6-address> [ { <interface-type> <interface-number> | <interface-name> } ] [ vpn-instance <vpn-instance-name> ] ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address for a DNS server.\nThe value is a 128-bit hexadecimal number, in the format of X:X:X:X:X:X:X:X, with each X representing four hexadecimal numbers."
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an outbound interface that communicates with the DNS server.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of an outbound interface that communicates with the DNS server.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of the outbound interface communicating with the DNS server.\n-"
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] dns server ipv6 2001:db8::2 vpn-instance vpn1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dns server ipv6 2001:db8::1"
        ]
    ],
    "ExtraInfo": "The DNS client must work with the DNS server to implement dynamic domain name resolution. You can run the dns server ipv6 command to specify the IPv6 address of the DNS server. The DNS client sends requests to the specified DNS server for domain name resolution.\nDuring dynamic domain name resolution, the switch sends a domain name resolution request to the DNS servers according to the order in which they were configured. If the domain name resolution request on the first DNS server times out, the device sends the request to the next DNS server."
}