{
    "PageTitle": "ip host",
    "FuncDef": "The ip host command configures static DNS entries.\nThe undo ip host command deletes static DNS entries. The ip host command configures static DNS entries. The undo ip host command deletes static DNS entries. By default, no static DNS entries are configured.",
    "CLIs": [
        "ip host <host-name> <ip-address> [ vpn-instance <vpn-instance-name> ]",
        "undo ip host <host-name> [ <ip-address> [ vpn-instance <vpn-instance-name> ] ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<host-name>",
            "Info": "Specifies the host name.\nThe value is a string of 1 to 255 case-sensitive characters without spaces. The value can contain digits, letters, underscores (_), periods (.), and hyphens (-), and must contain letters. Each level of domain name can contain a maximum of 63 characters."
        },
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies the IP address mapping the host name.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of the VPN instance to which the IP address corresponding to a domain name belongs.\nThe value is a string of 1 to 31 case-sensitive characters. The VPN instance name cannot be _public_. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] ip host test 10.110.0.2 vpn-instance vpn1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip host test 10.110.0.1"
        ]
    ],
    "ExtraInfo": "A static domain name resolution table is manually set up using the ip host command, describing the mappings between host names and IP addresses. In addition, some common host names are added to the table. Then, static host name resolution can be performed according to the static domain name resolution table. When requiring the IP address corresponding to a host name, the client firstly searches the static host name resolution table for the specified host name and obtains the corresponding IP address. In this manner, the efficiency of host name resolution is improved."
}