{
    "PageTitle": "ipv6 host",
    "FuncDef": "The ipv6 host command configures an IPv6 static DNS entry.\nThe undo ipv6 host command deletes an IPv6 static DNS entry. The ipv6 host command configures an IPv6 static DNS entry. The undo ipv6 host command deletes an IPv6 static DNS entry. By default, no IPv6 static DNS entry is configured. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 host <host-name> <ipv6-address> [ vpn-instance <vpn-instance-name> ]",
        "undo ipv6 host <host-name> [ <ipv6-address> [ vpn-instance <vpn-instance-name> ] ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<host-name>",
            "Info": "Specifies the host name.\nThe value cannot contain any other character except followings: a-z A-Z 0-9 . - _ , and must contain letters and is a string of 1 to 255 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address mapping the host name.\nThe value is a 128-bit hexadecimal number, in the format of X:X:X:X:X:X:X:X, with each X representing four hexadecimal numbers."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of the VPN instance to which the IPv6 address corresponding to the host name belongs.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 host www.huawei.com 2001:db8::8"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] ipv6 host www.huawei.com 2001:db8::2 vpn-instance vpn1"
        ]
    ],
    "ExtraInfo": "When requesting the IPv6 address mapping a domain name, the DNS client searches for the specified domain name in the static DNS table to obtain the corresponding IPv6 address. The ipv6 host command configures an IPv6 static DNS entry."
}