{
    "PageTitle": "8021p-inbound",
    "FuncDef": "The 8021p-inbound command maps the 802.1p priority of incoming VLAN packets in a DiffServ domain to the PHB and colors the packets.\nThe undo 8021p-inbound command restores the default mapping. The 8021p-inbound command maps the 802.1p priority of incoming VLAN packets in a DiffServ domain to the PHB and colors the packets. The undo 8021p-inbound command restores the default mapping. For details about default mappings from the 802.1p priorities to PHBs and colors of incoming VLAN packets in a DiffServ domain, see \"Default Settings for Priority Mapping\" under \"Priority Mapping Configuration\" in Configuration Guide > QoS Configuration.",
    "CLIs": [
        "8021p-inbound <8021p-value> phb <service-class> [ <color> ]",
        "undo 8021p-inbound [ <8021p-value> ]"
    ],
    "ParentView": [
        "DiffServ domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "<8021p-value>",
            "Info": "Specifies the 802.1p priority of VLAN packets. The value is an integer that ranges from 0 to 7.\nThe value is an integer that ranges from 0 to 7. A larger value indicates a higher priority."
        },
        {
            "Parameters": "phb <service-class>",
            "Info": "Specifies a PHB.\nThe value can be BE, AF1 to AF4, EF, CS6, or CS7, each of which corresponds to queues 0 to 7 respectively."
        },
        {
            "Parameters": "<color>",
            "Info": "Indicates the color of packets.\nThe value can be green, yellow, and red. The default value is green."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diffserv domain ds1",
            "[*HUAWEI-dsdomain-ds1] 8021p-inbound 2 phb af1 yellow"
        ]
    ],
    "ExtraInfo": "To implement QoS scheduling on incoming VLAN packets, you can use the 8021p-inbound command to map the 802.1p priorities of the packets to the PHBs and colors. After a DiffServ domain is bound to the inbound direction of packets, the device forwards the packets to queues based on PHBs of the packets. Congestion management is implemented. Packets are scheduled according to their colors after a discard template is configured, avoiding congestion."
}