{
    "PageTitle": "ip-dscp-inbound",
    "FuncDef": "The ip-dscp-inbound command maps the DSCP priority of incoming IP packets in a DiffServ domain to the PHB and colors the packets.\nThe undo ip-dscp-inbound command restores the default mapping. The ip-dscp-inbound command maps the DSCP priority of incoming IP packets in a DiffServ domain to the PHB and colors the packets. The undo ip-dscp-inbound command restores the default mapping. For details about default mappings from the DSCP priorities to PHBs and colors of incoming IP packets in a DiffServ domain, see \"Default Settings for Priority Mapping\" under \"Priority Mapping Configuration\" in Configuration Guide > QoS Configuration.",
    "CLIs": [
        "ip-dscp-inbound <dscp-value> phb <service-class> [ <color> ]",
        "undo ip-dscp-inbound [ <dscp-value> ]"
    ],
    "ParentView": [
        "DiffServ domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "<dscp-value>",
            "Info": "Specifies the DSCP priority of IP packets.\nThe value is an integer that ranges from 0 to 63."
        },
        {
            "Parameters": "phb <service-class>",
            "Info": "Specifies a PHB.\nThe value can be BE, AF1 to AF4, EF, CS6, or CS7, each of which corresponds to queues 0 to 7 respectively."
        },
        {
            "Parameters": "<color>",
            "Info": "Specify the color of the message mark.\nThe value can be:\ngreenyellowred\nThe default value is green."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diffserv domain ds1",
            "[*HUAWEI-dsdomain-ds1] ip-dscp-inbound 8 phb af1 yellow"
        ]
    ],
    "ExtraInfo": "To implement QoS scheduling for incoming IP packets carrying DSCP priorities, use the ip-dscp-inbound command to configure mappings from DSCP priorities of packets to PHBs and color the packets. After a DiffServ domain is bound to the inbound direction of packets, the device forwards the packets to queues based on PHBs of the packets. Congestion management is implemented. Packets are scheduled according to their colors after a discard template is configured, avoiding congestion."
}