{
    "PageTitle": "qos phb marking",
    "FuncDef": "The qos phb marking command enables or disables mapping between PHBs and DSCP or 802.1p priorities in the outbound direction.\nThe undo qos phb marking command enables or disables mapping between PHBs and DSCP or 802.1p priorities in the outbound direction. The qos phb marking command enables or disables mapping between PHBs and DSCP or 802.1p priorities in the outbound direction. The undo qos phb marking command enables or disables mapping between PHBs and DSCP or 802.1p priorities in the outbound direction. For the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6855-48XS8CQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode), CE6863E-48S8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6820H, CE6820H-K, CE6820S, CE6863H, CE6863H-K, CE6881H, and CE6881H-K:\n\n\nBy default, mapping from PHBs to DSCP priorities is disabled and mapping from PHBs to 802.1p priorities is enabled for outgoing packets.\n\n\nFor the CE6885-LL (low latency mode):\n\n\nBy default, mapping from PHBs to DSCP priorities and mapping from PHBs to 802.1p priorities are disabled for outgoing packets. For the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6855-48XS8CQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode), CE6863E-48S8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6820H, CE6820H-K, CE6820S, CE6863H, CE6863H-K, CE6881H, and CE6881H-K: By default, mapping from PHBs to DSCP priorities is disabled and mapping from PHBs to 802.1p priorities is enabled for outgoing packets. For the CE6885-LL (low latency mode): By default, mapping from PHBs to DSCP priorities and mapping from PHBs to 802.1p priorities are disabled for outgoing packets.",
    "CLIs": [
        "qos phb marking dscp enable",
        "undo qos phb marking dscp enable",
        "qos phb marking 8021p disable",
        "undo qos phb marking 8021p disable",
        "qos phb marking 8021p enable",
        "undo qos phb marking 8021p enable"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,Interface group view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] qos phb marking dscp enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] qos phb marking 8021p disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] qos phb marking 8021p enable"
        ]
    ],
    "ExtraInfo": "For the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6855-48XS8CQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode), CE6863E-48S8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6820H, CE6820H-K, CE6820S, CE6863H, CE6863H-K, CE6881H, and CE6881H-K:"
}