{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "load-interval",
    "FuncDef": [
        "To change the length of time for which data is used to compute load statistics, use the **load-interval** command in interface configuration mode or Frame Relay DLCI configuration mode. To revert to the default setting, use the **no** form of this command. "
    ],
    "CLIs": [
        "load-interval <seconds>",
        "noload-interval <seconds>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *seconds* ",
            "Info": " Length of time for which data is used to compute load statistics. Value is a multiple of 30, from 30 to 600 (30, 60, 90, 120, and so on). The default is 300 seconds. "
        }
    ],
    "Examples": [
        [
            "Interface Example",
            "In the following example, the default average of five minutes is changed to a 30-second average. A burst in traffic that would not trigger a dial backup for an interface configured with the default five-minute interval might trigger a dial backup for this interface, which is set for the shorter 30-second interval.",
            "```",
            "Router(config)# interface serial 0",
            "```",
            "```",
            "Router(config-if)# load-interval 30",
            "```",
            "Frame Relay PVC Example",
            "In the following example, the load interval is set to 60 <seconds> for a Frame Relay PVC with the DLCI 100:",
            "```",
            "Router(config)# interface serial 1/1",
            "```",
            "```",
            "Router(config-if)# frame-relay interface-dlci 100",
            "```",
            "```",
            "Router(config-fr-dlci)# load-interval 60",
            "```"
        ]
    ],
    "ExtraInfo": "To make computations more reactive to short bursts of traffic, you can shorten the length of time over which load averages are computed.If the load interval is set to 30 seconds, new data is used for load calculations over a 30-second period. This data is used to compute load statistics, including the input rate in bits and packets per second, the output rate in bits and packets per second, the load, and reliability.Load data is gathered every five seconds. This data is used for a weighted-average calculation in which recent load data has more weight in the computation than older load data. If the load interval is set to 30 seconds, the average is computed for the last 30 seconds of load data.If you change the calculation interval from the default of five minutes to a shorter period of time, the input and output statistics that are displayed by the**show interface** command or the **show frame-relay pvc** command will be more current and will be based on more nearly instantaneous data, rather than reflecting the average load over a longer period of time.This command is often used for dial backup purposes to increase or decrease the likelihood of implementation of a backup interface, but it can be used on any interface.",
    "RelatedCmds": [
        {
            "cmd": " **show interfaces** ",
            "description": " Displays statistics for all interfaces configured on the router or access server. "
        }
    ]
}