{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "logging ip access-list cache (interface configuration)",
    "FuncDef": [
        "To enable an Optimized ACL Logging (OAL)-logging cache on an interface that is based on direction, use the **logging ip access-list cache** command in interface configuration mode. To disable OAL, use the **no** form of this command. "
    ],
    "CLIs": [
        "logging ip access-list cache [ in | out ]",
        "no logging ip access-list cache"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **in** ",
            "Info": " (Optional) Enables OAL on ingress packets. "
        },
        {
            "Parameters": " **out** ",
            "Info": " (Optional) Enables OAL on egress packets. "
        }
    ],
    "Examples": [
        [
            "```",
            "Router(config-if)# logging ip access-list cache in",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "Router(config-if)# logging ip access-list cache out",
            "```"
        ]
    ],
    "ExtraInfo": "This command is supported on Cisco 7600 series routers that are configured with a Supervisor Engine 720 only.This command is supported on traffic that matches the **log** keyword in the applied ACL. You must set ICMP unreachable rate limiting to 0 if the OAL is configured to log denied packets.On systems that are configured with a PFC3A, support for the egress direction on tunnel interfaces is not supported.OAL is supported on IPv4 unicast traffic only.You cannot configure OAL and VACL capture on the same chassis. OAL and VACL capture are incompatible. With OAL configured, use SPAN to capture traffic.If the entry is inactive for the duration that is specified in the **update-interval** *seconds* command, the entry is removed from the cache.If you enter the **no logging ip access-list cache** command without keywords, all the parameters are returned to the default values.When enabling the IP \"too short\" check using the mls verify ip length minimum command, valid IP packets with with an IP protocol field of ICMP(1), IGMP(2), IP(4), TCP(6), UDP(17), IPv6(41), GRE(47), or SIPP-ESP(50) will be hardware switched. All other IP protocol fields are software switched.![](/c/dam/en/us/td/i/templates/caut.gif)---**Caution** ![](/c/dam/en/us/td/i/templates/blank.gif)Using optimized access-list logging (OAL) and the mls verify ip length minimum command together can cause routing protocol neighbor flapping as they are incompatible---",
    "RelatedCmds": [
        {
            "cmd": " **clear logging ip access-list cache** ",
            "description": " Clears all the entries from the OAL cache and sends them to the syslog. "
        },
        {
            "cmd": " **logging ip access-list cache (global configuration)** ",
            "description": " Configures the OAL parameters. "
        },
        {
            "cmd": " **show logging ip access-list** ",
            "description": " Displays information about the logging IP access list. "
        },
        {
            "cmd": " **update-interval** *seconds* ",
            "description": " Removes entries from the cache that are inactive for the duration that is specified in the command. "
        }
    ]
}