{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "logging ip access-list cache (global configuration)",
    "FuncDef": [
        "To configure the Optimized ACL Logging (OAL) parameters, use the **logging ip access-list cache** command in global configuration mode. To return to the default settings, use the **no** form of this command. "
    ],
    "CLIs": [
        "logging ip access-list cache { entries <entries> | { interval <seconds> | rate-limit <pps> | threshold <packets> }",
        "no logging ip access-list cache [ entries | interval | rate-limit | threshold ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **entries** *entries* ",
            "Info": " Specifies the maximum number of log entries that are cached in the software; valid values are from 0 to 1048576 entries. "
        },
        {
            "Parameters": " **interval** *seconds* ",
            "Info": " Specifies the maximum time interval before an entry is sent to syslog; valid values are from 5 to 86400 seconds. "
        },
        {
            "Parameters": " **rate-limit** *pps* ",
            "Info": " Specifies the number of packets that are logged per second in the software; valid values are from 10 to 1000000 pps. "
        },
        {
            "Parameters": " **threshold** *packets* ",
            "Info": " Specifies the number of packet matches before an entry is sent to syslog; valid values are from 1 to 1000000 packets. "
        }
    ],
    "Examples": [
        [
            "```",
            "Router(config)# logging ip access-list cache entries 200",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "Router(config)# logging ip access-list cache interval 350",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "Router(config)# logging ip access-list cache rate-limit 100",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "Router(config)# logging ip access-list cache threshold 125",
            "```"
        ]
    ],
    "ExtraInfo": "This command is supported on Cisco 7600 series routers that are configured with a Supervisor Engine 720 only.OAL is supported on IPv4 unicast traffic only.You cannot configure OAL and VACL capture on the same chassis. OAL and VACL capture are incompatible. With OAL configured, use SPAN to capture traffic.If the entry is inactive for the duration that is specified in the **update-interval** *seconds* command, the entry is removed from the cache.If you enter the **no logging ip access-list cache** command without keywords, all the parameters are returned to the default values.You must set ICMP unreachable rate limiting to 0 if the OAL is configured to log denied packets.When enabling the IP \"too short\" check using the mls verify ip length minimum command, valid IP packets with with an IP protocol field of ICMP(1), IGMP(2), IP(4), TCP(6), UDP(17), IPv6(41), GRE(47), or SIPP-ESP(50) will be hardware switched. All other IP protocol fields are software switched.![](/c/dam/en/us/td/i/templates/caut.gif)---**Caution** ![](/c/dam/en/us/td/i/templates/blank.gif)Using optimized access-list logging (OAL) and the mls verify ip length minimum command together can cause routing protocol neighbor flapping as they are incompatible---",
    "RelatedCmds": [
        {
            "cmd": " **clear logging ip access-list cache** ",
            "description": " Clears all the entries from the OAL cache and sends them to the syslog. "
        },
        {
            "cmd": " **logging ip access-list cache (interface configuration)** ",
            "description": " Enables an OAL-logging cache on an interface that is based on direction. "
        },
        {
            "cmd": " **show logging ip access-list** ",
            "description": " Displays information about the logging IP access list. "
        },
        {
            "cmd": " **update-interval** *seconds* ",
            "description": " Removes entries from the cache that are inactive for the duration that is specified in the command. "
        }
    ]
}