{
    "PageTitle": "import-rib protocol direct (VPN instance IPv6 address family view)",
    "FuncDef": "The import-rib protocol direct command imports public network or other VPN instance routes to a VPN instance routing table.\nThe undo import-rib protocol direct command restores the default configuration. The import-rib protocol direct command imports public network or other VPN instance routes to a VPN instance routing table. The undo import-rib protocol direct command restores the default configuration. By default, public network or other VPN instance routes are not imported to VPN instance routing tables. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "import-rib { vpn-instance <vpn-instance-name> | public } protocoldirect [ route-policy <route-policy-name> ]",
        "undo import-rib { vpn-instance <vpn-instance-name> | public } protocoldirect"
    ],
    "ParentView": [
        "VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "public",
            "Info": "Imports public network routes.\n-"
        },
        {
            "Parameters": "protocol",
            "Info": "Specifies a protocol type of route to be imported to a VPN instance routing table.\n-"
        },
        {
            "Parameters": "direct",
            "Info": "Imports direct routes, excluding direct VLINK routes.\n-"
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies a route-policy to filter routes to be imported.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv6-family",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv6] import-rib public protocol direct"
        ]
    ],
    "ExtraInfo": "In a BGP IPv6 VPN scenario, one VPN can communicate with another VPN if they have matching VPN targets, but VPNs cannot communicate with the public network. To enable a VPN to communicate with the public network, you have to ensure that the VPN and public network can obtain routes to each other. To import public network routes to a VPN instance, run the import-rib protocol direct command.\nIn an intelligent traffic control scenario, traffic of different users are distributed to different VPNs. To enable the traffic to reach the public network, run the import-rib protocol direct command to import public network routes to each VPN instance routing table."
}