{
    "PageTitle": "ipv6 import-rib vpn-instance protocol static",
    "FuncDef": "The ipv6 import-rib vpn-instance protocol static command enables a device to import IPv6 routes from a VPN instance to the public network instance's IPv6 routing table.\nThe undo ipv6 import-rib vpn-instance protocol static command disables a device from importing IPv6 routes from a VPN instance to the public network instance's IPv6 routing table. The ipv6 import-rib vpn-instance protocol static command enables a device to import IPv6 routes from a VPN instance to the public network instance's IPv6 routing table. The undo ipv6 import-rib vpn-instance protocol static command disables a device from importing IPv6 routes from a VPN instance to the public network instance's IPv6 routing table. By default, a device does not import IPv6 routes from a VPN instance to the public network instance's IPv6 routing table. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 import-rib vpn-instance <vpn-instance-name> protocolstatic [ valid-route ] [ route-policy <route-policy-name> ]",
        "undo ipv6 import-rib vpn-instance <vpn-instance-name> protocolstatic"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "protocol",
            "Info": "Specifies the type of routes to be imported.\n-"
        },
        {
            "Parameters": "static",
            "Info": "Imports static routes.\n-"
        },
        {
            "Parameters": "valid-route",
            "Info": "Imports only the valid routes of the specified route type.\n-"
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a route-policy.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv6-family",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv6] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vrf1] quit",
            "[*HUAWEI] ipv6 import-rib vpn-instance vrf1 protocol static"
        ]
    ],
    "ExtraInfo": "In the VPN networking, IPv6 users of two VPNs with matching VPN targets can communicate, but IPv6 VPN users cannot communicate with IPv6 public network users. To enable IPv6 VPN users to communicate with IPv6 public network users, you must configure IPv6 route import between VPN and public network instances. To enable a device to import IPv6 routes from a VPN instance to the public network instance, run the ipv6 import-rib vpn-instance protocol static command."
}