{
    "PageTitle": "execute (Maintenance assistant task view)",
    "FuncDef": "The execute batch-file command configures batch file execution for a maintenance assistant.\nThe execute command command configures command execution for a maintenance assistant.\nThe execute python command configures Python script execution for a maintenance assistant.\nThe undo execute command cancels the configuration. The execute batch-file command configures batch file execution for a maintenance assistant. The execute command command configures command execution for a maintenance assistant. The execute python command configures Python script execution for a maintenance assistant. The undo execute command cancels the configuration. By default, no task is configured for a maintenance assistant.",
    "CLIs": [
        "execute <priority> command <command-string>",
        "execute <priority> batch-file <file-name>",
        "execute <priority> python <file-name> [ <arguments> ]",
        "undo execute <priority>"
    ],
    "ParentView": [
        "Maintenance assistant task view"
    ],
    "ParaDef": [
        {
            "Parameters": "<priority>",
            "Info": "Specifies the task priority.\nThe value is in the format of integer1[.integer2] to allow an n.5 to be inserted between n and n+1. For example, if a user has configured tasks with the priorities 2 and 3 and needs to perform a task between the tasks with the priorities 2 and 3, the user can set the priority of the new task to 2.5."
        },
        {
            "Parameters": "<command-string>",
            "Info": "Specifies a command.\nThe value is a string of 1 to 511."
        },
        {
            "Parameters": "batch-file <file-name>",
            "Info": "Specifies the name of a batch file.\nThe value is a string of 5 to 56 characters. The file name extension is .bat."
        },
        {
            "Parameters": "python <file-name>",
            "Info": "Specifies a Python script.\nThe value is a string of 1 to 127 characters."
        },
        {
            "Parameters": "<arguments>",
            "Info": "Specifies the parameter of the Python script.\nThe value is a string of 1 to 383 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ops",
            "[~HUAWEI-ops] assistant policy",
            "[*HUAWEI-ops-assistant-policy] execute 3 python policy.py"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ops",
            "[~HUAWEI-ops] assistant reboot",
            "[*HUAWEI-ops-assistant-reboot] execute 1 command reboot"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ops",
            "[~HUAWEI-ops] assistant task",
            "[*HUAWEI-assistant-task] execute 2 batch-file batch.bat"
        ]
    ],
    "ExtraInfo": "To configure a device to automatically run a large number of commands when a specific condition is met, users can enable batch file execution for a maintenance assistant in the OPS.\nAfter a maintenance assistant is created, the assistant must be configured with tasks. Each maintenance assistant can be configured with at most one batch file with the size not greater than 1 MB. The configuration modification in the script takes effect immediately and does not require committing.\nWhen users configure the execute command, the OPS checks whether the file name extension is .bat but does not verify the file contents.\nTo configure a device to automatically run a large number of commands when a specific condition is met, users can enable batch file execution for a maintenance assistant in the OPS."
}