{
    "PageTitle": "ops install file",
    "FuncDef": "The ops install file command installs a single file.\nThe ops uninstall file command removes a single file or directory. The ops install file command installs a single file. The ops uninstall file command removes a single file or directory.",
    "CLIs": [
        "ops install file <scrFile> [ destination <directory> ]",
        "ops uninstall file <file-name-or-dir>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "<scrFile>",
            "Info": "Specifies the name of the file to be installed.\nThe value is a string of 1 to 127 characters without spaces. The value can contain the path and wildcards. The restriction is that the sum of the path length and the file name length is not greater than 127, and the installation path includes $_user.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "destination <directory>",
            "Info": "Specifies the installation path of the file.\nThe value does not contain a drive letter. In the case of an absolute path, the root directory must be $_user. In the case of a relative path, the $_user directory is used by default. If the specified directory does not exist, a new directory is created. A maximum of seven levels of subdirectories can be created under $_user. The value is a string of 1 to 127 characters. The restriction is that the sum of the path length and the file name length is not greater than 127, and the installation path includes $_user."
        },
        {
            "Parameters": "<file-name-or-dir>",
            "Info": "Specifies the name of the file or directory to be removed.\nThe value is a string of 1 to 127 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> ops uninstall file config.py"
        ],
        [
            "<HUAWEI> ops install file config.py"
        ]
    ],
    "ExtraInfo": "To install a file in a directory in a specified destination, run the ops install file command. If this parameter is not specified, the file is installed in the default directory $_user.\nThe dir command can be run to display information about files that are installed in the $_user directory.\nTo remove a file or files in a directory, run the ops uninstall file command."
}