{
    "PageTitle": "collect interface",
    "FuncDef": "The collect interface command allows the flexible flow statistics exported to the NSC to contain the indexes of inbound and outbound interfaces, as well as the packet sampling mode.\nThe undo collect interface command restores the default setting. The collect interface command allows the flexible flow statistics exported to the NSC to contain the indexes of inbound and outbound interfaces, as well as the packet sampling mode. The undo collect interface command restores the default setting. By default, the flexible flow statistics exported to the NSC do not contain the indexes of the inbound and outbound interfaces, as well as the packet sampling mode.",
    "CLIs": [
        "collect interface { input | output | sampler-info }",
        "undo collect interface { input | output | sampler-info }"
    ],
    "ParentView": [
        "IPv4 flexible flow statistics template view,IPv6 flexible flow statistics template view,VXLAN flexible flow statistics template view"
    ],
    "ParaDef": [
        {
            "Parameters": "input",
            "Info": "Indicates that the flexible flow statistics exported to the NSC contain the index of inbound interface.\n-"
        },
        {
            "Parameters": "output",
            "Info": "Indicates that the flexible flow statistics exported to the NSC contain the index of outbound interface.\n-"
        },
        {
            "Parameters": "sampler-info",
            "Info": "Configures the statistics sent to the NSC to contain the traffic sampling mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] netstream record record1 ip",
            "[*HUAWEI-netstream-record-ipv4-record1] collect interface input"
        ]
    ],
    "ExtraInfo": "To obtain richer flow statistics, configure whether flexible flow statistics exported to the NSC contain indexes of inbound and outbound interfaces, as well as the packet sampling mode."
}