{
    "PageTitle": "match inner-ip",
    "FuncDef": "The match inner-ip command configures aggregation keywords in a VXLAN flexible flow statistics template.\nThe undo match inner-ip command deletes aggregation keywords from a VXLAN flexible flow statistics template. The match inner-ip command configures aggregation keywords in a VXLAN flexible flow statistics template. The undo match inner-ip command deletes aggregation keywords from a VXLAN flexible flow statistics template. By default, no aggregation keyword is configured in a VXLAN flexible flow statistics template.",
    "CLIs": [
        "match inner-ip { destination-address | destination-port | tos | protocol | source-address | source-port | source-mac | destination-mac | cvlan | ethernet-type }",
        "undo match inner-ip { destination-address | destination-port | tos | protocol | source-address | source-port | source-mac | destination-mac | cvlan | ethernet-type }"
    ],
    "ParentView": [
        "VXLAN flexible flow statistics template view"
    ],
    "ParaDef": [
        {
            "Parameters": "destination-address",
            "Info": "Indicates to aggregate flows based on the destination IP address in original Ethernet frames.\n-"
        },
        {
            "Parameters": "destination-port",
            "Info": "Indicates to aggregate flows based on the destination port number in original Ethernet frames.\n-"
        },
        {
            "Parameters": "tos",
            "Info": "Indicates to aggregate flows based on the ToS value in original Ethernet frames.\n-"
        },
        {
            "Parameters": "protocol",
            "Info": "Indicates to aggregate flows based on the protocol type in original Ethernet frames.\n-"
        },
        {
            "Parameters": "source-address",
            "Info": "Indicates to aggregate flows based on the source IP address in original Ethernet frames.\n-"
        },
        {
            "Parameters": "source-port",
            "Info": "Indicates to aggregate flows based on the source port number in original Ethernet frames.\n-"
        },
        {
            "Parameters": "source-mac",
            "Info": "Indicates to aggregate flows based on the source MAC address in original Ethernet frames.\n-"
        },
        {
            "Parameters": "destination-mac",
            "Info": "Indicates to aggregate flows based on the destination MAC address in original Ethernet frames.\n-"
        },
        {
            "Parameters": "cvlan",
            "Info": "Indicates to aggregate flows based on the VLAN ID in original Ethernet frames.\n-"
        },
        {
            "Parameters": "ethernet-type",
            "Info": "Indicates to aggregate flows based on the ethernet type in original Ethernet frames.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] netstream record abc123 vxlan inner-ip",
            "[*HUAWEI-netstream-record-vxlan-abc123] match inner-ip source-port"
        ]
    ],
    "ExtraInfo": "During exporting of VXLAN flexible flow statistics, you can run the match inner-ip command to configure aggregation keywords in a flexible flow statistics template. The aggregation keywords refer to the destination IP address, destination port number, ToS, protocol type, source IP address, and source port number in the original Ethernet frames encapsulated in VXLAN packets."
}