{
    "PageTitle": "match ipv6",
    "FuncDef": "The match ipv6 command configures aggregation keywords in an IPv6 flexible flow statistics template.\nThe undo match ipv6 command deletes aggregation keywords from an IPv6 flexible flow statistics template. The match ipv6 command configures aggregation keywords in an IPv6 flexible flow statistics template. The undo match ipv6 command deletes aggregation keywords from an IPv6 flexible flow statistics template. By default, no aggregation keyword is configured in an IPv6 flexible flow statistics template.",
    "CLIs": [
        "match ipv6 { destination-address | destination-port | tos | protocol | source-address | source-port | flow-label | source-mac | destination-mac | ethernet-type | vlan }",
        "undo match ipv6 { destination-address | destination-port | tos | protocol | source-address | source-port | flow-label | source-mac | destination-mac | ethernet-type | vlan }"
    ],
    "ParentView": [
        "IPv6 flexible flow statistics template view"
    ],
    "ParaDef": [
        {
            "Parameters": "destination-address",
            "Info": "Indicates that flows are aggregated based on destination addresses.\n-"
        },
        {
            "Parameters": "destination-port",
            "Info": "Indicates that flows are aggregated based on destination ports.\n-"
        },
        {
            "Parameters": "tos",
            "Info": "Indicates that flows are aggregated based on ToS fields.\n-"
        },
        {
            "Parameters": "protocol",
            "Info": "Indicates that flows are aggregated based on protocol types.\n-"
        },
        {
            "Parameters": "source-address",
            "Info": "Indicates that flows are aggregated based on source addresses.\n-"
        },
        {
            "Parameters": "source-port",
            "Info": "Indicates that flows are aggregated based on source ports.\n-"
        },
        {
            "Parameters": "flow-label",
            "Info": "Indicates that flows are aggregated based on flow labels.\n-"
        },
        {
            "Parameters": "source-mac",
            "Info": "Indicates that flows are aggregated based on the source MAC address .\n-"
        },
        {
            "Parameters": "destination-mac",
            "Info": "Indicates that flows are aggregated based on the destination MAC address.\n-"
        },
        {
            "Parameters": "ethernet-type",
            "Info": "Indicates that flows are aggregated based on ethernet type.\n-"
        },
        {
            "Parameters": "vlan",
            "Info": "Indicates that flows are aggregated based on VLAN.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] netstream record abc123 ipv6",
            "[*HUAWEI-netstream-record-ipv6-abc123] match ipv6 flow-label"
        ]
    ],
    "ExtraInfo": "You can run the match ipv6 command to configure aggregation keywords in a flexible flow statistics template."
}