{
    "PageTitle": "netstream export ip version",
    "FuncDef": "The netstream export ip version command configures the version number of the exported packets carrying IPv4 flow statistics.\nThe undo netstream export ip version command restores the default setting. The netstream export ip version command configures the version number of the exported packets carrying IPv4 flow statistics. The undo netstream export ip version command restores the default setting. By default, the version number of the exported packets carrying IPv4 original flow statistics is 9 and no AS option is used.",
    "CLIs": [
        "netstream export ip version 5",
        "netstream export ip version 9",
        "undo netstream export ip version [ 5 | 9 ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "9",
            "Info": "Sets the version of exported packets carrying IPv4 flow statistics to V9.\n-"
        },
        {
            "Parameters": "5",
            "Info": "Sets the version of exported packets carrying IPv4 flow statistics to V5.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] netstream export ip version 9"
        ]
    ],
    "ExtraInfo": "The NDE exports NetStream flow statistics to the NSC. In order for the NSC to parse the exported packets, the version of exported packets carrying these statistics must be the same as that configured on the NSC.\nThe exported packets in V5 have fixed format and are difficult to expand. In contrast, the format of exported packets in V9 is defined in templates and is easy to expand. The statistics can be exported flexibly in such packets.\nDue to its advantages of being template-based and highly extendable, V9 is supported by most NSCs. As such, you are advised to set the version of exported packets to V9.\nYou can set the export version according to the NMS configuration. V9 must be used for the following exported packets:"
}