{
    "PageTitle": "netstream timeout inactive",
    "FuncDef": "The netstream timeout inactive command sets the inactive aging time of a flow.\nThe undo netstream timeout inactive command restores the default setting. The netstream timeout inactive command sets the inactive aging time of a flow. The undo netstream timeout inactive command restores the default setting. By default, the inactive aging time of the original flows and flexible flows is 15 seconds.",
    "CLIs": [
        "netstream timeout { ip | ipv6 | vxlaninner-ip } inactive <inactive-interval>",
        "undo netstream timeout { ip | ipv6 | vxlaninner-ip } inactive [ <inactive-interval> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip",
            "Info": "IPv4 packets.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "IPv6 packets.\n-"
        },
        {
            "Parameters": "vxlan",
            "Info": "VXLAN packets.\n-"
        },
        {
            "Parameters": "inner-ip",
            "Info": "Specifies the inner packet of the IPv4 type for VXLAN packets.\n-"
        },
        {
            "Parameters": "<inactive-interval>",
            "Info": "Specifies the inactive aging time of original flows and flexible flows.\nThe value is an integer in the range from 1 to 604800, in seconds. The default value is 15."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] netstream timeout ip inactive 20"
        ]
    ],
    "ExtraInfo": "Network traffic may burst intermittently, while the memory capacity of the NDE is limited. Earlier flows in the memory need to be exported to release space for the new flows. The process of exporting old flows is called aging. All flows in the NDE memory will be exported to the NSC for analysis.\nWhen the inactive time (from the last packet receiving time to the current time) of an original or flexible flow exceeds the specified inactive aging time, the flow is exported to the destination.\nTo quickly detect the status of an inactive flow, set the inactive time to a small value; however, this setting increases the frequency at which NetStream packets are sent. To reduce the frequency at which NetStream packets are exported and improve statistics collecting efficiency, set the inactive time to a large value."
}