{
    "PageTitle": "netstream sampler (interface view)",
    "FuncDef": "The netstream sampler command configures packet sampling on interfaces.\nThe undo netstream sampler command restores the default setting. The netstream sampler command configures packet sampling on interfaces. The undo netstream sampler command restores the default setting. By default, packet sampling is not configured on interfaces.",
    "CLIs": [
        "netstream sampler random-packets <packet-number> { inbound | outbound }",
        "undo netstream sampler [ random-packets <packet-number> ] { inbound | outbound }"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "inbound",
            "Info": "Samples incoming traffic on an interface.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Samples outgoing traffic on an interface.\n-"
        },
        {
            "Parameters": "random-packets <packet-number>",
            "Info": "Specifies the number of packets between two sampled packets in packet-based random sampling mode. In this mode, one packet is randomly sampled out of packet-number packets.\nThe value is an integer in the range from 1 to 32768 and must be 2^n (n = 0, 1, 2...)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] netstream sampler random-packets 8192 outbound"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] netstream sampler random-packets 8192 inbound"
        ]
    ],
    "ExtraInfo": "After the NetStream function is enabled on an interface, the system stores the NetStream information in the corresponded interface information table. If every packet passing an interface is captured and counted, forwarding performance on the interface will deteriorate, especially on the interface with a high forwarding rate. To understand interface traffic attributes without compromising forwarding performance, configure packet sampling on the interface. A low sampling rate can significantly reduce impact of NetStream on device performance."
}