{
    "PageTitle": "netstream export source",
    "FuncDef": "The netstream export source command configures the source IP address for the exported packets carrying flow statistics.\nThe undo netstream export source command deletes the configured source IP address for the exported packets carrying flow statistics. The netstream export source command configures the source IP address for the exported packets carrying flow statistics. The undo netstream export source command deletes the configured source IP address for the exported packets carrying flow statistics. By default, the source IP address of the exported packets carrying flow statistics is not configured.",
    "CLIs": [
        "netstream export { ip | ipv6 | vxlaninner-ip } source { <ip-address> | ipv6 <ipv6-address> }",
        "undo netstream export { ip | ipv6 | vxlaninner-ip } source [ <ip-address> | ipv6 [ <ipv6-address> ] ]",
        "netstream export { ip | ipv6 | vxlaninner-ip } source <ip-address>",
        "undo netstream export { ip | ipv6 | vxlaninner-ip } source [ <ip-address> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies the source IPv4 address of the exported packets carrying flow statistics.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ip",
            "Info": "Specifies source IP address for the exported packets carrying IPv4 flow statistics.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Specifies the source IP address for the exported packets carrying IPv6 flow statistics.\n-"
        },
        {
            "Parameters": "ipv6 <ipv6-address>",
            "Info": "Specifies the source IPv6 address of the exported packets carrying flow statistics.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-digit hexadecimal number, in the format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "vxlan",
            "Info": "Specifies the source IP address for the exported packets carrying VXLAN flexible flow statistics.\n-"
        },
        {
            "Parameters": "inner-ip",
            "Info": "Specifies the inner packet of the IPv4 type for VXLAN packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] netstream export ip source 10.1.1.1"
        ]
    ],
    "ExtraInfo": "If the NMS needs to identify the data source according to the source IP address in NetStream packets, specify the source IP address for NetStream packets."
}