{
    "PageTitle": "netstream export index-switch",
    "FuncDef": "The netstream export index-switch command sets the number of digits in the interface index contained in an exported packet carrying flow statistics.\nThe undo netstream export index-switch command restores the default setting. The netstream export index-switch command sets the number of digits in the interface index contained in an exported packet carrying flow statistics. The undo netstream export index-switch command restores the default setting. By default, the number of digits in interface indexes is 32.",
    "CLIs": [
        "netstream export { ip | ipv6 | vxlaninner-ip } index-switch { 16 | 32 }",
        "undo netstream export { ip | ipv6 | vxlaninner-ip } index-switch [ 16 | 32 ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip",
            "Info": "Sets the number of digits in the interface index contained in an exported packet carrying IPv4 flow statistics.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "sets the number of digits in the interface index contained in an exported packet carrying IPv6 flow statistics.\n-"
        },
        {
            "Parameters": "vxlan",
            "Info": "Sets the number of digits in the interface index contained in an exported packet carrying VXLAN flexible flow statistics.\n-"
        },
        {
            "Parameters": "inner-ip",
            "Info": "Specifies the inner packet of the IPv4 type for VXLAN packets.\n-"
        },
        {
            "Parameters": "index-switch",
            "Info": "Specifies the number of digits in the index of a specified interface.\nThe value is 16 or 32. The default value is 32."
        },
        {
            "Parameters": "16",
            "Info": "Set the number of digits in an interface index to 16.\n-"
        },
        {
            "Parameters": "32",
            "Info": "Set the number of digits in an interface index to 32.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] netstream export ip version 9",
            "[*HUAWEI] netstream export ip index-switch 32"
        ]
    ],
    "ExtraInfo": "You can run this command to set the number of digits in an interface index to 16 or 32.\nThe number of digits in the interface index is set according to the type of the interface index that can be parsed by the NMS. For example, if the NMS can parse 32-bit interface indexes, set the format of the interface indexes contained in exported NetStream packets to 32-bit."
}