{
    "PageTitle": "netstream export host",
    "FuncDef": "The netstream export host command configures the destination IP address and destination UDP port number for the exported packets carrying flow statistics.\nThe undo netstream export host  command deletes the configured destination IP address and destination UDP port number for the exported packets carrying flow statistics. The netstream export host command configures the destination IP address and destination UDP port number for the exported packets carrying flow statistics. The undo netstream export host  command deletes the configured destination IP address and destination UDP port number for the exported packets carrying flow statistics. By default, no destination IP address or destination UDP port number is configured for the exported packets carrying flow statistics.",
    "CLIs": [
        "netstream export { ip | ipv6 | vxlaninner-ip } host { <ip-address> | ipv6 <ipv6-address> } <port> [ vpn-instance <vpn-instance-name> ] dscp <dscp-value>",
        "undo netstream export { ip | ipv6 | vxlaninner-ip } host { <ip-address> | ipv6 <ipv6-address> } <port> [ vpn-instance <vpn-instance-name> ] dscp <dscp-value>",
        "netstream export { ip | ipv6 | vxlaninner-ip } host <ip-address> <port> [ vpn-instance <vpn-instance-name> ] dscp <dscp-value>",
        "undo netstream export { ip | ipv6 | vxlaninner-ip } host <ip-address> <port> [ vpn-instance <vpn-instance-name> ] dscp <dscp-value>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies the destination IP address of the exported packets carrying flow statistics.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<port>",
            "Info": "Specifies the destination UDP port number of the exported packets carrying flow statistics.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the VPN instance of the exported packets carrying flow statistics.\nThe value is a string of 1 to 31 case-sensitive characters. The VPN instance name cannot be _public_. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "dscp <dscp-value>",
            "Info": "Specifies the DSCP priority of the exported packets carrying flow statistics.\nThe value is an integer that ranges from 0 to 63."
        },
        {
            "Parameters": "ip",
            "Info": "Specifies destination information for the exported packets carrying IPv4 flow statistics.\n-"
        },
        {
            "Parameters": "ipv6 <ipv6-address>",
            "Info": "Specifies the destination IPv6 address of the exported packets carrying flow statistics.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-digit hexadecimal number, in the format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "ipv6",
            "Info": "Specifies destination information for the exported packets carrying IPv6 flow statistics.\n-"
        },
        {
            "Parameters": "vxlan",
            "Info": "Specifies destination information for the exported packets carrying VXLAN flexible flow statistics.\n-"
        },
        {
            "Parameters": "inner-ip",
            "Info": "Specifies the inner packet of the IPv4 type for VXLAN packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] netstream export ip host 10.1.1.1 222 dscp 0"
        ]
    ],
    "ExtraInfo": "After finishing data collection, the NDE sends the collected data to the NSC. This command specifies the destination address of the collected data, that is, the NSC IP address."
}