{
    "PageTitle": "netstream record vxlan inner-ip (interface view)",
    "FuncDef": "The netstream record vxlan inner-ip command creates a VXLAN flexible flow statistics template or displays the view of an existing VXLAN flexible flow statistics template.\nThe undo netstream record vxlan inner-ip command deletes a VXLAN flexible flow statistics template. The netstream record vxlan inner-ip command creates a VXLAN flexible flow statistics template or displays the view of an existing VXLAN flexible flow statistics template. The undo netstream record vxlan inner-ip command deletes a VXLAN flexible flow statistics template. By default, no VXLAN flexible flow statistics template is configured.",
    "CLIs": [
        "netstream record <record-name> vxlaninner-ip",
        "undo netstream record <record-name> vxlaninner-ip"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,Sub-interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<record-name>",
            "Info": "Specifies the name of a VXLAN flexible flow statistics template.\nThe record-name must already exist."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] netstream record abc1 vxlan inner-ip",
            "[*HUAWEI-netstream-record-vxlan-abc1] match inner-ip destination-address",
            "[*HUAWEI-netstream-record-vxlan-abc1] collect counter bytes",
            "[*HUAWEI-netstream-record-vxlan-abc1] quit",
            "[*HUAWEI] commit",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] netstream record abc1 vxlan inner-ip"
        ]
    ],
    "ExtraInfo": "After a VXLAN flexible flow statistics template is configured, run the netstream record vxlan inner-ip command to apply the template to an interface. If a template is not applied to an interface, the VXLAN flexible flow statistics collection will not take effect.\nThe interface aggregates flows based on the aggregation keywords configured in the template, collects flow statistics, and exports aged flows to the NSC."
}