{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "configure revert",
    "FuncDef": [
        "To cancel the timed rollback and trigger the rollback immediately, or to reset parameters for the timed rollback, use the **configure revert** command in privileged EXEC mode. "
    ],
    "CLIs": [
        "configure revert { now | timer { <minutes> | idle <minutes> } }"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *minutes* ",
            "Info": " Time in minutes (1-120). "
        }
    ],
    "Examples": [
        [
            "The following example shows how to cancel the timed rollback and revert to the saved configuration immediately:",
            "```",
            "Rourter(config)# archive",
            "```",
            "```",
            "Router(config-archive)# path disk0:abc",
            "```",
            "```",
            "Router# configure revert now",
            "```"
        ]
    ],
    "ExtraInfo": "In order to use the **configure revert** command to configure a timed rollback, the Configuration Archive functionality must be enable first. The Configuration Archive APIs are used to store the current configuration before applying any changes or rolling back to the previous configuration.In case of multi-user environments, only the user who enabled the timed rollback functionality will have the permission to perform the following operations:•![](/c/dam/en/us/td/i/templates/blank.gif)Confirm the configuration change•![](/c/dam/en/us/td/i/templates/blank.gif)Reset the timer•![](/c/dam/en/us/td/i/templates/blank.gif)Cancel the timer and trigger rollback immediately",
    "RelatedCmds": [
        {
            "cmd": " **archive config** ",
            "description": " Saves a copy of the current running configuration to the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **configure replace** ",
            "description": " Replaces the current running configuration with a saved Cisco IOS configuration file. "
        },
        {
            "cmd": " **maximum** ",
            "description": " Sets the maximum number of archive files of the running configuration to be saved in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **path (config-archive)** ",
            "description": " Specifies the location and filename prefix for the files in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **show archive** ",
            "description": " Displays information about the files saved in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **time-period** ",
            "description": " Sets the time increment for automatically saving an archive file of the current running configuration in the Cisco IOS configuration archive. "
        }
    ]
}