{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "configure confirm",
    "FuncDef": [
        "To confirm replacement of the current running configuration with a saved Cisco IOS configuration file, use the **configure confirm** command in privileged EXEC mode. "
    ],
    "CLIs": [
        "configure confirm"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "The following example shows the use of the configure replace command with the time <seconds> keyword and argument. You must enter the configure confirm command within the specified time limit to confirm replacement of the current running configuration file:",
            "```",
            "Router# configure replace nvram:startup-config time 120",
            "```",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "```",
            "to replace the current running configuration with the",
            "```",
            "```",
            "contents of the specified configuration file, which is",
            "```",
            "```",
            "assumed to be a complete configuration, not a partial",
            "```",
            "```",
            "configuration. Enter Y if you are sure you want to proceed. ? [ no ] : Y",
            "```",
            "```",
            "```",
            "```",
            "Total number of passes: 1",
            "```",
            "```",
            "Rollback Done",
            "```",
            "```",
            "```",
            "```",
            "Router# configure confirm",
            "```"
        ]
    ],
    "ExtraInfo": "The **configure confirm** command is used only if the **time** *seconds* keyword and argument of the **configure replace** command are specified. If the **configure confirm** command is not entered within the specified time limit, the configuration replace operation is automatically reversed (in other words, the current running configuration file is restored to the configuration state that existed prior to entering the **configure replace** command).",
    "RelatedCmds": [
        {
            "cmd": " **archive config** ",
            "description": " Saves a copy of the current running configuration to the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **configure replace** ",
            "description": " Replaces the current running configuration with a saved Cisco IOS configuration file. "
        },
        {
            "cmd": " **maximum** ",
            "description": " Sets the maximum number of archive files of the running configuration to be saved in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **path (config-archive)** ",
            "description": " Specifies the location and filename prefix for the files in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **show archive** ",
            "description": " Displays information about the files saved in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **time-period** ",
            "description": " Sets the time increment for automatically saving an archive file of the current running configuration in the Cisco IOS configuration archive. "
        }
    ]
}