{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "copy /noverify",
    "FuncDef": [
        "To disable the automatic image verification for the current copy operation, use the **copy** **/noverify** command. "
    ],
    "CLIs": [
        "copy /noverify <source-url destination-url>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *source-url* ",
            "Info": " Location URL or alias of the source file or directory to be copied; see the \"Usage Guidelines\" section for additional information. "
        },
        {
            "Parameters": " *destination-url* ",
            "Info": " Destination URL or alias of the copied file or directory; see the \"Usage Guidelines\" section for additional information. "
        }
    ],
    "Examples": [
        [
            "```",
            "Router# copy /noverify tftp: sup-bootflash:",
            "```",
            "```",
            ".................................................",
            "```",
            "```",
            "[ OK - 24301348 bytes ]",
            "```",
            "```",
            "24301348 bytes copied in 157.328 secs (154463 bytes/sec)",
            "```",
            "```",
            "Router#",
            "```"
        ]
    ],
    "ExtraInfo": "The exact format of the source and destination URLs varies according to the file or directory location. You may enter either an alias keyword for a particular file or an alias keyword for a file system type (not a file within a type).![](/c/dam/en/us/td/i/templates/timesave.gif)---**Timesaver** ![](/c/dam/en/us/td/i/templates/blank.gif)Aliases are used to cut down on the amount of typing that you need to perform. For example, it is easier to type **copy run start** (the abbreviated form of the **copy running-config startup-config** command) than it is to type **copy system:r nvram:s** (the abbreviated form of the **copy system:running-config nvram:startup-config** command). These aliases allow you to continue using some of the common commands that are used in previous versions of Cisco IOS software.---[Table 23](#wp1011258) shows two keyword shortcuts to URLs.Table 23 Common Keyword Aliases to URLs| Keyword | Source or Destination || --- | --- || **running-config** | (Optional) Specifies the alias for the **system:running-config** URL. This keyword does not work in the **more** and **show file** command syntaxes. || **startup-config** | (Optional) Specifies the alias for the **nvram:startup-config URL.** The **nvram:startup-config** keyword represents the configuration file that is used during initialization (startup). This file is contained in NVRAM. This keyword does not work in **more** and **show file** EXEC command syntaxes. |  [Table 24](#wp1011297) through [Table 26](#wp1011360) list aliases by file system type. If you do not specify an alias, the system looks for a file in the current directory.[Table 24](#wp1011297) lists the URL prefix aliases for special (opaque) file systems, [Table 25](#wp1011334) lists the URL prefix aliases for network file systems, and [Table 26](#wp1011360) lists the URL prefix aliases for local writable storage file systems.Table 24 URL Prefix Aliases for Special File Systems| Alias | Source or Destination || --- | --- || **flh:** | Source URL for Flash load helper log files. || **nvram:** | Router NVRAM. You can copy the startup configuration into or from NVRAM. You can also display the size of a private configuration file. || **null:** | Null destination for copies or files. You can copy a remote file to null to determine its size. || **system:** | Source or destination URL for system memory, which includes the running configuration. || **xmodem:** | Source destination for the file from a network device that uses the Xmodem protocol. || **ymodem:** | Source destination for the file from a network device that uses the Ymodem protocol. |  Table 25 URL Prefix Aliases for Network File Systems| Alias | Source or Destination || --- | --- || **ftp:** | Source or destination URL for an FTP network server. The syntax for this alias is as follows:**ftp:**[[[//username [:password]@]location]/directory]/filename. || **rcp:** | Source or destination URL for an rcp network server. The syntax for this alias is as follows: **rcp:**[[[//username@]location]/directory]/filename. || **tftp:** | Source or destination URL for a TFTP network server. The syntax for this alias is **tftp:**[[//location]/directory]/filename. |  Table 26 URL Prefix Aliases for Local Writable Storage File Systems| Alias | Source or Destination || --- | --- || **bootflash:** | Source or destination URL for boot flash memory. || **disk0: and disk1:** | Source or destination URL of rotating media. || **flash:** | Source or destination URL for Flash memory. This alias is available on all platforms.  For platforms that lack a Flash: device, note that flash: is aliased to slot0:, allowing you to refer to the main Flash memory storage area on all platforms. || **slavebootflash:** | Source or destination URL for internal Flash memory on the slave RSP card of a device that is configured for HSA. || **slaveram:** | NVRAM on a slave RSP card of a device that is configured for HSA. || **slavedisk0:** | Source or destination URL of the first PCMCIA card on a slave RSP card of a device that is configured for HSA. || **slavedisk1:** | Source or destination URL of the second PCMCIA slot on a slave RSP card of a device that is configured for HSA. || **slaveslot0:** | Source or destination URL of the first PCMCIA card on a slave RSP card of a router configured for HSA—Available on systems that are configured with a Supervisor Engine 2. || **slaveslot1:** | Source or destination URL of the second PCMCIA slot on a slave RSP card of a router configured for HSA—Available on systems that are configured with a Supervisor Engine 2. || **slot0:** | Source or destination URL of the first PCMCIA Flash memory card—Available on systems that are configured with a Supervisor Engine 2. || **slot1:** | Source or destination URL of the second PCMCIA Flash memory card—Available on systems that are configured with a Supervisor Engine 2. |  You can enter on the command line all necessary source- and destination-URL information and the username and password to use, or you can enter the **copy** command and have the switch prompt you for any missing information.If you enter information, choose one of the following three options: **running-config**, **startup-config**, or a file system alias (see [Table 23](#wp1011258) through [Table 26](#wp1011360)). The location of a file system dictates the format of the source or destination URL.The colon is required after the alias. However, earlier commands that do not require a colon remain supported but are unavailable in context-sensitive help.The entire copying process may take several minutes and differs from protocol to protocol and from network to network.In the alias syntax for **ftp:**, **rcp:**, and **tftp:**, the location is either an IP address or a hostname. The filename is specified for the directory that is used for file transfers.Enter the **file verify auto** command to set up verification globally.",
    "RelatedCmds": [
        {
            "cmd": " **file verify auto** ",
            "description": " Verifies the compressed Cisco IOS image checksum. "
        },
        {
            "cmd": " **verify** ",
            "description": " Verifies the checksum of a file on a Flash memory file system or compute an MD5 signature for a file. "
        }
    ]
}