{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "delete",
    "FuncDef": [
        "To delete a file on a Flash memory device or NVRAM, use the **delete** command in EXEC, privileged EXEC, or diagnostic mode. "
    ],
    "CLIs": [
        "delete <url> [ /force | /recursive ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *url* ",
            "Info": " Cisco IOS File System URL of the file to be deleted. Include the file system prefix, followed by a colon, and, optionally, the name of a file or directory. See [Table 27](#wp1063761) for list of supported URLs. "
        },
        {
            "Parameters": " **/force** ",
            "Info": " (Optional) Deletes the specified file or directory without prompting you for verification.  **Note** Use this keyword with caution: the system will not ask you to confirm the file deletion. "
        },
        {
            "Parameters": " **/recursive** ",
            "Info": " (Optional) Deletes all files in the specified directory, as well as the directory itself. "
        }
    ],
    "Examples": [
        [
            "The following example deletes the file named test from the Flash card inserted in slot 0:",
            "```",
            "Router# delete slot0:test",
            "```",
            "```",
            "Delete slot0:test? [ confirm ]",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "If you attempt to delete the configuration file or image specified by the CONFIG\\_FILE or BOOTLDR environment variable, the system prompts you to confirm the deletion. Also, if you attempt to delete the last valid system image specified in the BOOT environment variable, the system prompts you to confirm the deletion.When you delete a file in Flash memory, the software simply marks the file as deleted, but it does not erase the file. To later recover a \"deleted\" file in Flash memory, use the **undelete** EXECcommand. You can delete and undelete a file up to 15 times.To permanently delete all files marked \"deleted\" on a linear Flash memory device, use the **squeeze** EXEC command.[Table 27](#wp1063761) contains a list of Cisco IOS File System URLs.Table 27 URL File System Prefix Keywords| Prefix | Filesystem || --- | --- || **bootflash:** | Delete the file from boot Flash memory. || **flash:** | Delete the file from Flash memory. || harddisk: | Delete the file from the harddisk file system. || **nvram:** | Delete the from the router NVRAM. || obfl: | Delete the file from the onboard failure logging file system. || **slot0:** | Delete the file from the first PCMCIA Flash memory card. || stby-bootflash: | Delete the file from the standby bootflash file system. || stby-harddisk: | Delete the file from the standby harddisk file system. || stby-nvram: | Delete the from the router NVRAM on the standby hardware. || stby-obfl: | Delete the file from the onboard failure logging file system on the standby hardware. || stby-usb[0-1]: | Delete the file from the standby USB Flash drive. || usb[0-1]; | Delete the file from the USB Flash drive. || **usbflash**[**0**-**9**]**:** | Delete the file from the USB Flash drive. || **usbtoken**[**0**-**9**]**:** | Delete the file from the USB eToken. |  ",
    "RelatedCmds": [
        {
            "cmd": " **cd** ",
            "description": " Changes the default directory or file system. "
        },
        {
            "cmd": " **dir** ",
            "description": " Displays a list of files on a file system. "
        },
        {
            "cmd": " **show bootvar** ",
            "description": " Displays the contents of the BOOT environment variable, the name of the configuration file pointed to by the CONFIG_FILE environment variable, the contents of the BOOTLDR environment variable, and the configuration register setting. "
        },
        {
            "cmd": " **squeeze** ",
            "description": " Permanently deletes Flash files by squeezing a Class A Flash file system. "
        },
        {
            "cmd": " **undelete** ",
            "description": " Recovers a file marked \"deleted\" on a Class A or Class B Flash file system. "
        }
    ]
}