{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "diagnostic bootup level",
    "FuncDef": [
        "To set the diagnostic bootup level, use the **diagnostic bootup level** command in global configuration mode. To skip all diagnostic tests, use the **no** form of this command. "
    ],
    "CLIs": [
        "diagnostic bootup level { minimal | complete }",
        "no diagnostic bootup level"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **minimal** ",
            "Info": " Specifies minimal diagnostics. See the Usage Guidelines section for additional information. "
        },
        {
            "Parameters": " **complete** ",
            "Info": " Specifies complete diagnostics. See the Usage Guidelines section for additional information. "
        }
    ],
    "Examples": [
        [
            "The following example shows how to set the diagnostic bootup level:",
            "```",
            "Router(config)# diagnostic bootup level complete",
            "```"
        ]
    ],
    "ExtraInfo": "Setting the diagnostic level determines the level of testing that occurs when the system or module is reset. The two levels are as follows:•![](/c/dam/en/us/td/i/templates/blank.gif)Complete—Runs all tests.•![](/c/dam/en/us/td/i/templates/blank.gif)Minimal—Runs only EARL tests for the supervisor engine and loopback tests for all ports in the system.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)Although the default is **minimal**, you can set the diagnostic level to **complete** for troubleshooting hardware problems.---In certain circumstances, you might want to skip the bootup online diagnostics completely. For example, you might skip the bootup online diagnostics to verify that a port is as bad as online diagnostics reports. To skip online diagnostic testing completely, use the **no diagnostic bootup level** command.For information on the diagnostic test types, use the **show diagnostic** command.The new level takes effect at the next reload or the next time that an online insertion and removal is performed.",
    "RelatedCmds": [
        {
            "cmd": " **show diagnostic bootup level** ",
            "description": " Displays the coverage level for the configured bootup diagnostics. "
        }
    ]
}