{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "dispatch-timeout",
    "FuncDef": [
        "To set the character dispatch timer, use the **dispatch-timeout** command in line configuration mode. To remove the timeout definition, use the **no** form of this command. "
    ],
    "CLIs": [
        "dispatch-timeout <milliseconds>",
        "no dispatch-timeout"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *milliseconds* ",
            "Info": " Integer that specifies the number of milliseconds (ms) that the Cisco IOS software waits after putting the first character into a packet buffer before sending the packet. During this interval, more characters can be added to the packet, which increases the processing efficiency of the remote host. "
        }
    ],
    "Examples": [
        [
            "The following example sets the dispatch timer to 80 <milliseconds> for virtual terminal line (vty) lines 0 through 4:",
            "```",
            "Router(config)# line vty 0 4",
            "```",
            "```",
            "Router(config-line)# dispatch-timeout 80",
            "```"
        ]
    ],
    "ExtraInfo": "Use this command to increase the processing efficiency for the remote host.The **dispatch-timeout** line configuration command causes the software to buffer characters into packets for transmission to the remote host. The Cisco IOS software sends a packet a specified amount of time after the first character is put into the buffer. You can use the **dispatch-timeout** and **dispatch-character** line configuration commands together. In this case, the software dispatches a packet each time the dispatch character is entered, or after the specified dispatch timeout interval, depending on which condition is met first.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)The system response time might appear intermittent if the timeout interval is greater than 100 milliseconds and remote echoing is used. For lines with a reverse-Telnet connection, use a dispatch-timeout value less than 10 milliseconds.---",
    "RelatedCmds": [
        {
            "cmd": " **buffer-length** ",
            "description": " Specifies the maximum length of data streams forwarded on a line. "
        },
        {
            "cmd": " **dispatch-character** ",
            "description": " Defines a character that causes a packet to be sent. "
        },
        {
            "cmd": " **dispatch-machine** ",
            "description": " Specifies an identifier for a TCP packet dispatch state machine on a particular line. "
        },
        {
            "cmd": " **state-machine** ",
            "description": " Specifies the transition criteria for the state of a particular state machine. "
        },
        {
            "cmd": " **terminal dispatch-timeout** ",
            "description": " Sets the character dispatch timer for the current session. "
        }
    ]
}