{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "dispatch-character",
    "FuncDef": [
        "To define a character that causes a packet to be sent, use the **dispatch-character** command in line configuration mode. To remove the definition of the specified dispatch character, usethe **no** form of this command. "
    ],
    "CLIs": [
        "dispatch-character <ascii-number1> [ <ascii-number2 . . . ascii-number> ]",
        "no dispatch-character <ascii-number1> [ <ascii-number2 . . . ascii-number> ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *ascii-number1* ",
            "Info": " Decimal representation of the desired dispatch character. "
        },
        {
            "Parameters": " *ascii-number2 . . . ascii-number* ",
            "Info": " (Optional) Additional decimal representations of characters. This syntax indicates that you can define any number of characters as dispatch characters. "
        }
    ],
    "Examples": [
        [
            "The following example defines the Return character (decimal 13) as the dispatch character for virtual terminal line (vty) line 4:",
            "```",
            "Router(config)# line vty 4",
            "```",
            "```",
            "Router(config-line)# dispatch-character 13",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "See the \"ASCII Character Set and Hex Values\" appendix for a list of ASCII characters.The **dispatch-character** command defines one or more dispatch characters that cause a packet to be sent even if the dispatch timer has not expired. Use of a dispatch character causes the Cisco IOS software to attempt to buffer characters into larger-sized packets for transmission to the remote host.Enable the **dispatch-character** command from the session that initiates the connection, not from the incoming side of a streaming Telnet session.This command can take multiple arguments, so you can define any number of characters as dispatch characters.",
    "RelatedCmds": [
        {
            "cmd": " **dispatch-machine** ",
            "description": " Specifies an identifier for a TCP packet dispatch state machine on a particular line. "
        },
        {
            "cmd": " **dispatch-timeout** ",
            "description": " Sets the character dispatch timer. "
        },
        {
            "cmd": " **state-machine** ",
            "description": " Specifies the transition criteria for the state of a particular state machine. "
        },
        {
            "cmd": " **terminal dispatch-character** ",
            "description": " Defines a character that causes a packet to be sent for the current session. "
        }
    ]
}