{
    "PageTitle": "dcb enable",
    "FuncDef": "The dcb enable command applies an Enhanced Transmission Selection (ETS) or APP profile to an interface.\nThe undo dcb ets enable command deletes an ETS profile from an interface.\nThe undo dcb app-profile enable command applies the default APP profile to an interface.\nThe dcb app-profile disable command deletes an APP profile from an interface. The dcb enable command applies an Enhanced Transmission Selection (ETS) or APP profile to an interface. The undo dcb ets enable command deletes an ETS profile from an interface. The undo dcb app-profile enable command applies the default APP profile to an interface. The dcb app-profile disable command deletes an APP profile from an interface. By default, no ETS or APP profile is applied to an interface. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "dcb { { etsenable <etsprofile> } | { app-profile { enable <appprofile> | disable } } }",
        "undo dcb { { etsenable [ <etsprofile> ] } | { app-profile { { enable [ <appprofile> ] } | disable } } }"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<etsprofile>",
            "Info": "Specifies the name of an ETS profile.\nThe ETS profile must already exist."
        },
        {
            "Parameters": "<appprofile>",
            "Info": "Specifies the name of an APP profile.\nThe APP profile must already exist."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcb ets-profile myets",
            "[*HUAWEI-ets-myets] quit",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] dcb ets enable myets"
        ]
    ],
    "ExtraInfo": "ETS ensures that traffic of high priorities is preferentially processed, maximizing the bandwidth usage. The dcb ets enable command applies an ETS profile to an interface.\nTo enable the device configured with Data Center Bridging (DCB) to interwork with a non-Huawei device, create an APP profile, specify a service priority in the APP TLV in the APP profile, and apply the APP profile to an interface. To apply the APP profile to an interface, run this command."
}