{
    "PageTitle": "dcb pfc buffer",
    "FuncDef": "The dcb pfc buffer command sets the thresholds for triggering and stopping PFC frames, guaranteed buffer threshold, and headroom buffer threshold for a PFC queue in the inbound direction.\nThe undo dcb pfc buffer command deletes the manually configured thresholds for triggering and stopping PFC frames, guaranteed buffer threshold, and headroom buffer threshold for a PFC queue in the inbound direction. The dcb pfc buffer command sets the thresholds for triggering and stopping PFC frames, guaranteed buffer threshold, and headroom buffer threshold for a PFC queue in the inbound direction. The undo dcb pfc buffer command deletes the manually configured thresholds for triggering and stopping PFC frames, guaranteed buffer threshold, and headroom buffer threshold for a PFC queue in the inbound direction. By default, the thresholds for triggering and stopping PFC frames, guaranteed buffer threshold, and headroom buffer threshold for a PFC queue in the inbound direction are not configured. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "dcb pfc buffer <queue-index> xonstatic <xon-value> { kbytes | mbytes } xoffstatic <xoff-value> { kbytes | mbytes }",
        "undo dcb pfc buffer <queue-index> xonstatic <xon-value> { kbytes | mbytes } xoffstatic <xoff-value> { kbytes | mbytes }",
        "dcb pfc buffer <queue-index> xondynamic <alpha-value> xoffdynamic <alpha-value>",
        "undo dcb pfc buffer <queue-index> xondynamic <alpha-value> xoffdynamic <alpha-value>",
        "dcb pfc buffer <queue-index> guaranteed <guaranteed-value> [ bytes | kbytes ]",
        "dcb pfc buffer <queue-index> hdrm <hdrm-value> [ kbytes ]",
        "undo dcb pfc buffer [ <queue-index> [ guaranteed [ <guaranteed-value> [ bytes | kbytes ] ] ] ]",
        "undo dcb pfc buffer [ <queue-index> [ hdrm [ <hdrm-value> [ kbytes ] ] ] ]",
        "dcb pfc buffer <queue-index> xoff { static <xoff-value> [ kbytes | mbytes ] | dynamic <alpha-value> } [ xonoffset <offset-value> [ kbytes | mbytes ] ]",
        "undo dcb pfc buffer [ <queue-index> [ xoff [ static [ <xoff-value> [ kbytes | mbytes ] ] | dynamic [ <alpha-value> ] ] [ xonoffset [ <offset-value> [ kbytes | mbytes ] ] ] ] ]"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<queue-index>",
            "Info": "Specifies the index of an interface queue.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 0 to 7.\nFor the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM:The value is an integer ranging from 0 to 5."
        },
        {
            "Parameters": "xon <xon-value>",
            "Info": "Specifies the threshold for stopping PFC frames. When the occupied buffer space is lower than this threshold, PFC frames are not sent.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.\nThe value is an integer ranging from 1 to 6144, in kbytes. The default value is 100 kbytes. The default unit is kbytes.\nThe configured value of xon must be smaller than or equal to the configured value of xoff."
        },
        {
            "Parameters": "static",
            "Info": "Specifies the static threshold.\n-"
        },
        {
            "Parameters": "kbytes",
            "Info": "Specifies that a threshold is expressed in kbytes.\n-"
        },
        {
            "Parameters": "mbytes",
            "Info": "Specifies that a threshold is expressed in mbytes.\n-"
        },
        {
            "Parameters": "xoff <xoff-value>",
            "Info": "Specifies the threshold for triggering PFC frames. When the occupied buffer space is higher than this threshold, PFC frames are sent.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 30720, in kbytes. The default unit is kbytes.\nFor the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM:The value is an integer ranging from 1 to 6144, in kbytes. The default value is 125 kbytes. The default unit is kbytes.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 9216, in kbytes. The default unit is kbytes."
        },
        {
            "Parameters": "dynamic <alpha-value>",
            "Info": "Specifies the dynamic threshold.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 12. The default value is 3.\nFor the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM:The value is an integer ranging from 0 to 10."
        },
        {
            "Parameters": "guaranteed <guaranteed-value>",
            "Info": "Specifies the guaranteed buffer threshold for a PFC queue in the inbound direction. The buffer space specified by this threshold cannot be used by other queues.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 640 to 25600, in bytes. The default value is 1600 bytes. The default unit is bytes.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 640 to 25600, in bytes. The default value is 1632 bytes. The default unit is bytes."
        },
        {
            "Parameters": "bytes",
            "Info": "Specifies that the threshold is expressed in bytes.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "hdrm <hdrm-value>",
            "Info": "Specifies the headroom buffer threshold for a PFC queue in the inbound direction. If the volume of traffic received after PFC frames are sent exceeds the buffer space specified by this threshold, the traffic is discarded.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 16 to 30720, in kbytes. The default value is 256 kbytes. The default unit is kbytes.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 16 to 9216, in kbytes. The default value is 256 kbytes. The default unit is kbytes."
        },
        {
            "Parameters": "offset <offset-value>",
            "Info": "Specifies the offset of the Xon value relative to the Xoff value.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 30720, in kbytes. The default value is 6 kbytes. The default unit is kbytes.\nThe configured value of offset must be smaller than the configured value of xoff. The difference between them is the Xon value, which is the threshold for stopping PFC frames.\nThe actual effective threshold for stopping PFC frames is the larger value between the Xon protection value and the value obtained by subtracting the configured offset value from the configured xoff value.\nThe Xon protection value is that of the Xon-Lowest field in the display dcb pfc buffer command output.\n\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 9216, in kbytes. The default value is 6 kbytes. The default unit is kbytes.\nThe configured value of offset must be smaller than the configured value of xoff. The difference between them is the Xon value, which is the threshold for stopping PFC frames.\nThe actual effective threshold for stopping PFC frames is the larger value between the Xon protection value and the value obtained by subtracting the configured offset value from the configured xoff value.\nThe Xon protection value is that of the Xon-Lowest field in the display dcb pfc buffer command output."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] dcb pfc buffer 1 guaranteed 25 kbytes",
            "[*HUAWEI-100GE1/0/1] dcb pfc buffer 1 xoff static 300 kbytes xon offset 200 kbytes",
            "[*HUAWEI-100GE1/0/1] dcb pfc buffer 1 hdrm 1000 kbytes"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] dcb pfc buffer 3 xon dynamic 5 xoff dynamic 10"
        ]
    ],
    "ExtraInfo": "When the buffer space of a queue on an interface of the receive device exceeds the threshold, a backpressure signal is sent to the transmit device, requesting the transmit device to stop sending packets in the corresponding priority queue. You can run this command to adjust the threshold of a queue on an interface of the receive device.\nAfter PFC is enabled, the device has default thresholds for triggering and stopping PFC frames in the inbound direction. If you find that the default thresholds cannot meet your expectation, you can run this command to manually set the thresholds.\nThe sum of the threshold for triggering PFC frames and the headroom buffer threshold in the inbound direction of a queue must be smaller than both the lower WRED threshold and queue-level service buffer threshold. Otherwise, packet loss occurs.\nWhen traffic is transmitted from multiple inbound interfaces to one outbound interface, the sum of the threshold for triggering PFC frames and the headroom buffer threshold of all these inbound interfaces must be smaller than both the lower WRED threshold and queue-level service buffer threshold of the single outbound interface. Otherwise, packet loss occurs.\nYou can run the display dcb pfc buffer command to check the thresholds.\nFor the CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-SAN, CE6885-LL, CE6885-T, and CE6863E-48S8CQ:"
}