{
    "PageTitle": "dcb pfc deadlock recovery-behavior",
    "FuncDef": "The dcb pfc deadlock recovery-behavior command configures the packet processing behavior of a device during the recovery period of hardware-based deadlock detection.\nThe undo dcb pfc deadlock recovery-behavior command restores the default packet processing behavior of a device during the recovery period of hardware-based deadlock detection. The dcb pfc deadlock recovery-behavior command configures the packet processing behavior of a device during the recovery period of hardware-based deadlock detection. The undo dcb pfc deadlock recovery-behavior command restores the default packet processing behavior of a device during the recovery period of hardware-based deadlock detection. By default, the CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-SAN, CE6885-LL, CE6885-T, and CE6863E-48S8CQ forward packets during the recovery period of hardware-based deadlock detection. By default, the CE6866, CE6860-SAN, CE6866K, CE6860-HAM, CE8851-32CQ8DQ-P, CE8850-SAN, CE8851K, and CE8850-HAM discard packets during the recovery period of hardware-based deadlock detection. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "dcb pfc deadlock recovery-behavior { forwarding | discard } slot <slot-id>",
        "undo dcb pfc deadlock recovery-behavior { forwarding | discard } slot <slot-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "forwarding",
            "Info": "Configures a device to forward packets during the recovery period of hardware-based deadlock detection.\n-"
        },
        {
            "Parameters": "discard",
            "Info": "Configures a device to discard packets during the recovery period of hardware-based deadlock detection.\n-"
        },
        {
            "Parameters": "slot <slot-id>",
            "Info": "Specifies the slot ID.\nThe value is an integer. You can enter a question mark (?) and select a value from the displayed value range."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcb pfc deadlock recovery-behavior discard slot 1"
        ]
    ],
    "ExtraInfo": "After deadlock detection and recovery are configured, you can run this command to modify the packet forwarding behavior during the recovery period of hardware-based deadlock detection."
}