{
    "PageTitle": "port pfc-deadlock trigger",
    "FuncDef": "The port pfc-deadlock trigger command configures the device to set an interface to the Error-Down state or disable PFC on the interface after a deadlock occurs on the interface for a specified number of times within 20 seconds.\nThe undo port pfc-deadlock trigger command restores the default configuration. The port pfc-deadlock trigger command configures the device to set an interface to the Error-Down state or disable PFC on the interface after a deadlock occurs on the interface for a specified number of times within 20 seconds. The undo port pfc-deadlock trigger command restores the default configuration. By default, the device automatically disables PFC on an interface after a deadlock occurs on the interface for a specified number of times within 20 seconds. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "port pfc-deadlock trigger { error-down | turn-off }",
        "undo port pfc-deadlock trigger { error-down | turn-off }"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "error-down",
            "Info": "Configure an interface to enter the Error-Down state when the number of deadlocks detected within 20 seconds exceeds the deadlock threshold.\n-"
        },
        {
            "Parameters": "turn-off",
            "Info": "Disable the PFC function when the number of deadlocks detected within 20 seconds exceeds the deadlock threshold.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] port pfc-deadlock trigger error-down"
        ]
    ],
    "ExtraInfo": ""
}