{
    "PageTitle": "priority-group queue",
    "FuncDef": "The priority-group queue command adds an interface queue to a priority group.\nThe undo priority-group queue command deletes an interface queue from a priority group. The priority-group queue command adds an interface queue to a priority group. The undo priority-group queue command deletes an interface queue from a priority group. By default, queues 0, 1, 2, 4, and 5 belong to PG0, queue 3 belongs to PG1, and queues 6 and 7 belong to PG15. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "priority-group <pg-group-value> queue { <start-queue-index> [ to <end-queue-index> ] } &<1-8>",
        "undo priority-group <pg-group-value> queue [ <start-queue-index> [ to <end-queue-index> ] ] &<0-8>"
    ],
    "ParentView": [
        "ETS view of the DCB"
    ],
    "ParaDef": [
        {
            "Parameters": "<pg-group-value>",
            "Info": "Specifies the value of a priority group.\nEnumerated type. The values are as follows:\n0:PG01:PG12:PG23:PG34:PG45:PG56:PG67:PG715:PG15"
        },
        {
            "Parameters": "<start-queue-index>",
            "Info": "Specifies queue-start value.\nThe value is an integer that ranges from 0 to 7."
        },
        {
            "Parameters": "to <end-queue-index>",
            "Info": "Specifies queue-end value.\nend-queue-index must be larger than or equal to start-queue-index. start-queue-index and end-queue-index determine a range of queues. If to end-queue-index is not specified, the queue specified by start-queue-index joins a priority group.\nThe value is an integer that ranges from 0 to 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcb ets-profile myets",
            "[*HUAWEI-ets-myets] priority-group 1 queue 5 to 7"
        ]
    ],
    "ExtraInfo": "ETS provides CoSs based on priority groups. A priority group is a group of queues with the same attributes on an interface. You can run the priority-group queue command to add queues with different priorities to a priority group.\nQueues in the same priority group share the same CoS such as low latency and lossless packets."
}