{
    "PageTitle": "priority-group drr",
    "FuncDef": "The priority-group drr command sets the Deficit Round Robin (DRR) weight for a priority group.\nThe undo priority-group drr command restores the default DRR weight for a priority group. The priority-group drr command sets the Deficit Round Robin (DRR) weight for a priority group. The undo priority-group drr command restores the default DRR weight for a priority group. For the CE6866, CE6860-SAN, CE6866K, CE6860-HAM, CE8851-32CQ8DQ-P, CE8850-SAN, CE8851K, and CE8850-HAM, the DRR weights of PG0 and PG1 are both 50 by default.\n\n\nFor the CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-SAN, CE6885-LL (standard forwarding mode), CE6885-T, and CE6863E-48S8CQ, by default, the scheduling mode of the CIR token bucket based on PG0 and PG1 is PQ, and the scheduling mode of the EIR token bucket based on PG0 and PG1 is DRR with the weight being 50. For the CE6866, CE6860-SAN, CE6866K, CE6860-HAM, CE8851-32CQ8DQ-P, CE8850-SAN, CE8851K, and CE8850-HAM, the DRR weights of PG0 and PG1 are both 50 by default. For the CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-SAN, CE6885-LL (standard forwarding mode), CE6885-T, and CE6863E-48S8CQ, by default, the scheduling mode of the CIR token bucket based on PG0 and PG1 is PQ, and the scheduling mode of the EIR token bucket based on PG0 and PG1 is DRR with the weight being 50. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "priority-group <pg-group-value> drrweight <weight-value>",
        "undo priority-group <pg-group-value> drrweight <weight-value>"
    ],
    "ParentView": [
        "ETS view of the DCB"
    ],
    "ParaDef": [
        {
            "Parameters": "<pg-group-value>",
            "Info": "Specifies the value of a priority group.\nEnumerated type. The values are as follows:\n0:PG01:PG12:PG23:PG34:PG45:PG56:PG67:PG7"
        },
        {
            "Parameters": "weight <weight-value>",
            "Info": "Specifies the DRR weight of a queue or some queues participating in DRR scheduling.\nThe value is an integer that ranges from 1 to 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcb ets-profile myets",
            "[*HUAWEI-ets-myets] priority-group 1 drr weight 80"
        ]
    ],
    "ExtraInfo": "In ETS, priority groups except PG15 use DRR scheduling. You can run the priority-group drr command to set the DRR weight for each priority group so that the system schedules each priority group based on weights in turn.\nIn DRR scheduling, the weight indicates the percentage of resources that a queue can obtain. You can configure the DRR weight according to the actual networking."
}