{
    "PageTitle": "qos buffer headroom-pool",
    "FuncDef": "The qos buffer headroom-pool command configures the chip-level headroom buffer threshold.\nThe undo qos buffer headroom-pool command cancels the configuration. The qos buffer headroom-pool command configures the chip-level headroom buffer threshold. The undo qos buffer headroom-pool command cancels the configuration. By default, the chip-level headroom buffer threshold is not configured. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "qos buffer headroom-pool size <size> { kbytes | mbytes } slot <slot-id>",
        "undo qos buffer headroom-pool [ size <size> { kbytes | mbytes } ] slot <slot-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "size <size>",
            "Info": "Specifies the headroom buffer threshold.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer that ranges from 16 to 30720, in kbytes.\nFor the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM:The value is an integer that ranges from 1 to 2048, in kbytes.\nFor the CE6885-LL (low latency mode):The value is an integer that ranges from 16 to 9216, in kbytes."
        },
        {
            "Parameters": "kbytes",
            "Info": "Specifies the unit as kilobytes.\n-"
        },
        {
            "Parameters": "mbytes",
            "Info": "Specifies the unit as megabytes.\n-"
        },
        {
            "Parameters": "slot <slot-id>",
            "Info": "Specifies the slot ID.\nThe value is an integer. You can enter the question mark (?) and select the value as prompted."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] qos buffer headroom-pool size 1 mbytes slot 1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] qos buffer headroom-pool size 4 mbytes slot 1"
        ]
    ],
    "ExtraInfo": "To absorb more packets from a link, run this command."
}