{
    "PageTitle": "queue",
    "FuncDef": "The queue command configures a scheduling mode for an interface queue.\nThe undo queue command restores the default scheduling mode for an interface queue. The queue command configures a scheduling mode for an interface queue. The undo queue command restores the default scheduling mode for an interface queue. By default, an interface queue uses priority queuing PQ. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "queue { <start-queue-index> [ to <end-queue-index> ] } &<1-8> { pq | lpq | drr [ weight <weight-value> ] }",
        "undo queue <start-queue-index> { lpq | drrweight <weight-value> }"
    ],
    "ParentView": [
        "ETS view of the DCB"
    ],
    "ParaDef": [
        {
            "Parameters": "<start-queue-index>",
            "Info": "Specifies queue-start value.\nThe value is an integer that ranges from 0 to 7 ."
        },
        {
            "Parameters": "to <end-queue-index>",
            "Info": "Specifies queue-end value.\nend-queue-index must be larger than or equal to start-queue-index. start-queue-index and end-queue-index determine a range of queues. If end-queue-index is not specified, a scheduling mode is configured for the queue specified by start-queue-index.\nThe value is an integer that ranges from 0 to 7 ."
        },
        {
            "Parameters": "pq",
            "Info": "Sets the scheduling mode to PQ.\n-"
        },
        {
            "Parameters": "lpq",
            "Info": "Sets the scheduling mode to LPQ.\n-"
        },
        {
            "Parameters": "drr",
            "Info": "Sets the scheduling mode to DRR.\n-"
        },
        {
            "Parameters": "weight <weight-value>",
            "Info": "Specifies the DRR weight.\nThe value is an integer that ranges from 1 to 100 ."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcb ets-profile myets",
            "[*HUAWEI-ets-myets] queue 5 pq",
            "[*HUAWEI-ets-myets] queue 6 7 drr weight 30"
        ]
    ],
    "ExtraInfo": "ETS supports two-level scheduling: scheduling based on priority groups and queues. ETS provides fine-grained QoS services.\nETS uses the following scheduling modes for queues in priority groups:"
}