{
    "PageTitle": "queue shaping",
    "FuncDef": "The queue shaping command enables traffic shaping for an interface queue and sets shaping parameters.\nThe undo queue shaping command disables traffic shaping for an interface queue. The queue shaping command enables traffic shaping for an interface queue and sets shaping parameters. The undo queue shaping command disables traffic shaping for an interface queue. By default, traffic shaping is disabled for an interface queue. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "queue { <start-queue-index> [ to <end-queue-index> ] } &<1-8> shapingcir <cir-value> { kbps | mbps | gbps } pir <pir-value> { kbps | mbps | gbps } [ cbs <cbs-value> { kbytes | mbytes } pbs <pbs-value> { kbytes | mbytes } ]",
        "undo queue { <start-queue-index> [ to <end-queue-index> ] } &<1-8> shaping [ cir <cir-value> { kbps | mbps | gbps } pir <pir-value> { kbps | mbps | gbps } [ cbs <cbs-value> { kbytes | mbytes } pbs <pbs-value> { kbytes | mbytes } ] ]"
    ],
    "ParentView": [
        "ETS view of the DCB"
    ],
    "ParaDef": [
        {
            "Parameters": "<start-queue-index>",
            "Info": "Specify queue-start value.\nThe value is an integer that ranges from 0 to 7 ."
        },
        {
            "Parameters": "to <end-queue-index>",
            "Info": "Specify queue-end value.\nend-queue-index must be larger than or equal to start-queue-index. start-queue-index and end-queue-index determine a range of queues. If end-queue-index is not specified, a scheduling mode is configured for the queue specified by start-queue-index.\nThe value is an integer that ranges from 0 to 7 ."
        },
        {
            "Parameters": "cir <cir-value>",
            "Info": "Specifies the CIR for a priority group.\nThe value is an integer that ranges from 1 Mbit/s to 400 Gbit/s."
        },
        {
            "Parameters": "kbps",
            "Info": "Specifies the rate unit as kbit/s.\n-"
        },
        {
            "Parameters": "mbps",
            "Info": "Specifies the rate unit as mbit/s.\n-"
        },
        {
            "Parameters": "gbps",
            "Info": "Specifies the rate unit as gbit/s.\n-"
        },
        {
            "Parameters": "pir <pir-value>",
            "Info": "Specifies the PIR for a priority group.\nThe value is an integer that ranges from 1 Mbit/s to 400 Gbit/s."
        },
        {
            "Parameters": "cbs <cbs-value>",
            "Info": "Specifies the CBS, which is the committed volume of burst traffic that can pass through an interface.\nIf this parameter is not specified, the CBS is 125 times the CIR. If the CBS exceeds the maximum value, the maximum value takes effect.\nThe value is an integer that ranges from 1 kilobyte to 512 megabytes. The default unit is kilobyte."
        },
        {
            "Parameters": "kbytes",
            "Info": "Specifies that the CBS is expressed in kilobytes.\n-"
        },
        {
            "Parameters": "mbytes",
            "Info": "Specifies that the CBS is expressed in megabytes.\n-"
        },
        {
            "Parameters": "pbs <pbs-value>",
            "Info": "Specifies the PBS, which is the maximum volume of burst traffic that can pass through an interface.\nIf this parameter is not specified, the PBS is 125 times the PIR. If the PBS exceeds the maximum value, the maximum value takes effect.\nThe value is an integer that ranges from 1 kilobyte to 512 megabytes. The default unit is kilobyte."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcb ets-profile myets",
            "[*HUAWEI-ets-myets] queue 5 to 7 shaping cir 1 mbps pir 2 mbps cbs 12 kbytes pbs 24 kbytes"
        ]
    ],
    "ExtraInfo": ""
}