{
    "PageTitle": "dcb abs-pfc queue enable",
    "FuncDef": "The dcb abs-pfc queue enable command enables antilocking PFC for queues on an interface.\nThe undo dcb abs-pfc queue enable command disables antilocking PFC for queues on an interface. The dcb abs-pfc queue enable command enables antilocking PFC for queues on an interface. The undo dcb abs-pfc queue enable command disables antilocking PFC for queues on an interface. By default, this function is disabled. This command is supported only on the CE6860-SAN and CE8850-SAN.",
    "CLIs": [
        "dcb abs-pfc queue <first-queue-index> [ <second-queue-index> ] enable [ threshold <threshold-value> ]",
        "undo dcb abs-pfc queue <first-queue-index> [ <second-queue-index> ] enable [ threshold <threshold-value> ]"
    ],
    "ParentView": [
        "100GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<first-queue-index>",
            "Info": "Specifies the index of the first queue for which antilocking PFC is to be enabled.\nThe value is an integer ranging from 0 to 5."
        },
        {
            "Parameters": "<second-queue-index>",
            "Info": "Specifies the index of the second queue for which antilocking PFC is to be enabled.\nThe value is an integer ranging from 0 to 5."
        },
        {
            "Parameters": "threshold <threshold-value>",
            "Info": "Specifies the buffer threshold for antilocking PFC to take effect.\nThe value is an integer that ranges from 0 to 512. The unit is KB and the default value is 0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] dcb abs-pfc queue 3 enable threshold 0"
        ]
    ],
    "ExtraInfo": "If lossless services on the live network have a long communication distance, for example, in a long-distance DCI scenario, you can run this command to enable antilocking PFC for interface queues."
}