{
    "PageTitle": "priority deadlock-recovery time(Antilocking PFC profile view)",
    "FuncDef": "The priority deadlock-recovery time command sets the recovery time for hardware-based deadlock detection.\nThe undo priority deadlock-recovery time command restores the default recovery time for hardware-based deadlock detection. The priority deadlock-recovery time command sets the recovery time for hardware-based deadlock detection. The undo priority deadlock-recovery time command restores the default recovery time for hardware-based deadlock detection. By default, the recovery time for hardware-based deadlock detection is 100 ms. This command is supported only on the CE6885-SAN.",
    "CLIs": [
        "priority <priority> deadlock-recoverytime <time>",
        "undo priority <priority> deadlock-recovery [ time <time> ]"
    ],
    "ParentView": [
        "Antilocking PFC profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "<priority>",
            "Info": "Specifies the priority.\nThe value is an integer ranging from 0 to 7."
        },
        {
            "Parameters": "<time>",
            "Info": "Specifies the recovery time for hardware-based deadlock detection.\nThe value is an integer that ranges from 0 to 31. The default value is 10.\nThe unit is determined by the dcb pfc deadlock-detect interval command. The default unit is 10 ms. The actual effective time is the product of the period accuracy parameter <interval-value> and the specified period <time>."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcb pfc deadlock-detect interval 100",
            "[~HUAWEI] abs-pfc profile myabspfc",
            "[~HUAWEI-abs-pfc-myabspfc] priority 3",
            "[*HUAWEI-abs-pfc-myabspfc] priority 3 deadlock-recovery time 15"
        ]
    ],
    "ExtraInfo": "A PFC deadlock may occur on a ring network. You can run the priority deadlock-recovery time command to configure the recovery time for hardware-based deadlock detection. During PFC deadlock recovery, PFC frames received by the interface are ignored. The internal scheduler resumes traffic sending or discards traffic in the specified priority queue. After the recovery period expires, the normal flow control mechanism of PFC resumes. If the system still determines that a deadlock occurs in the next deadlock detection period, the deadlock recovery process starts again."
}