{
    "PageTitle": "statistics enable (Layer 3 sub-interface view)",
    "FuncDef": "The statistics enable command enables traffic statistics collection on a Layer 3 sub-interface. The undo statistics enable command disables traffic statistics collection on a Layer 3 sub-interface. By default, traffic statistics collection is disabled on a Layer 3 sub-interface. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "statistics { ipv4 | ipv6 } enable [ inbound | outbound ]",
        "undo statistics { ipv4 | ipv6 } enable [ inbound | outbound ]"
    ],
    "ParentView": [
        "100ge sub-interface view,10GE sub-interface view,200GE sub-interface view,25GE sub-interface view,400GE sub-interface view,50GE sub-interface view,Eth-Trunk sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4",
            "Info": "Enables traffic statistics collection of IPv4 packets.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Enables traffic statistics collection of IPv6 packets.\n-"
        },
        {
            "Parameters": "inbound",
            "Info": "Enables traffic statistics collection in the inbound direction of an interface.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Enables traffic statistics collection in the outbound direction of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] quit",
            "[*HUAWEI] interface 100GE 1/0/1.1",
            "[*HUAWEI-100GE1/0/1.1] statistics ipv4 enable",
            "[*HUAWEI-100GE1/0/1.1] statistics ipv6 enable"
        ]
    ],
    "ExtraInfo": "To check the network status or locate network faults, you can enable traffic statistics collection on Layer 3 sub-interfaces and collect traffic statistics on the Layer 3 sub-interfaces."
}