{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "terminal exec-character-bits",
    "FuncDef": [
        "To locally change the ASCII character set used in EXEC and configuration command characters for the current session, use the **terminal exec-character-bits** command in EXEC mode. "
    ],
    "CLIs": [
        "terminal exec-character-bits { 7 | 8 }"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **7** ",
            "Info": " Selects the 7-bit ASCII character set. This is the default. "
        },
        {
            "Parameters": " **8** ",
            "Info": " Selects the full 8-bit character set. "
        }
    ],
    "Examples": [
        [
            "The following example temporarily configures the system to use a full 8-bit user interface for system banners and prompts, allowing the use of additional graphical and international characters:",
            "```",
            "Router# terminal exec-character-bits 8",
            "```"
        ]
    ],
    "ExtraInfo": "This EXEC command overrides the **default-value exec-character-bits** global configuration command. Configuring the EXEC character width to 8 bits enables you to view special graphical and international characters in banners, prompts, and so on.When the user exits the session, the character width is reset to the default value established by the **exec-character-bits** global configuration command. However, setting the EXEC character width to 8 bits can also cause failures. For example, if a user on a terminal that is sending parity enters the **help** command, an \"unrecognized command\" message appears because the system is reading all 8 bits, and the eighth bit is not needed for the **help** command.",
    "RelatedCmds": [
        {
            "cmd": " **exec-character-bits** ",
            "description": " Configures the character widths of EXEC and configuration command characters. "
        }
    ]
}