{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "terminal flowcontrol",
    "FuncDef": [
        "To set flow control for the current terminal line for the current session, use the **terminal flowcontrol** command in EXEC mode. "
    ],
    "CLIs": [
        "terminal flowcontrol { none | software [ in | out ] | hardware }"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **none** ",
            "Info": " Prevents flow control. "
        },
        {
            "Parameters": " **software** ",
            "Info": " Sets software flow control. "
        },
        {
            "Parameters": " **in** ",
            "Info": " **out** "
        },
        {
            "Parameters": " **hardware** ",
            "Info": " Sets hardware flow control. For information about setting up the EIA/TIA-232 line, see the manual that was shipped with your product. "
        }
    ],
    "Examples": [
        [
            "In the following example, incoming software flow control is set for the current session:",
            "```",
            "Router# terminal flowcontrol software in",
            "```"
        ]
    ],
    "ExtraInfo": "Flow control enables you to regulate the rate at which data can be transmitted from one point so that it is equal to the rate at which it can be received at another point. Flow control protects against loss of data because the terminal is not capable of receiving data at the rate it is being sent. You can set up data flow control for the current terminal line in one of two ways: software flow control, which you do with control key sequences, and hardware flow control, which you do at the device level.For software flow control, the default stop and start characters are Ctrl-S and Ctrl-Q (XOFF and XON). You can change them with the **terminal stop-character** and **terminal start-character** EXEC commands.",
    "RelatedCmds": [
        {
            "cmd": " **flowcontrol** ",
            "description": " Sets the method of data flow control between the terminal or other serial device and the router. "
        }
    ]
}