{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "tftp-server",
    "FuncDef": [
        "To configure a router or a Flash memory device on the router as a TFTP server, use one of the following **tftp-server** commands in global configuration mode. This command replaces the **tftp-server****system** command. To remove a previously defined filename, use the **no**form of this command with the appropriate filename. "
    ],
    "CLIs": [
        "tftp-server flash [ <partition-number>: ] <filename1> [ alias <filename2> ] [ <access-list-number> ]",
        "tftp-server rom alias <filename1> [ <access-list-number> ]",
        "no tftp-server { flash [ <partition-number>: ] <filename1> | rom alias <filename2> }",
        "<><><>Cisco<><><> <><><>1600<><><> <><><>Series<><><> <><><>and<><><> <><><>Cisco<><><> <><><>3600<><><> <><><>Series<><><> <><><>Routers<><><>",
        "tftp-server flash [ <device>: ] [ <partition-number>: ] <filename>",
        "no tftp-server flash [ <device>: ] [ <partition-number>: ] <filename>",
        "<><><>Cisco<><><> <><><>7000<><><> <><><>Family<><><> <><><>Routers<><><>",
        "tftp-server flash <device>:<filename>",
        "no tftp-server flash <device>:<filename>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **flash** ",
            "Info": " Specifies TFTP service of a file in Flash memory. "
        },
        {
            "Parameters": " **rom** ",
            "Info": " Specifies TFTP service of a file in ROM. "
        },
        {
            "Parameters": " *filename1* ",
            "Info": " Name of a file in Flash or in ROM that the TFTP server uses in answering TFTP Read Requests. "
        },
        {
            "Parameters": " **alias** ",
            "Info": " Specifies an alternate name for the file that the TFTP server uses in answering TFTP Read Requests. "
        },
        {
            "Parameters": " *filename2* ",
            "Info": " Alternate name of the file that the TFTP server uses in answering TFTP Read Requests. A client of the TFTP server can use this alternate name in its Read Requests. "
        },
        {
            "Parameters": " *access-list-number* ",
            "Info": " (Optional) Basic IP access list number. Valid values are from 0 to 99. "
        },
        {
            "Parameters": " *partition-number*: ",
            "Info": " (Optional) Specifies TFTP service of a file in the specified partition of Flash memory. If the partition number is not specified, the file in the first partition is used.  For the Cisco 1600 series and Cisco 3600 series routers, you must enter a colon after the partition number if a filename follows it. "
        },
        {
            "Parameters": " *device*: ",
            "Info": " (Optional) Specifies TFTP service of a file on a Flash memory device in the Cisco 1600 series, Cisco 3600 series, and Cisco 7000 family routers. The colon is required. Valid devices are as follows:  •**flash**—Internal Flash memory on the Cisco 1600 series and Cisco 3600 series routers. This is the only valid device for the Cisco 1600 series routers.  •**bootflash**—Internal Flash memory in the Cisco 7000 family routers.  •**slot0**—First PCMCIA slot on the Cisco 3600 series and Cisco 7000 family routers.  •**slot1**—Second PCMCIA slot on the Cisco 3600 series and Cisco 7000 family.  •**slavebootflash**—Internal Flash memory on the slave RSP card of a Cisco 7507 or Cisco 7513 router configured for HSA.  •**slaveslot0**—First PCMCIA slot of the slave RSP card on a Cisco 7507 or Cisco 7513 router configured for HSA.  •**slaveslot1**—Second PCMCIA slot of the slave RSP card on a Cisco 7507 or Cisco 7513 router configured for HSA. "
        },
        {
            "Parameters": " *filename* ",
            "Info": " Name of the file on a Flash memory device that the TFTP server uses in answering a TFTP Read Request. Use this argument only with the Cisco 1600 series, Cisco 3600 series, Cisco 7000 series, or Cisco 7500 series routers. "
        }
    ],
    "Examples": [
        [
            "In the following example, the system uses TFTP to send a copy of the <version-10.3> file located in Flash memory in response to a TFTP Read Request for that file. The requesting host is checked against access list 22.",
            "```",
            "tftp-server flash version-10.3 22",
            "```",
            "```",
            "```",
            "In the following example, the system uses TFTP to send a copy of the ROM image <gs3-k.101> in response to a TFTP Read Request for the gs3-k.101 file:",
            "```",
            "tftp-server rom alias gs3-k.101",
            "```",
            "```",
            "```",
            "In the following example, the system uses TFTP to send a copy of the <version-11.0> filein response to a TFTP Read Request for that file. The file is located on the Flash memory card inserted in slot 0.",
            "```",
            "tftp-server flash slot0:version-11.0",
            "```",
            "```",
            "```",
            "The following example enables a Cisco 3600 series router to operate as a TFTP server. The source file c3640-i-mz is in the second partition of internal Flash memory.",
            "```",
            "Router# configure terminal",
            "```",
            "```",
            "```",
            "```",
            "Enter configuration commands, one per line. End with CNTL/Z.",
            "```",
            "```",
            "router(config)# tftp-server flash flash:2:dirt/gate/c3640-i-mz",
            "```",
            "```",
            "```",
            "In the following example, the source file is in the second partition of the Flash memory PC card in slot 0 on a Cisco 3600 series:",
            "```",
            "Router# configure terminal",
            "```",
            "```",
            "```",
            "```",
            "Enter configuration commands, one per line. End with CNTL/Z.",
            "```",
            "```",
            "Router(config)# tftp-server flash slot0:2:dirt/gate/c3640-j-mz",
            "```",
            "```",
            "```",
            "The following example enables a Cisco 1600 series router to operate as a TFTP server. The source file c1600-i-mz is in the second partition of Flash memory:",
            "```",
            "router# configure terminal",
            "```",
            "```",
            "```",
            "```",
            "Enter configuration commands, one per line. End with CNTL/Z.",
            "```",
            "```",
            "router(config)# tftp-server flash flash:2:dirt/gate/c1600-i-mz",
            "```"
        ]
    ],
    "ExtraInfo": "You can specify multiple filenames by repeating the **tftp-server**command. The system sends a copy of the system image contained in ROM or one of the system images contained in Flash memory to any client that issues a TFTP Read Request with this filename.If the specified *filename1* or *filename2* argument exists in Flash memory, a copy of the Flash image is sent. On systems that contain a complete image in ROM, the system sends the ROM image if the specified *filename1* or *filename2* argument is not found in Flash memory.Images that run from ROM cannot be loaded over the network. Therefore, it does not make sense to use TFTP to offer the ROMs on these images.On the Cisco 7000 family routers, the system sends a copy of the file contained on one of the Flash memory devices to any client that issues a TFTP Read Request with its filename.",
    "RelatedCmds": [
        {
            "cmd": " **access-list** ",
            "description": " Creates an extended access list. "
        }
    ]
}