{
    "PageTitle": "display traffic-policy pre-state",
    "FuncDef": "The display traffic-policy pre-state command displays information about resources occupied by the traffic policy to be applied, based on which you can determine whether the traffic policy can be successfully applied after the configuration is committed. The display traffic-policy pre-state command displays information about resources occupied by the traffic policy to be applied, based on which you can determine whether the traffic policy can be successfully applied after the configuration is committed.",
    "CLIs": [
        "display traffic-policy pre-state { global [ slot <slot-id> ] | interface { <interface-type> <interface-number> | <interface-name> } | vlan <vlan-id> | qosgroup <qos-group-name> | vpn-instance <vpn-instance-name> } <traffic-policy-name> { inbound | outbound }",
        "display traffic-policy pre-state bridge-domain <bd-id> <traffic-policy-name> { inbound | outbound }",
        "display traffic-policy pre-state { global [ slot <slot-id> ] | interface { <interface-type> <interface-number> | <interface-name> } | vlan <vlan-id> | qosgroup <qos-group-name> | vpn-instance <vpn-instance-name> } <traffic-policy-name> { inbound }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "global",
            "Info": "Displays information about resources occupied by a traffic policy to be applied in the system view.\n-"
        },
        {
            "Parameters": "slot <slot-id>",
            "Info": "Displays information about resources occupied by a traffic policy to be applied in a specified slot.\nThe value is an integer or a character string. You can enter a question mark (?) and select a value from the displayed value range."
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Displays information about resources occupied by a traffic policy to be applied on a specific interface.\ninterface-type specifies the interface type.interface-number specifies the interface number.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Displays information about resources occupied by a traffic policy to be applied on a specified interface.\n-"
        },
        {
            "Parameters": "vlan <vlan-id>",
            "Info": "Displays information about resources occupied by a traffic policy to be applied in a specific VLAN.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer that ranges from 1 to 1023."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "The traffic policy is applied under the specified vpn-instance.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "<traffic-policy-name>",
            "Info": "Specifies the name of a traffic policy to be applied.\nThe value is a string of 1 to 31 case-sensitive characters, starting with a letter or digit. It cannot contain spaces or question marks (?)."
        },
        {
            "Parameters": "inbound",
            "Info": "Displays information about resources occupied by a traffic policy to be applied in the inbound direction.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Displays information about resources occupied by a traffic policy to be applied in the outbound direction.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "bridge-domain <bd-id>",
            "Info": "Displays information about resources occupied by a traffic policy to be applied in a specific broadcast domain.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer ranging from 1 to 16777215."
        },
        {
            "Parameters": "qosgroup <qos-group-name>",
            "Info": "The traffic policy is applied under the specified qos group.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display traffic-policy pre-state interface 100GE1/0/1 test inbound"
        ]
    ],
    "ExtraInfo": "Before applying a traffic policy, you can run the display traffic-policy pre-state command to check information about resources occupied by the traffic policy to be applied. Then you can determine whether the traffic policy can be successfully applied after the configuration is committed."
}