{
    "PageTitle": "display traffic-policy applied-record",
    "FuncDef": "The display traffic-policy applied-record command displays traffic policy application records. The display traffic-policy applied-record command displays traffic policy application records.",
    "CLIs": [
        "display traffic-policy applied-record [ <policy-name> ] [ global [ slot <slot-id> ] | interface { <interface-type> <interface-number> | <interface-name> } | vlan <vlan-id> | qosgroup <group-name> | vpn-instance <vpn-instance-name> | bridge-domain <bd-id> ] [ inbound | outbound ]",
        "display traffic-policy applied-record [ <policy-name> ] [ global [ slot <slot-id> ] | interface { <interface-type> <interface-number> | <interface-name> } | vlan <vlan-id> | qosgroup <group-name> | vpn-instance <vpn-instance-name> ] [ inbound | outbound ]",
        "display traffic-policy applied-record [ <policy-name> ] [ global [ slot <slot-id> ] | interface { <interface-type> <interface-number> | <interface-name> } | vlan <vlan-id> | qosgroup <group-name> | vpn-instance <vpn-instance-name> ] [ inbound ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<policy-name>",
            "Info": "Specifies a traffic policy name.\nThe value is a string of 1 to 31  case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "global",
            "Info": "Displays the record of a traffic policy that has been applied globally.\n-"
        },
        {
            "Parameters": "slot <slot-id>",
            "Info": "Specifies a slot ID.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Displays the record of a traffic policy that has been applied to an interface.\ninterface-type specifies the interface type.interface-number specifies the interface number.\n-\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Displays the application record of a traffic policy on a specified interface.\n-"
        },
        {
            "Parameters": "vlan <vlan-id>",
            "Info": "Displays the record of a traffic policy that has been applied in a VLAN.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer that ranges from 1 to 1023."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Displays the record of a traffic policy that has been applied in a VPN.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. The character string can contain spaces if it is enclosed with double quotation marks (\"\")."
        },
        {
            "Parameters": "inbound",
            "Info": "Displays the record of a traffic policy that has been applied in the inbound direction.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Displays the record of a traffic policy that has been applied in the outbound direction.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "group <group-name>",
            "Info": "Displays the record of a traffic policy that has been applied in a QoS group.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "bridge-domain <bd-id>",
            "Info": "Displays the record of a traffic policy that has been applied in a BD.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer ranging from 1 to 16777215."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display traffic-policy applied-record"
        ]
    ],
    "ExtraInfo": ""
}