{
    "PageTitle": "if-match l2-protocol",
    "FuncDef": "The if-match l2-protocol command configures a matching rule based on the Layer 2 protocol type in a traffic classifier.\nThe undo if-match l2-protocol command deletes a matching rule based on the Layer 2 protocol type in a traffic classifier. The if-match l2-protocol command configures a matching rule based on the Layer 2 protocol type in a traffic classifier. The undo if-match l2-protocol command deletes a matching rule based on the Layer 2 protocol type in a traffic classifier. By default, a matching rule based on the Layer 2 protocol type is not configured in a traffic classifier.",
    "CLIs": [
        "if-match l2-protocol { arp | ip | rarp | <protocol-value> }",
        "undo if-match l2-protocol",
        "undo if-match l2-protocol { arp | ip | rarp | <protocol-value> }"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "arp",
            "Info": "Indicates that ARP packets are classified.\nThe value of arp corresponds to 0x0806."
        },
        {
            "Parameters": "ip",
            "Info": "Indicates that IP packets are classified.\nThe value of ip corresponds to 0x0800."
        },
        {
            "Parameters": "rarp",
            "Info": "Indicates that RARP packets are classified.\nThe value of rarp corresponds to 0x8035."
        },
        {
            "Parameters": "<protocol-value>",
            "Info": "Specifies the value of a protocol type.\nThe value ranges from 0x0 to 0xFFFF in hexadecimal notation and must start with 0x. If the value of protocol-value is smaller than 0x0600, the Destination Service Access Point (DSAP) and Source Service Access Point (SSAP) fields in the Logical Line Control (LLC) protocol packets are matched."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier c1",
            "[*HUAWEI-classifier-c1] if-match l2-protocol arp"
        ]
    ],
    "ExtraInfo": "You can run the if-match l2-protocol command to classify packets based on the Layer 2 protocol type so that the device processes packets matching the same traffic classifier in the same manner."
}