{
    "PageTitle": "if-match inbound-interface",
    "FuncDef": "The if-match inbound-interface command configures a matching rule based on an inbound interface in a traffic classifier.\nThe undo if-match inbound-interface command deletes a matching rule based on an inbound interface in a traffic classifier. The if-match inbound-interface command configures a matching rule based on an inbound interface in a traffic classifier. The undo if-match inbound-interface command deletes a matching rule based on an inbound interface in a traffic classifier. By default, a matching rule based on an inbound interface is not configured in a traffic classifier.",
    "CLIs": [
        "if-match inbound-interface { { <interface-type> <interface-number1> | <interface-name1> } [ to { <interface-type> <interface-number2> | <interface-name2> } ] } &<1-8>",
        "undo if-match inbound-interface"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "<interface-number1>",
            "Info": "The interface-number1 specifies the number of the first interface.\n-"
        },
        {
            "Parameters": "<interface-name1>",
            "Info": "interface-name1 specifies the name of the first interface.\n-"
        },
        {
            "Parameters": "to",
            "Info": "If to interface-type interface-number2 is not specified, only the interface specified by interface-number1 is used.\n-"
        },
        {
            "Parameters": "<interface-number2>",
            "Info": "The interface-number2 specifies the number of the last interface. interface-number2 and interface-number1 identify a range of interfaces. If interface-number1 and interface-number2 are specified, multiple inbound interfaces can be matched.\n-"
        },
        {
            "Parameters": "<interface-name2>",
            "Info": "interface-name2 specifies the name of the last interface. interface-name2 and interface-name1 specify an interface range, indicating that multiple inbound interfaces are matched.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier class1",
            "[*HUAWEI-classifier-class1] if-match inbound-interface 100GE 1/0/1"
        ]
    ],
    "ExtraInfo": "You can run the if-match inbound-interface command to classify traffic based on an inbound interface so that the device processes packets matching the same traffic classifier in the same manner."
}