{
    "PageTitle": "if-match destination-mac",
    "FuncDef": "The if-match destination-mac command configures a matching rule based on the destination MAC address in a traffic classifier.\nThe undo if-match destination-mac command deletes a matching rule based on the destination MAC address in a traffic classifier. The if-match destination-mac command configures a matching rule based on the destination MAC address in a traffic classifier. The undo if-match destination-mac command deletes a matching rule based on the destination MAC address in a traffic classifier. By default, a matching rule based on the destination MAC address is not configured in a traffic classifier.",
    "CLIs": [
        "if-match destination-mac <mac-address> [ <mac-address-mask> ]",
        "undo if-match destination-mac"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "<mac-address>",
            "Info": "Specifies the destination MAC address.\nThe value is in H-H-H format. An H is a hexadecimal number of 1 to 4 digits."
        },
        {
            "Parameters": "<mac-address-mask>",
            "Info": "Specifies the mask of the destination MAC address. The mask of the MAC address is similar to the mask of the IP address. The value 1 indicates that the bit is matched, and the value 0 indicates that the bit is not matched. The mask can be used to determine a group of MAC addresses. You can use the mask of the MAC address to accurately match certain bits in the destination MAC address. You can set these bits to 1 in the mask of the destination MAC address.\nThe value is in H-H-H format. An H is a hexadecimal number of 1 to 4 digits."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier c1",
            "[*HUAWEI-classifier-c1] if-match destination-mac 00e0-fc12-3456"
        ]
    ],
    "ExtraInfo": "You can run the if-match destination-mac command to configure a matching rule based on the destination MAC address in a traffic classifier so that the device processes packets matching the same traffic classifier in the same manner."
}