{
    "PageTitle": "if-match rocev2",
    "FuncDef": "The if-match rocev2 command configures a matching rule based on RoCEv2 packet information in a traffic classifier.\nThe undo if-match rocev2 command deletes a matching rule based on RoCEv2 packet information in a traffic classifier. The if-match rocev2 command configures a matching rule based on RoCEv2 packet information in a traffic classifier. The undo if-match rocev2 command deletes a matching rule based on RoCEv2 packet information in a traffic classifier. By default, a matching rule based on RoCEv2 packet information is not configured in a traffic classifier. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "if-match rocev2 { opcode <opcode-value> | qpair <qpair-value> | nack <nack-value> | udfbasel4-head { <udf-data> <udf-mask> offset <offset-value> } &<1-4> }",
        "undo if-match rocev2 [ opcode <opcode-value> | qpair <qpair-value> | nack <nack-value> | udfbasel4-head { <udf-data> <udf-mask> offset <offset-value> } &<1-4> ]",
        "if-match ipv6 rocev2 { opcode <opcode-value> | qpair <qpair-value> | nack <nack-value> | udfbasel4-head { <udf-data> <udf-mask> offset <offset-value> } &<1-4> }",
        "undo if-match ipv6 rocev2 [ opcode <opcode-value> | qpair <qpair-value> | nack <nack-value> | udfbasel4-head { <udf-data> <udf-mask> offset <offset-value> } &<1-4> ]"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "opcode <opcode-value>",
            "Info": "Specifies the value of the Opcode field in RoCEv2 packets.\nThe value is an integer that ranges from 0 to 255."
        },
        {
            "Parameters": "qpair <qpair-value>",
            "Info": "Specifies the value of the Qpair field in RoCEv2 packets.\nThe value is an integer ranging from 0 to 16777215."
        },
        {
            "Parameters": "nack <nack-value>",
            "Info": "Specifies the value of the Nack field in RoCEv2 packets.\nThe value is an integer that ranges from 0 to 31."
        },
        {
            "Parameters": "udf",
            "Info": "Matches user-defined fields in RoCEv2 packets.\n-"
        },
        {
            "Parameters": "base",
            "Info": "Specifies the packet header that matches a user-defined rule.\n-"
        },
        {
            "Parameters": "l4-head",
            "Info": "Packet L4-header.\n-"
        },
        {
            "Parameters": "<udf-data>",
            "Info": "Indicates the value of the user-defined packet field.\nThe value is a string of 3 to 10 case-insensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "<udf-mask>",
            "Info": "Indicates the mask of the packet field that is customized by the user.\nThe value is a string of 3 to 10 case-insensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "offset <offset-value>",
            "Info": "Indicates the offset of the packet field that is customized by the user.\nThe value is an integer ranging from 8 to 20."
        },
        {
            "Parameters": "ipv6",
            "Info": "Indicates the IPv6 packets.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier class1",
            "[*HUAWEI-classifier-class1] if-match rocev2 opcode 10"
        ]
    ],
    "ExtraInfo": "You can run the if-match rocev2 command to classify RoCEv2 packets so that the device processes RoCEv2 packets matching the same traffic classifier in the same manner and provides fine-granular services."
}