{
    "PageTitle": "if-match inner-vlan",
    "FuncDef": "The if-match inner-vlan command configures a matching rule based on VLAN IDs in the inner and outer tags of QinQ packets in a traffic classifier. You can specify the VLAN ID range in the inner tag.\nThe undo if-match inner-vlan command deletes a matching rule based on VLAN IDs in the inner and outer tags of QinQ packets in a traffic classifier. The if-match inner-vlan command configures a matching rule based on VLAN IDs in the inner and outer tags of QinQ packets in a traffic classifier. You can specify the VLAN ID range in the inner tag. The undo if-match inner-vlan command deletes a matching rule based on VLAN IDs in the inner and outer tags of QinQ packets in a traffic classifier. By default, a matching rule based on the VLAN ID in the inner and outer tags of QinQ packets is not configured in a traffic classifier. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "if-match inner-vlan <start-inner-vlan-value> [ to <end-inner-vlan-value> ]",
        "undo if-match inner-vlan <start-inner-vlan-value> [ to <end-inner-vlan-value> ]"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "<start-inner-vlan-value>",
            "Info": "Specifies the start VLAN ID in the inner tag of a QinQ packet.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "to <end-inner-vlan-value>",
            "Info": "Specifies the end VLAN ID in the inner tag of a QinQ packet.\nThe value is an integer ranging from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier c1 type and",
            "[*HUAWEI-classifier-c1] if-match inner-vlan 100"
        ]
    ],
    "ExtraInfo": "You can run the if-match inner-vlan command to classify packets based on the VLAN ID in the inner tag of QinQ packets so that the device processes packets matching the same traffic classifier in the same manner."
}