{
    "PageTitle": "if-match vxlan ipv6 acl",
    "FuncDef": "The if-match vxlan ipv6 acl command creates a matching rule based on inner information in VXLAN packets in an IPv6 ACL on the VXLAN network.\nThe undo if-match vxlan ipv6 acl command deletes a matching rule based on an IPv6 ACL that defines inner information in VXLAN packets on the VXLAN network. The if-match vxlan ipv6 acl command creates a matching rule based on inner information in VXLAN packets in an IPv6 ACL on the VXLAN network. The undo if-match vxlan ipv6 acl command deletes a matching rule based on an IPv6 ACL that defines inner information in VXLAN packets on the VXLAN network. By default, a matching rule based on inner information in VXLAN packets in an IPv6 ACL is not configured on the VXLAN network. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "if-match vxlan [ transit ] ipv6acl { <acl-number> | <acl-name> } [ loose-mode | strict-mode ]",
        "undo if-match vxlan [ transit ] ipv6acl { <acl-number> | <acl-name> } [ loose-mode | strict-mode ]",
        "if-match vxlan transit ipv6 acl { <acl-number> | <acl-name> } [ loose-mode | strict-mode ]",
        "undo if-match vxlan transit ipv6 acl { <acl-number> | <acl-name> } [ loose-mode | strict-mode ]"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "transit",
            "Info": "Indicates that VXLAN packets of a transmission device are matched.\nWhen transit is not specified, the traffic policy containing this matching rule takes effect only on the device at the VXLAN tunnel egress.\n-"
        },
        {
            "Parameters": "<acl-number>",
            "Info": "Specifies the number of an IPv6 ACL.\nThe value is an integer ranging from 2000 to 2999 or an integer ranging from 3000 to 3999."
        },
        {
            "Parameters": "<acl-name>",
            "Info": "Specifies a named IPv6 ACL.\nthe name is a string of 1 to 32 characters, which begins with 0-9 or a-z or A-Z, and cannot contain only digits."
        },
        {
            "Parameters": "loose-mode",
            "Info": "Indicates that the loose mode is used to match IPv6 ACLs. In this mode, the leftmost 64 bits of IPv6 addresses are matched.\n-"
        },
        {
            "Parameters": "strict-mode",
            "Info": "Indicates that the strict mode is used to match IPv6 ACLs. In this mode, all the 128 bits of IPv6 addresses are matched.\n-"
        },
        {
            "Parameters": "undo",
            "Info": "Cancels the current configuration.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 2046",
            "[*HUAWEI-acl6-basic-2046] rule permit source any",
            "[*HUAWEI-acl6-basic-2046] quit",
            "[*HUAWEI] traffic classifier c1",
            "[*HUAWEI-classifier-c1] if-match vxlan ipv6 acl 2046"
        ]
    ],
    "ExtraInfo": "The if-match vxlan ipv6 acl command creates a matching rule based on inner information in VXLAN packets in an IPv6 ACL on the VXLAN network. You must first define an IPv6 ACL, configure rules in the IPv6 ACL, and then run the if-match vxlan ipv6 acl command to configure a matching rule based on the IPv6 ACL in a traffic classifier. This ensures that the device processes packets matching the traffic classifier in the same way."
}