{
    "PageTitle": "if-match dscp",
    "FuncDef": "The if-match dscp command configures a matching rule based on the Differentiated Services Code Point (DSCP) priority of packets in a traffic classifier.\nThe undo if-match dscp command deletes a matching rule based on the DSCP priority of packets in a traffic classifier. The if-match dscp command configures a matching rule based on the Differentiated Services Code Point (DSCP) priority of packets in a traffic classifier. The undo if-match dscp command deletes a matching rule based on the DSCP priority of packets in a traffic classifier. By default, a matching rule based on the DSCP priority of packets is not configured in a traffic classifier.",
    "CLIs": [
        "if-match dscp <dscp-value> &<1-8>",
        "undo if-match dscp [ <dscp-value> &<1-8> ]",
        "if-match ipv6 dscp <dscp-value> &<1-8>",
        "undo if-match ipv6 dscp [ <dscp-value> &<1-8> ]"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "dscp <dscp-value>",
            "Info": "Specifies the DSCP priority.\nThe value can be a DiffServ code, an integer ranging from 0 to 63, or the name of the DSCP service type such as af11, af12, af13, af21, af22, af23, af31, af32, af33, af41, af42, af43, cs1-cs7, default, and ef.\nThe values corresponding to service types are as follows:\naf11: 10af12: 12af13: 14af21: 18af22: 20af23: 22af31: 26af32: 28af33: 30af41: 34af42: 36af43: 38cs1: 8cs2: 16cs3: 24cs4: 32cs5: 40cs6: 48cs7: 56default: 0ef: 46"
        },
        {
            "Parameters": "ipv6",
            "Info": "Indicates that IPv6 packets are matched. If this parameter is not specified, IPv4 packets are matched.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier class1",
            "[*HUAWEI-classifier-class1] if-match dscp 1"
        ]
    ],
    "ExtraInfo": "You can run the if-match dscp command to classify packets based on the DSCP priority of packets so that the device processes packets matching the same traffic classifier in the same manner."
}