{
    "PageTitle": "if-match nexthop",
    "FuncDef": "The if-match nexthop command configures a matching rule based on the next hop IP address and outbound interface in a traffic classifier.\nThe undo if-match nexthop command deletes a matching rule based on the next hop IP address and outbound interface in a traffic classifier.\nThe if-match ipv6 nexthop command configures a matching rule based on the next hop ipv6 IP address and outbound interface in a traffic classifier.\nThe undo if-match ipv6 nexthop command deletes a matching rule based on the next hop ipv6 IP address and outbound interface in a traffic classifier. The if-match nexthop command configures a matching rule based on the next hop IP address and outbound interface in a traffic classifier. The undo if-match nexthop command deletes a matching rule based on the next hop IP address and outbound interface in a traffic classifier. The if-match ipv6 nexthop command configures a matching rule based on the next hop ipv6 IP address and outbound interface in a traffic classifier. The undo if-match ipv6 nexthop command deletes a matching rule based on the next hop ipv6 IP address and outbound interface in a traffic classifier. By?default,?a?matching?rule?based?on?the?next?hop?IP?address?and?outbound?interface?is?not?configured?in?a?traffic?classifier. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "if-match { nexthop <ip-address> | ipv6nexthop <ipv6-address> } interface { <interface-type> <interface-number> | <interface-name> }",
        "undo if-match { nexthop <ip-address> | ipv6nexthop <ipv6-address> } interface { <interface-type> <interface-number> | <interface-name> }"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-address>",
            "Info": "Specify the IP nexthop address of the flow.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6",
            "Info": "Specifies the matching rule based on the next hop IPv6 address.\n-"
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specify the IPv6 nexthop address of the flow.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Displays packet statistics on an interface to which a traffic policy has been applied.\ninterface-type specifies the interface type.interface-number specifies the interface number.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Displays packet statistics on a specified interface to which a traffic policy has been applied.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 100",
            "[*HUAWEI] interface Vlanif 100",
            "[*HUAWEI-Vlanif100] q",
            "[*HUAWEI] traffic classifier c1",
            "[*HUAWEI-classifier-c1] if-match nexthop 192.168.1.1 interface Vlanif 100"
        ]
    ],
    "ExtraInfo": "You can run the if-match nexthop command to classify packets based on the next hop IP address and outbound interface so that the device processes packets with the same next hop IP address and outbound interface in the same manner."
}