{
    "PageTitle": "if-match tcp-flag",
    "FuncDef": "The if-match tcp-flag command configures a matching rule based on the TCP Flag in the TCP packet header in a traffic classifier.\nThe undo if-match tcp-flag command deletes a matching rule based on the TCP Flag in the TCP packet header in a traffic classifier. The if-match tcp-flag command configures a matching rule based on the TCP Flag in the TCP packet header in a traffic classifier. The undo if-match tcp-flag command deletes a matching rule based on the TCP Flag in the TCP packet header in a traffic classifier. By default, a matching rule based on the TCP Flag in the TCP packet header is not configured in a traffic classifier.",
    "CLIs": [
        "if-match tcp-flag { <tcp-flag-value> | { ack | fin | psh | rst | syn | urg } }",
        "undo if-match tcp-flag"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "<tcp-flag-value>",
            "Info": "Specifies the value of the TCP flag in the TCP packet header.\nThe value is an integer ranging from 0 to 63."
        },
        {
            "Parameters": "ack",
            "Info": "Indicates that the TCP Flag type in the TCP packet header is ACK.\n-"
        },
        {
            "Parameters": "fin",
            "Info": "Indicates that the TCP flag type in the TCP packet header is FIN.\n-"
        },
        {
            "Parameters": "psh",
            "Info": "Indicates that the TCP Flag type in the TCP packet header is PSH.\n-"
        },
        {
            "Parameters": "rst",
            "Info": "Indicates that the TCP flag type in the TCP packet header is RST.\n-"
        },
        {
            "Parameters": "syn",
            "Info": "Indicates that the TCP Flag type in the TCP packet header is SYN.\n-"
        },
        {
            "Parameters": "urg",
            "Info": "Indicates that the TCP Flag type in the TCP packet header is URG.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier c1",
            "[*HUAWEI-classifier-c1] if-match tcp-flag psh"
        ]
    ],
    "ExtraInfo": "You can run the if-match tcp-flag command to classify packets based on the TCP Flag in the TCP packet header so that the device processes packets matching the same traffic classifier in the same manner."
}