{
    "PageTitle": "if-match vxlan reserved-value",
    "FuncDef": "The if-match vxlan reserved-value command configures a matching rule based on the VXLAN reserved field in a traffic classifier.\nThe undo if-match vxlan reserved-value command deletes a matching rule based on the VXLAN reserved field in a traffic classifier. The if-match vxlan reserved-value command configures a matching rule based on the VXLAN reserved field in a traffic classifier. The undo if-match vxlan reserved-value command deletes a matching rule based on the VXLAN reserved field in a traffic classifier. By default, no matching rule based on the VXLAN reserved field is configured in a traffic classifier. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "if-match vxlan reserved-value <reserved-value>",
        "undo if-match vxlan reserved-value [ <reserved-value> ]",
        "if-match vxlan transit reserved-value <reserved-value>",
        "undo if-match vxlan transit reserved-value [ <reserved-value> ]"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "<reserved-value>",
            "Info": "Specifies the value of the VXLAN reserved field.\nThe value ranges from 0 to ffffff, in hexadecimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier class1",
            "[*HUAWEI-classifier-class1] if-match vxlan reserved-value 0x8847"
        ]
    ],
    "ExtraInfo": "You can run the if-match vxlan reserved-value command to classify packets based on the VXLAN reserved field so that the device processes packets matching the same traffic classifier in the same manner."
}