{
    "PageTitle": "if-match vxlan vni",
    "FuncDef": "The if-match vxlan vni command configures a matching rule based on VNI information in VXLAN packets in a traffic classifier.\nThe undo if-match vxlan vni command deletes a matching rule based on VNI information in VXLAN packets in a traffic classifier. The if-match vxlan vni command configures a matching rule based on VNI information in VXLAN packets in a traffic classifier. The undo if-match vxlan vni command deletes a matching rule based on VNI information in VXLAN packets in a traffic classifier. By default, a matching rule based on the VNI·ID of VXLAN packets is not configured in a traffic classifier. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "if-match vxlan [ transit ] vni <vni-id>",
        "undo if-match vxlan [ transit ] vni <vni-id>",
        "if-match vxlan transit vni <vni-id>",
        "undo if-match vxlan transit vni <vni-id>"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "transit",
            "Info": "Indicates that VXLAN packets of a transmission device are matched.\nWhen transit is not specified, the traffic policy containing this matching rule takes effect only on the device at the VXLAN tunnel egress.\n-"
        },
        {
            "Parameters": "<vni-id>",
            "Info": "Specifies the VNI ID of VXLAN packets.\nThe value is an integer that ranges from 1 to 16777215."
        },
        {
            "Parameters": "undo",
            "Info": "Cancels the current configuration.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier class1",
            "[*HUAWEI-classifier-class1] if-match vxlan vni 10"
        ]
    ],
    "ExtraInfo": "VXLAN is a network virtualization technology that uses MAC-in-UDP encapsulation, and adds a UDP header and a VXLAN header ahead of an Ethernet header in a packet.\nYou can run the if-match vxlan command to classify VXLAN packets based on inner Ethernet packet information so that the device processes packets matching the same traffic classifier in the same manner and provides fine-granular services."
}