{
    "PageTitle": "if-match { unicast | unknown-unicast }",
    "FuncDef": "The if-match unicast command configures a matching rule for Layer 2 known unicast packets in a traffic classifier.\nThe undo if-match unknown-unicast command deletes a matching rule for Layer 2 known unicast packets in a traffic classifier.\nThe if-match unknown-unicast command configures a matching rule for Layer 2 unknown unicast packets in a traffic classifier.\nThe undo if-match unknown-unicast command deletes a matching rule for Layer 2 unknown unicast packets in a traffic classifier. The if-match unicast command configures a matching rule for Layer 2 known unicast packets in a traffic classifier. The undo if-match unknown-unicast command deletes a matching rule for Layer 2 known unicast packets in a traffic classifier. The if-match unknown-unicast command configures a matching rule for Layer 2 unknown unicast packets in a traffic classifier. The undo if-match unknown-unicast command deletes a matching rule for Layer 2 unknown unicast packets in a traffic classifier. By default, a matching rule for Layer 2 known unicast packets is not configured in a traffic classifier. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "if-match { unicast | unknown-unicast }",
        "undo if-match { unicast | unknown-unicast }"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "unicast",
            "Info": "Matches unicast packets.\n-"
        },
        {
            "Parameters": "unknown-unicast",
            "Info": "Specify unknown-unicast packets to match.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier c1",
            "[*HUAWEI-classifier-c1] if-match unicast"
        ]
    ],
    "ExtraInfo": "You can run the if-match { unicast | unknown-unicast } command to configure a matching rule for Layer 2 known or unknown unicast packets so that the device processes Layer 2 known or unknown unicast packets matching the same traffic classifier in the same manner."
}