{
    "PageTitle": "reset traffic-policy statistics",
    "FuncDef": "The reset traffic-policy statistics command clears statistics on packets matching a traffic policy. The reset traffic-policy statistics command clears statistics on packets matching a traffic policy.",
    "CLIs": [
        "reset traffic-policy statistics { global [ slot <slot-id> ] | interface { <interface-type> <interface-number> | <interface-name> } | vlan <vlan-id> | vpn-instance <vpn-instance-name> | qosgroup <group-id> } [ <policy-name> ] [ inbound | outbound ] [ classifier-base <classifier-name> ] [ history ]",
        "reset traffic-policy statistics bridge-domain <bd-id> [ <policy-name> ] [ inbound | outbound ] [ classifier-base <classifier-name> ] [ history ]",
        "reset traffic-policy statistics { global [ slot <slot-id> ] | interface { <interface-type> <interface-number> | <interface-name> } | vlan <vlan-id> | vpn-instance <vpn-instance-name> | qosgroup <group-id> } [ <policy-name> ] [ inbound ] [ classifier-base <classifier-name> ] [ history ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "global",
            "Info": "Clears statistics on packets matching a traffic policy in the system.\n-"
        },
        {
            "Parameters": "slot <slot-id>",
            "Info": "Specifies a slot ID.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Clears statistics on packets matching a traffic policy on a specified interface. If this parameter is not specified, statistics on packets of all interfaces are cleared.\ninterface-type specifies the interface type.interface-number specifies the interface number.\n-\n-\n-\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:-\nFor the CE6885-LL (low latency mode):-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Clears statistics on packets matching a traffic policy applied to a specified interface. If this parameter is not specified, flow-based traffic statistics on all interfaces are cleared.\n-"
        },
        {
            "Parameters": "vlan <vlan-id>",
            "Info": "Clears statistics on packets matching a traffic policy in a specified VLAN.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer that ranges from 1 to 1023."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Clears the record of a traffic policy that has been applied in a specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. The character string can contain spaces if it is enclosed with double quotation marks (\"\")."
        },
        {
            "Parameters": "<policy-name>",
            "Info": "Clears statistics on packets matching a specified traffic policy.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "inbound",
            "Info": "Clears traffic statistics in the inbound direction.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Clears traffic statistics in the outbound direction.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "classifier-base <classifier-name>",
            "Info": "Clears statistics on packets matching a specified traffic classifier.\nThe value is a string of 1 to 31 case-sensitive characters, starting with a letter or digit. It cannot contain spaces."
        },
        {
            "Parameters": "history",
            "Info": "Clears historical packet statistics after a traffic policy is applied.\n-"
        },
        {
            "Parameters": "qosgroup <group-id>",
            "Info": "Clears the record of a traffic policy that has been applied in a specified QoS group.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "bridge-domain <bd-id>",
            "Info": "Clears the record of a traffic policy that has been applied in a BD.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe bd-id value is an integer ranging from 1 to 16777215."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset traffic-policy statistics vlan 10 inbound"
        ],
        [
            "<HUAWEI> reset traffic-policy statistics interface 100GE 1/0/1 inbound history"
        ]
    ],
    "ExtraInfo": "After this command is run, traffic statistics are cleared and cannot be restored.\nTo view traffic statistics, run the display traffic-policy statistics command."
}