{
    "PageTitle": "traffic classifier",
    "FuncDef": "The traffic classifier command creates a traffic classifier and displays the traffic classifier view, or directly displays the view of an existing traffic classifier.\nThe undo traffic classifier command deletes a traffic classifier. The traffic classifier command creates a traffic classifier and displays the traffic classifier view, or directly displays the view of an existing traffic classifier. The undo traffic classifier command deletes a traffic classifier. By default, no traffic classifier is created in the system.",
    "CLIs": [
        "traffic classifier <classifier-name> [ type { and | or } ]",
        "undo traffic classifier <classifier-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<classifier-name>",
            "Info": "Specifies the name of a traffic classifier.\nThe value is a string of 1 to 31 case-sensitive characters without spaces and question marks, and must start with letters or digits."
        },
        {
            "Parameters": "type",
            "Info": "Specifies the relationship between rules in a traffic classifier. If this parameter is not specified, the relationship between rules is OR by default.\n-"
        },
        {
            "Parameters": "and",
            "Info": "Indicates that the relationship between rules is AND.\nAfter this parameter is specified, the following situations occur:?If a traffic classifier contains ACL rules, packets match the traffic classifier only when the packets match one ACL rule and all the non-ACL rules.\n?If a traffic classifier does not contain ACL rules, packets match the traffic classifier only when the packets match all the non-ACL rules.\n-"
        },
        {
            "Parameters": "or",
            "Info": "Indicates that the relationship between rules is OR.\nAfter this parameter is specified, packets match a traffic classifier if the packets match one or more rules.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier c1 type and"
        ]
    ],
    "ExtraInfo": "A traffic classifier classifies traffic of a certain type using matching rules. To provide differentiated services for service flows, bind a traffic classifier and a traffic behavior (see traffic behavior) to a traffic policy and apply the traffic policy."
}