{
    "PageTitle": "traffic-policy (bridge domain view)",
    "FuncDef": "The traffic-policy command applies a traffic policy to a BD.\nThe undo traffic-policy command deletes a traffic policy from a BD. The traffic-policy command applies a traffic policy to a BD. The undo traffic-policy command deletes a traffic policy from a BD. By default, no traffic policy is applied to a BD. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "traffic-policy <policy-name> { inbound | outbound }",
        "undo traffic-policy <policy-name> { inbound | outbound }"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "<policy-name>",
            "Info": "Specifies the name of a traffic policy.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "inbound",
            "Info": "Applies a traffic policy to the inbound direction of a BD.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Applies a traffic policy to the outbound direction of a BD.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier c1",
            "[*HUAWEI-classifier-c1] quit",
            "[*HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] quit",
            "[*HUAWEI] traffic policy p1",
            "[*HUAWEI-trafficpolicy-p1] classifier c1 behavior b1",
            "[*HUAWEI-trafficpolicy-p1] quit",
            "[*HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] traffic-policy p1 inbound"
        ]
    ],
    "ExtraInfo": "Packets are classified based on Layer 2 information, Layer 3 information, or ACLs. To provide differentiated services for service flows, bind a traffic classifier and a traffic behavior to a traffic policy and apply the traffic policy. You can use the traffic-policy command to apply a traffic policy to a BD."
}