{
    "PageTitle": "ip route-static",
    "FuncDef": "The ip route-static command configures an IPv4 unicast static route on the public network.\nThe undo ip route-static command deletes an IPv4 unicast static route from the public network. The ip route-static command configures an IPv4 unicast static route on the public network. The undo ip route-static command deletes an IPv4 unicast static route from the public network. By default, no IPv4 unicast static route is configured on the public network.",
    "CLIs": [
        "ip route-static <ip-address> { <mask> | <mask-length> } <nexthop-address> [ recursive-lookuphost-route [ arp-vlink-only ] ] [ preference <preference> | tag <tag> ] [ [ bfdenable | track { bfd-session <cfg-name> | nqa <admin-name> <test-name> } ] [ inherit-cost ] | permanent ] [ arp-detect { <arp-interface-name> | <arp-interface-type> <arp-interface-number> } ] [ inter-protocol-ecmp ] [ description <text> ]",
        "ip route-static <ip-address> { <mask> | <mask-length> } { <interface-name> | <interface-type> <interface-number> } [ <nexthop-address> ] [ preference <preference> | tag <tag> ] [ bfdenable | track { bfd-session <cfg-name> | nqa <admin-name> <test-name> } | permanent ] [ arp-detect { <arp-interface-name> | <arp-interface-type> <arp-interface-number> } ] [ inter-protocol-ecmp ] [ description <text> ]",
        "undo ip route-static <ip-address> { <mask> | <mask-length> } <nexthop-address> inherit-cost",
        "undo ip route-static <ip-address> { <mask> | <mask-length> } vpn-instance <vpn-instance-name> <nexthop-address> [ inherit-cost ]",
        "undo ip route-static <ip-address> { <mask> | <mask-length> } vpn-instance <vpn-instance-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies a destination IP address.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "<mask>",
            "Info": "Specifies the mask of the IP address.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "<mask-length>",
            "Info": "Specifies a mask length. The 1s in each 32-bit mask must be consecutive. Therefore, a mask in dotted decimal notation can be presented by a mask length.\nThe value is an integer ranging from 0 to 32."
        },
        {
            "Parameters": "<nexthop-address>",
            "Info": "Specifies the next hop IP address of a route.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "recursive-lookup",
            "Info": "Recursive route lookup policy.\n-"
        },
        {
            "Parameters": "host-route",
            "Info": "Recurses the static route to a 32-bit host route.\n-"
        },
        {
            "Parameters": "arp-vlink-only",
            "Info": "Recurses the static route only to an ARP Vlink route.\n-"
        },
        {
            "Parameters": "preference <preference>",
            "Info": "Specifies a priority for static routes.\nThe value is an integer that ranges from 1 to 255. The default value is 60. A smaller value indicates a higher preference."
        },
        {
            "Parameters": "tag <tag>",
            "Info": "Specifies the tag value of a static route. You can configure different tag values to classify static routes and implement different routing management policies.\nThe value is an integer ranging from 1 to 4294967295. The default value is 0."
        },
        {
            "Parameters": "bfd",
            "Info": "Binds a dynamic BFD session to static routes to quickly detect faults.\n-"
        },
        {
            "Parameters": "enable",
            "Info": "Binds a dynamic BFD session to static routes to quickly detect faults.\n-"
        },
        {
            "Parameters": "track",
            "Info": "Specifies a follow object.\n-"
        },
        {
            "Parameters": "bfd-session <cfg-name>",
            "Info": "Associates a static BFD session with the static route to fast detect faults.\nThe undo ip route-static [ track bfd-session ] all command with track bfd-session cfg-name specified dissociates the static route from the current BFD session only without deleting the static route.\nThe value is a string of 1 to 64 case-sensitive characters without spaces."
        },
        {
            "Parameters": "nqa <admin-name>",
            "Info": "Associates the static route with an NQA test instance to fast detect faults so that the system determines whether to activate the static route based on the NQA link detection result to control route advertisement and guide remote traffic.\nCurrently, only ICMP NQA test instances and TCP NQA test instances can be bound to static routes to implement fast fault detection.\nThe value is a string of 1 to 32 case-sensitive characters."
        },
        {
            "Parameters": "<test-name>",
            "Info": "Associates a static route with an NQA test instance to fast detect faults. The system determines whether to activate a static route based on the NQA link detection result to control route advertisement and guide traffic from the remote end.\nCurrently, only ICMP NQA test instances can be associated with static routes to implement fast fault detection.\nThe value is a string of 1 to 32 case-sensitive characters."
        },
        {
            "Parameters": "inherit-cost",
            "Info": "Enables the static route to inherit the cost of recursive routes.\nIf you have specified an outbound interface for a static route, you can no longer specify inherit-cost for the static route.\n-"
        },
        {
            "Parameters": "permanent",
            "Info": "Configures permanent advertisement of the static route.\n-"
        },
        {
            "Parameters": "arp-detect <arp-interface-type>",
            "Info": "Configures the device to learn the ARP entry of the next hop proactively.\nThe parameter is used in the following scenarios:\nARP entries can be learned by the local end or triggered by packet loss during traffic forwarding. Considering that packet loss-triggered ARP entry learning involves packet loss, specify arp-detect interface-type interface-number to configure the device to learn the ARP entry of the next hop proactively.If the arp-vlink-only parameter is configured to enable the device to recurse the static route only to an ARP Vlink route and the peer end has not the local ARP entry, an ARP Vlink route cannot be generated due to the lack of the ARP entry. Consequently, the static route cannot recurse to an ARP Vlink route. As a result, the static route is not Up. If traffic can be imported only after the static route is advertised by another protocol, traffic cannot be imported because the static route cannot be advertised by another protocol. As a result, the ARP entry cannot be learned. To address this problem, specify arp-detect interface-type interface-number to configure the device to learn the ARP entry of the next hop proactively.\n-"
        },
        {
            "Parameters": "<arp-interface-number>",
            "Info": "Specifies an interface number.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "inter-protocol-ecmp",
            "Info": "Enables inter-protocol load balancing among static routes and the routes of dynamic routing protocols.\nIf a static route is the optimal or suboptimal route and the optimal and suboptimal routes share the same priority, the static route and the routes of dynamic routing protocols can participate in inter-protocol load balancing.\nIf inter-protocol load balancing among static routes and the routes of dynamic routing protocols is enabled for any static route in the routing table, the other static routes in the routing table that have the same prefix as that of this static route can also participate in inter-protocol load balancing with the routes of dynamic routing protocols.\nIntra-protocol and inter-process load balancing and inter-protocol load balancing are mutually exclusive. If you configure them both, the former takes effect.\nInter-protocol load balancing does not take effect in the following cases:\nAmong routes imported using the import-rib command and other routes.Among black-hole routes and non-black-hole routes.Among Vlink routes and non-Vlink routes.\n-"
        },
        {
            "Parameters": "description <text>",
            "Info": "Specifies the description of a static route.\nDescription:\nYou can run the display this (system view) and display current-configuration commands to view the description.\nOther command parameters, such as bfd and preference, cannot be configured after the description keyword. The content is only used as the description. For example, if ip route-static 1.1.1.1 255.255.255.255 NULL0 description aa preference 10 is configured, aa preference 10 is used as the description.\nThe value is a string of 1 to 150 characters, spaces supported."
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an interface.\n-\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of an interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance. If the name of a VPN instance is specified, a router searches the routing table of the VPN instance for an outbound interface of the static route based on the next hop IP address specified by the nexthop-address parameter.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces.\nIf the nexthop-address parameter is not specified, that is, the Next-Table function is configured, the device searches the forwarding table of the specified VPN instance for a forwarding path if no forwarding path is found in the public network forwarding table."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip route-static 1.1.1.1 32 10.11.0.1 arp-detect 100GE1/0/1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip route-static 1.1.1.1 32 10.11.0.1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip route-static 0.0.0.0 0.0.0.0 10.2.0.4"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip route-static 1.1.1.1 32 10.11.0.1 inter-protocol-ecmp"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance admin test",
            "[*HUAWEI-nqa-admin-test] test-type icmp",
            "[*HUAWEI-nqa-admin-test] destination-address ipv4 1.1.1.2",
            "[*HUAWEI-nqa-admin-test] frequency 10",
            "[*HUAWEI-nqa-admin-test] start now",
            "[*HUAWEI-nqa-admin-test] quit",
            "[*HUAWEI] ip route-static 1.1.1.1 32 2.2.2.2 track nqa admin test"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip route-static 1.1.1.1 32 10.11.0.1 inherit-cost"
        ]
    ],
    "ExtraInfo": "On a simple network, static routes alone can ensure that the network runs properly. If the Device cannot run dynamic routing protocols to generate routes to the destination, configure static routes on the Device."
}