{
    "PageTitle": "ip route-static (System view)",
    "FuncDef": "The ip route-static command configures an IPv4 unicast static route on the public network. The ip route-static command configures an IPv4 unicast static route on the public network. By default, no IPv4 unicast static route is configured on the public network. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ip route-static <ip-address> { <mask> | <mask-length> } vpn-instance <vpn-instance-name> [ preference <preference> | tag <tag> ] [ description <text> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies a destination IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<mask>",
            "Info": "Specifies a subnet mask of an IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<mask-length>",
            "Info": "Specifies the mask length. A 32-bit mask is represented by consecutive 1s, and the mask in dotted decimal notation can be replaced by the mask length.\nThe value is an integer ranging from 0 to 32."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of the destination VPN instance. If the destination VPN instance is specified and no next hop address is specified, the Next-Table function is configured. In this case, after receiving packets, the device searches the public network forwarding table for a forwarding entry with the destination VPN instance. Then, the device searches the forwarding table of the destination VPN instance for the corresponding forwarding entry.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "preference <preference>",
            "Info": "Specifies a priority for the static route.\nThe value is an integer that ranges from 1 to 255. The default value is 60. A smaller value indicates a higher preference."
        },
        {
            "Parameters": "tag <tag>",
            "Info": "Specifies a tag value for the static route. The tag can be used by a routing policy to import desired static routes.\nThe value is an integer ranging from 1 to 4294967295. The default value is 0."
        },
        {
            "Parameters": "description <text>",
            "Info": "Specifies the description of a static route.\nDescription:\nYou can run the display this (system view) and display current-configuration commands to view the description.\nOther command parameters, such as bfd and preference, cannot be configured after the description keyword. The content is only used as the description. For example, if ip route-static 1.1.1.1 255.255.255.255 NULL0 description aa preference 10 is configured, aa preference 10 is used as the description.\nThe value is a string of 1 to 150 characters, spaces supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip route-static 1.2.3.4 32 vpn-instance vpn1"
        ]
    ],
    "ExtraInfo": "On a simple network, static routes alone can ensure that the network runs properly. If the Device cannot run dynamic routing protocols to generate routes to the destination, configure static routes on the Device."
}