{
    "PageTitle": "ipv6 route-static vpn-instance",
    "FuncDef": "The ipv6 route-static vpn-instance command configures IPv6 static routes for an IPv6 address family-enabled VPN instance.\nThe undo ipv6 route-static vpn-instance command deletes the IPv6 static routes configured for an IPv6 address family-enabled VPN instance. The ipv6 route-static vpn-instance command configures IPv6 static routes for an IPv6 address family-enabled VPN instance. The undo ipv6 route-static vpn-instance command deletes the IPv6 static routes configured for an IPv6 address family-enabled VPN instance. By default, no IPv6 static routes are configured for an IPv6 address family-enabled VPN instance. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 route-static vpn-instance <vpn-source-name> <dest-ipv6-address> <prefix-length> { vpn-instance <vpn-destination-name> <nexthop-ipv6-address> | <nexthop-ipv6-address> [ public ] } [ recursive-lookuphost-route ] [ preference <preference> | tag <tag> ] [ bfdenable | track { bfd-session <cfg-name> | nqa <admin-name> <test-name> } ] [ inter-protocol-ecmp ] [ description <text> ]",
        "ipv6 route-static vpn-instance <vpn-source-name> <dest-ipv6-address> <prefix-length> { vpn-instance <vpn-destination-name> | public } [ preference <preference> | tag <tag> ] [ description <text> ]",
        "undo ipv6 route-static vpn-instance <vpn-source-name> <dest-ipv6-address> <prefix-length> [ { <interface-name> | <interface-type> <interface-number> } [ <nexthop-ipv6-address> ] | vpn-instance <vpn-destination-name> <nexthop-ipv6-address> | <nexthop-ipv6-address> [ public ] ]",
        "undo ipv6 route-static vpn-instance <vpn-source-name> <dest-ipv6-address> <prefix-length> { vpn-instance <vpn-destination-name> | public }",
        "ipv6 route-static vpn-instance <vpn-source-name> <dest-ipv6-address> <prefix-length> { <interface-name> | <interface-type> <interface-number> } [ <nexthop-ipv6-address> ] [ preference <preference> | tag <tag> ] [ bfdenable | track { bfd-session <cfg-name> | nqa <admin-name> <test-name> } ] [ inter-protocol-ecmp ] [ description <text> ]",
        "ipv6 route-static vpn-instance <vpn-source-name> <dest-ipv6-address> <prefix-length> { vpn-instance <vpn-destination-name> <nexthop-ipv6-address> | <nexthop-ipv6-address> [ public ] } [ recursive-lookuphost-route ] [ preference <preference> | tag <tag> ] [ bfdenable | track { bfd-session <cfg-name> | nqa <admin-name> <test-name> } ] inherit-cost [ inter-protocol-ecmp ] [ description <text> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<vpn-source-name>",
            "Info": "Specifies the name of a source VPN instance. Each VPN instance has its own routing table. The configured static routes are added to the routing table of the specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. In addition, the VPN instance name must not be _public_. The character string can contain spaces if it is enclosed in double quotation marks (\"\")."
        },
        {
            "Parameters": "<dest-ipv6-address>",
            "Info": "Specifies a destination IPv6 address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X"
        },
        {
            "Parameters": "<prefix-length>",
            "Info": "Specifies the length of an IPv6 prefix.\nIt is an integer ranging from 0 to 128."
        },
        {
            "Parameters": "vpn-instance <vpn-destination-name>",
            "Info": "Specifies the destination VPN instance. A static route searches the destination VPN instance for an outbound interface based on the configured nexthop-ipv6-address.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. The VPN instance name cannot be _public_. The character string can contain spaces if it is enclosed with double quotation marks (\").\nIf nexthop-ipv6-address is not specified, the next-table function is configured. After receiving a packet, the device searches the forwarding table of the source VPN instance for the destination VPN instance, and then searches the forwarding table of the destination VPN instance for the forwarding path."
        },
        {
            "Parameters": "<nexthop-ipv6-address>",
            "Info": "Specifies the next hop IPv6 address of the device.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X"
        },
        {
            "Parameters": "public",
            "Info": "Indicates the public network address of a gateway. After a certain Device is configured in an IPv6 address family-enabled VPN instance, the next hop or the next hop gateway of the Device belongs to this IPv6 address family-enabled VPN instance and the public network. If the keyword public is specified in the command, the next hop is specified as a public network device.\n-"
        },
        {
            "Parameters": "recursive-lookup",
            "Info": "Recursive route lookup policy.\n-"
        },
        {
            "Parameters": "host-route",
            "Info": "Recurses the static route to a 128-bit host route.\n-"
        },
        {
            "Parameters": "preference <preference>",
            "Info": "Specifies the priority of a route.\nThe value is an integer that ranges from 1 to 255. The default value is 60. A smaller value indicates a higher preference."
        },
        {
            "Parameters": "tag <tag>",
            "Info": "Specifies the tag value of a static route. You can configure different tag values to classify static routes and implement different routing management policies.\nThe value is an integer ranging from 1 to 4294967295. The default value is 0."
        },
        {
            "Parameters": "bfd",
            "Info": "Associates a dynamic BFD session with the static route to fast detect faults.\n-"
        },
        {
            "Parameters": "enable",
            "Info": "Associates a dynamic BFD session with the static route to fast detect faults.\n-"
        },
        {
            "Parameters": "track",
            "Info": "Specify a track object.\n-"
        },
        {
            "Parameters": "bfd-session <cfg-name>",
            "Info": "Associates a static BFD session with the static route to fast detect faults.\nThe undo ip route-static [ track bfd-session ] all command with track bfd-session cfg-name specified dissociates the static route from the current BFD session only without deleting the static route.\nThe value is a string of 1 to 64 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "nqa <admin-name>",
            "Info": "Associates the static route with an NQA test instance to fast detect faults so that the system determines whether to activate the static route based on the NQA link detection result to control route advertisement and guide remote traffic.\nCurrently, only ICMP NQA test instances and TCP NQA test instances can be bound to static routes to implement fast fault detection.\nThe value is a string of 1 to 32 case-sensitive characters."
        },
        {
            "Parameters": "<test-name>",
            "Info": "Associates the static route with an NQA test instance to fast detect faults so that the system determines whether to activate the static route based on the NQA link detection result to control route advertisement and guide remote traffic.\nCurrently, only ICMP NQA test instances and TCP NQA test instances can be bound to static routes to implement fast fault detection.\nThe value is a string of 1 to 32 case-sensitive characters."
        },
        {
            "Parameters": "inter-protocol-ecmp",
            "Info": "If a static route is the optimal or suboptimal route and the optimal and suboptimal routes share the same priority, the static route and the routes of dynamic routing protocols can participate in inter-protocol load balancing.\nIf inter-protocol load balancing among static routes and the routes of dynamic routing protocols is enabled for any static route in the routing table, the other static routes in the routing table that have the same prefix as that of this static route can also participate in inter-protocol load balancing with the routes of dynamic routing protocols.\nIntra-protocol and inter-process load balancing and inter-protocol load balancing are mutually exclusive. If you configure them both, the former takes effect.\nInter-protocol load balancing does not take effect in the following cases:\nAmong routes imported using the import-rib command and other routes.Among black-hole routes and non-black-hole routes.Among Vlink routes and non-Vlink routes.\n-"
        },
        {
            "Parameters": "description <text>",
            "Info": "Specifies a description of a static route.\nYou can run the display this (system view) and display current-configuration commands to view the description.\nOther command parameters, such as bfd and preference, cannot be configured after the description keyword. The content is only used as the description. For example, if ipv6 route-static 2001:db8:1::1 128 NULL0 description aa preference 10 is configured, aa preference 10 is used as the description.\nThe value is a string of 1 to 150 characters, spaces supported."
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of an interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "inherit-cost",
            "Info": "Enables a static route to inherit the cost of recursive routes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] quit",
            "[~HUAWEI] ip vpn-instance vpn2",
            "[*HUAWEI-vpn-instance-vpn2] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn2-af-ipv6] quit",
            "[*HUAWEI] ipv6 route-static vpn-instance vpn1 :: 0 vpn-instance vpn2 2001:db8:1::2 inter-protocol-ecmp"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] quit",
            "[*HUAWEI] ipv6 route-static vpn-instance vpn1 :: 0 2001:db8:1::1"
        ]
    ],
    "ExtraInfo": "To configure static routes for a simple IPv6 VPN, run the ipv6 route-static vpn-instance command.\nIf the destination address and mask of a static route are all 0s, the static route is a default route."
}