{
    "PageTitle": "ipv6 route-static default-bfd",
    "FuncDef": "The ipv6 route-static default-bfd command configures global default BFD parameters for IPv6 static routes.\nThe undo ipv6 route-static default-bfd command cancels the global default BFD parameters configured for IPv6 static routes. The ipv6 route-static default-bfd command configures global default BFD parameters for IPv6 static routes. The undo ipv6 route-static default-bfd command cancels the global default BFD parameters configured for IPv6 static routes. By default, the minimum interval at which BFD control packets are received and sent is 1000 ms, and the detection time multiplier is 3. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 route-static default-bfd { min-rx-interval <min-rx-interval> | min-tx-interval <min-tx-interval> | detect-multiplier <multiplier> }",
        "undo ipv6 route-static default-bfd"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "min-rx-interval <min-rx-interval>",
            "Info": "Specifies the minimum interval at which BFD control packets are received.\nThe value is an integer ranging from 3 to 1000, in milliseconds."
        },
        {
            "Parameters": "min-tx-interval <min-tx-interval>",
            "Info": "Specifies the minimum interval at which BFD control packets are sent.\nThe value is an integer ranging from 3 to 1000, in milliseconds."
        },
        {
            "Parameters": "detect-multiplier <multiplier>",
            "Info": "Specifies the detection time multiplier.\nThe value is an integer ranging from 3 to 50."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 route-static default-bfd min-rx-interval 300"
        ]
    ],
    "ExtraInfo": "To configure global default BFD parameters for IPv6 static routes, run the ipv6 route-static default-bfd command."
}