{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "ip bootp server",
    "FuncDef": [
        "To enable the Bootstrap Protocol (BOOTP) service on your routing device, use the **ip bootp server** command in global configuration mode. To disable BOOTP services, use the **no** form of the command. "
    ],
    "CLIs": [
        "ip bootp server",
        "no ip bootp server"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "In the following example, BOOTP and DHCP services are disabled on the router:",
            "```",
            "Router(config)# no ip bootp server",
            "```",
            "```",
            "Router(config)# no service dhcp",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "By default, the BOOTP service is enabled. When disabled, the **no ip bootp server** command will appear in the configuration file.The integrated Dynamic Host Configuration Protocol (DHCP) server was introduced in Cisco IOS Release 12.0(1)T. Because DHCP is based on BOOTP, both of these services share the \"well-known\" UDP server port of 67 (per RFC 951, RFC 1534, and RFC 2131; the client port is 68). To disable DHCP services (DHCP relay and DHCP server), use the **no service dhcp** command. To disable BOOTP services (in releases 12.2(8)T and later), but leave DHCP services enabled, use the **ip dhcp bootp ignore** command.If both the BOOTP server and DHCP server are disabled, \"ICMP port unreachable\" messages will be sent in response to incoming requests on port 67, and the original incoming packet will be discarded. If DHCP is enabled, using the **no ip bootp server** command by itself will not stop the router from listening on UDP port 67.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)As with all minor services, the async line BOOTP service should be disabled on your system if you do not have a need for it in your network.     Any network device that has User Data Protocol (UDP), TCP, BOOTP, DHCP, or Finger services should be protected by a firewall or have the services disabled to protect against Denial of Service attacks.---",
    "RelatedCmds": [
        {
            "cmd": " **ip dhcp bootp ignore** ",
            "description": " Configures the Cisco IOS DHCP server to selectively ignore and not reply to received Bootstrap Protocol (BOOTP) request packets, allowing you continue using DHCP while disabling BOOTP. "
        },
        {
            "cmd": " **service dhcp** ",
            "description": " Enables the Cisco IOS Dynamic Host Configuration Protocol (DHCP) server and relay agent features. "
        }
    ]
}