{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "ip wccp web-cache accelerated",
    "FuncDef": [
        "To enable the hardware acceleration for WCCP version 1, use the **ip wccp web-cache accelerated** command in global configuration mode. To disable hardware acceleration, use the **no** form of this command. "
    ],
    "CLIs": [
        "ip wccp web-cache accelerated [ [ group-address <groupaddress> ] | [ redirect-list <access-list> ] | [ group-list <access-list> ] | [ password <password> ] ]",
        "no ip wccp web-cache accelerated"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **group-address** *group-address* ",
            "Info": " (Optional) Directs the router to use a specified multicast IP address for communication with the WCCP service group. See the \"Usage Guidelines\" section for additional information. "
        },
        {
            "Parameters": " **redirect-list** *access-list* ",
            "Info": " (Optional) Directs the router to use an access list to control traffic that is redirected to this service group. See the \"Usage Guidelines\" section for additional information. "
        },
        {
            "Parameters": " **group-list** *access-list* ",
            "Info": " (Optional) Directs the router to use an access list to determine which cache engines are allowed to participate in the service group. See the \"Usage Guidelines\" section for additional information. "
        },
        {
            "Parameters": " **password** *password* ",
            "Info": " (Optional) Specifies a string that directs the router to apply MD5 authentication to messages received from the service group specified by the service name given. See the \"Usage Guidelines\" section for additional information. "
        }
    ],
    "Examples": [
        [
            "```",
            "Router(config)# ip wccp web-cache accelerated",
            "```"
        ]
    ],
    "ExtraInfo": "This command is supported on software releases later than cache engine software Release ACNS 4.2.1.The **group-address** *group-address* option requires a multicast address that is used by the router to determine which cache engine should receive redirected messages. This option instructs the router to use the specified multicast IP address to coalesce the \"I See You\" responses for the \"Here I Am\" messages that it has received on this group address. In addition, the response is sent to the group address. The default is for no **group-address** to be configured, so that all \"Here I Am\" messages are responded to with a unicast reply.The **redirect-list** *access-list* option instructs the router to use an access list to control the traffic that is redirected to the cache engines of the service group that is specified by the service-name given. The *access-list* argument specifies either a number from 1 to 99 to represent a standard or extended access-list number, or a name to represent a named standard or extended access list. The access list itself specifies the traffic that is permitted to be redirected. The default is for no **redirect-list** to be configured (all traffic is redirected).The **group-list** *access-list* option instructs the router to use an access list to control the cache engines that are allowed to participate in the specified service group. The *access-list* argument specifies either a number from 1 to 99 to represent a standard access-list number, or a name to represent a named standard access list. The access list specifies which cache engines are permitted to participate in the service group. The default is for no **group-list** to be configured, so that all cache engines may participate in the service group.The password can be up to seven characters. When you designate a password, the messages that are not accepted by the authentication are discarded. The password name is combined with the HMAC MD5 value to create security for the connection between the router and the cache engine.",
    "RelatedCmds": [
        {
            "cmd": " **ip wccp version** ",
            "description": " Specifies which version of WCCP to configure on your router. "
        }
    ]
}