{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "show hosts",
    "FuncDef": [
        "To display the default domain name, the style of name lookup service, a list of name server hosts, and the cached list of hostnames and addresses specific to a particular Domain Name System (DNS) view or for all configured DNS views, use the **show hosts** command in privileged EXEC mode. "
    ],
    "CLIs": [
        "show hosts [ vrf <vrf-name> ] [ view [ <view-name> | default ] [ all ] [ <hostname> | summary ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **vrf** *vrf-name* ",
            "Info": " (Optional) The *vrf-name* argument specifies the name of the Virtual Private Network (VPN) routing and forwarding (VRF) instance associated with the DNS view whose hostname cache entries are to be displayed. Default is the global VRF (that is, the VRF whose name is a NULL string) with the specified or default DNS view.  **Note** More than one DNS view can be associated with a VRF. To uniquely identify a DNS view, specify both the view name and the VRF with which it is associated. "
        },
        {
            "Parameters": " **view** *view-name* ",
            "Info": " (Optional) The *view-name* argument specifies the DNS view whose hostname cache information is to be displayed. Default is the default (unnamed) DNS view associated with the specified or global VRF.  **Note** More than one DNS view can be associated with a VRF. To uniquely identify a DNS view, specify both the view name and the VRF with which it is associated. "
        },
        {
            "Parameters": " **default** ",
            "Info": " (Optional) Displays the default view. "
        },
        {
            "Parameters": " **all** ",
            "Info": " (Optional) Display all the host tables. "
        },
        {
            "Parameters": " *hostname* ",
            "Info": " (Optional) The specified hostname cache information displayed is to be limited to entries for a particular hostname. Default is the hostname cache information for all hostname entries in the cache. "
        },
        {
            "Parameters": " **summary** ",
            "Info": " (Optional) The specified hostname cache information is to be displayed in brief summary format. Disabled by default. "
        }
    ],
    "Examples": [
        [
            "The following is sample output from the show hosts command with no parameters specified:",
            "```",
            "Router# show hosts",
            "```",
            "```",
            "```",
            "```",
            "Default domain is CISCO.COM",
            "```",
            "```",
            "Name/address lookup uses domain service",
            "```",
            "```",
            "Name servers are 192.0.2.220",
            "```",
            "```",
            "Host Flag Age Type Address(es)",
            "```",
            "```",
            "EXAMPLE1.CISCO.COM (temp, OK) 1 IP 192.0.2.10",
            "```",
            "```",
            "EXAMPLE2.CISCO.COM (temp, OK) 8 IP 192.0.2.50",
            "```",
            "```",
            "EXAMPLE3.CISCO.COM (temp, OK) 8 IP 192.0.2.115",
            "```",
            "```",
            "EXAMPLE4.CISCO.COM (temp, EX) 8 IP 192.0.2.111",
            "```",
            "```",
            "EXAMPLE5.CISCO.COM (temp, EX) 0 IP 192.0.2.27",
            "```",
            "```",
            "EXAMPLE6.CISCO.COM (temp, EX) 24 IP 192.0.2.30",
            "```",
            "```",
            "```",
            "The following is sample output from the show hosts command that specifies the VRF vpn101:",
            "```",
            "Router# show hosts vrf vpn101",
            "```",
            "```",
            "```",
            "```",
            "Default domain is example.com",
            "```",
            "```",
            "Domain list: example1.com, example2.com, example3.com",
            "```",
            "```",
            "Name/address lookup uses domain service",
            "```",
            "```",
            "Name servers are 192.0.2.204, 192.0.2.205, 192.0.2.206",
            "```",
            "```",
            "```",
            "```",
            "Codes: UN - unknown, EX - expired, OK - OK, ?? - revalidate",
            "```",
            "```",
            "temp - temporary, perm - permanent",
            "```",
            "```",
            "NA - Not Applicable None - Not defined",
            "```",
            "```",
            "```",
            "```",
            "Host Port Flags Age Type Address(es)",
            "```",
            "```",
            "user None (perm, OK) 0 IP 192.0.2.001",
            "```",
            "```",
            "www.example.com None (perm, OK) 0 IP 192.0.2.111",
            "```",
            "```",
            "192.0.2.112",
            "```",
            "```",
            "```",
            "[ Table 91 ] (#wp1513444) describes the significant fields shown in the display.",
            "Table 91 show hosts Field Descriptions",
            "| Field | Description |",
            "| --- | --- |",
            "| Default domain | Default domain name to be used to complete unqualified names if no domain list is defined. |",
            "| Domain list | List of default domain names to be tried in turn to complete unqualified names. |",
            "| Name/address lookup | Style of name lookup service. |",
            "| Name servers | List of name server hosts. |",
            "| Host | Learned or statically defined hostname. Statically defined hostname-to-address mappings can be added to the DNS hostname cache for a DNS view by using the ip hosts command. |",
            "| Port | TCP port number to connect to when using the defined <hostname> in conjunction with an EXEC connect or Telnet command. |",
            "| Flags | Indicates additional information about the <hostname>-to-IP address mapping. Possible values are as follows: •EX—Entries marked EX are expired. •OK—Entries marked OK are believed to be valid. •perm—A permanent entry is entered by a configuration command and is not timed out. •temp—A temporary entry is entered by a name server; the Cisco IOS software removes the entry after 72 hours of inactivity. •??—Entries marked ?? are considered suspect and subject to revalidation. |",
            "| Age | Number of hours since the software last referred to the cache entry. |",
            "| Type | Type of address. For example, IP, Connectionless Network Service (CLNS), or X.121. If you have used the ip hp-host global configuration command, the show hosts command will display these hostnames as type HP-IP. |",
            "| Address(es) | IP address of the host. One host may have up to eight addresses. |"
        ]
    ],
    "ExtraInfo": "This command displays the default domain name, the style of name lookup service, a list of name server hosts, and the cached list of hostnames and addresses specific to a particular DNS view or for all configured DNS views.If you specify the **show hosts** command without any optional keywords or arguments, only the entries in the global hostname cache will be displayed.If the output from this command extends beyond the bottom of the screen, press the Space bar to continue or press the Q key to terminate command output.",
    "RelatedCmds": [
        {
            "cmd": " **clear host** ",
            "description": " Removes static hostname-to-address mappings from the hostname cache for the specified DNS view or all DNS views. "
        },
        {
            "cmd": " **ip host** ",
            "description": " Defines static hostname-to-address mappings in the DNS hostname cache for a DNS view. "
        }
    ]
}