{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "show running-config partition",
    "FuncDef": [
        "To display the list of commands that make up the current running configuration for a specific part of the system's global running configuration, use the **show running-config partition** command in privileged EXEC mode. "
    ],
    "CLIs": [
        "show running-config partition <part>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *part* ",
            "Info": " The *part* argument will consist of one or more keyword options. These keywords represent a partition of the system's running configuration state, as a major-descriptor and, in some cases, one or more minor-descriptors.  For example, in the command **show running-config partition router eigrp 1**, the major-descriptor for the *part* argument is the **router** keyword, and the minor-descriptors for the *part* argument are the **eigrp 1** keywords.  The actual list of *part* keyword options will depend on your system hardware, what feature set you are running, and what features are currently configured on your system.  Some examples of command *part*keyword options are provided here for reference. Use the **show running-config partition ?** command on your system to view the list of command options available on your system.  •**access-list**—Displays all running configuration commands that make up the access-list configuration partition.  •**boot**—Displays all running configuration commands that make up the boot configuration partition.  •**class-map**—Displays all running configuration commands that make up the class-map configuration partition.  •**global-cdp**—Displays all running configuration commands that make up the global CDP configuration partition.  •**interface** [**type** *slot*/*port*/*number*]—Displays all running configuration commands that make up the interfaces configuration partition or the configuration commands that are applied to the specified interface.  •**line**—Displays all running configuration commands that make up the line command configuration partition.  •**policy-map**—Displays all running configuration commands that make up the policy-map configuration partition.  •**route-map**—Displays all running configuration commands that make up the route-map configuration partition.  •**router** [*protocol*]—Displays all running configuration commands that make up the router configuration partition, or the configuration commands for the specified routing protocol.  •**service**—Displays all running configuration commands that make up the services (small server) configuration partition.  •**snmp**—Displays all running configuration commands that make up the SNMP configuration partition.  •**"
        }
    ],
    "Examples": [
        [
            "In the following example, the system generates a view of the running configuration by polling only the components associated with the access-list parts of the running configuration state, and then displays only those access-list-related configuration commands.",
            "```",
            "Router# show running-config partition access-list",
            "```",
            "```",
            "Building configuration...",
            "```",
            "```",
            "```",
            "```",
            "Current configuration : 127 bytes",
            "```",
            "```",
            "!",
            "```",
            "```",
            "Configuration of Partition access-list",
            "```",
            "```",
            "!",
            "```",
            "```",
            "access-list 90 permit 0.0.0.0 1.2.3.5",
            "```",
            "```",
            "access-list 100 permit 10 any any",
            "```",
            "```",
            "!",
            "```",
            "```",
            "end",
            "```",
            "```",
            "```",
            "In the following example, only the main configuration partition associated with the interface configuration is queried, and only the configuration commands associated with Fast Ethernet interface 0/1 are displayed.",
            "```",
            "Router# show running-config partition interface fastethernet0/1",
            "```",
            "```",
            "Building configuration...",
            "```",
            "```",
            "```",
            "```",
            "Current configuration : 213 bytes",
            "```",
            "```",
            "!",
            "```",
            "```",
            "Configuration of Partition interface FastEthernet0/1",
            "```",
            "```",
            "!",
            "```",
            "```",
            "!",
            "```",
            "```",
            "interface FastEthernet0/1",
            "```",
            "```",
            "ip address 10.4.2.39 255.255.255.0",
            "```",
            "```",
            "no ip route-cache cef",
            "```",
            "```",
            "no ip route-cache",
            "```",
            "```",
            "duplex half",
            "```",
            "```",
            "ipv6 enable",
            "```",
            "```",
            "no cdp enable",
            "```",
            "```",
            "!",
            "```",
            "```",
            "!",
            "```",
            "```",
            "end",
            "```"
        ]
    ],
    "ExtraInfo": "When the Configuration Partitioning feature is enabled, the system groups the configuration state of the device into parts (called \"partitions\") for the purpose of generating the virtual running configuration file (the list of configuration commands). The selective processing of the system's configuration state for the purpose of generating a partial running configuration is called \"configuration partitioning.\"![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)This command is not related to hard drive or flash drive partitioning.---This granular access to configuration information offers important performance benefits for high-end routing platforms with very large configuration files, as the system wide generation of a complete virtual configuration file from all components on systems with large and complex configurations can become overly resource intensive and be unacceptably slow.The **show running-config partition** command allows you to display only the part of the running configuration that you want to examine, while also allowing the system to process only the collection of system components (such as specific interfaces) that you need to display. This is in contrast to other existing extensions to the **show running-config** command, which only filter the generated list after all system components have been processed.The Configuration Partitioning feature is enabled by default in Cisco IOS software images that support the feature. To disable the feature, use the **no parser config partition** command.",
    "RelatedCmds": [
        {
            "cmd": " **copy running-config startup-config** ",
            "description": " Copies the running configuration to the default startup configuration file. "
        },
        {
            "cmd": " **show interfaces** ",
            "description": " Displays statistics for all interfaces configured on the router or access server. "
        },
        {
            "cmd": " **show running-config** ",
            "description": " Generates and displays a virtual configuration file that lists all configuration commands that are in effect on the system. "
        },
        {
            "cmd": " **show startup-config** ",
            "description": " Displays the contents of NVRAM (if present and valid) or displays the configuration file pointed to by the CONFIG_FILE environment variable. (Command alias for the **more:nvram startup-config** command.) "
        }
    ]
}