{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "show logging history",
    "FuncDef": [
        "To display information about the state of the syslog history table, use the **show logging history** command in privileged EXEC mode. "
    ],
    "CLIs": [
        "show logging history"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "The following example shows sample output from the show logginghistorycommand. In this example, notifications of severity level 5 (notifications) through severity level 0 (emergencies) are configured to be written to the logging history table.",
            "```",
            "Router# show logging history",
            "```",
            "```",
            "```",
            "```",
            "Syslog History Table: 1 maximum table entries,",
            "```",
            "```",
            "saving level notifications or higher",
            "```",
            "```",
            "0 messages ignored, 0 dropped, 15 table entries flushed,",
            "```",
            "```",
            "SNMP notifications not enabled",
            "```",
            "```",
            "entry number 16: SYS-5-CONFIG_I",
            "```",
            "```",
            "Configured from console by console",
            "```",
            "```",
            "timestamp: 1110",
            "```",
            "```",
            "Router#",
            "```",
            "[ Table 99 ] (#wp1069133) describes the significant fields shown in the output.",
            "Table 99 show logging history Field Descriptions",
            "| Field | Description |",
            "| --- | --- |",
            "| maximum table entry | Number of messages that can be stored in the history table. Set with the logging history size command. |",
            "| saving level notifications <x> or higher | Level of messages that are stored in the history table and sent to the SNMP server (if SNMP notification is enabled). The severity level can be configured with the logging historycommand. |",
            "| messages ignored | Number of messages not stored in the history table because the severity level is greater than that specified with the logging history command. |",
            "| dropped | Number of messages that could not be processed due to lack of system resources. Dropped messages do not appear in the history table and are not sent to the SNMP server. |",
            "| table entries flushed | Number of messages that have been removed from the history table to make room for newer messages. |",
            "| SNMP notifications | Whether syslog traps of the appropriate level are sent to the SNMP server. The sending of syslog traps are enabled or disabled through thesnmp-server enable traps syslog command. |",
            "| entry number: | Number of the message entry in the history table. In the example above, the message \"SYS-5-CONFIG_IConfigured from console by console\" indicates a syslog message consisting of the facility name (SYS), which indicates where the message came from, the severity level (5) of the message, the message name (CONFIG_I), and the message text. |",
            "| timestamp | Time, based on the up time of the router, that the message was generated. |"
        ]
    ],
    "ExtraInfo": "This command displays information about the syslog history table, such as the table size, the status of messages, and text of messages stored in the table. Messages stored in the table are governed by the **logging history** global configuration command.",
    "RelatedCmds": [
        {
            "cmd": " **clear logging** ",
            "description": " Clears messages from the logging buffer. "
        },
        {
            "cmd": " **logging history** ",
            "description": " Limits syslog messages sent to the router's history table to a specified severity level. "
        },
        {
            "cmd": " **logging history size** ",
            "description": " Changes the number of syslog messages that can be stored in the history table. "
        },
        {
            "cmd": " **logging linecard** ",
            "description": " Logs messages to an internal buffer on a line card. This command limits the logging messages displayed on terminal lines other than the console line to messages with a level at or above level. "
        },
        {
            "cmd": " **snmp-server enable traps** ",
            "description": " The [**no**] **snmp-server enable traps syslog** form of this command controls (enables or disables) the sending of system-logging messages to a network management station. "
        }
    ]
}