{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "show parser statistics",
    "FuncDef": [
        "To displays statistics about the last configuration file parsed and the status of the Parser Cache feature, use the **show parser statistics** command in privileged EXEC mode. "
    ],
    "CLIs": [
        "show parser statistics"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "The following example shows sample output from the show parser statistics command:",
            "```",
            "Router# show parser statistics",
            "```",
            "```",
            "```",
            "```",
            "Last configuration file parsed:Number of Commands:1484, Time:1272 ms",
            "```",
            "```",
            "```",
            "```",
            "Parser cache:disabled, 0 hits, 2 misses",
            "```",
            "```",
            "```",
            "In this example, the Parser Cache feature is disabled, but shows the hit/miss statistics for the two commands issued while the parser cache was last enabled.",
            "[ Table 126 ] (#wp1033933) describes the key output fields.",
            "Table 126 show parser statistics Output Fields",
            "| Last configuration file parsed: | Displays statistics on the last configuration file copied into the running configuration (at startup or using the copy command). |",
            "| --- | --- |",
            "| Number of commands: | The number of command lines in the last configuration file parsed. |",
            "| Time: | Time (in milliseconds) taken for the system to load the last configuration file. |",
            "| Parser cache: | Displays whether the Parser Cache feature is enabled or disabled, and the hit/miss statistics related to the feature. Statistics are stored since the initialization of the system, or since the last time the parser cache was cleared. |",
            "| hits | Number of commands the parser cache was able to parse more efficiently by matching them to similar commands executed previously. |",
            "| misses | Number of commands the parser cache was unable to match to previously executed commands. The performance enhancement provided by the Parser Cache feature cannot be applied to unmatched commands. |",
            "In the following example the show parser statistics command is used to compare the parse-time of a large configuration file with the Parser Cache feature disabled and enabled. In this example, a configuration file with 1484 access list commands is loaded into the running configuration.",
            "```",
            "Router# configure terminal",
            "```",
            "```",
            "!parser cache is disabled",
            "```",
            "```",
            "Router(config)# no parser cache",
            "```",
            "```",
            "!configuration file is loaded into the running configuration",
            "```",
            "```",
            "Router# copy slot0:acl_list running-config",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            "Router# show parser statistics",
            "```",
            "```",
            "Last configuration file parsed:Number of Commands:1484, Time:1272 ms",
            "```",
            "```",
            "```",
            "```",
            "Parser cache:disabled, 0 hits, 2 misses",
            "```",
            "```",
            "```",
            "```",
            "!the parser cache is reenabled",
            "```",
            "```",
            "Router(config)# parser cache",
            "```",
            "```",
            "!configuration file is loaded into the running configuration",
            "```",
            "```",
            "Router# copy slot0:acl_list running-config",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            "Router# show parser statistics",
            "```",
            "```",
            "Last configuration file parsed:Number of Commands:1484, Time:820 ms",
            "```",
            "```",
            "```",
            "```",
            "Parser cache:enabled, 1460 hits, 26 misses",
            "```",
            "```",
            "```",
            "These results show an improvement to the load time for the same configuration file from 1272 milliseconds (ms) to 820 ms when the Parser Cache feature was enabled. As indicated in the \"hits\" field of the show command output, 1460 commands were able to be parsed more efficiently by the parser cache."
        ]
    ],
    "ExtraInfo": "The **show parser statistics** command displays two sets of data:•![](/c/dam/en/us/td/i/templates/blank.gif)The number of commands in the configuration file that was last copied into the running configuration, and the time it took for the system to parse them (a configuration file can be loaded into the running configuration at system startup, or by issuing commands such as the **copy** *source* running-config command).•![](/c/dam/en/us/td/i/templates/blank.gif)The status of the Parser Cache feature (enabled or disabled) and the number of command matches (indicated by hits/misses) since the system was started or since the parser cache was cleared.The Parser Cache feature optimizes the parsing (translation and execution) of Cisco IOS software configuration command lines by remembering how to parse recently encountered command lines, decreasing the time required to process large configuration files.",
    "RelatedCmds": [
        {
            "cmd": " **clear parser cache** ",
            "description": " Clears the parse cache entries and hit/miss statistics stored for the Parser Cache feature. "
        },
        {
            "cmd": " **parser cache** ",
            "description": " Enables or disables the Parser Cache feature. "
        }
    ]
}