{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "show history",
    "FuncDef": [
        "To list the commands you have entered in the current EXEC session, use the **show history**command in EXEC mode. "
    ],
    "CLIs": [
        "show history"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "The following is sample output from the show history command, which lists the commands the user has entered in EXEC mode for this session:",
            "```",
            "Router# show history",
            "```",
            "```",
            "help",
            "```",
            "```",
            "where",
            "```",
            "```",
            "show hosts",
            "```",
            "```",
            "show history",
            "```",
            "```",
            "Router#",
            "```"
        ]
    ],
    "ExtraInfo": "The command history feature provides a record of EXEC commands you have entered. The number of commands that the history buffer will record is determined by the **history** **size** line configuration command or the **terminal history size**EXEC command.[Table 90](#wp1079417) lists the keys and functions you can use to recall commands from the command history buffer.Table 90 History Keys| Key | Function || --- | --- || Ctrl-P or Up Arrow[1](#wp1079427) | Recalls commands in the history buffer in a backward sequence, beginning with the most recent command. Repeat the key sequence to recall successively older commands. || Ctrl-N or Down Arrow1 | Returns to more recent commands in the history buffer after recalling commands with Ctrl-P or the Up Arrow. Repeat the key sequence to recall successively more recent commands. || [1](#wp1079428) The arrow keys function only with ANSI-compatible terminals. || --- |  ",
    "RelatedCmds": [
        {
            "cmd": " **history size** ",
            "description": " Enables the command history function, or changes the command history buffer size for a particular line. "
        },
        {
            "cmd": " **terminal history size** ",
            "description": " Enables the command history feature for the current terminal session, or changes the size of the command history buffer for the current terminal session. "
        }
    ]
}