{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "maximum",
    "FuncDef": [
        "To set the maximum number of archive files of the running configuration to be saved in the Cisco IOS configuration archive, use the **maximum** command in archive configuration mode. To reset this command to its default, use the **no** form of this command. "
    ],
    "CLIs": [
        "maximum <number>",
        "no maximum <number>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *number* ",
            "Info": " Maximum number of archive files of the running configuration to be saved in the Cisco IOS configuration archive. You can archive from 1 to 14 configuration files. The default is 10. "
        }
    ],
    "Examples": [
        [
            "In the following example, a value of 5 is set as the maximum <number> of archive files of the running configuration to be saved in the Cisco IOS configuration archive:",
            "```",
            "configure terminal",
            "```",
            "```",
            "!",
            "```",
            "```",
            "archive",
            "```",
            "```",
            "path disk0:myconfig",
            "```",
            "```",
            "maximum 5",
            "```",
            "```",
            "end",
            "```"
        ]
    ],
    "ExtraInfo": "![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)Before using this command, you must configure the **path** command to specify the location and filename prefix for the files in the Cisco IOS configuration archive.---After the maximum number of files are saved in the Cisco IOS configuration archive, the oldest file is automatically deleted when the next, most recent file is saved.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)This command should only be used when a local writable file system is specified in the *url* argument of the **path** command. Network file systems may not support deletion of previously saved files.---",
    "RelatedCmds": [
        {
            "cmd": " **archive config** ",
            "description": " Saves a copy of the current running configuration to the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **configure confirm** ",
            "description": " Confirms replacement of the current running configuration with a saved Cisco IOS configuration file. "
        },
        {
            "cmd": " **configure replace** ",
            "description": " Replaces the current running configuration with a saved Cisco IOS configuration file. "
        },
        {
            "cmd": " **path** ",
            "description": " Specifies the location and filename prefix for the files in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **show archive** ",
            "description": " Displays information about the files saved in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **time-period** ",
            "description": " Sets the time increment for automatically saving an archive file of the current running configuration in the Cisco IOS configuration archive. "
        }
    ]
}