{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "memory free low-watermark",
    "FuncDef": [
        "To configure a router to issue system logging message notifications when available memory falls below a specified threshold, use the **memory free low-watermark** command in global configuration mode. To disable memory threshold notifications, use the **no** form of this command. "
    ],
    "CLIs": [
        "memory free low-watermark { processor <threshold> | io <threshold> }",
        "no memory free low-watermark"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **processor** *threshold* ",
            "Info": " Sets the processor memory threshold in kilobytes. When available processor memory falls below this threshold, a notification message is triggered. Valid values are 1 to 4294967295. "
        },
        {
            "Parameters": " **io** *threshold* ",
            "Info": " Sets the input/output (I/O) memory threshold in kilobytes. When available I/O memory falls below this threshold, a notification message is triggered. Valid values are 1 to 4294967295. "
        }
    ],
    "Examples": [
        [
            "The following example specifies a free processor memory notification threshold of 20000 KB:",
            "```",
            "Router(config)# memory free low-watermark processor 200000",
            "```",
            "```",
            "```",
            "If available free processor memory falls below this threshold, the router sends a notification message like this one:",
            "```",
            "000029: *Aug 12 22:31:19.559: %SYS-4-FREEMEMLOW: Free Memory has dropped below 20000k",
            "```",
            "```",
            "Pool: Processor Free: 66814056 freemem_lwm: 204800000",
            "```",
            "```",
            "```",
            "Once available free processor memory rises to a point 5 percent above the threshold, another notification message like this is sent:",
            "```",
            "000032: *Aug 12 22:33:29.411: %SYS-5-FREEMEMRECOVER: Free Memory has recovered 20000k",
            "```",
            "```",
            "Pool: Processor Free: 66813960 freemem_lwm: 0",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "Using this command, you can configure a router to issue a system logging message each time available free memory falls below a specified threshold (\"low-watermark\"). Once available free memory rises to 5 percent above the threshold, another notification message is generated.",
    "RelatedCmds": [
        {
            "cmd": " **memory reserve critical** ",
            "description": " Reserves memory for use by critical processes. "
        }
    ]
}