{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "menu clear-screen",
    "FuncDef": [
        "To clear the terminal screen before displaying a menu, use the **menu clear-screen** command in global configuration mode. "
    ],
    "CLIs": [
        "menu <menu-name> clear-screen"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *menu-name* ",
            "Info": " Name of the menu this command should be applied to. "
        }
    ],
    "Examples": [
        [
            "In the following example, the terminal screen is cleared before displaying the menu named Access1:",
            "```",
            "Router(config)# menu Access1 clear-screen",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "This command uses a terminal-independent mechanism based on termcap entries defined in the router and the configured terminal type for the user. This command allows the same menu to be used on multiple types of terminals instead of having terminal-specific strings embedded within menu titles. If the termcap entry does not contain a clear string, the menu system enters 24 new lines, causing all existing text to scroll off the top of the terminal screen.",
    "RelatedCmds": [
        {
            "cmd": " **menu (EXEC)** ",
            "description": " Invokes a user menu. "
        },
        {
            "cmd": " **menu command** ",
            "description": " Specifies underlying commands for user menus. "
        },
        {
            "cmd": " **menu default** ",
            "description": " Specifies the menu item to use as the default. "
        },
        {
            "cmd": " **menu line-mode** ",
            "description": " Requires the user to press Enter after specifying an item. "
        },
        {
            "cmd": " **menu options** ",
            "description": " Sets options for items in user menus. "
        },
        {
            "cmd": " **menu prompt** ",
            "description": " Specifies the prompt for a user menu. "
        },
        {
            "cmd": " **menu single-space** ",
            "description": " Displays menu items single-spaced rather than double-spaced. "
        },
        {
            "cmd": " **menu status-line** ",
            "description": " Displays a line of status information about the current user at the top of a menu "
        },
        {
            "cmd": " **menu text** ",
            "description": " Specifies the text of a menu item in a user menu. "
        },
        {
            "cmd": " **menu title** ",
            "description": " Creates a title, or banner, for a user menu. "
        },
        {
            "cmd": " **no menu** ",
            "description": " Deletes a specified menu from a menu configuration. "
        }
    ]
}