{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "menu command",
    "FuncDef": [
        "To specify underlying commands for user menus, use the **menu** **command** command in global configuration mode. "
    ],
    "CLIs": [
        "menu <menu-name> command <menu-item> { <command> | menu-exit }"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *menu-name* ",
            "Info": " Name of the menu. You can specify a maximum of 20 characters. "
        },
        {
            "Parameters": " *menu-item* ",
            "Info": " Number, character, or string used as the key for the item. The key is displayed to the left of the menu item text. You can specify a maximum of 18 menu entries. When the tenth item is added to the menu, the line-mode and single-space options are activated automatically. "
        },
        {
            "Parameters": " *command* ",
            "Info": " Command to issue when the user selects an item. "
        },
        {
            "Parameters": " **menu-exit** ",
            "Info": " Provides a way for menu users to return to a higher-level menu or exit the menu system. "
        }
    ],
    "Examples": [
        [
            "In the following example, the commands to be issued when the menu user selects option 1, 2, or 3 are specified for the menu named Access1:",
            "```",
            "menu Access1 <command> 1 tn3270 vms.cisco.com",
            "```",
            "```",
            "menu Access1 <command> 2 rlogin unix.cisco.com",
            "```",
            "```",
            "menu Access1 <command> 3 menu-exit",
            "```",
            "```",
            "```",
            "The following example allows a menu user to exit a menu by entering Exit at the menu prompt:",
            "```",
            "menu Access1 text Exit Exit",
            "```",
            "menu Access1 <command> Exit menu-exit"
        ]
    ],
    "ExtraInfo": "Use this command to assign actions to items in a menu. Use the **menu text** global configuration command to assign text to items. These commands must use the same menu name and menu selection key.The **menu command** command has a special keyword for the *command* argument, **menu-exit**, that is available only within menus. It is used to exit a submenu and return to the previous menu level, or to exit the menu altogether and return to the EXEC command prompt.You can create submenus that are opened by selecting entries in another menu. Use the **menu**EXEC command as the *command* for the submenu item.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)If you nest too many levels of menus, the system prints an error message on the terminal and returns to the previous menu level.---When a menu allows connections (their normal use), the command for an entry activating the connection should contain a **resume**command, or the line should be configured to prevent users from escaping their sessions with the **escape-char none**command. Otherwise, when they escape from a connection and return to the menu, there will be no way to resume the session and it will sit idle until the user logs out.Specifying the **resume** command as the action that is performed for a selected menu entry permits a user to resume a named connection or connect using the specified name, if there is no active connection by that name. As an option, you can also supply the connect string needed to connect initially. When you do not supply this connect string, the command uses the specified connection name.You can also use the **resume/next** command, which resumes the next connection in the user's list of connections. This function allows you to create a single menu entry that steps through all of the user's connections.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)A menu should not contain any exit paths that leave users in an unfamiliar interface environment.---When a particular line should always display a menu, that line can be configured with an **autocommand** line configuration command. Menus can be run on a per-user basis by defining a similar **autocommand** command for that local username. For more information about the **autocommand** command, refer to the *Cisco IOS Dial Technologies Configuration Guide*.",
    "RelatedCmds": [
        {
            "cmd": " **autocommand** ",
            "description": " Configures the Cisco IOS software to automatically execute a command when a user connects to a particular line. "
        },
        {
            "cmd": " **menu (EXEC)** ",
            "description": " Invokes a user menu. "
        },
        {
            "cmd": " **menu clear-screen** ",
            "description": " Clears the terminal screen before displaying a menu. "
        },
        {
            "cmd": " **menu default** ",
            "description": " Specifies the menu item to use as the default. "
        },
        {
            "cmd": " **menu line-mode** ",
            "description": " Requires the user to press Enter after specifying an item. "
        },
        {
            "cmd": " **menu options** ",
            "description": " Sets options for items in user menus. "
        },
        {
            "cmd": " **menu prompt** ",
            "description": " Specifies the prompt for a user menu. "
        },
        {
            "cmd": " **menu single-space** ",
            "description": " Displays menu items single-spaced rather than double-spaced. "
        },
        {
            "cmd": " **menu status-line** ",
            "description": " Displays a line of status information about the current user at the top of a menu "
        },
        {
            "cmd": " **menu text** ",
            "description": " Specifies the text of a menu item in a user menu. "
        },
        {
            "cmd": " **menu title** ",
            "description": " Creates a title, or banner, for a user menu. "
        }
    ]
}