{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "microcode (7200)",
    "FuncDef": [
        "To configure a default override for the microcode that is downloaded to the hardware on a Cisco 7200 series router, use the **microcode** command in global configuration mode. To revert to the default microcode for the current running version of the Cisco IOS software, use the no form of this command. "
    ],
    "CLIs": [
        "microcode { ecpa | pcpa } <location>",
        "no microcode { ecpa | pcpa }"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **ecpa** ",
            "Info": " ESCON Channel Port Adapter (CPA) interface. "
        },
        {
            "Parameters": " **pcpa** ",
            "Info": " Parallel CPA interface. "
        },
        {
            "Parameters": " *location* ",
            "Info": " Location of microcode, including the device and filename. "
        }
    ],
    "Examples": [
        [
            "The following example instructs the Cisco IOS software to load the microcode from an individual microcode image that is stored as a file on the Flash card inserted in Flash card slot 0:",
            "```",
            "microcode ecpa slot0:xcpa26-1",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "If there are any default overrides when the configuration is written, then the **microcode reload** command will be written to the configuration automatically. This action enables the configured microcode to be downloaded at system startup.The CPA microcode image is preloaded on Flash memory cards for Cisco 7200-series routers for Cisco IOS Release 11.3(3)T and later releases. You may be required to copy a new image to Flash memory when a new microcode image becomes available.For more information on the CPA configuration and maintenance, refer to the \"Configuring Cisco Mainframe Channel Connection Adapters\" chapter in the Release 12.2 *Cisco IOS Bridging and IBM Networking Configuration Guide*.",
    "RelatedCmds": [
        {
            "cmd": " **microcode reload (7200)** ",
            "description": " Resets and reloads the specified hardware in a Cisco 7200 series router. "
        },
        {
            "cmd": " **show microcode** ",
            "description": " Displays microcode information. "
        }
    ]
}