{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "microcode (7000/7500)",
    "FuncDef": [
        "To specify the location of the microcode that you want to download from Flash memory into the writable control store (WCS) on Cisco 7000 series (including RSP based routers) or Cisco 7500 series routers, use the **microcode** command in global configuration mode. To load the microcode bundled with the system image, use the **no** form of this command. "
    ],
    "CLIs": [
        "microcode <interface-type> { <flash-filesystem>:<filename> [ <slot> ] | rom | system [ <slot> ] }",
        "no microcode <interface-type> { <flash-filesystem>:<filename> [ <slot> ] | rom | system [ <slot> ] }"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *interface-type* ",
            "Info": " One of the following interface processor names: **aip**, **cip**, **eip**, **feip**, **fip**, **fsip**, **hip**, **mip**, **sip**, **sp**, **ssp**, **trip**, **vip**, or **vip2**. "
        },
        {
            "Parameters": " *flash-filesystem*: ",
            "Info": " Flash file system, followed by a colon. Valid file systems are **bootflash**, **slot0**, and **slot1**.  Slave devices such as slaveslot0 are invalid. The slave's file system is not available during microcode reloads. "
        },
        {
            "Parameters": " *filename* ",
            "Info": " Name of the microcode file. "
        },
        {
            "Parameters": " *slot* ",
            "Info": " (Optional) Number of the slot. Range is from 0 to 15. "
        },
        {
            "Parameters": " **rom** ",
            "Info": " If ROM is specified, the router loads from the onboard ROM microcode. "
        },
        {
            "Parameters": " **system** ",
            "Info": " If the **system** keyword is specified, the router loads the microcode from the microcode bundled into the system image you are running for that interface type. "
        }
    ],
    "Examples": [
        [
            "In the following example, all FIP cards will be loaded with the microcode found in Flash memoryfile fip.v141-7 when the system is booted, when a card is inserted or removed, or when the microcode reload global configuration command is issued. The configuration is then written to the startup configuration file.",
            "```",
            "Router(config)# microcode fip slot0:fip.v141-7",
            "```",
            "```",
            "Router(config)# end",
            "```",
            "```",
            "Router# copy system:running-config nvram:startup-config",
            "```"
        ]
    ],
    "ExtraInfo": "If you do not use the **microcode reload** command after using the **microcode** command, the **microcode reload** command will be written to the configuration file automatically.When using Dual RSPs for simple hardware backup, ensure that the master and slave RSP card contain the same microcode image in the same location when the router is to load the interface processor microcode from a Flash file system. Thus, if the slave RSP becomes the master, it will be able to find the microcode image and download it to the interface processor.",
    "RelatedCmds": [
        {
            "cmd": " **more flh:logfile** ",
            "description": " Displays the system console output generated during the Flash load helper operation. "
        }
    ]
}