{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "motd-banner",
    "FuncDef": [
        "To enable the display of message-of-the-day (MOTD) banners on the specified line or lines, use the **motd-banner** command in line configuration mode. To suppress the MOTD banners on the specified line or lines, use the **no** form of this command. "
    ],
    "CLIs": [
        "motd-banner",
        "no motd-banner"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "The following example suppresses the MOTD banner on vty lines 0 through 4:",
            "```",
            "line vty 0 4",
            "```",
            "```",
            "no motd-banner",
            "```"
        ]
    ],
    "ExtraInfo": "This command determines whether the router will display the MOTD banner when an EXEC session is created on the specified line or lines. The MOTD banner is defined with the **banner motd** global configuration command. By default, the MOTD banner is enabled on all lines. Disable the MOTD banner on specific lines using the **no****motd-banner** line configuration command.The MOTD banners can also be disabled by the **no****exec-banner** line configuration command, which disables both MOTD banners and EXEC banners on a line. If the **no****exec-banner** command is configured on a line, the MOTD banner will be disabled regardless of whether the **motd-banner** command is enabled or disabled. [Table 37](#wp1019957) summarizes the effects of the **exec-banner** command and the **motd-banner** command.Table 37 Banners Displayed Based On exec-banner and motd-banner Combinations|  | exec-banner  (default) | no exec-banner || --- | --- | --- || motd-banner  (default) | MOTD banner  EXEC banner | None || no motd-banner | EXEC banner | None |  For reverse Telnet connections, the EXEC banner is never displayed. Instead, the incoming banner is displayed. The MOTD banner is displayed by default, but it is disabled if either the **no****exec-banner** command or **no** **motd-banner** command is configured. [Table 38](#wp1019989) summarizes the effects of the **exec-banner** command and the **motd-banner** command for reverse Telnet connections.Table 38 Banners Displayed Based On exec-banner and motd-banner Combinations   for Reverse Telnet Sessions to Async Lines|  | exec-banner  (default) | no exec-banner || --- | --- | --- || motd-banner  (default) | MOTD banner  Incoming banner | Incoming banner || no motd-banner | Incoming banner | Incoming banner |  ",
    "RelatedCmds": [
        {
            "cmd": " **banner exec** ",
            "description": " Defines and enables a customized banner to be displayed whenever the EXEC process is initiated. "
        },
        {
            "cmd": " **banner incoming** ",
            "description": " Defines and enables a customized message to be displayed when there is an incoming connection to a terminal line from a host on the network. "
        },
        {
            "cmd": " **banner motd** ",
            "description": " Defines and enables a customized message-of-the-day banner. "
        },
        {
            "cmd": " **motd-banner** ",
            "description": " Controls (enables or disables) the display of message-of-the-day banners on a specified line or lines. "
        }
    ]
}