{
    "PageTitle": "commit (All views except the user view)",
    "FuncDef": "The commit command commits a configuration. The commit command commits a configuration.",
    "CLIs": [
        "commit [ trial [ <time> ] [ label <label> ] ] [ persist <persistId> ] [ description <description> ]"
    ],
    "ParentView": [
        "All views except the user view"
    ],
    "ParaDef": [
        {
            "Parameters": "trial <time>",
            "Info": "Specifies the timeout period for the trial running of a configuration.\nThe value is an integer ranging from 60 to 65535, in seconds. The default value is 600 seconds."
        },
        {
            "Parameters": "label <label>",
            "Info": "Specifies a user label for a configuration rollback point.\nThe value is a string of 1 to 256 case-sensitive characters. It can be any visible ASCII character except for the space. However, the string can contain spaces if it is enclosed with double quotation marks (\" \"). The string cannot start with a digit or be a hyphen (-)."
        },
        {
            "Parameters": "persist <persistId>",
            "Info": "Specifies a persistence ID for a configuration trial run.\nThe value is a string of 1 to 256 case-sensitive characters. It can be any visible ASCII characters excluding spaces. If double quotation marks are used around the tag name, spaces are allowed in the tag name."
        },
        {
            "Parameters": "description <description>",
            "Info": "Specifies information about a configuration rollback point.\nThe value is a string of 1 to 60 case-sensitive ASCII characters, spaces supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] sysname ROLLBACK",
            "[*HUAWEI] commit trial 120"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] sysname DeviceA",
            "[*HUAWEI] commit trial persist abcid"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] sysname ROLLBACK",
            "[*HUAWEI] commit description This is a new name",
            "[~ROLLBACK] display configuration commit list verbose"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] sysname HUAWEIA",
            "[*HUAWEI] commit label a123"
        ]
    ],
    "ExtraInfo": "To add a description for the committed configuration to provide guidance and help for subsequent configuration rollback, run the commit description command in two-phase validation mode. You can run the display configuration commit list verbose command to view the generated description.You can use the trial keyword to configure the trial run function. This function enables a trial run of new functions and services on the live network to improve network reliability. The time parameter specifies the timeout period of the trial run. During the trial run, you can run the commit command to make the configuration in trial running state take effect. When the trial run time exceeds the specified timeout period, the system automatically rolls back the configuration in the trial running state and restores the system to the status before the configuration. If you want the configuration in the trial run state to take effect, reconfigure the configuration and commit it. During the trial run, you can run the commit trial command to refresh the trial run time.If you are not sure about the configuration impact or want to observe the configuration effect after the configuration, you are advised to run the commit trial command. After confirming that the configuration has achieved the expected effect, reconfigure and commit the configuration to ensure operation security on the live network.If persistId is specified during the configuration trial run, the persistent trial run does not terminate when the session ends. You can run the commit persist \\ command to confirm the configuration of persistent trial running.In two-phase validation mode, if a user has uncommitted configurations, the configurations are marked with asterisks (*) in the corresponding view. If all configurations have been committed, ~ is displayed in the corresponding view except the user view."
}