{
    "PageTitle": "configuration file auto-save backup-to-server",
    "FuncDef": "The configuration file auto-save backup-to-server server command configures the system to periodically save the configuration file to an IPv4 server.\nThe undo configuration file auto-save backup-to-server server command disables the system from periodically saving the configuration file to an IPv4 server.\nThe configuration file auto-save backup-to-server server ipv6 command configures the system to periodically save the configuration file to an IPv6 server.\nThe undo configuration file auto-save backup-to-server server ipv6 command disables the system from periodically saving the configuration file to an IPv6 server. The configuration file auto-save backup-to-server server command configures the system to periodically save the configuration file to an IPv4 server. The undo configuration file auto-save backup-to-server server command disables the system from periodically saving the configuration file to an IPv4 server. The configuration file auto-save backup-to-server server ipv6 command configures the system to periodically save the configuration file to an IPv6 server. The undo configuration file auto-save backup-to-server server ipv6 command disables the system from periodically saving the configuration file to an IPv6 server. By default, the system does not periodically save configurations to a server.",
    "CLIs": [
        "configuration file auto-save backup-to-server server <server-ip> [ vpn-instance <vpn-instance-name> ] transport-type { tftp | { ftp | sftp } [ port <port-value> ] user <user-name> password <password> } [ path <folder> ]",
        "configuration file auto-save backup-to-server server <server-ip> [ vpn-instance <vpn-instance-name> ] transport-type { sftp [ port <port-value> ] user <user-name> password }",
        "configuration file auto-save backup-to-server server <server-ip> [ vpn-instance <vpn-instance-name> ] path <folder>",
        "configuration file auto-save backup-to-server server ipv6 <server-ip> [ vpn-instance <vpn-instance-name> ] transport-type { tftp | { ftp | sftp } [ port <port-value> ] user <user-name> password <password> } [ path <folder> ]",
        "configuration file auto-save backup-to-server server ipv6 <server-ip> [ vpn-instance <vpn-instance-name> ] path <folder>",
        "configuration file auto-save backup-to-server server ipv6 <server-ip> [ vpn-instance <vpn-instance-name> ] transport-type { sftp [ port <port-value> ] user <user-name> password }",
        "undo configuration file auto-save backup-to-server server [ <server-ip> | <server-ip> vpn-instance <vpn-instance-name> | <server-ip> vpn-instance <vpn-instance-name> port <port-value> ]",
        "undo configuration file auto-save backup-to-server server ipv6 [ <server-ip> | <server-ip> vpn-instance <vpn-instance-name> | <server-ip> vpn-instance <vpn-instance-name> port <port-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. If spaces are used, the string must be enclosed in double quotation marks (\" \")."
        },
        {
            "Parameters": "transport-type",
            "Info": "Indicates the transmission mode.\nThe value can be ftp, tftp, or sftp."
        },
        {
            "Parameters": "tftp",
            "Info": "Specifies the transmission mode is TFTP.\n-"
        },
        {
            "Parameters": "ftp",
            "Info": "Specifies the transmission mode is FTP.\n-"
        },
        {
            "Parameters": "sftp",
            "Info": "Specifies the transmission mode is SFTP.\n-"
        },
        {
            "Parameters": "port <port-value>",
            "Info": "Specifies the port number used to send a configuration file to a server.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "user <user-name>",
            "Info": "Specifies the name of the user that accesses the server using FTP or SFTP.\nThe value is a string of 1 to 64 characters without spaces.\nExcept the question mark (?) and space. However, when quotation marks (\") are used around the password, spaces are allowed in the password."
        },
        {
            "Parameters": "password <password>",
            "Info": "Specifies the password of the user that accesses the server using FTP or SFTP.\nIn the case of a password in plaintext, the value is a string of 1 to 255 case-sensitive characters without spaces. In the case of a ciphertext password, the value is a string of 20 to 432 case-sensitive characters without spaces. A 24-character ciphertext password configured in an earlier version is also supported in this version.\nExcept the question mark (?) and space. However, when quotation marks (\") are used around the password, spaces are allowed in the password."
        },
        {
            "Parameters": "path <folder>",
            "Info": "Specifies the path of the configuration file on the server. If this parameter is not configured, the root path of FTP, SFTP, or TFTP services is used by default.\nThe value is a string of 1 to 64 case-sensitive characters."
        },
        {
            "Parameters": "server <server-ip>",
            "Info": "Specifies the IP address of the server to which the system periodically saves the configuration file.\nThe IP address is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6 <server-ip>",
            "Info": "Specifies the IPv6 address of the server to which the system periodically saves the configuration file.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] configuration file auto-save backup-to-server server 10.1.1.1 transport-type tftp"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] configuration file auto-save backup-to-server server 10.1.1.1 transport-type ftp port 88 user huawei password YsHsjx_202206"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] configuration file auto-save backup-to-server server 10.1.1.1 transport-type ftp port 88 user huawei password YsHsjx_202206 path D:/FTP/TEST"
        ]
    ],
    "ExtraInfo": "To back up the configuration file, you can run this command to specify a server. The configuration file is automatically saved to the specified server, improving database security.The format of the configuration file backed up to the server is the same as that of the configuration file for next startup. If the configuration file for next startup is in .dat format, the generated configuration file is in .dat format. If the configuration file for next startup is in .cfg or .zip format, the generated configuration file is in .zip format. The configuration file backed up to the server is named in the format of date, time, and system name. The names of the configuration files backed up at different time are different and do not overwrite the previous backup files.You can run this command multiple times to configure multiple file servers."
}