{
    "PageTitle": "configuration current backup-to-file",
    "FuncDef": "The configuration current backup-to-file command enables and sets the configuration for periodically backing up the configuration file. If interval and from are not specified, the system uses the default values. The default start time of the periodic backup is 05:00, and the default interval is one day.\nThe undo configuration current backup-to-file command disables the function of periodically backing up the configuration file. The configuration current backup-to-file command enables and sets the configuration for periodically backing up the configuration file. If interval and from are not specified, the system uses the default values. The default start time of the periodic backup is 05:00, and the default interval is one day. The undo configuration current backup-to-file command disables the function of periodically backing up the configuration file. By default, the periodic configuration backup function is enabled.",
    "CLIs": [
        "configuration current backup-to-file [ interval <interval-time> | from <time> ]",
        "undo configuration current backup-to-file"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval <interval-time>",
            "Info": "Interval for periodic backup.\nThe value is an integer ranging from 1 to 7, in days."
        },
        {
            "Parameters": "from <time>",
            "Info": "Start time of periodic backup.\nThe value is time format, ranging from 00:00 to 23:59."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] configuration current backup-to-file interval 2 from 22:00"
        ]
    ],
    "ExtraInfo": "After this function is enabled, if a configuration error occurs, you can use the local backup configuration file to roll back the configuration. The backup configuration file is automatically saved to the $_autobackup directory in the flash memory. The file name contains the time when the configuration file is saved. The default file name extension is .zip."
}