{
    "PageTitle": "configuration file auto-save",
    "FuncDef": "The configuration file auto-save command configures the function of saving system configurations periodically.\nThe undo configuration file auto-save command cancels the function of saving system configurations periodically. The configuration file auto-save command configures the function of saving system configurations periodically. The undo configuration file auto-save command cancels the function of saving system configurations periodically. By default, the system does not enable the function.",
    "CLIs": [
        "configuration file auto-save [ interval <interval> | delay <delay-interval> | cpu-limit <cpu-usage> ]",
        "configuration file auto-save { interval | delay | cpu-limit } default",
        "undo configuration file auto-save"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval <interval>",
            "Info": "Specifies the interval at which configurations are saved automatically.\nThe value is an integer ranging from 30 to 43200, in minutes. The default value is 30."
        },
        {
            "Parameters": "delay <delay-interval>",
            "Info": "Specifies the delay time for backing up a configuration automatically after the configuration is changed.\nThe value is an integer ranging from 1 to 60, in minutes. The default value is 5."
        },
        {
            "Parameters": "cpu-limit <cpu-usage>",
            "Info": "Specifies the maximum CPU usage.\nThe value is an integer ranging from 1 to 100. The default value is 50."
        },
        {
            "Parameters": "default",
            "Info": "Restores the default values for the parameters of the automatic save function.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] configuration file auto-save interval 600 delay 3 cpu-limit 60"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] configuration file auto-save interval 60"
        ]
    ],
    "ExtraInfo": "If the configuration file auto-save command is not run, the system does not enable the auto-save function. After the function of periodically saving configurations is enabled, if the configuration or configuration file changes, the system saves the configuration. Otherwise, the system does not save the configuration. If the system is configured to periodically save the configuration file to the server, the configuration file is also uploaded to the server."
}