{
    "PageTitle": "configuration save-policy interrupt-allowed",
    "FuncDef": "The configuration save-policy interrupt-allowed command enables configuration saving interruption upon configuration committing and triggers the system to automatically save configurations.\nThe undo configuration save-policy interrupt-allowed command disables configuration saving interruption upon configuration committing and triggers the system to automatically save configurations. The configuration save-policy interrupt-allowed command enables configuration saving interruption upon configuration committing and triggers the system to automatically save configurations. The undo configuration save-policy interrupt-allowed command disables configuration saving interruption upon configuration committing and triggers the system to automatically save configurations. By default, configuration committing will interrupt configuration saving, and the system is disabled from automatically saving configurations.",
    "CLIs": [
        "configuration save-policy interrupt-allowed",
        "undo configuration save-policy interrupt-allowed"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] configuration save-policy interrupt-allowed"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo configuration save-policy interrupt-allowed"
        ]
    ],
    "ExtraInfo": "After the configuration save-policy interrupt-allowed command is configured, if a user delivers configurations during configuration saving, configuration saving will be interrupted and fail, and configuration delivery will succeed. The system automatically saves the configurations five minutes later.\nAfter the undo configuration save-policy interrupt-allowed command is configured, if a user delivers configurations during configuration saving, configuration saving will not be affected, and configuration delivery will fail."
}