{
    "PageTitle": "display configuration commit",
    "FuncDef": "The display configuration commit command displays all configurations at a specified configuration rollback point.\nThe display configuration command displays configurations in a specified configuration file. The configuration file must be stored in the root directory of the MPU.\nThe display saved-configuration command displays the configuration file used for startup. The display configuration commit command displays all configurations at a specified configuration rollback point. The display configuration command displays configurations in a specified configuration file. The configuration file must be stored in the root directory of the MPU. The display saved-configuration command displays the configuration file used for startup.",
    "CLIs": [
        "display { saved-configuration [ last ] | configuration <configuration-file> }",
        "display configuration commit at <commit-id>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "saved-configuration",
            "Info": "Displays the setting of the configuration file for the next startup.\n-"
        },
        {
            "Parameters": "last",
            "Info": "Displays the system configurations saved last time.\n-"
        },
        {
            "Parameters": "configuration",
            "Info": "Display parameter information about the configuration of the autosave function.\n-"
        },
        {
            "Parameters": "<configuration-file>",
            "Info": "Specifies the name of a configuration file. The file must have been created.\nThe name is a string of 5 to 64 characters in the format of *.zip, *.cfg or *.dat."
        },
        {
            "Parameters": "at <commit-id>",
            "Info": "Displays configuration changes at a configuration rollback point.\nThe id is a string of 1 to 22 characters and generated by the system automatically."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display configuration vrpcfg.cfg",
            "local-user admin1234 password cipher $1d$k4:o79a_DJ$dkxW!,\\@7Cjr*k+Q}gb'{g{x)#wS1GjQST'EZ]/F$",
            "set authentication password cipher $1d$k4:o79a_DJ$dkxW!,\\@7Cjr*k+Q}gb'{g{x)#wS1GjQST'EZ]/F$"
        ],
        [
            "<HUAWEI> display saved-configuration",
            "local-user admin1234 password cipher $1d$k4:o79a_DJ$dkxW!,\\@7Cjr*k+Q}gb'{g{x)#wS1GjQST'EZ]/F$",
            "set authentication password cipher $1d$k4:o79a_DJ$dkxW!,\\@7Cjr*k+Q}gb'{g{x)#wS1GjQST'EZ]/F$"
        ],
        [
            "<HUAWEI> display configuration commit at 1000000001"
        ]
    ],
    "ExtraInfo": "After a configuration command is successfully committed to the system, the system automatically generates a configuration rollback point to record the configuration change information and the all system configurations at the point. You can run the display configuration commit command to view all configurations at a specified configuration rollback point. If a fault occurs in the system, you can run the rollback configuration command to roll back the system to the configuration before the fault occurs.You can run the save configuration-file command to save the current configuration as a *.cfg, *.zip, or *.dat file. The *.cfg file is a text file and can be viewed by running the more command. The *.zip and *.dat files cannot be viewed by running this command. You can run the display configuration command to view the contents of the preceding three types of configuration files to check whether the configurations are correct.If the device does not work properly after being powered on, you can run the display saved-configuration command to check the startup configuration of the device.The display saved-configuration last command displays the system configuration saved last time.The display saved-configuration time command displays the time when the system automatically saves configurations last time."
}