{
    "PageTitle": "display configuration changes",
    "FuncDef": "The display configuration changes command displays the difference between a configuration file and the current running configuration file on the device. The display configuration changes command displays the difference between a configuration file and the current running configuration file on the device.",
    "CLIs": [
        "display configuration commit changes [ at <commit-id> | since <commit-id> | last <number-of-commits> ]",
        "display configuration changes [ runningfile <file-name> | file <file-name> running ]",
        "display configuration changes { runninglabel <label> | label <label> running }",
        "display configuration commit changes <latest-number-of-commits>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "at <commit-id>",
            "Info": "Displays configuration changes at a configuration rollback point.\nThe id is a string of 1 to 20 characters and generated by the system automatically."
        },
        {
            "Parameters": "since <commit-id>",
            "Info": "Displays configuration changes since the specified configuration rollback point was generated.\nThe id is a string of 1 to 20 characters and generated by the system automatically."
        },
        {
            "Parameters": "last <number-of-commits>",
            "Info": "Specifies the number of the latest configuration rollback points. Configuration changes in these rollback points are displayed.\nThe value is an integer ranging from 1 to 80."
        },
        {
            "Parameters": "running",
            "Info": "Displays the running configuration, that is, the configuration data in the running/ database.\n-"
        },
        {
            "Parameters": "file <file-name>",
            "Info": "Specifies a configuration file.\nThe name is a string of 5 to 64 characters in the format of .zip, .cfg, or .dat."
        },
        {
            "Parameters": "label <label>",
            "Info": "Specifies a label.\nThe value is a string of 1 to 256 characters."
        },
        {
            "Parameters": "<latest-number-of-commits>",
            "Info": "The number of latest commit changes.\nThe value is an integer ranging from 1 to 80."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display configuration commit changes since 1000000067"
        ],
        [
            "<HUAWEI> display configuration commit changes"
        ],
        [
            "<HUAWEI> display configuration commit changes last 2 with-tag",
            "+ <cmd-script:vlan batch></cmd>vlan batch 1 to 1000",
            "<view-entry></view>aaa"
        ],
        [
            "<HUAWEI> display configuration commit changes last 2"
        ],
        [
            "<HUAWEI> display configuration changes running file a.cfg"
        ],
        [
            "<HUAWEI> display configuration changes running label a"
        ],
        [
            "<HUAWEI> display configuration commit changes 2"
        ],
        [
            "<HUAWEI> display configuration changes"
        ]
    ],
    "ExtraInfo": "If a misoperation is performed or some configurations fail, the system must roll back to a specified historical configuration. In this case, you can run the display configuration commit changes command to check configuration changes at configuration rollback points.To view the difference between the current running configuration file and a specified configuration file, run the display configuration changes running file file-name command.To view the difference between a specified configuration file and the current running configuration file, run the display configuration changes file file-name running command.The display configuration changes running label label command displays the difference between the current configuration and the configuration of a specified user label.The display configuration changes label label running command displays the difference between the configuration of a specified user label and the current configuration.This command can only compare the current running configuration file with a configuration file. When you run this command, the first specified configuration file is called source configuration, and the later specified configuration file is called target configuration. If the target configuration is different from the source configuration, the difference is displayed based on the following rules:A command that exists in the target configuration rather than the source configuration is prefixed with \"+\".A command that exists in the source configuration rather than the target configuration is prefixed with \"-\".If a command is modified in the target configuration, the original command is prefixed with \"-\" and the new command is prefixed with \"+\"."
}