{
    "PageTitle": "save",
    "FuncDef": "The save command saves all configurations to a storage device.\nThe save shareable-configuration command saves the configuration to a specified file and generates a root key based on the password entered by the user. The save command saves all configurations to a storage device. The save shareable-configuration command saves the configuration to a specified file and generates a root key based on the password entered by the user.",
    "CLIs": [
        "save [ <configuration-file> ]",
        "save shareable-configuration <configuration-file> [ password ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "<configuration-file>",
            "Info": "Specifies the name of a configuration file.\nThe value is a string of 5 to 64 characters in the format of .zip, .cfg, or .dat."
        },
        {
            "Parameters": "password",
            "Info": "Password for saving a configuration file.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> save shareable-configuration test.cfg",
            "Warning: Are you sure to save the configuration to flash:/test.cfg? [Y/N]:y"
        ],
        [
            "<HUAWEI> save",
            "Are you sure to continue?[Y/N]y"
        ]
    ],
    "ExtraInfo": "When a group of configurations are complete and the desired functions are achieved, all the configurations should be saved to the storage device.If you run the save [ <configuration-file> ] command without specifying the configuration-file parameter, all configurations are saved to the configuration file for the next startup by default. If no next-startup configuration file exists, the system prompts you to determine whether to save configurations to the vrpcfg.zip file. You can save configurations to the file or specify another file for saving the configurations. Then the specified file is configured as the next-startup configuration file. You can run the display startup command to view the name of the configuration file for next startup.The save [ <configuration-file> ] command backs up all configurations to the specified file on the storage device. This command does not affect the current startup configuration file. If the storage path and name of the configuration file specified using configuration-file are the same as those of the next-startup configuration file, the save configuration-file command functions the same as the save command.If you run the save [ <configuration-file> ] command without specifying the optional parameter configuration-file when saving the configuration file for the first time, the system asks you whether to save the file as vrpcfg.zip. The vrpcfg.zip file is the default configuration file, and it is empty initially.If a configuration-level user runs the save command, the configuration file can be saved only to the root directory.The save shareable-configuration command saves configurations to a specified file, generates a root key based on the entered password, and saves the root key to the file.The configuration-file parameter must be specified when you run the save shareable-configuration command. If the system has the next startup file, the specified file name cannot be the same as the next startup file name.If the password parameter is not specified, the preset password (default value) generated by the device is used. The preset password is generated based on the system master key of the device and cannot be viewed."
}