{
    "PageTitle": "startup",
    "FuncDef": "The startup saved-configuration command specifies the configuration file to be loaded at the next startup of the system.\nThe startup shareable-configuration command imports a configuration file. The password entered by the user matches the key in the configuration file. The startup saved-configuration command specifies the configuration file to be loaded at the next startup of the system. The startup shareable-configuration command imports a configuration file. The password entered by the user matches the key in the configuration file.",
    "CLIs": [
        "startup saved-configuration <configuration-file>",
        "startup shareable-configuration <configuration-file> [ password ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "<configuration-file>",
            "Info": "Specifies the name of a configuration file. The file must have been created.\nThe name is a string of 5 to 64 characters in the format of *.zip, *.cfg or *.dat."
        },
        {
            "Parameters": "password",
            "Info": "Specifies the password for decrypting a configuration file.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] configuration file auto-save",
            "[*HUAWEI] commit",
            "[~HUAWEI] quit",
            "<HUAWEI> startup saved-configuration huawei.cfg"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo configuration file auto-save",
            "[*HUAWEI] commit",
            "[~HUAWEI] quit",
            "<HUAWEI> startup saved-configuration huawei.cfg"
        ],
        [
            "<HUAWEI> startup shareable-configuration 333.cfg"
        ],
        [
            "<HUAWEI> startup shareable-configuration test.cfg password"
        ]
    ],
    "ExtraInfo": "If the configuration file becomes inapplicable due to software upgrade, run the startup saved-configuration command to specify a new configuration file to be loaded at the next startup of the system. You can run the startup shareable-configuration command to configure the configuration file that contains the key information saved on another device as the next startup file.\nThe extension of the configuration file name must be .zip, .cfg or .dat. The system configuration file must be saved in the root directory of the storage device."
}