{
    "PageTitle": "startup default-configuration",
    "FuncDef": "The startup default-configuration command configures a preset configuration file for the system. If no configuration file is specified for next startup, the device uses this preset configuration file for startup. The startup default-configuration command configures a preset configuration file for the system. If no configuration file is specified for next startup, the device uses this preset configuration file for startup.",
    "CLIs": [
        "startup default-configuration <configuration-file>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "<configuration-file>",
            "Info": "Specifies the name of a configuration file to be used as the default configuration file. This file must exist.\nThe value is a string of 8 to 127 characters in the format of *.defcfg."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> startup default-configuration huawei.defcfg",
            "Warning: The action will override and update the default configuration file on the device. Continue? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "When a device starts without any configuration file, engineers need to configure the device onsite, which is inconvenient for device O&M. To implement plug-and-play after a device starts without any configuration file, run the startup default-configuration command to preset a configuration file for the device. The preset configuration file must contain configurations required by the plug-and-play function. The preset configuration file will be used for configuration restoration when the device starts without any configuration file.\nThe configuration file name extension must be *.defcfg, and the default configuration file must be stored in the root directory of the device before being specified. After the startup default-configuration command is configured, the default configuration file in the root directory will be imported to the device.\nThe preset configuration file is in text format, and its content can be directly viewed. After the preset configuration file is specified for startup, the device restores the commands in the preset configuration file one by one upon startup."
}