{
    "PageTitle": "ip source destination(Flow Matrix view)",
    "FuncDef": "The ip source destination command configures a path planning rule for a specified flow.\nThe undo ip source destination command deletes a path planning rule for a specified flow. The ip source destination command configures a path planning rule for a specified flow. The undo ip source destination command deletes a path planning rule for a specified flow. By default, no flow path planning rule is configured. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ip source <source-ip-address> destination <destination-ip-address> flow-rail { <interface-name> | <interface-type> <interface-number> }",
        "undo ip source <source-ip-address> destination <destination-ip-address> flow-rail { <interface-name> | <interface-type> <interface-number> }"
    ],
    "ParentView": [
        "Flow Matrix view"
    ],
    "ParaDef": [
        {
            "Parameters": "<source-ip-address>",
            "Info": "Indicates the source IP address that matches the rule.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<destination-ip-address>",
            "Info": "Indicates the destination IP address that matches the rule.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "flow-rail",
            "Info": "Specifies a flow rail.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of an outbound interface.\n-"
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an outbound interface.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of an outbound interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-matrix",
            "[*HUAWEI-flow-matrix] ip source 10.1.1.2 destination 10.1.2.2 flow-rail 100GE1/0/1"
        ]
    ],
    "ExtraInfo": "You can run this command to configure a path planning rule for a specified flow in Flow Matrix."
}