{
    "PageTitle": "advertise lowest-priority all-address-family peer-up (BGP multi-instance view)",
    "FuncDef": "The advertise lowest-priority all-address-family peer-up command configures BGP to minimize the priorities of the routes to be advertised to BGP peers when the peers go Up from Down.\nThe undo advertise lowest-priority all-address-family peer-up command restores the default configuration. The advertise lowest-priority all-address-family peer-up command configures BGP to minimize the priorities of the routes to be advertised to BGP peers when the peers go Up from Down. The undo advertise lowest-priority all-address-family peer-up command restores the default configuration. By default, the priorities of the BGP routes to be advertised remain unchanged.",
    "CLIs": [
        "advertise lowest-priority all-address-family peer-up [ delay <delay> ]",
        "undo advertise lowest-priority all-address-family peer-up [ delay <delay> ]"
    ],
    "ParentView": [
        "BGP multi-instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "delay <delay>",
            "Info": "Specifies a delay.\nThe value is an integer ranging from 1 to 864000, in seconds. The default value is 0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] advertise lowest-priority all-address-family peer-up"
        ]
    ],
    "ExtraInfo": "If the advertise lowest-priority all-address-family peer-up command is not run, BGP routes with unchanged priorities are advertised to peers when the peers go Up from Down. After the peers receive the routes, traffic may be switched back to the original paths. Consequently, lengthy packet loss may occur. To address this problem, run the advertise lowest-priority all-address-family peer-up command. After the command is run, routes advertised to the peers carry the lowest priorities (largest MED value and smallest Local_Pref value) until delay expires."
}