{
    "PageTitle": "advertise lowest-priority on-startup(BGP-IPv6 unicast address family view)",
    "FuncDef": "The advertise lowest-priority on-startup command configures BGP to minimize the priorities of the BGP routes to be advertised.\nThe undo advertise lowest-priority on-startup command restores the default configuration. The advertise lowest-priority on-startup command configures BGP to minimize the priorities of the BGP routes to be advertised. The undo advertise lowest-priority on-startup command restores the default configuration. By default, the priorities of the BGP routes to be advertised remain unchanged. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "advertise lowest-priority on-startup [ delay-time <time-value> ]",
        "undo advertise lowest-priority on-startup [ delay-time <time-value> ]"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "delay-time <time-value>",
            "Info": "Specifies a delay.\nThe value is an integer ranging from 1 to 864000, in seconds.\nThe default value is 0, indicating that the delay function is disabled."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] advertise lowest-priority on-startup"
        ]
    ],
    "ExtraInfo": "When a device restarts during ARP entry delivery, the route advertised by the device needs to have a low priority to prevent traffic loss.<br />\nBefore restarting the device, you can run the advertise lowest-priority on-startup command to set the lowest priority for the routes advertised to peers. That is, you can change the MED value to 4294967295 and the Local_Pref value to 0. As such, a BGP route advertised by the device has the lowest priority among routes of the the same type after the device restarts, preventing the BGP route from being preferentially selected. To restore the priorities of these BGP routes after ARP entries are delivered, run the reset bgp advertise lowest-priority on-startup command.\nYou can also run the advertise lowest-priority on-startup delay-time command before the device restarts to ensure that the priority of the routes advertised by the device is the lowest among the routes of the same type within the configured delay after the device restarts. ARP entries are delivered within the delay time. After the delay time expires, the priority of the routes advertised by the device is automatically restored. Within the delay, you can also run the reset bgp advertise lowest-priority on-startup command to restore the default priority of the routes to be advertised.\nIn addition, when advertising low-priority routes, you can run the undo undo advertise lowest-priority on-startup [delay-time ] command to restore the default priority of routes to be advertised, regardless of whether there is a delay."
}