{
    "PageTitle": "aggregate (BGP-VPN instance IPv6 address family view) (IPv6)",
    "FuncDef": "The aggregate command adds a summarized route to the BGP routing table. The outbound interface of the summarized route on the local Router is NULL 0. When receiving the summarized route, each of the other devices automatically adds its local outbound interface to the summarized route.\nThe undo aggregate command disables the function. The aggregate command adds a summarized route to the BGP routing table. The outbound interface of the summarized route on the local Router is NULL 0. When receiving the summarized route, each of the other devices automatically adds its local outbound interface to the summarized route. The undo aggregate command disables the function. By default, no routes are summarized. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "aggregate <ipv6-address> <mask-length> [ as-set | detail-suppressed | attribute-policy <route-policy-name1> | origin-policy <route-policy-name2> | suppress-policy <route-policy-name3> ]",
        "undo aggregate <ipv6-address> <mask-length> [ as-set | detail-suppressed | attribute-policy <route-policy-name1> | origin-policy <route-policy-name2> | suppress-policy <route-policy-name3> ]"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view,BGP multi-instance VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies an IPv6 address of the summarized route.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<mask-length>",
            "Info": "Specifies the network mask length of the summary route.\nThe value is an integer ranging from 1 to 128."
        },
        {
            "Parameters": "as-set",
            "Info": "Generates a route carrying the AS-Set attribute.\n-"
        },
        {
            "Parameters": "detail-suppressed",
            "Info": "Advertises only the summary route.\n-"
        },
        {
            "Parameters": "attribute-policy <route-policy-name1>",
            "Info": "Specifies the name of a route-policy for setting attributes of a summary route.\nThe value is a string of 1 to 200 case-sensitive characters. It cannot contain spaces. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "origin-policy <route-policy-name2>",
            "Info": "Specifies the name of the route-policy that allows route summarization.\nThe value is a string of 1 to 200 case-sensitive characters. It cannot contain spaces. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "suppress-policy <route-policy-name3>",
            "Info": "Specifies the name of the route-policy for suppressing the advertisement of specified routes.\nThe value is a string of 1 to 200 case-sensitive characters. It cannot contain spaces. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv6-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpna",
            "[*HUAWEI-bgp-6-vpna] aggregate 2001:db8:1::1 64 as-set"
        ]
    ],
    "ExtraInfo": "BGP route summarization is classified into manual summarization and automatic summarization. The aggregate command is used to implement manual summarization. Manual summarization takes precedence over automatic summarization. The aggregate ipv4-address { mask | mask-length } command can be used to summarize specific routes in the local BGP routing table and advertise all summary routes and specific routes. The summary route inherits the Origin attribute of the specific routes. If the Origin attributes of the specific routes are different, the route with the largest Origin attribute priority (incomplete\\ > egp\\ > igp) is selected. In addition, the generated summary route carries the atomic-aggregate attribute. Except the Origin and Atomic-aggregate attributes, the summary route discards all other attributes of the specific routes.\nTo ensure that summary routes can prevent loops, you can specify the as-set keyword to create a summary route for loop detection. The summary route inherits the Origin, AS_Path (loop-proof), community, and large-community attributes of specific routes. The summary route also carries the community attributes of all specific routes. When the number of community attributes of the summary route exceeds 255, the summarization stops and the routes that are not summarized are advertised as specific routes. If multiple AS_Paths need to be summarized, exercise caution when using this parameter because frequent changes of specific routes may cause route flapping.\ndetail-suppressed is used to suppress the advertisement of all specific routes corresponding to the summary route. Only the summary route is advertised. The summary route carries the atomic-aggregate attribute but does not carry the community attribute of the specific routes.\nThe suppress-policy keyword can be used to generate summary routes but suppress the advertisement of specified routes. You can use the if-match clause of the route-policy to selectively suppress some specific routes. That is, the routes that match the route-policy are suppressed, but the routes that do not match the route-policy are still advertised. You can also run the peer route-policy command to achieve the same effect.\nIf origin-policy is specified, a summary route is generated only when the route-policy is matched.\nThe attribute-policy keyword can be used to set the attributes of the summary route. If the AS_Path attribute is set in the policy through the apply as-path command and the keyword as-set is set in the aggregate command, the apply as-path command in the policy does not take effect. You can also run the peer route-policy command to achieve the same effect."
}