{
    "PageTitle": "as-number (BGP-VPN instance IPv6 address family view)",
    "FuncDef": "The as-number command configures an AS number for a VPN instance.\nThe undo as-number command restores the default setting. The as-number command configures an AS number for a VPN instance. The undo as-number command restores the default setting. By default, a VPN instance uses the AS number of BGP. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "as-number <vrf-as> [ no-prepend ]",
        "undo as-number",
        "undo as-number <vrf-as> no-prepend"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<vrf-as>",
            "Info": "Specifies a destination AS number.\nFor an integral AS number, the value is an integer ranging from 1 to 4294967295.\nFor an AS number in dotted notation, the value is in the format of x.y, where x is an integer that ranges from 1 to 65535, and y is an integer ranging from 0 to 65535."
        },
        {
            "Parameters": "no-prepend",
            "Info": "Indicates whether the AS number is prepended.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv6-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpna",
            "[*HUAWEI-bgp-6-vpna] as-number 65001"
        ]
    ],
    "ExtraInfo": "During network migration or service identification, if a physical device needs to be logically simulated as multiple BGP devices, you can run the as-number command to configure a unique AS number for each VPN instance.\nAfter the as-number command is run:"
}