{
    "PageTitle": "as-number(BGP-VPN instance view)",
    "FuncDef": "The as-number ipv4 command configures an independent AS number for an IPv4 peer of a VPN instance.\nThe undo as-number ipv4 command restores the default configuration.\nThe as-number ipv6 command configures an independent AS number for an IPv6 peer of a VPN instance.\nThe undo as-number ipv6 command restores the default configuration. The as-number ipv4 command configures an independent AS number for an IPv4 peer of a VPN instance. The undo as-number ipv4 command restores the default configuration. The as-number ipv6 command configures an independent AS number for an IPv6 peer of a VPN instance. The undo as-number ipv6 command restores the default configuration. By default, a VPN instance uses the AS number of BGP.",
    "CLIs": [
        "as-number ipv4 <ipv4-as> [ no-prepend ]",
        "undo as-number ipv4 <ipv4-as> [ no-prepend ]",
        "as-number ipv6 <ipv6-as> [ no-prepend ]",
        "undo as-number ipv6 <ipv6-as> [ no-prepend ]"
    ],
    "ParentView": [
        "BGP-VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-as>",
            "Info": "Specifies the AS number of an IPv6 peer.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nFor an integral AS number, the value is an integer ranging from 1 to 4294967295.\nFor an AS number in dotted notation, the value is in the format of x.y, where x is an integer that ranges from 1 to 65535, and y is an integer ranging from 0 to 65535."
        },
        {
            "Parameters": "<ipv4-as>",
            "Info": "Specifies the AS number of an IPv4 peer.\nFor an integral AS number, the value is an integer ranging from 1 to 4294967295.\nFor an AS number in dotted notation, the value is in the format of x.y, where x is an integer that ranges from 1 to 65535, and y is an integer ranging from 0 to 65535."
        },
        {
            "Parameters": "no-prepend",
            "Info": "Indicates whether the AS number is prepended.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] route-distinguisher 1:4",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 10:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpna",
            "[*HUAWEI-bgp-instance-vpna] as-number ipv4 65001",
            "[*HUAWEI-bgp-instance-vpna] as-number ipv6 65001"
        ]
    ],
    "ExtraInfo": "During network transfer or service identification in a scenario where the YANG management mode is enabled for BGP VPN instances, if a physical device needs to be simulated as multiple logical BGP devices, you can run the as-number { ipv4 | ipv6 } command to configure a different AS number for each VPN instance.\nAfter this command is run:"
}