{
    "PageTitle": "bestroute med-plus-igp (BGP-VPN instance IPv6 address family view)",
    "FuncDef": "The bestroute med-plus-igp command configures BGP to preferentially select the route with the smallest sum of MED multiplied by a MED multiplier and IGP cost multiplied by an IGP cost multiplier when BGP needs to compare MEDs to select the optimal route.\nThe undo bestroute med-plus-igp command restores the default configuration. The bestroute med-plus-igp command configures BGP to preferentially select the route with the smallest sum of MED multiplied by a MED multiplier and IGP cost multiplied by an IGP cost multiplier when BGP needs to compare MEDs to select the optimal route. The undo bestroute med-plus-igp command restores the default configuration. By default, the MED and IGP cost of each route are used as separate route selection criteria. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "bestroute med-plus-igp [ igp-multiplier <igp-multiplier> | med-multiplier <med-multiplier> ]",
        "undo bestroute med-plus-igp [ igp-multiplier <igp-multiplier> | med-multiplier <med-multiplier> ]"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view,BGP multi-instance VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "igp-multiplier <igp-multiplier>",
            "Info": "Specifies an IGP cost multiplier.\nThe value is an integer ranging from 1 to 1000. The default value is 1."
        },
        {
            "Parameters": "med-multiplier <med-multiplier>",
            "Info": "Specifies a MED multiplier.\nThe value is an integer ranging from 1 to 1000. The default value is 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv6-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpna",
            "[*HUAWEI-bgp-6-vpna] bestroute med-plus-igp"
        ]
    ],
    "ExtraInfo": ""
}