{
    "PageTitle": "default local-preference (BGP-VPN instance IPv4 address family view)",
    "FuncDef": "The default local-preference command configures a Local_Pref for BGP routes.\nThe undo default local-preference command restores the default value. The default local-preference command configures a Local_Pref for BGP routes. The undo default local-preference command restores the default value. By default, the Local_Pref of BGP routes is 100.",
    "CLIs": [
        "default local-preference <local-preference>",
        "undo default local-preference"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<local-preference>",
            "Info": "Specifies the local preference for BGP routes. The larger the value, the higher the priority.\nThe value is an integer ranging from 0 to 4294967295. The default value is 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpna",
            "[*HUAWEI-bgp-instance-vpna] quit",
            "[*HUAWEI-bgp] ipv4-labeled-unicast vpn-instance vpna",
            "[*HUAWEI-bgp-labeled-vpna] default local-preference 200"
        ]
    ],
    "ExtraInfo": "The preference attribute is used to determine the optimal route when traffic leaves an AS. When a BGP device obtains multiple routes that have the same destination address but different next hops from IBGP peers, the route with the highest preference value is selected.\nThe default local-preference command is used to configure the default local preference of BGP. If the default local preference of BGP is required, the configuration takes effect. For example, if a route carries the Local_Pref attribute and does not require the default local preference of BGP, the route is not affected by the default local preference."
}