{
    "PageTitle": "default local-preference (BGP-VPN instance IPv6 address family view)",
    "FuncDef": "The default local-preference command configures a Local_Pref for BGP routes.\nThe undo default local-preference command restores the default value. The default local-preference command configures a Local_Pref for BGP routes. The undo default local-preference command restores the default value. By default, the Local_Pref of BGP routes is 100. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "default local-preference <preference>",
        "undo default local-preference"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view,BGP multi-instance VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<preference>",
            "Info": "Specifies the local preference for BGP routes. The larger the value, the higher the priority.\nThe value is an integer ranging from 0 to 4294967295. The default value is 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[~HUAWEI-vpn-instance-vrf1] ipv6-family",
            "[~HUAWEI-vpn-instance-vrf1-af-ipv6] quit",
            "[~HUAWEI-vpn-instance-vrf1] quit",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vrf1",
            "[*HUAWEI-bgp6-vrf1] default local-preference 200"
        ]
    ],
    "ExtraInfo": "The preference attribute is used to determine the optimal route when traffic leaves an AS. When a BGP device obtains multiple routes that have the same destination address but different next hops from IBGP peers, the route with the highest preference value is selected.\nThe default local-preference command is used to configure the default local preference of BGP. If the default local preference of BGP is required, the configuration takes effect. For example, if a route carries the Local_Pref attribute and does not require the default local preference of BGP, the route is not affected by the default local preference."
}