{
    "PageTitle": "display bmp session",
    "FuncDef": "The display bmp session command displays configurations about a BGP Monitoring Protocol (BMP) session. The display bmp session command displays configurations about a BGP Monitoring Protocol (BMP) session.",
    "CLIs": [
        "display bmp session [ vpn-instance <vpn-instacne-name> ]",
        "display bmp session [ vpn-instance <vpn-instacne-name> ] { <ipv4-address> | <ipv6-address> } verbose",
        "display bmp session [ vpn-instance <vpn-instacne-name> ] { <ipv4-address> | <ipv6-address> } alias <alias-name> verbose"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance <vpn-instacne-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address used for the RPKI session.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a BMP session.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed session information.\n-"
        },
        {
            "Parameters": "alias <alias-name>",
            "Info": "Specifies a session alias. When the device needs to establish multiple TCP connections with the same monitoring server through different port numbers, specify session aliases for differentiation.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bmp session 10.3.3.3 alias aa verbose"
        ],
        [
            "<HUAWEI> display bmp session"
        ],
        [
            "<HUAWEI> display bmp session 10.1.1.1 verbose"
        ]
    ],
    "ExtraInfo": "To check configurations about a BMP session, run the display bmp session command. The command output helps you locate a fault (if any) and determine whether the BMP session is properly configured."
}