{
    "PageTitle": "display bgp vpn-instance group",
    "FuncDef": "The display bgp vpn-instance group command displays information about BGP peer groups in a specified VPN instance. The display bgp vpn-instance group command displays information about BGP peer groups in a specified VPN instance.",
    "CLIs": [
        "display bgp vpnv4 vpn-instance <vpn-instance-name> group",
        "display bgp vpnv4 vpn-instance <vpn-instance-name> group <group-name>",
        "display bgp instance <instance-name> vpnv4vpn-instance <vpn-instance-name> group",
        "display bgp instance <instance-name> vpnv4vpn-instance <vpn-instance-name> group <group-name>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpnv4",
            "Info": "Displays information about BGP VPNv4 peer groups.\n-"
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Displays information about BGP peer groups in a specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "instance <instance-name>",
            "Info": "Specifies the BGP multi-instance name.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bgp instance aaa vpnv4 vpn-instance vpn3 group"
        ]
    ],
    "ExtraInfo": "Configuring BGP peer groups simplifies BGP network configuration and improves route advertisement efficiency.\nThe\ndisplay bgp vpn-instance group command displays information about BGP peer groups in a specified VPN instance, including peers in the peer group and configuration information about the peer group. The\ndisplay bgp vpn-instance group command is used in the following scenarios:"
}