{
    "PageTitle": "display bgp routing-table unnumbered peer interface statistics",
    "FuncDef": "The display bgp routing-table unnumbered peer interface advertised-routes statistics command displays statistics about BGP routes sent to unnumbered BGP peers.\nThe display bgp routing-table unnumbered peer interface received-routes statistics command displays statistics about BGP routes received from unnumbered BGP peers. The display bgp routing-table unnumbered peer interface advertised-routes statistics command displays statistics about BGP routes sent to unnumbered BGP peers. The display bgp routing-table unnumbered peer interface received-routes statistics command displays statistics about BGP routes received from unnumbered BGP peers.",
    "CLIs": [
        "display bgp routing-table unnumbered peer interface { <interface-name> | <IfType> <IFNum> } { advertised-routes | received-routes | received-routesactive } statistics"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies an interface name.\nThe value is a string of 1 to 63 characters."
        },
        {
            "Parameters": "<IfType>",
            "Info": "Specifies an interface type.\n-"
        },
        {
            "Parameters": "<IFNum>",
            "Info": "Specifies the number of an interface.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "advertised-routes",
            "Info": "Displays the routes advertised to a peer.\n-"
        },
        {
            "Parameters": "received-routes",
            "Info": "Indicates the routes from the peer.\n-"
        },
        {
            "Parameters": "active",
            "Info": "Displays active route from the peer.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bgp routing-table unnumbered peer interface 100GE 1/0/1 received-routes statistics"
        ]
    ],
    "ExtraInfo": "You can run the display bgp routing-table unnumbered peer interface advertised-routes statistics command to view statistics about BGP routes sent to unnumbered BGP peers.\nTo check statistics about BGP routes received from unnumbered BGP peers, run the display bgp routing-table unnumbered peer interface received-routes statistics command."
}