{
    "PageTitle": "display bgp ipv6 routing-table unnumbered peer interface advertised-routes(Attribute Filter)",
    "FuncDef": "The display bgp ipv6 routing-table unnumbered peer interface advertised-routes command allows you to specify different parameters to view the specified routes of BGP unnumbered peers. The display bgp ipv6 routing-table unnumbered peer interface advertised-routes command allows you to specify different parameters to view the specified routes of BGP unnumbered peers. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display bgp ipv6 routing-table unnumbered peer interface { <interface-name> | <IfType> <IFNum> } advertised-routes <ipv6-address> [ <mask-length> ] { as-path | community-list | large-community | ext-community | cluster-list | advertised-peer }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of an interface.\nThe value is a string of 1 to 63 characters."
        },
        {
            "Parameters": "<IfType>",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "<IFNum>",
            "Info": "Specifies the number of an interface.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "IPv6 network segment address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<mask-length>",
            "Info": "Specifies the mask length of the network address.\nThe value is an integer ranging from 0 to 128."
        },
        {
            "Parameters": "as-path",
            "Info": "Displays AS_Path attribute information.\n-"
        },
        {
            "Parameters": "community-list",
            "Info": "Displays the community attribute contained in a route.\n-"
        },
        {
            "Parameters": "large-community",
            "Info": "Displays the routes with the specified BGP Large-Community in the routing table.\n-"
        },
        {
            "Parameters": "ext-community",
            "Info": "Displays extcommunity attribute information.\n-"
        },
        {
            "Parameters": "cluster-list",
            "Info": "Displays the cluster list of a route.\n-"
        },
        {
            "Parameters": "advertised-peer",
            "Info": "Displays the list of the peers to which a route is advertised.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bgp ipv6 routing-table unnumbered peer interface 100GE 1/0/1 advertised-routes 2001:DB8::55 advertised-peer"
        ]
    ],
    "ExtraInfo": ""
}