{
    "PageTitle": "display bgp vpnv6 update-peer-group",
    "FuncDef": "The display bgp vpnv6 update-peer-group command displays information about BGP VPNv6 update peer-groups. The display bgp vpnv6 update-peer-group command displays information about BGP VPNv6 update peer-groups. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display bgp { vpnv6vpn-instance <vpn-instance-name> | vpnv6all } update-peer-group [ index <update-group-index> ]",
        "display bgp instance <bgpName> vpnv6vpn-instance <vpn-instance-name> update-peer-group [ index <update-group-index> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies a VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "all",
            "Info": "Displays all information about VPNv6 and IPv6 VPN instances.\n-"
        },
        {
            "Parameters": "index <update-group-index>",
            "Info": "Index of update peer group.\nThe value is an integer ranging from 0 to 65535."
        },
        {
            "Parameters": "instance <bgpName>",
            "Info": "Specifies the BGP multi-instance name.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bgp vpnv6 all update-peer-group index 0"
        ]
    ],
    "ExtraInfo": ""
}