{
    "PageTitle": "display bgp vpnv6 peer log-info",
    "FuncDef": "The display bgp vpnv6 peer log-info command displays the log information of the BGP VPNv6 address family. The display bgp vpnv6 peer log-info command displays the log information of the BGP VPNv6 address family. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display bgp [ instance <bgpName> ] vpnv6vpn-instance <vpn-instance-name> peer <ipv6-address> log-info",
        "display bgp [ instance <bgpName> ] vpnv6vpn-instance <vpn-instance-name> peer-group <group-name> log-info"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "instance <bgpName>",
            "Info": "Specifies the BGP multi-instance name.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies a VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies an IPv6 peer address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "peer-group <group-name>",
            "Info": "Specifies a peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bgp vpnv6 vpn-instance vpn1 peer 2001:DB8:1::2 log-info"
        ]
    ],
    "ExtraInfo": ""
}