{
    "PageTitle": "display bgp group",
    "FuncDef": "The display bgp group command displays information about BGP peer groups, excluding the BGP unnumbered peer groups.\nThe display bgp unnumbered group command displays information about BGP unnumbered peer groups. The display bgp group command displays information about BGP peer groups, excluding the BGP unnumbered peer groups. The display bgp unnumbered group command displays information about BGP unnumbered peer groups.",
    "CLIs": [
        "display bgp group",
        "display bgp vpnv4 all group [ <group-name> ]",
        "display bgp group <group-name>",
        "display bgp instance <instance-name> vpnv4allgroup [ <group-name> ]",
        "display bgp unnumbered group",
        "display bgp unnumbered group <group-name>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpnv4",
            "Info": "Displays information about BGP VPNv4 peer groups.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Displays information about all BGP VPNv4 peer groups.\n-"
        },
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "instance <instance-name>",
            "Info": "Specifies a BGP instance.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bgp unnumbered group"
        ],
        [
            "<HUAWEI> display bgp vpnv4 all group rr1"
        ],
        [
            "<HUAWEI> display bgp group dyn-peer"
        ],
        [
            "<HUAWEI> display bgp vpnv4 all group"
        ],
        [
            "<HUAWEI> display bgp group my-peer"
        ]
    ],
    "ExtraInfo": "Configuring BGP peer groups simplifies BGP network configuration and improves BGP route advertisement efficiency.\nThe display bgp group command displays information about peer groups, including the members in the peer groups and the configuration of the peer groups. This command is used in the following scenarios:"
}