{
    "PageTitle": "display bgp update-peer-group",
    "FuncDef": "The display bgp update-peer-group command displays information about update peer-groups. If no address family is specified, information about the update peer-groups of the IPv4 unicast address family is displayed by default. The display bgp update-peer-group command displays information about update peer-groups. If no address family is specified, information about the update peer-groups of the IPv4 unicast address family is displayed by default.",
    "CLIs": [
        "display bgp [ vpnv4vpn-instance <vpn-instance-name> | vpnv4all ] update-peer-group [ index <index-value> ]",
        "display bgp instance <instance-name> [ vpnv4vpn-instance <vpn-instance-name> | vpnv4all ] update-peer-group [ index <index-value> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpnv4",
            "Info": "Displays information about the BGP update peer-groups of a VPNv4 instance.\n-"
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "all",
            "Info": "Displays information about all the update peer-groups in current address family.\n-"
        },
        {
            "Parameters": "index <index-value>",
            "Info": "Specifies the index of an update peer-group.\nThe value is an integer that ranges from 0 to 65535."
        },
        {
            "Parameters": "instance <instance-name>",
            "Info": "Specifies the name of a BGP instance.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bgp update-peer-group index 0"
        ],
        [
            "<HUAWEI> display bgp update-peer-group"
        ]
    ],
    "ExtraInfo": ""
}