{
    "PageTitle": "display bgp routing-table time-range",
    "FuncDef": "The display bgp routing-table time-range command displays BGP routes that flap within the specified period.\nThe display bgp routing-table unnumbered peer interface time-range command displays BGP Unnumbered routes that flap within the specified period. The display bgp routing-table time-range command displays BGP routes that flap within the specified period. The display bgp routing-table unnumbered peer interface time-range command displays BGP Unnumbered routes that flap within the specified period.",
    "CLIs": [
        "display bgp routing-table peer <remoteIpv4Addr> { received-routestime-range <time-range-start> <time-range-end> | advertised-routestime-range <time-range-start> <time-range-end> }",
        "display bgp routing-table time-range <time-range-start> <time-range-end>",
        "display bgp routing-table unnumbered peer interface { <interface-name> | <IfType> <IFNum> } { received-routestime-range <time-range-start> <time-range-end> | advertised-routestime-range <time-range-start> <time-range-end> }",
        "display bgp routing-table peer <remoteIpv6Addr> { received-routestime-range <time-range-start> <time-range-end> | advertised-routestime-range <time-range-start> <time-range-end> }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "received-routes",
            "Info": "Displays the public network routes received from a specified peer.\n-"
        },
        {
            "Parameters": "time-range <time-range-start> <time-range-end>",
            "Info": "Displays BGP public network routes that flap within the specified period. For example, the value 0d0h5m0s of start-time indicates five minutes before the current time. The value 0d0h10m0s of end-time indicates 10 minutes before the current time. All BGP public network routes with the Keepalive time in the range of 5 to 10 minutes are displayed.\nBoth start-time and end-time are in the format of xxdxxhxxmxxs. d indicates the day, which is an integer ranging from 0 to 10000. h indicates the hour, which is an integer ranging from 0 to 23. m indicates the minute, which is an integer ranging from 0 to 59. s indicates the second, which is an integer ranging from 0 to 59."
        },
        {
            "Parameters": "advertised-routes",
            "Info": "Displays the public network routes advertised to a specified peer.\n-"
        },
        {
            "Parameters": "peer <remoteIpv4Addr>",
            "Info": "Displays the public network routes of a specified peer.\nThe value is in the dotted decimal format."
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of an interface.\nThe value is a string of 1 to 63 characters."
        },
        {
            "Parameters": "<IfType>",
            "Info": "Specifies an interface type.\n-"
        },
        {
            "Parameters": "<IFNum>",
            "Info": "Specifies an interface number.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "<remoteIpv6Addr>",
            "Info": "Specifies the IPv6 address of a peer.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bgp routing-table time-range 0d0h5m3s 1d1h1m1s",
            "Status codes: * - valid, > - best, d - damped, x - best external, a - add path,",
            "*>   10.2.3.4/32         10.0.0.0                        0.0.0.0                                   0d01h10m05s      ?",
            "*>i  10.5.6.7/32         10.1.1.2                       10.1.1.2                                  0d01h08m16s      ?"
        ]
    ],
    "ExtraInfo": ""
}