{
    "PageTitle": "display bgp bmp-monitor",
    "FuncDef": "The display bgp bmp-monitor command displays information about the BGP peers monitored by a BMP session in all address families or in a specified address family. The display bgp bmp-monitor command displays information about the BGP peers monitored by a BMP session in all address families or in a specified address family.",
    "CLIs": [
        "display bgp bmp-monitor ipv4 { <ipv4-address> | <ipv6-address> }",
        "display bgp bmp-monitor ipv6 <ipv6-address>",
        "display bgp bmp-monitor vpnv4 vpn-instance <vpn-instance-name> <ipv4-address>",
        "display bgp bmp-monitor vpnv6 vpn-instance <vpn-instance-name> <ipv6-address>",
        "display bgp bmp-monitor all"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of a BGP peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a BGP peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "ipv4",
            "Info": "Displays information about BGP peers monitored by a BMP session in the IPv4 unicast address family.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Displays information about BGP peers monitored by a BMP session in the IPv6 unicast address family.\n-"
        },
        {
            "Parameters": "vpnv4",
            "Info": "Displays information about BGP peers monitored by a BMP session in the VPNv4 address family.\n-"
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Displays information about BGP peers monitored by a BMP session in the VPN instance address family.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "vpnv6",
            "Info": "Displays information about BGP peers monitored by a BMP session in the VPNv6 address family.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Displays information about BGP peers monitored by a BMP session in all address families.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bgp bmp-monitor ipv6 2001:DB8:1::2",
            "*>BGP ipv6-family unicast :"
        ],
        [
            "<HUAWEI> display bgp bmp-monitor all",
            "*>BGP ipv4-family unicast :",
            "*>BGP ipv6-family unicast :"
        ]
    ],
    "ExtraInfo": "To check information about the BGP peers monitored by a BMP session in all address families or in a specified address family, run the display bgp bmp-monitor command. The information includes the type of route reported to the monitoring server, IP address of the server with which a BMP session is established, BMP session alias, and BMP session status."
}