{
    "PageTitle": "ext-community-change enable (BGP-IPv4 unicast address family view)",
    "FuncDef": "The ext-community-change enable command enables a device to change the VPN target, SoO, and link bandwidth extended community attributes based on a route-policy.\nThe undo ext-community-change enable command disables a device from changing VPN target, SoO, and link bandwidth extended community attributes based on a route-policy. The ext-community-change enable command enables a device to change the VPN target, SoO, and link bandwidth extended community attributes based on a route-policy. The undo ext-community-change enable command disables a device from changing VPN target, SoO, and link bandwidth extended community attributes based on a route-policy. By default, the VPN target, SoO, and link bandwidth extended community attributes cannot be modified using a route-policy.",
    "CLIs": [
        "ext-community-change enable",
        "undo ext-community-change enable"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view,BGP view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ext-community-change enable"
        ]
    ],
    "ExtraInfo": "By default, BGP is not allowed to use an import policy to change the VPN target and SoO extended community attributes and the link bandwidth attribute of the routes received from a specified peer or peer group, or use an export policy to change the VPN target and SoO extended community attributes and the link bandwidth attribute of the routes to be advertised to a specified peer or peer group. After the ext-community-change enable command is run, the VPN target and SoO extended community attributes and the link bandwidth attribute of the routes received from a specified peer or peer group can be modified based on an import policy, and the changed extended community attributes can be advertised to a specified peer or peer group based on an export policy. In this manner, the modified VPN target and SoO extended community attributes and the link bandwidth attribute of preferred routes can be advertised to the peer or peer group."
}