{
    "PageTitle": "group listen(BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The group listen command creates a dynamic BGP peer group.\nThe undo group listen command deletes a dynamic BGP peer group. The group listen command creates a dynamic BGP peer group. The undo group listen command deletes a dynamic BGP peer group. By default, no dynamic BGP peer groups are created.",
    "CLIs": [
        "group <peerGroupName> listen { internal | external }",
        "group <peerGroupName> listen",
        "undo group <peerGroupName> listen [ internal | external ]"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerGroupName>",
            "Info": "Specifies the name of a dynamic peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "internal",
            "Info": "Creates a dynamic IBGP peer group.\n-"
        },
        {
            "Parameters": "external",
            "Info": "Creates a dynamic EBGP peer group.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100 instance a",
            "[~HUAWEI-bgp-instance-a] ipv4-family vpn vpna",
            "[*HUAWEI-bgp-instance-a-vpna] group in listen internal"
        ]
    ],
    "ExtraInfo": "On a BGP network, multiple peers frequently change, and the establishment of peer relationships changes accordingly. If you configure peers in common mode, you need to frequently add or delete peer configurations on the local device, which increases the maintenance workload. In this case, you can configure the dynamic BGP peer function to enable BGP to listen to BGP connection requests from a specified network segment, dynamically establish BGP peer relationships, and add these peers to the same dynamic peer group. In this manner, when the peer changes, you do not need to add or delete BGP peer configurations on the local end, which reduces the workload of network maintenance. The group listen command creates a dynamic BGP peer group.\nThe features of members in a dynamic peer group are the same as those of members in a common peer group. When a peer is added to a dynamic peer group, the peer obtains the same configurations as the peer group.The peers in a peer group can inherit the configurations of the peer group. When the configurations of the peer group are changed, the configurations of the members in the peer group are changed accordingly.\nAfter a dynamic BGP peer group is created, if the peer enable command is run in an address family view to enable the device to exchange routing information with a specified peer, the peer enable command configured in another address family view does not take effect. In this case, you must run the reset bgp command, resets the BGP connection with a dynamic peer or a dynamic peer group so that the dynamic peer enabled in another address family can be established."
}