{
    "PageTitle": "hierarchy-convergence base-route hierarchy-route (BGP-IPv6 unicast address family view)",
    "FuncDef": "The hierarchy-convergence base-route hierarchy-route command configures base routes and hierarchical routes.\nThe undo hierarchy-convergence base-route hierarchy-route cancels the configuration. The hierarchy-convergence base-route hierarchy-route command configures base routes and hierarchical routes. The undo hierarchy-convergence base-route hierarchy-route cancels the configuration. By default, base routes and hierarchical routes are not configured. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "hierarchy-convergence base-route <ipv6-address> <ipv6-mask-length> hierarchy-route { all | route-policy <policy-name> }",
        "undo hierarchy-convergence base-route <ipv6-address> <ipv6-mask-length> hierarchy-route { all | route-policy <policy-name> }"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a base route.\nThe value is in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<ipv6-mask-length>",
            "Info": "Specifies the mask length of a base route.\nIt is an integer ranging from 1 to 128."
        },
        {
            "Parameters": "all",
            "Info": "All routes without the hierarchical convergence attribute will be mapped to the current base route.\n-"
        },
        {
            "Parameters": "route-policy <policy-name>",
            "Info": "Routes that do not carry the hierarchical convergence attribute and match the route-policy are mapped to the current base route.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy test-policy permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] hierarchy-convergence base-route 2001:DB8:1::1 128 hierarchy-route route-policy test-policy"
        ]
    ],
    "ExtraInfo": ""
}