{
    "PageTitle": "hierarchy-convergence base-route hierarchy-route (BGP-IPv4 unicast address family view)",
    "FuncDef": "The hierarchy-convergence base-route hierarchy-route command configures base routes and hierarchical routes.\nThe undo hierarchy-convergence base-route hierarchy-route cancels the configuration. The hierarchy-convergence base-route hierarchy-route command configures base routes and hierarchical routes. The undo hierarchy-convergence base-route hierarchy-route cancels the configuration. By default, base routes and hierarchical routes are not configured.",
    "CLIs": [
        "hierarchy-convergence base-route <ip-address> <mask-length> hierarchy-route { all | route-policy <policy-name> }",
        "undo hierarchy-convergence base-route <ip-address> <mask-length> hierarchy-route { all | route-policy <policy-name> }"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<mask-length>",
            "Info": "Specifies the mask length of a base route.\nIt is an integer ranging from 1 to 32."
        },
        {
            "Parameters": "all",
            "Info": "All routes without the hierarchical convergence attribute will be mapped to the current base route.\n-"
        },
        {
            "Parameters": "route-policy <policy-name>",
            "Info": "Routes that do not carry the hierarchical convergence attribute and match the route-policy are mapped to the current base route.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy test-policy permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family unicast",
            "[*HUAWEI-bgp-af-ipv4] hierarchy-convergence base-route 10.1.1.1 32 hierarchy-route route-policy test-policy"
        ]
    ],
    "ExtraInfo": "BGP routes converge one by one in case of a failure. In the underlay BGP scenario of a data center, routes are classified into base routes (device reachability routes) and hierarchical routes (learned service routes). To configure base routes and hierarchical routes, run the hierarchy-convergence base-route hierarchy-route command. Base routes converge first, and then hierarchical routes rely on the recursion results of the base routes. BGP hierarchical routing speeds up route convergence in the case of faults on data center networks, especially when hierarchical routes greatly outnumber base routes."
}