{
    "PageTitle": "import-route (BGP-IPv6 unicast address family view)",
    "FuncDef": "The import-route command configures BGP to import routes from other protocols.\nThe undo import-route command cancels the configuration. The import-route command configures BGP to import routes from other protocols. The undo import-route command cancels the configuration. By default, BGP does not import routes from other protocols. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "import-route { direct | static | { ospfv3 | isis | ripng } <process-id> } [ med <med> | route-policy <route-policy-name> ]",
        "undo import-route { direct | static | { ospfv3 | isis | ripng } <process-id> }"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "direct",
            "Info": "Configures the device to import direct routes.\n-"
        },
        {
            "Parameters": "static",
            "Info": "Imports static routes.\n-"
        },
        {
            "Parameters": "ospfv3",
            "Info": "Imports OSPFv3 routes.\n-"
        },
        {
            "Parameters": "isis",
            "Info": "Imports IS-IS routes.\n-"
        },
        {
            "Parameters": "ripng",
            "Info": "Configures BGP to import RIPng routes.\n-"
        },
        {
            "Parameters": "<process-id>",
            "Info": "Specifies the ID of a process for matching.\nThe value ranges from 1 to 4294967295."
        },
        {
            "Parameters": "med <med>",
            "Info": "Specifies a MED value for imported routes.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the route-policy used to filter routes and modify route attributes when these routes are imported from other protocols.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] import-route static"
        ]
    ],
    "ExtraInfo": "BGP can import routes using the import-route or network command."
}