{
    "PageTitle": "import-rib",
    "FuncDef": "The import-rib command imports public network BGP routes or BGP routes in a specified VPN instance into a BGP-VPN instance routing table.\nThe undo import-rib command cancels the configuration of importing public network BGP routes or BGP routes in a specified VPN instance into a BGP-VPN instance routing table. The import-rib command imports public network BGP routes or BGP routes in a specified VPN instance into a BGP-VPN instance routing table. The undo import-rib command cancels the configuration of importing public network BGP routes or BGP routes in a specified VPN instance into a BGP-VPN instance routing table. By default, a device does not import public network BGP routes or BGP routes in a VPN instance into a BGP-VPN instance routing table. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "import-rib { vpn-instance <vpn-instance-name> } [ valid-route ] [ route-policy <route-policy-name> ]",
        "undo import-rib { vpn-instance <vpn-instance-name> } [ valid-route ] [ route-policy <route-policy-name> ]"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "valid-route",
            "Info": "Imports valid routes of a specified type. Valid routes include optimal routes, routes for load balancing, FRR routes, and reachable routes that are not selected for packet forwarding. If this parameter is not specified, only optimal routes, load balancing routes, and FRR routes can be imported.\n-"
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a route-filter.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. Each value ranges from 1 to 200 characters."
        }
    ],
    "Examples": [
        [
            "<pe> system-view",
            "[~pe] ip vpn-instance vpna",
            "[*pe-vpn-instance-vpna] ipv6-family",
            "[*pe-vpn-instance-vpna-af-ipv6] quit",
            "[*pe-vpn-instance-vpna] quit",
            "[*pe] ip vpn-instance vpnb",
            "[*pe-vpn-instance-vpnb] ipv6-family",
            "[*pe-vpn-instance-vpnb-af-ipv6] quit",
            "[*pe-vpn-instance-vpnb] quit",
            "[*pe] bgp 100 instance a",
            "[*pe-bgp-instance-a] ipv6-family vpn-instance vpna",
            "[*pe-bgp-instance-a-6-vpna] import-rib vpn-instance vpnb valid-route"
        ]
    ],
    "ExtraInfo": "To configure a device to import public network BGP routes into a BGP-VPN instance IPv6 routing table, run the import-rib public command in the BGP-VPN instance IPv6 address family view.\nTo configure a device to import BGP routes from a specified VPN instance into a BGP-VPN instance IPv6 routing table, run the import-rib vpn-instance command in the BGP-VPN instance IPv6 address family view."
}