{
    "PageTitle": "import-rib (BGP-VPN instance IPv4 address family view)",
    "FuncDef": "The import-rib command imports public network BGP routes or BGP routes in a specified VPN instance into a BGP-VPN instance routing table.\nThe undo import-rib command cancels the configuration. The import-rib command imports public network BGP routes or BGP routes in a specified VPN instance into a BGP-VPN instance routing table. The undo import-rib command cancels the configuration. By default, a device does not import public network BGP routes or BGP routes in a VPN instance into a BGP-VPN instance routing table.",
    "CLIs": [
        "import-rib { public | [ instance <instance-name> ] vpn-instance <vpn-instance-name> } [ include-label-route ] [ valid-route ] [ route-policy <route-policy-name> ]",
        "undo import-rib { public | [ instance <instance-name> ] vpn-instance <vpn-instance-name> } [ include-label-route ] [ valid-route ] [ route-policy <route-policy-name> ]"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "public",
            "Info": "Imports routes from the public network BGP routing table.\n-"
        },
        {
            "Parameters": "instance <instance-name>",
            "Info": "Specifies the BGP multi-instance name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "include-label-route",
            "Info": "Includes labeled routes received from peers as well as leaked VPN routes.\n-"
        },
        {
            "Parameters": "valid-route",
            "Info": "Imports valid routes of a specified type. Valid routes include optimal routes, routes for load balancing, FRR routes, and reachable routes that are not selected for packet forwarding. If this parameter is not specified, only optimal routes, load balancing routes, and FRR routes can be imported.\n-"
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a route-policy.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] vpn-target 100:1 both",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpn1",
            "[*HUAWEI-bgp-vpn1] import-rib public valid-route"
        ]
    ],
    "ExtraInfo": "To configure a device to import public network BGP routes into a VPN instance routing table, run the import-rib public command in the BGP-VPN instance IPv4 address family view.\nTo configure a device to import BGP routes from a specified VPN instance into a VPN instance routing table, run the import-rib vpn-instance vpn-instance-name command in the BGP-VPN instance IPv4 address family view.\nTo import BGP routes from a specified VPN instance in the BGP multi-instance to the VPN routing table, run the import-rib instance instance-name vpn-instance vpn-instance-name command in the BGP-VPN instance IPv4 address family view."
}