{
    "PageTitle": "load-balancing (BGP-IPv4 unicast address family view)",
    "FuncDef": "The load-balancing as-path-ignore command configures a router not to compare the AS_Path attributes of routes that are to be used for load balancing.\nThe undo load-balancing as-path-ignore command cancels the configuration.\nThe load-balancing as-path-relax command configures BGP to compare only the AS_Path attribute lengths of the routes to be used for load balancing. Routes with different AS-Path attributes can form equal-cost routes as long as the AS-Path attribute lengths of the routes are the same.\nThe undo load-balancing as-path-relax command cancels the configuration. The load-balancing as-path-ignore command configures a router not to compare the AS_Path attributes of routes that are to be used for load balancing. The undo load-balancing as-path-ignore command cancels the configuration. The load-balancing as-path-relax command configures BGP to compare only the AS_Path attribute lengths of the routes to be used for load balancing. Routes with different AS-Path attributes can form equal-cost routes as long as the AS-Path attribute lengths of the routes are the same. The undo load-balancing as-path-relax command cancels the configuration. By default, a router compares the AS_Path attributes of the routes to be used for load balancing.",
    "CLIs": [
        "load-balancing { as-path-ignore | as-path-relax }",
        "undo load-balancing { as-path-ignore | as-path-relax }"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "as-path-ignore",
            "Info": "Ignores AS_Path attribute comparison.\n-"
        },
        {
            "Parameters": "as-path-relax",
            "Info": "Ignores the comparison of the AS_Path attributes with the same AS_Path length.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family unicast",
            "[*HUAWEI-bgp-af-ipv4] load-balancing as-path-relax"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family unicast",
            "[*HUAWEI-bgp-af-ipv4] load-balancing as-path-ignore"
        ]
    ],
    "ExtraInfo": "When load balancing is performed among routes, the device processes the AS_Path attribute as follows:"
}