{
    "PageTitle": "maximum load-balancing eibgp (BGP-VPN instance IPv4 address family view)",
    "FuncDef": "By default, the maximum number of EBGP and IBGP routes for load balancing is 1, and load balancing is not implemented.",
    "CLIs": [
        "maximum load-balancing eibgp <number>",
        "maximum load-balancing eibgp <number> ecmp-nexthop-changed",
        "undo maximum load-balancing eibgp"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<number>",
            "Info": "Specifies the maximum number of equal-cost EBGP and IBGP routes.\nThe value is an integer ranging from 1 to 128."
        },
        {
            "Parameters": "ecmp-nexthop-changed",
            "Info": "Configures the device to change the next hop addresses of only the routes that carry out load balancing to its address.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[~HUAWEI-vpn-instance-vpna] ipv4-family",
            "[~HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[~HUAWEI-vpn-instance-vpna] quit",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-vpna] maximum load-balancing eibgp 3"
        ]
    ],
    "ExtraInfo": "The maximum load-balancing eibgp command is mainly used in the scenario where a CE in a VPN is multi-homed to the same PE. In this case, you can set the number of EBGP and IBGP routes for load balancing in another VPN so that the route type (EBGP or IBGP) is not used as a judgment condition, in this manner, private network traffic can be load balanced among EBGP and IBGP routes.\nDescription:\nAfter the maximum load-balancing eibgp command is run, the changes the next hop addresses of the routes to be advertised to a local address, regardless of whether the routes are used for load balancing. However, in RR and BGP confederation scenarios, the device does not change the next hop of a non-local route to the local address.\nAfter the maximum load-balancing eibgp ecmp-nexthop-changed command is run, the device changes the next hop addresses of the routes to be advertised to a local address only when the routes are used for load balancing. When advertising routes that are not used for load balancing, the device does not process the next hops of the routes. That is, the original next hops of the routes are the same as the next hops of the routes that are not used for load balancing.\nIn Add-Path scenarios, the next hops of Add-Path routes to be advertised are processed in the same way as those of optimal routes, regardless of whether load balancing is implemented.\nAfter BGP load balancing is configured, the BGP routes that meet the following conditions and have the same AS_Path attribute become equal-cost routes for load balancing:"
}