{
    "PageTitle": "maximum load-balancing (BGP-IPv6 unicast address family view)",
    "FuncDef": "The maximum load-balancing command sets the maximum number of equal-cost routes for load balancing.\nThe undo maximum load-balancing command restores the default setting. The maximum load-balancing command sets the maximum number of equal-cost routes for load balancing. The undo maximum load-balancing command restores the default setting. By default, the maximum number of equal-cost routes for load balancing is 1, and load balancing is not implemented. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "maximum load-balancing <number>",
        "maximum load-balancing ebgp <ebgpNumber>",
        "maximum load-balancing ibgp <ibgpNumber>",
        "maximum load-balancing <number> ecmp-nexthop-changed",
        "maximum load-balancing ebgp <ebgpNumber> ecmp-nexthop-changed",
        "maximum load-balancing ibgp <ibgpNumber> ecmp-nexthop-changed",
        "undo maximum load-balancing",
        "undo maximum load-balancing ebgp",
        "undo maximum load-balancing ibgp"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<number>",
            "Info": "Specifies the maximum number of equal-cost routes for load balancing.\nThe value is an integer ranging from 1 to 128."
        },
        {
            "Parameters": "ebgp <ebgpNumber>",
            "Info": "Specifies the maximum number of equal-cost EBGP routes for load balancing.\nThe value is an integer ranging from 1 to 128."
        },
        {
            "Parameters": "ibgp <ibgpNumber>",
            "Info": "Specifies the maximum number of equal-cost IBGP routes for load balancing.\nThe value is an integer ranging from 1 to 128."
        },
        {
            "Parameters": "ecmp-nexthop-changed",
            "Info": "Configures the device to change the next hop addresses of only the routes that carry out load balancing to its address.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] maximum load-balancing 2"
        ]
    ],
    "ExtraInfo": "After this command is run, multiple BGP equal-cost routes will implement load balancing, improving network resource efficiency.\nAfter this command is run, the routes that meet the following conditions will become equal-cost routes and implement load balancing:"
}