{
    "PageTitle": "network (BGP view/BGP-IPv4 unicast address family view)",
    "FuncDef": "The network command imports routes to the BGP routing table and advertises them to peers.\nThe undo network command cancels the configuration. The network command imports routes to the BGP routing table and advertises them to peers. The undo network command cancels the configuration. By default, BGP does not import routes.",
    "CLIs": [
        "network { <ipv4-address> [ <mask> | <mask-length> ] } [ route-policy <route-policy-name> ]",
        "undo network { <ipv4-address> [ <mask> | <mask-length> ] }"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view,BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of a route to be imported by BGP.\nThe value is in the dotted decimal format."
        },
        {
            "Parameters": "<mask>",
            "Info": "Specifies an IP address mask. If no mask is specified, the IP address is considered as a classful address.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "<mask-length>",
            "Info": "Specifies the mask length of an IP address. If no mask length is specified, the IP address is considered as a classful address.\nThe value is an integer in the range from 0 to 32."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a route-policy that is used for route advertisement.\nThe value is a string of 1 to 200 case-sensitive characters. It cannot contain spaces. If spaces are used, the string must start and end with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] network 10.0.0.0 255.255.0.0"
        ]
    ],
    "ExtraInfo": "BGP itself cannot discover routes and needs to import routes discovered by other protocols, such as IGP routes or static routes, into the BGP routing table. These imported routes can be transmitted within an AS or between ASs. When importing routes, you can filter routes based on different routing protocols. When you need to statically add the routes in the local routing table to the BGP routing table and advertise the routes to the peer, run the network command.\nThe Origin attribute of the routes that are added to the BGP routing table through the network command is IGP.\nA route with the specified prefix and mask is added to the BGP routing table using the network command. This route is the optimal route selected from the routes of various routing protocols. The import-route command is used to add routes of a specified protocol, such as RIP routes, OSPF routes, IS-IS routes, static routes, or direct routes, to the BGP routing table.\nIf the same route is imported between different protocols, the loop prevention attribute of the route is lost, which may lead to routing loops. To prevent this problem, you are advised to specify a route-policy when importing routes."
}