{
    "PageTitle": "nexthop recursive-lookup route-policy (BGP-IPv6 unicast address family view)",
    "FuncDef": "The nexthop recursive-lookup route-policy command configures route-policy next hop recursion.\nThe undo nexthop recursive-lookup route-policy command disables route-policy next hop recursion. The nexthop recursive-lookup route-policy command configures route-policy next hop recursion. The undo nexthop recursive-lookup route-policy command disables route-policy next hop recursion. By default, route-policy-based next hop recursion is disabled. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "nexthop recursive-lookup route-policy <route-policy-name>",
        "undo nexthop recursive-lookup route-policy"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<route-policy-name>",
            "Info": "Specifies the name of a route-policy.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy aa permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] nexthop recursive-lookup route-policy aa"
        ]
    ],
    "ExtraInfo": "BGP needs route recursion in case of next hops. If route recursion is not limited, BGP routes may be incorrectly iterated, causing traffic loss. Therefore, next hops should perform recursion according to certain conditions.\nTo control route recursion based on a route-policy, run the nexthop recursive-lookup route-policy command. If a target recursive route is filtered out by the route-policy, the route is considered unreachable. In this manner, BGP route recursion will fail."
}