{
    "PageTitle": "nexthop recursive-lookup delay (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The nexthop recursive-lookup delay command configures a delay in responding to next hop recursion changes.\nThe undo nexthop recursive-lookup delay command cancels the configuration of the delay in responding to next hop recursion changes.\nThe nexthop recursive-lookup non-critical-event delay command configures a delay in responding to non-critical next hop recursion changes.\nThe undo nexthop recursive-lookup non-critical-event delay command cancels the configuration of the delay in responding to non-critical next hop recursion changes. The nexthop recursive-lookup delay command configures a delay in responding to next hop recursion changes. The undo nexthop recursive-lookup delay command cancels the configuration of the delay in responding to next hop recursion changes. The nexthop recursive-lookup non-critical-event delay command configures a delay in responding to non-critical next hop recursion changes. The undo nexthop recursive-lookup non-critical-event delay command cancels the configuration of the delay in responding to non-critical next hop recursion changes. By default, the delay in responding to non-critical next hop recursion changes is 10s, and the device does not delay responding to critical next hop recursion changes.",
    "CLIs": [
        "nexthop recursive-lookup delay [ <delay-time> ]",
        "nexthop recursive-lookup non-critical-event delay [ <nonCrit-delay-time> ]",
        "undo nexthop recursive-lookup delay",
        "undo nexthop recursive-lookup non-critical-event delay"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<delay-time>",
            "Info": "Specifies the delay in responding to recursion changes.\nThe value is an integer that ranges from 1 to 100, in seconds. The default value is 5 seconds."
        },
        {
            "Parameters": "<nonCrit-delay-time>",
            "Info": "Indicates the delay in responding to non-critical recursion changes.\nThe value is an integer ranging from 0 to 100, in seconds. The default value is 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-a-vpna] nexthop recursive-lookup non-critical-event delay 20"
        ]
    ],
    "ExtraInfo": "If the recursion result of BGP routes changes frequently, you can run the nexthop recursive-lookup delay command to configure BGP to respond to the recursion result change after a specified period of time. This reduces unnecessary route re-selection and re-advertisement. However, this affects network convergence. Therefore, recursion result changes are classified into two types:"
}