{
    "PageTitle": "nexthop recursive-lookup restrain disable (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The nexthop recursive-lookup restrain disable command disables BGP recursion suppression in case of next hop flapping.\nThe undo nexthop recursive-lookup restrain disable command enables BGP recursion suppression in case of next hop flapping. The nexthop recursive-lookup restrain disable command disables BGP recursion suppression in case of next hop flapping. The undo nexthop recursive-lookup restrain disable command enables BGP recursion suppression in case of next hop flapping. By default, BGP recursion suppression in case of next hop flapping is enabled.",
    "CLIs": [
        "nexthop recursive-lookup restrain disable",
        "undo nexthop recursive-lookup restrain disable"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpn1",
            "[*HUAWEI-bgp-vpn1] nexthop recursive-lookup restrain disable"
        ]
    ],
    "ExtraInfo": "If a large number of routes are recursed to the same next hop and the next hop flaps frequently, the system frequently processes the changes of these routes, consuming a large number of resources and causing high CPU usage. To address this problem, recursion suppression in case of next hop flapping is enabled by default. This function slows down route processing, saves system resources, and reduces CPU usage.\nIf you do not want to slow down recursion processing or do not care about the high CPU usage caused by recursion change processing, run the nexthop recursive-lookup restrain disable command to disable recursion suppression in case of next hop flapping."
}