{
    "PageTitle": "nexthop recursive-lookup restrain (BGP view)",
    "FuncDef": "The nexthop recursive-lookup restrain command configures the intervals for increasing, retaining, and clearing the penalty value for BGP recursion suppression in case of next hop flapping.\nThe undo nexthop recursive-lookup restrain command restores the default configuration. The nexthop recursive-lookup restrain command configures the intervals for increasing, retaining, and clearing the penalty value for BGP recursion suppression in case of next hop flapping. The undo nexthop recursive-lookup restrain command restores the default configuration. By default, the intervals for increasing, retaining, and clearing the penalty value for BGP recursion suppression in case of next hop flapping are 60s, 120s, and 600s, respectively.",
    "CLIs": [
        "nexthop recursive-lookup restrain suppress-interval <add-count-time> hold-interval <hold-count-time> clear-interval <clear-count-time>",
        "undo nexthop recursive-lookup restrain suppress-interval hold-interval clear-interval"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "hold-interval <hold-count-time>",
            "Info": "Specifies the interval for retaining the penalty value for recursion suppression.\nThe value is an integer ranging from 1 to 65535, in seconds. The default values is recommended."
        },
        {
            "Parameters": "clear-interval <clear-count-time>",
            "Info": "Specifies the interval for clearing the penalty value for recursion suppression.\nThe value is an integer ranging from 1 to 65535, in seconds. The default values is recommended."
        },
        {
            "Parameters": "suppress-interval <add-count-time>",
            "Info": "Specifies the interval for increasing the penalty value for recursion suppression.\nThe value is an integer ranging from 1 to 65535, in seconds. The default value is recommended."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] nexthop recursive-lookup restrain suppress-interval 30 hold-interval 60 clear-interval 120"
        ]
    ],
    "ExtraInfo": ""
}