{
    "PageTitle": "peer ip-prefix export (BGP-IPv4 unicast address family view) (group)",
    "FuncDef": "The peer ip-prefix export command configures a policy based on an IP prefix list for filtering BGP routes to be advertised to a specified peer group.\nThe undo peer ip-prefix export command cancels this configuration. The peer ip-prefix export command configures a policy based on an IP prefix list for filtering BGP routes to be advertised to a specified peer group. The undo peer ip-prefix export command cancels this configuration. By default, no route filtering policy based on an IP address prefix list is configured for a peer group.",
    "CLIs": [
        "peer <group-name> ip-prefix <ip-prefix-name> export",
        "undo peer <group-name> ip-prefix [ <ip-prefix-name> ] export"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "ip-prefix <ip-prefix-name>",
            "Info": "Specifies the name of an IP address prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "export",
            "Info": "Applies a route-filter to the routes to be advertised to a specified peer group.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix prefix1 permit 10.1.1.1 8 greater-equal 17 less-equal 18",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test",
            "[*HUAWEI-bgp] ipv4-family unicast",
            "[*HUAWEI-bgp-af-ipv4] peer test ip-prefix prefix1 export"
        ]
    ],
    "ExtraInfo": "The peer ip-prefix export command can be used to configure a route filtering policy that is based on an IP prefix list for filtering BGP routes to be advertised to a specified peer group, implementing route control."
}