{
    "PageTitle": "peer enable(BGP-IPv4 unicast address family view) (IPv6)",
    "FuncDef": "The peer enable command enables a BGP device to exchange routes with a specified peer group in the address family view.\nThe undo peer enable command disables a BGP device from exchanging routes with a specified peer group. The peer enable command enables a BGP device to exchange routes with a specified peer group in the address family view. The undo peer enable command disables a BGP device from exchanging routes with a specified peer group. By default, route exchange with a specified peer is enabled only in the BGP-IPv4 unicast address family. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <peerIpv6Addr> enable",
        "undo peer <peerIpv6Addr> enable"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerIpv6Addr>",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 2001:DB8:1::1 as-number 100",
            "[*HUAWEI-bgp] ipv4-family unicast",
            "[*HUAWEI-bgp-af-ipv4] peer 2001:DB8:1::1 enable"
        ]
    ],
    "ExtraInfo": "By default, only peer groups in the BGP-IPv4 unicast address family are automatically enabled to exchange routing information. In other words, after the peer as-number command is run in the BGP view, the system automatically configures the peer enable command. In other address family views, however, this function must be manually enabled."
}