{
    "PageTitle": "peer listen-as-segment(BGP multi-instance view)",
    "FuncDef": "The peer listen-as-segment command specifies a peer AS range from which a dynamic EBGP peer group listens for BGP connection requests.\nThe undo peer listen-as-segment command deletes the specified peer AS range from which a dynamic EBGP peer group listens for BGP connection requests. The peer listen-as-segment command specifies a peer AS range from which a dynamic EBGP peer group listens for BGP connection requests. The undo peer listen-as-segment command deletes the specified peer AS range from which a dynamic EBGP peer group listens for BGP connection requests. By default, no peer AS range from which a dynamic EBGP peer group listens for BGP connection requests is specified.",
    "CLIs": [
        "peer <peerGroupName> listen-as-segmentbegin-as <begin-asn> end-as <end-asn>",
        "undo peer <peerGroupName> listen-as-segmentbegin-as <begin-asn> end-as <end-asn>"
    ],
    "ParentView": [
        "BGP multi-instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerGroupName>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported. If the string is enclosed in double quotation marks (\"), spaces are allowed in the string."
        },
        {
            "Parameters": "begin-as <begin-asn>",
            "Info": "Specifies the start AS number in an AS range.\nFor an integral AS number, the value is an integer ranging from 1 to 4294967295.\nFor an AS number in dotted notation, the value is in the format of x.y, where x and y are integers ranging from 1 to 65535 and from 0 to 65535, respectively."
        },
        {
            "Parameters": "end-as <end-asn>",
            "Info": "Specifies the end AS number in an AS range.\nFor an integral AS number, the value is an integer ranging from 1 to 4294967295.\nFor an AS number in dotted notation, the value is in the format of x.y, where x and y are integers ranging from 1 to 65535 and from 0 to 65535, respectively."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] group ex listen external",
            "[*HUAWEI-bgp-instance-a] peer ex listen-as-segment begin-as 200 end-as 300"
        ]
    ],
    "ExtraInfo": "To specify a peer AS range from which a dynamic EBGP peer group listens for BGP connection requests, run the peer listen-as-segment command. The dynamic BGP peer function enables BGP to listen for BGP connection requests from a specified network segment, dynamically establish BGP peer relationships, and add these peers to the same dynamic peer group. This spares you from adding or deleting BGP peer configurations in response to each change in BGP peers."
}