{
    "PageTitle": "peer public-as-only import (BGP view) (group)",
    "FuncDef": "The peer public-as-only import command enables a device to remove private AS numbers from the AS_Path list in received BGP Update messages.\nThe undo peer public-as-only import command allows a device to accept BGP Update messages in which the AS_Path list carries private AS numbers. The peer public-as-only import command enables a device to remove private AS numbers from the AS_Path list in received BGP Update messages. The undo peer public-as-only import command allows a device to accept BGP Update messages in which the AS_Path list carries private AS numbers. By default, a device does not remove private AS numbers from the AS_Path list when receiving BGP Update messages.",
    "CLIs": [
        "peer <peerGroupName> public-as-onlyimport [ force ]",
        "undo peer <peerGroupName> public-as-onlyimport [ force ]"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerGroupName>",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "force",
            "Info": "Deletes all private AS numbers from the AS_Path attribute.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test",
            "[*HUAWEI-bgp] peer test as-number 100",
            "[*HUAWEI-bgp] peer test public-as-only import"
        ]
    ],
    "ExtraInfo": "Generally, AS numbers range from 1 to 4294967295, including the public, private, and reserved AS numbers. If the private-4-byte-as enable command is not run, private AS numbers range from 64512 to 65534, and the AS number 65535 is reserved for special use. If the private-4-byte-as enable command is run, private AS numbers range from 64512 to 65534 and from 4200000000 to 4294967294, and the AS numbers 65535 and 4294967295 are reserved for special use.\nPublic AS numbers can be used over the Internet, whereas private AS numbers cannot be advertised to the Internet. If private AS numbers are advertised to the Internet, routing loops may occur. Therefore, private AS numbers are used only within a routing domain.\nThis command enables BGP to process the private and reserved AS numbers in the AS_Path attribute of BGP routes as required. Reserved AS numbers are processed the same as private AS numbers. The following uses private AS numbers as an example to illustrate the processing modes:\nIf the peer public-as-only import command is run without any optional parameter specified and the AS_Path attribute of BGP routes contains only private AS numbers, BGP deletes these private AS numbers and then accepts update messages. If the AS_Path contains both public and private AS numbers, BGP does not delete the private AS numbers. If private AS numbers are deleted in this case, a forwarding error may occur. To forcibly delete private AS numbers from the AS_Path, configure force."
}