{
    "PageTitle": "peer advertise hierarchy-convergence (BGP view)",
    "FuncDef": "The peer advertise hierarchy-convergence enable command enables a BGP device to advertise the hierarchical convergence attribute to a peer.\nThe undo peer advertise hierarchy-convergence enable command cancels the configuration of enabling a BGP device to advertise the hierarchical convergence attribute to a peer.\nThe peer advertise hierarchy-convergence disable command disables a BGP device from advertising the hierarchical convergence attribute to a peer.\nThe undo peer advertise hierarchy-convergence disable command cancels the configuration of disabling a BGP device from advertising the hierarchical convergence attribute to a peer. The peer advertise hierarchy-convergence enable command enables a BGP device to advertise the hierarchical convergence attribute to a peer. The undo peer advertise hierarchy-convergence enable command cancels the configuration of enabling a BGP device to advertise the hierarchical convergence attribute to a peer. The peer advertise hierarchy-convergence disable command disables a BGP device from advertising the hierarchical convergence attribute to a peer. The undo peer advertise hierarchy-convergence disable command cancels the configuration of disabling a BGP device from advertising the hierarchical convergence attribute to a peer. By default, a BGP device is enabled to advertise the hierarchical convergence attribute to a peer.",
    "CLIs": [
        "peer <ip-address> advertisehierarchy-convergence { enable | disable }",
        "undo peer <ip-address> advertisehierarchy-convergence { enable | disable }"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies the IPv4 address of a peer.\nIt is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 advertise hierarchy-convergence enable"
        ]
    ],
    "ExtraInfo": "To control whether a device advertises the hierarchical convergence attribute to a peer, run the peer advertise hierarchy-convergence command."
}