{
    "PageTitle": "peer filter-policy import (BGP-VPN instance IPv6 address family view) (IPv6)",
    "FuncDef": "The peer filter-policy import command configures an ACL-based policy for filtering BGP routes received from a specified peer.\nThe undo peer filter-policy import command cancels this configuration. The peer filter-policy import command configures an ACL-based policy for filtering BGP routes received from a specified peer. The undo peer filter-policy import command cancels this configuration. By default, no filtering policy is configured for the routes received from peers. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <ipv6-address> filter-policy <acl-number> import",
        "peer <ipv6-address> filter-policyacl6-name <acl6-name> import",
        "undo peer <ipv6-address> filter-policy <acl-number> import",
        "undo peer <ipv6-address> filter-policyacl6-name <acl6-name> import"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view,BGP multi-instance VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X"
        },
        {
            "Parameters": "<acl-number>",
            "Info": "Specifies the number of the basic ACL.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "import",
            "Info": "Filters received routes.\n-"
        },
        {
            "Parameters": "acl6-name <acl6-name>",
            "Info": "Specifies the name of a basic named ACL6.\nThe value is a string of 1 to 64 case-sensitive characters starting with a letter. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 2001",
            "[*HUAWEI-acl6-basic-2001] rule permit",
            "[*HUAWEI-acl6-basic-2001] quit",
            "[*HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv6-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpna",
            "[*HUAWEI-bgp-6-vpna] peer 2001:db8::3:4 as-number 100",
            "[*HUAWEI-bgp-6-vpna] peer 2001:db8::3:4 filter-policy 2001 import"
        ]
    ],
    "ExtraInfo": "If you do not want to receive all routes from a peer, you can run the peer filter-policy import command to configure an ACL-based filtering policy to filter the routes received from the peer."
}