{
    "PageTitle": "peer check-first-as (BGP view) (group)",
    "FuncDef": "The peer check-first-as enable command enables a device to check the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer group.\nThe peer check-first-as disable command disables a device from checking the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer group.\nThe undo peer check-first-as enable command disables a device from checking the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer group.\nThe undo peer check-first-as disable command enables a device to check the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer group. The peer check-first-as enable command enables a device to check the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer group. The peer check-first-as disable command disables a device from checking the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer group. The undo peer check-first-as enable command disables a device from checking the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer group. The undo peer check-first-as disable command enables a device to check the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer group. By default, a device checks the first AS number in the AS_Path attribute contained in the update messages received from all EBGP peers or peer groups.",
    "CLIs": [
        "peer <group-name> check-first-asenable",
        "peer <group-name> check-first-asdisable",
        "undo peer <group-name> check-first-asenable",
        "undo peer <group-name> check-first-asdisable"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test external",
            "[*HUAWEI-bgp] peer test as-number 200",
            "[*HUAWEI-bgp] peer test check-first-as enable"
        ]
    ],
    "ExtraInfo": "If the peer check-first-as enable command is run, BGP checks whether the first AS number in the AS_Path carried in the Update messages sent by a specified EBGP peer group is the same as the AS where the EBGP peer group resides. If the two AS numbers are different, the update information is rejected. If the peer check-first-as disable command is run, BGP does not check the first AS number in the AS_Path carried in the Update messages sent by a specified EBGP peer group. That is, BGP accepts the Update messages even if the first AS number is not the AS number of the EBGP peer group. This undo command deletes the configurations of a specified EBGP peer group and restores the default settings.\nThe check on the first AS number in the AS_Path attribute of each received Update message can be configured for a specified EBGP peer, the peer group that the EBGP peer belongs to, or the entire BGP process. The configuration takes effect in descending order of priority as follows: EBGP peer > peer group > entire BGP process."
}