{
    "PageTitle": "peer ssl-policy (BGP view)",
    "FuncDef": "The peer ssl-policy name command applies an SSL policy to an SSL client or server.\nThe peer ssl-policy disable command disables an SSL policy applied to an SSL client or server.\nThe undo peer ssl-policy name command cancels the configuration of applying an SSL policy to an SSL client or server.\nThe undo peer ssl-policy disable command restores the default configuration and takes effect only when the peer ssl-policy disable command is run. The peer ssl-policy name command applies an SSL policy to an SSL client or server. The peer ssl-policy disable command disables an SSL policy applied to an SSL client or server. The undo peer ssl-policy name command cancels the configuration of applying an SSL policy to an SSL client or server. The undo peer ssl-policy disable command restores the default configuration and takes effect only when the peer ssl-policy disable command is run. By default, no SSL policy is applied to an SSL client or server.",
    "CLIs": [
        "peer { <ipv4-address> | <ipv6-address> } ssl-policyname <ssl-policy-name>",
        "peer { <ipv4-address> | <ipv6-address> } ssl-policydisable",
        "undo peer { <ipv4-address> | <ipv6-address> } ssl-policyname <ssl-policy-name>",
        "undo peer { <ipv4-address> | <ipv6-address> } ssl-policydisable",
        "peer <ipv4-address> ssl-policyname <ssl-policy-name>",
        "peer <ipv4-address> ssl-policydisable",
        "undo peer <ipv4-address> ssl-policyname <ssl-policy-name>",
        "undo peer <ipv4-address> ssl-policydisable"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies an IPv4 peer address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a peer.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "name <ssl-policy-name>",
            "Info": "Specifies the name of an SSL policy.\nThe value is a string of 1 to 23 case-insensitive characters. The value does not contain spaces."
        },
        {
            "Parameters": "disable",
            "Info": "Disables an SSL policy applied to an SSL client or server.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy ftps_der",
            "[*HUAWEI-ssl-policy-ftps_der] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 ssl-policy name ftps_der"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy ftps_der",
            "[*HUAWEI-ssl-policy-ftps_der] pki-domain default",
            "[*HUAWEI-ssl-policy-ftps_der] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 ssl-policy name ftps_der",
            "Warning: The SSL policy is bound to the default PKI domain, Continue? [Y/N]:y"
        ]
    ],
    "ExtraInfo": ""
}