{
    "PageTitle": "peer description(BGP-VPN instance view)(IPv6)",
    "FuncDef": "The peer description command configures a description for a peer.\nThe undo peer description command deletes the description of a peer. The peer description command configures a description for a peer. The undo peer description command deletes the description of a peer. By default, no description is configured for a peer. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <ipv6-address> description <description-text>",
        "undo peer <ipv6-address> description"
    ],
    "ParentView": [
        "BGP-VPN instance view,BGP multi-instance VPN instance session view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<description-text>",
            "Info": "Specifies a description.\nThe value is a string of 1 to 255 characters. Letters, digits, and spaces are supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-vpn1] peer 2001:DB8:1::1 as-number 200",
            "[*HUAWEI-bgp-instance-vpn1] peer 2001:DB8:1::1 description abc"
        ]
    ],
    "ExtraInfo": "The peer description can be used to configure a description for a peer, which facilitates management of peers or peer groups. The description records information about the peer, such as the VPN instance to which the peer belongs, and devices that establish peer relationships with the peer."
}