{
    "PageTitle": "peer timer connect-retry (BGP multi-instance view)",
    "FuncDef": "The peer timer connect-retry command sets a ConnectRetry interval for a peer.\nThe undo peer timer connect-retry command restores the default setting. The peer timer connect-retry command sets a ConnectRetry interval for a peer. The undo peer timer connect-retry command restores the default setting. By default, the ConnectRetry interval is 32s.",
    "CLIs": [
        "peer { <ipv4-address> | <ipv6-address> } timerconnect-retry <connect-retry-time>",
        "undo peer { <ipv4-address> | <ipv6-address> } timerconnect-retry",
        "peer <ipv4-address> timerconnect-retry <connect-retry-time>",
        "undo peer <ipv4-address> timerconnect-retry"
    ],
    "ParentView": [
        "BGP multi-instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "<connect-retry-time>",
            "Info": "Specifies a ConnectRetry interval.\nThe value ranges from 1 to 65535, in seconds."
        },
        {
            "Parameters": "peer <ipv4-address>",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "peer <ipv6-address>",
            "Info": "Specifies an IPv6 peer address.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] peer 10.2.2.2 as-number 200",
            "[*HUAWEI-bgp-instance-a] peer 10.2.2.2 timer connect-retry 60"
        ]
    ],
    "ExtraInfo": "When BGP initiates a TCP connection, the ConnectRetry timer is stopped if the TCP connection is established successfully. If the attempt to establish a TCP connection fails, BGP tries again to establish the TCP connection after the ConnectRetry timer expires. The ConnectRetry interval can be adjusted as needed."
}