{
    "PageTitle": "peer as-path-filter import (BGP-IPv4 unicast address family view) (group)",
    "FuncDef": "The peer as-path-filter import command configures a BGP route filtering policy based on the AS_Path for the routes received from a peer group.\nThe undo peer as-path-filter import command cancels the existing configuration. The peer as-path-filter import command configures a BGP route filtering policy based on the AS_Path for the routes received from a peer group. The undo peer as-path-filter import command cancels the existing configuration. By default, no policy based on an AS_Path list is configured for filtering BGP routes received from peers in a peer group, and all the received BGP routes will be permitted.",
    "CLIs": [
        "peer <group-name> as-path-filter { <number> | <name> } import",
        "undo peer <group-name> as-path-filter { <number> | <name> } import"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported.  The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "<number>",
            "Info": "Specifies the number of the AS_Path filter.\nThe value is an integer ranging from 1 to 256."
        },
        {
            "Parameters": "<name>",
            "Info": "Specifies the name of an AS_Path filter.\nThe value is a string of 1 to 51 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip as-path-filter 3 permit ^10_",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test",
            "[*HUAWEI-bgp] ipv4-family unicast",
            "[*HUAWEI-bgp-af-ipv4] peer test as-path-filter 3 import"
        ]
    ],
    "ExtraInfo": "When the peer as-path-filter import command is run to apply a routing policy to BGP routes received from a specified peer group, the AS_Path filter filters out unqualified routes."
}