{
    "PageTitle": "peer public-as-only import (BGP-IPv6 unicast address family view) (IPv6)",
    "FuncDef": "The peer public-as-only import command enables a device to remove private AS numbers from the AS_Path list in received BGP Update messages.\nThe undo peer public-as-only import command allows a device to accept BGP Update messages in which the AS_Path list carries private AS numbers. The peer public-as-only import command enables a device to remove private AS numbers from the AS_Path list in received BGP Update messages. The undo peer public-as-only import command allows a device to accept BGP Update messages in which the AS_Path list carries private AS numbers. By default, a device does not remove private AS numbers from the AS_Path list when receiving BGP Update messages. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <peerIpv6Addr> public-as-onlyimport [ force ]",
        "peer <peerIpv6Addr> public-as-onlyimportdisable",
        "undo peer <peerIpv6Addr> public-as-onlyimport [ force ]",
        "undo peer <peerIpv6Addr> public-as-onlyimportdisable"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerIpv6Addr>",
            "Info": "Specifies the IPv6 address of a peer.\nThe address is in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "force",
            "Info": "Deletes all private AS numbers from the AS_Path attribute.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Disables a device from removing the private AS numbers from the AS_Path list in received BGP Update messages.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 2001:DB8:1::1 as-number 100",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] peer 2001:DB8:1::1 enable",
            "[*HUAWEI-bgp-af-ipv6] peer 2001:DB8:1::1 public-as-only import"
        ]
    ],
    "ExtraInfo": ""
}