{
    "PageTitle": "peer filter-policy export  (BGP view/BGP-IPv4 unicast address family view) (group)",
    "FuncDef": "The peer filter-policy export command configures an ACL-based policy for filtering BGP routes to be advertised to a specified peer group.\nThe undo peer filter-policy export command cancels this configuration. The peer filter-policy export command configures an ACL-based policy for filtering BGP routes to be advertised to a specified peer group. The undo peer filter-policy export command cancels this configuration. By default, no filtering policy is configured for the routes to be advertised to a peer group.",
    "CLIs": [
        "peer <group-name> filter-policy <acl-number> export",
        "peer <group-name> filter-policyacl-name <acl-name> export",
        "undo peer <group-name> filter-policy <acl-number> export",
        "undo peer <group-name> filter-policyacl-name <acl-name> export"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view,BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a BGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "<acl-number>",
            "Info": "Specifies the number of a basic ACL.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "export",
            "Info": "Filters routes to be advertised.\n-"
        },
        {
            "Parameters": "acl-name <acl-name>",
            "Info": "Specifies the name of a named basic ACL.\nThe value is a string of 1 to 64 case-sensitive characters starting with a letter. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl 2001",
            "[*HUAWEI-acl4-basic-2001] rule permit",
            "[*HUAWEI-acl4-basic-2001] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test external",
            "[*HUAWEI-bgp] peer test as-number 200",
            "[*HUAWEI-bgp] peer test filter-policy 2001 export"
        ]
    ],
    "ExtraInfo": "If you do not want all routes to be advertised to a peer group, you can run the peer filter-policy export command to configure an ACL-based filtering policy to filter the routes to be advertised to the peer group."
}