{
    "PageTitle": "peer local-as (BGP-VPN instance IPv6 address family view) (group)",
    "FuncDef": "The peer local-as command enables a device to use a fake AS number to establish a BGP peer relationship with a specified peer.\nThe undo peer local-as command cancels the existing configuration. The peer local-as command enables a device to use a fake AS number to establish a BGP peer relationship with a specified peer. The undo peer local-as command cancels the existing configuration. By default, a device uses an actual AS number to establish a BGP peer relationship with a peer. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <group-name> local-as <local-as-value> [ dual-as ] [ prepend-global-as ] [ prepend-local-as ]",
        "undo peer <group-name> local-as"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view,BGP multi-instance VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "<local-as-value>",
            "Info": "Specifies a destination AS number.\nFor an AS number in integer format, the value ranges from 1 to 4294967295.\nFor an AS number in dotted notation, it is in the format of x.y, in which x and y are integers, with x ranging from 1 to 65535 and y ranging from 0 to 65535."
        },
        {
            "Parameters": "dual-as",
            "Info": "Allows the local end to use either the real AS number or the fake AS number to establish a connection with the peer end.\n-"
        },
        {
            "Parameters": "prepend-global-as",
            "Info": "Indicates that the actual AS number is added to packets to be sent.\n-"
        },
        {
            "Parameters": "prepend-local-as",
            "Info": "Adds the fake AS number to the AS_Path list in received BGP messages.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpn1",
            "[*HUAWEI-bgp-6-vpn1] group test external",
            "[*HUAWEI-bgp-6-vpn1] peer test local-as 99"
        ]
    ],
    "ExtraInfo": "If the peer local-as command is run, without dual-as, prepend-global-as, or prepend-local-as specified, the local end uses only the fake AS number to establish a BGP peer relationship with the specified peer and adds only the fake AS number to the AS_Path of the routes to be advertised to the peer.\nThe peer local-as command is used in a scenario where a carrier modifies network deployment. For example, in a carrier merger and acquisition scenario, if the acquirer's network and the acquiree's network belong to different ASs, BGP peers on the acquiree's network need to be shifted from their original AS to the AS of the acquirer's AS. If the customers of the acquiree do not want their BGP configurations to be changed or do not want them to be changed immediately during the shift, BGP peer relationships may be interrupted for a long time.\nIf a device uses a fake AS number to establish a BGP peer relationship with an EBGP peer or confederation EBGP peer, it performs the following actions before sending routes to the EBGP peer or confederation EBGP peer:"
}