{
    "PageTitle": "peer route-policy import (BGP-MVPN address family view) (group)",
    "FuncDef": "The peer route-policy import command specifies a route-policy for routes received from a peer group.\nThe undo peer route-policy import command deletes a specified route-policy. The peer route-policy import command specifies a route-policy for routes received from a peer group. The undo peer route-policy import command deletes a specified route-policy. By default, no route-policy is specified for a peer group. That is, no route-policy is applied to the routes to be received from peers.",
    "CLIs": [
        "peer <group-name> route-policy <route-policy-name> import",
        "undo peer <group-name> route-policy <route-policy-name> import"
    ],
    "ParentView": [
        "BGP-MVPN address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "<route-policy-name>",
            "Info": "Specifies a route-policy.\nThe value is a string of 1 to 200 case-sensitive characters without spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy test-policy permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test internal",
            "[*HUAWEI-bgp] ipv4-family mvpn",
            "[*HUAWEI-bgp-af-mvpn] peer test enable",
            "[*HUAWEI-bgp-af-mvpn] peer test route-policy test-policy import"
        ]
    ],
    "ExtraInfo": "After a route-policy is created, the peer route-policy import command is used to apply a Route-Policy to a peer group so that the routes received from a peer group can be controlled. To be specific, only the necessary routes are received from the peer group. In this manner, route management is implemented, the scale of the routing table is reduced, and fewer network resources are consumed."
}