{
    "PageTitle": "peer capability-advertise orf ip-prefix (BGP-IPv4 unicast address family view) (group)",
    "FuncDef": "The peer capability-advertise orf ip-prefix command configures a BGP device to advertise the prefix-based ORF capability to its peer group.\nThe undo peer capability-advertise orf ip-prefix command cancels the configuration. The peer capability-advertise orf ip-prefix command configures a BGP device to advertise the prefix-based ORF capability to its peer group. The undo peer capability-advertise orf ip-prefix command cancels the configuration. By default, a BGP device is not configured to advertise the prefix-based ORF capability to its peer group.",
    "CLIs": [
        "peer <group-name> capability-advertiseorfip-prefix { both | receive | send }",
        "peer <group-name> capability-advertiseorfnon-standard-compatibleip-prefix { both | receive | send }",
        "undo peer <group-name> capability-advertiseorfip-prefix { both | receive | send }",
        "undo peer <group-name> capability-advertiseorfnon-standard-compatibleip-prefix { both | receive | send }"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view,BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported.  The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "both",
            "Info": "Allows the device to send and receive ORF messages.\n-"
        },
        {
            "Parameters": "receive",
            "Info": "Allows the device only to receive ORF messages.\n-"
        },
        {
            "Parameters": "send",
            "Info": "Allows the device only to send ORF messages.\n-"
        },
        {
            "Parameters": "non-standard-compatible",
            "Info": "Indicates that the device is compatible with the devices of other vendors.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test external",
            "[*HUAWEI-bgp] peer test capability-advertise orf ip-prefix both"
        ]
    ],
    "ExtraInfo": "The outbound route filtering (ORF) function uses the import policy of the peer as the export policy of the local end to filter the routes to be sent. The routes that do not comply with the import policy of the peer are not sent to the peer.\nUsers want the carrier to send only the required routes, but the carrier does not want to maintain different export policies for each user. Against this backdrop, the ORF feature can meet the requirements of customers and carriers. ORF supports on-demand route advertisement, which reduces bandwidth consumption and configuration workload."
}