{
    "PageTitle": "peer default-route-advertise(BGP-IPv6 unicast address family view)(group)",
    "FuncDef": "The peer default-route-advertise command configures a device to advertise default routes to a peer group.\nThe undo peer default-route-advertise command restores the default configuration. The peer default-route-advertise command configures a device to advertise default routes to a peer group. The undo peer default-route-advertise command restores the default configuration. By default, a device does not advertise default routes to a peer group. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <group-name> default-route-advertise [ route-policy <route-policy-name> ]",
        "peer <group-name> default-route-advertise [ route-policy <route-policy-name> ] { conditional-route-match-all | conditional-route-match-any } { <ipv6-address> <mask-length> } &<1-4>",
        "undo peer <group-name> default-route-advertise"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a routing policy.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "conditional-route-match-all",
            "Info": "Configures the device to send the default route when all conditional routes are matched.\n-"
        },
        {
            "Parameters": "conditional-route-match-any",
            "Info": "Configures the device to send the default route when any conditional route is matched.\n-"
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a conditional route.\nThe value is in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<mask-length>",
            "Info": "Specifies the IPv6 mask length of a conditional route.\nIt is an integer ranging from 0 to 128."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test external",
            "[*HUAWEI-bgp] peer test as-number 200",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] peer test enable",
            "[*HUAWEI-bgp-af-ipv6] peer test default-route-advertise"
        ]
    ],
    "ExtraInfo": "Default routes are usually used on networks with the following characteristics:"
}