{
    "PageTitle": "peer route-update-interval (BGP-VPN-Target address family view)",
    "FuncDef": "The peer route-update-interval command sets the interval for sending Update messages with the same route prefix to a peer.\nThe undo peer route-update-interval command restores the default configuration. The peer route-update-interval command sets the interval for sending Update messages with the same route prefix to a peer. The undo peer route-update-interval command restores the default configuration. By default, the interval at which routing updates are sent to IBGP peers is 15s, and the interval at which routing updates are sent to EBGP peers is 30s.",
    "CLIs": [
        "peer { <ipv4-address> | <ipv6-address> } route-update-interval <interval>",
        "undo peer { <ipv4-address> | <ipv6-address> } route-update-interval",
        "peer <ipv4-address> route-update-interval <interval>",
        "undo peer <ipv4-address> route-update-interval"
    ],
    "ParentView": [
        "BGP-VPN-target address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of a peer.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies an IPv6 peer address.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<interval>",
            "Info": "Specifies the minimum interval at which routing updates are sent.\nThe value is an integer ranging from 0 to 600, in seconds. The value 0 indicates that the device immediately sends BGP Update messages to notify its peers of route changes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 200",
            "[*HUAWEI-bgp] ipv4-family vpn-target",
            "[*HUAWEI-bgp-af-vpn-target] peer 10.1.1.1 enable",
            "[*HUAWEI-bgp-af-vpn-target] peer 10.1.1.1 route-update-interval 10"
        ]
    ],
    "ExtraInfo": "When routes change, the device sends routing updates to notify its peers. If a route changes frequently, the peer route-update-interval command can be used to adjust the interval at which Update packets are sent for changes of this route. This frees the device from sending Update packets for every route change."
}