{
    "PageTitle": "peer advertise-large-community (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The peer advertise-large-community command enables a device to advertise the Large-Community attribute to a peer.\nThe undo peer advertise-large-community command cancels the existing configuration. The peer advertise-large-community command enables a device to advertise the Large-Community attribute to a peer. The undo peer advertise-large-community command cancels the existing configuration. By default, a device does not advertise the Large-Community attribute to its peer.",
    "CLIs": [
        "peer <ipv4-address> advertise-large-community [ disable ]",
        "undo peer <ipv4-address> advertise-large-community [ disable ]"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies an IPv4 peer address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "disable",
            "Info": "Disables the function.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-a-vpna] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp-instance-a-vpna] peer 10.1.1.1 advertise-large-community"
        ]
    ],
    "ExtraInfo": "To enable a device to advertise the Large-Community attribute to its BGP peer or peer group, run the peer advertise-large-community command. If the Large-Community attribute is advertised to a peer group, all the peer members in the group inherit this configuration. This simplifies the application of route-policies and facilitates route maintenance and management."
}