{
    "PageTitle": "peer ssl-policy role",
    "FuncDef": "The peer ssl-policy role client command configures a peer as an SSL client.\nThe undo peer ssl-policy role client command cancels the SSL client configuration.\nThe peer ssl-policy role server command configures a peer as an SSL server.\nThe undo peer ssl-policy role server command cancels the SSL server configuration.\nThe peer ssl-policy role disable command disables SSL role setting for a peer.\nThe undo peer ssl-policy role disable command restores the default configuration and takes effect only when the peer ssl-policy role disable command is run. The peer ssl-policy role client command configures a peer as an SSL client. The undo peer ssl-policy role client command cancels the SSL client configuration. The peer ssl-policy role server command configures a peer as an SSL server. The undo peer ssl-policy role server command cancels the SSL server configuration. The peer ssl-policy role disable command disables SSL role setting for a peer. The undo peer ssl-policy role disable command restores the default configuration and takes effect only when the peer ssl-policy role disable command is run. By default, no peer is configured as an SSL client or server.",
    "CLIs": [
        "peer { <ipv4-address> | <ipv6-address> } ssl-policyroleserver",
        "peer { <ipv4-address> | <ipv6-address> } ssl-policyroleclient",
        "peer { <ipv4-address> | <ipv6-address> } ssl-policyroledisable",
        "undo peer { <ipv4-address> | <ipv6-address> } ssl-policyroleserver",
        "undo peer { <ipv4-address> | <ipv6-address> } ssl-policyroleclient",
        "undo peer { <ipv4-address> | <ipv6-address> } ssl-policyroledisable",
        "peer <ipv4-address> ssl-policyroleserver",
        "peer <ipv4-address> ssl-policyroleclient",
        "peer <ipv4-address> ssl-policyroledisable",
        "undo peer <ipv4-address> ssl-policyroleserver",
        "undo peer <ipv4-address> ssl-policyroleclient",
        "undo peer <ipv4-address> ssl-policyroledisable"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies an IPv4 peer address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a peer.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "disable",
            "Info": "Disables SSL role setting for a peer.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.2 as-number 100",
            "[*HUAWEI-bgp] peer 10.1.1.2 ssl-policy role client"
        ]
    ],
    "ExtraInfo": ""
}