{
    "PageTitle": "peer bfd enable (BGP-VPN instance IPv6 address family view) (group)",
    "FuncDef": "The peer bfd enable command enables a device to establish a BFD session with its peer group using default detection parameter values.\nThe undo peer bfd enable command cancels this function. The peer bfd enable command enables a device to establish a BFD session with its peer group using default detection parameter values. The undo peer bfd enable command cancels this function. By default, a BGP device does not establish any BFD session with its peer group. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <group-name> bfdenable [ single-hop-prefer ] [ compatible ]",
        "peer <group-name> bfdenableper-linkone-arm-echo",
        "peer <group-name> bfdenableone-arm-echo",
        "undo peer <group-name> bfdenable"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view,BGP multi-instance VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "single-hop-prefer",
            "Info": "Configures the BGP peer to preferentially use the single-hop mode when establishing BFD sessions.\n-"
        },
        {
            "Parameters": "compatible",
            "Info": "Indicates the compatibility mode and sets the TTL value in sent BFD packets to 255.\n-"
        },
        {
            "Parameters": "per-link",
            "Info": "Establishes a BFD session to monitor the link between member interfaces.\n-"
        },
        {
            "Parameters": "one-arm-echo",
            "Info": "Indicates a U-BFD echo session.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpn1",
            "[*HUAWEI-bgp-6-vpn1] group test external",
            "[*HUAWEI-bgp-6-vpn1] peer test as-number 200",
            "[*HUAWEI-bgp-6-vpn1] peer test bfd enable"
        ]
    ],
    "ExtraInfo": "BGP uses BFD to quickly detect faults in links between BGP peers. This accelerates network convergence. You can run this command to create a BFD session with default detection parameters for a peer or peer group.\nIf single-hop-prefer is specified, single-hop detection is preferentially used when a BFD session is established between BGP peers. This parameter is used to detect IP connectivity between BGP peers. That is, only one BFD session exists on a specified BGP interface. This parameter is used to ensure that the local and peer ends use the same detection mode when a Huawei device is connected to a non-Huawei device.\nThe per-link one-arm-echo parameter enables one-arm BFD echo for each link. This parameter ensures that the local and peer ends use the same detection mode when a Huawei device is connected to a non-Huawei device.\nAfter a peer is added to a peer group, the peer inherits the BFD configuration of the peer group regardless of whether BFD is enabled on the peer. If the peer does not need to inherit the configuration of the peer group, run the peer bfd block command on the peer to prevent the peer from inheriting the BFD function of the peer group.\nIf neither single-hop-prefer nor compatible is specified, the multi-hop mode is used by default when a BFD session is established between BGP peers, and the TTL value in BFD packets is 253 by default."
}