{
    "PageTitle": "peer graceful-restart timer wait-for-rib (BGP-VPN instance view)",
    "FuncDef": "The peer graceful-restart timer wait-for-rib command sets the maximum duration for a BGP restarter to wait for the End-of-RIB flag from a specified peer.\nThe undo peer graceful-restart timer wait-for-rib command deletes the configured duration. The peer graceful-restart timer wait-for-rib command sets the maximum duration for a BGP restarter to wait for the End-of-RIB flag from a specified peer. The undo peer graceful-restart timer wait-for-rib command deletes the configured duration. By default, a BGP restarter waits for the End-of-RIB flag from a specified peer for a maximum of 600s.",
    "CLIs": [
        "peer <ipv4-address> graceful-restarttimerwait-for-rib <time-value>",
        "undo peer <ipv4-address> graceful-restarttimerwait-for-rib",
        "peer <ipv6-address> graceful-restarttimerwait-for-rib <time-value>",
        "undo peer <ipv6-address> graceful-restarttimerwait-for-rib"
    ],
    "ParentView": [
        "BGP-VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies an IPv4 peer address.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "<time-value>",
            "Info": "Specifies the maximum duration for waiting for the End-Of-RIB flag.\nThe value is an integer ranging from 3 to 3000, in seconds."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a peer.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpna",
            "[*HUAWEI-bgp-instance-vpna] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp-instance-vpna] peer 10.1.1.1 graceful-restart timer wait-for-rib 100"
        ]
    ],
    "ExtraInfo": "After the local device reestablishes a BGP session with a specified peer, the local device should receive the End-Of-RIB flag from the specified peer within the period specified by this command. If the local device does not receive the End-Of-RIB flag within the period specified by this command, the local device exits the GR process and selects the optimal route from the existing routes."
}