{
    "PageTitle": "peer bfd enable (BGP-VPN instance view)",
    "FuncDef": "The peer bfd enable command enables a device to establish a BFD session with its peer using default detection parameter values.\nThe undo peer bfd enable command cancels this function. The peer bfd enable command enables a device to establish a BFD session with its peer using default detection parameter values. The undo peer bfd enable command cancels this function. By default, a BGP device does not establish any BFD session with its peer.",
    "CLIs": [
        "peer <ipv4-address> bfdenable [ single-hop-prefer ] [ compatible ]",
        "peer <ipv4-address> bfdenableper-linkone-arm-echo",
        "peer <ipv4-address> bfdenableone-arm-echo",
        "undo peer <ipv4-address> bfdenable",
        "peer <ipv6-address> bfdenable [ single-hop-prefer ] [ compatible ]",
        "peer <ipv6-address> bfdenableper-linkone-arm-echo",
        "peer <ipv6-address> bfdenableone-arm-echo",
        "undo peer <ipv6-address> bfdenable"
    ],
    "ParentView": [
        "BGP-VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of a peer.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "single-hop-prefer",
            "Info": "Preferentially creates a single-hop BFD session for BGP peers.\n-"
        },
        {
            "Parameters": "compatible",
            "Info": "Indicates the compatibility mode. If this keyword is specified, the TTL in packets sent by BFD is set to 255.\n-"
        },
        {
            "Parameters": "per-link",
            "Info": "Preferentially creates a single-hop BFD session for BGP peers.\n-"
        },
        {
            "Parameters": "one-arm-echo",
            "Info": "Indicates a one-arm BFD echo session.\n-"
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a peer.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-vpn1] peer 1.1.1.1 as-number 100",
            "[*HUAWEI-bgp-instance-vpn1] peer 1.1.1.1 bfd enable"
        ]
    ],
    "ExtraInfo": "BGP uses BFD to quickly detect faults in links between BGP peers. This accelerates network convergence. You can run this command to create a BFD session with default detection parameters for a peer or peer group.\nIf single-hop-prefer is specified, single-hop detection is preferentially used when a BFD session is established between BGP peers. This parameter is used to detect IP connectivity between BGP peers. That is, only one BFD session exists on a specified BGP interface. This parameter is used to ensure that the local and peer ends use the same detection mode when a Huawei device is connected to a non-Huawei device.\nThe per-link one-arm-echo parameter enables one-arm BFD echo for each link. This parameter ensures that the local and peer ends use the same detection mode when a Huawei device is connected to a non-Huawei device.\nAfter a peer is added to a peer group, the peer inherits the BFD configuration of the peer group regardless of whether BFD is enabled on the peer. If the peer does not need to inherit the configuration of the peer group, run the peer bfd block command on the peer to prevent the peer from inheriting the BFD function of the peer group.\nIf neither single-hop-prefer nor compatible is specified, the multi-hop mode is used by default when a BFD session is established between BGP peers, and the TTL value in BFD packets is 253 by default."
}