{
    "PageTitle": "peer public-as-only import (BGP-VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer public-as-only import command enables a device to remove private AS numbers from the AS_Path list in received BGP Update messages.\nThe undo peer public-as-only import command allows a device to accept BGP Update messages in which the AS_Path list carries private AS numbers. The peer public-as-only import command enables a device to remove private AS numbers from the AS_Path list in received BGP Update messages. The undo peer public-as-only import command allows a device to accept BGP Update messages in which the AS_Path list carries private AS numbers. By default, a device does not remove private AS numbers from the AS_Path list when receiving BGP Update messages.",
    "CLIs": [
        "peer <peerGroupName> public-as-onlyimport [ force ]",
        "undo peer <peerGroupName> public-as-onlyimport [ force ]"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerGroupName>",
            "Info": "Specifies the name of a BGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "force",
            "Info": "Deletes all private AS numbers from the AS_Path attribute.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-vpna] group test",
            "[*HUAWEI-bgp-vpna] peer test public-as-only import"
        ]
    ],
    "ExtraInfo": ""
}