{
    "PageTitle": "peer filter-policy export (BGP-VPN instance IPv6 address family view) (group)",
    "FuncDef": "The peer filter-policy export command configures an ACL-based policy for filtering BGP routes to be advertised to a specified peer group.\nThe undo peer filter-policy export command cancels this configuration. The peer filter-policy export command configures an ACL-based policy for filtering BGP routes to be advertised to a specified peer group. The undo peer filter-policy export command cancels this configuration. By default, no filtering policy is configured for the routes to be advertised to a peer group. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <group-name> filter-policy <acl-number> export",
        "peer <group-name> filter-policyacl6-name <acl6-name> export",
        "undo peer <group-name> filter-policy <acl-number> export",
        "undo peer <group-name> filter-policyacl6-name <acl6-name> export"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view,BGP multi-instance VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "<acl-number>",
            "Info": "Specifies the number of the basic ACL.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "export",
            "Info": "Filters advertised routes.\n-"
        },
        {
            "Parameters": "acl6-name <acl6-name>",
            "Info": "Specifies the name of a basic named ACL6.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 2001",
            "[*HUAWEI-acl6-basic-2001] rule permit",
            "[*HUAWEI-acl6-basic-2001] quit",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-vpn1] group yy internal",
            "[*HUAWEI-bgp-instance-vpn1] peer 10.1.1.1 group yy",
            "[*HUAWEI-bgp-instance-vpn1] quit",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpn1",
            "[*HUAWEI-bgp-6-vpn1] peer yy enable",
            "[*HUAWEI-bgp-6-vpn1] peer yy filter-policy 2001 export"
        ]
    ],
    "ExtraInfo": "If you do not want all routes to be advertised to a peer group, you can run the peer filter-policy export command to configure an ACL-based filtering policy to filter the routes to be advertised to the peer group."
}