{
    "PageTitle": "peer ssl-policy name (BGP view) (group)",
    "FuncDef": "The peer ssl-policy name command applies an SSL policy to an SSL client or server.\nThe undo peer ssl-policy name command cancels the configuration of applying an SSL policy to an SSL client or server. The peer ssl-policy name command applies an SSL policy to an SSL client or server. The undo peer ssl-policy name command cancels the configuration of applying an SSL policy to an SSL client or server. By default, no SSL policy is applied to an SSL client or server.",
    "CLIs": [
        "peer <group-name> ssl-policyname <ssl-policy-name>",
        "undo peer <group-name> ssl-policyname <ssl-policy-name>"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "name <ssl-policy-name>",
            "Info": "Specifies the name of an SSL policy.\nThe value is a string of 1 to 23 case-insensitive characters. The value does not contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy ftps_der",
            "[*HUAWEI-ssl-policy-ftps_der] pki-domain default",
            "[*HUAWEI-ssl-policy-ftps_der] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test external",
            "[*HUAWEI-bgp] peer test as-number 200",
            "[*HUAWEI-bgp] peer test ssl-policy name ftps_der",
            "Warning: The SSL policy is bound to the default PKI domain, Continue? [Y/N]:y"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy ftps_der",
            "[*HUAWEI-ssl-policy-ftps_der] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test external",
            "[*HUAWEI-bgp] peer test as-number 200",
            "[*HUAWEI-bgp] peer test ssl-policy name ftps_der"
        ]
    ],
    "ExtraInfo": "The Secure Sockets Layer (SSL) protocol protects data privacy on the Internet by preventing attackers from eavesdropping on data exchanged between a client and a server. Specifically, to ensure data transmission security on a network, an SSL policy needs to be applied to an SSL client or server using the peer ssl-policy name command, and SSL data encryption, identity authentication, and message integrity verification mechanisms need to be used."
}