{
    "PageTitle": "peer check-first-as (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The peer check-first-as enable command enables a device to check the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer.\nThe peer check-first-as disable command disables a device from checking the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer.\nThe undo peer check-first-as enable command disables a device from checking the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer.\nThe undo peer check-first-as disable command enables a device to check the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer. The peer check-first-as enable command enables a device to check the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer. The peer check-first-as disable command disables a device from checking the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer. The undo peer check-first-as enable command disables a device from checking the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer. The undo peer check-first-as disable command enables a device to check the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer. By default, a device checks the first AS number in the AS_Path attribute contained in the update messages received from all EBGP peers or peer groups.",
    "CLIs": [
        "peer <ipv4-address> check-first-asenable",
        "peer <ipv4-address> check-first-asdisable",
        "undo peer <ipv4-address> check-first-asenable",
        "undo peer <ipv4-address> check-first-asdisable"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies an IPv4 peer address.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-a-vpna] peer 10.1.1.1 as-number 200",
            "[*HUAWEI-bgp-instance-a-vpna] peer 10.1.1.1 check-first-as enable"
        ]
    ],
    "ExtraInfo": "After the peer check-first-as enable command is run, BGP checks whether the first AS number in the AS_Path list carried in the Update message sent by a specified EBGP peer is the AS where the EBGP peer resides. If the two AS numbers are different, the Update message is denied. If the peer check-first-as disable command is run, BGP does not check the first AS number in the AS_Path list carried in the Update message sent by a specified EBGP peer. That is, BGP accepts the Update message even if the first AS number is not the AS number of the EBGP peer. This undo command deletes the configuration of the specified EBGP peer and restores the default configuration.\nThe check on the first AS number in the AS_Path attribute of each received Update message can be configured for a specified EBGP peer, the peer group that the EBGP peer belongs to, or the entire BGP process. The configuration takes effect in descending order of priority as follows: EBGP peer > peer group > entire BGP process."
}