{
    "PageTitle": "peer password (BGP-VPN instance view) (IPv6)",
    "FuncDef": "The peer password command configures Message Digest 5 (MD5) authentication for BGP messages exchanged between BGP peers during TCP connection establishment.\nThe undo peer password command restores the default configuration. The peer password command configures Message Digest 5 (MD5) authentication for BGP messages exchanged between BGP peers during TCP connection establishment. The undo peer password command restores the default configuration. By default, the BGP device to implement Message Digest 5 (MD5) authentication for BGP messages exchanged during the establishment of a TCP connection with a peer is disabled. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <ipv6-address> passwordsimple <simple-password>",
        "peer <ipv6-address> passwordcipher <cipher-password>",
        "undo peer <ipv6-address> password"
    ],
    "ParentView": [
        "BGP-VPN instance view,BGP multi-instance VPN instance session view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies an IPv6 peer address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "simple <simple-password>",
            "Info": "Specifies a cleartext password.\nFor security purposes, you are advised to configure a password in ciphertext mode. To further improve device security, periodically change the password.\nThe value is a string of 1 to 255 case-sensitive characters, without spaces.\nThe characters do not include the question mark (?) or spaces. However, when double quotation marks are used around a password, spaces are allowed in the password."
        },
        {
            "Parameters": "cipher <cipher-password>",
            "Info": "Specifies a cipher text password.\nIn the case of a plaintext, the value is a string of 1 to 255 case-sensitive characters, without spaces. In the case of a ciphertext password, the value is a string of 20 to 432 case-sensitive characters, without spaces.\nThe characters do not include question marks (?) or spaces. However, when double quotation marks are used around a password, spaces are allowed in the password."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-vpn1] peer 2001:DB8:1::1 as-number 200",
            "[*HUAWEI-bgp-instance-vpn1] peer 2001:DB8:1::1 password cipher YsHsjx_202206"
        ]
    ],
    "ExtraInfo": "BGP uses TCP as the transport layer protocol. To improve BGP security, you can perform MD5 authentication when establishing a TCP connection. In MD5 authentication of BGP, only the MD5 authentication password is set for the TCP connection, and the authentication is performed by TCP.\nA password can be set in plaintext or ciphertext mode. The two modes determine how the password is saved in the configuration file."
}