{
    "PageTitle": "peer ebgp-max-hop (BGP multi-instance view)",
    "FuncDef": "The peer ebgp-max-hop command configures a BGP device to establish an EBGP peer relationship with a peer on an indirectly-connected network and set the maximum number of hops between the two devices.\nThe undo peer ebgp-max-hop command cancels the existing configuration. The peer ebgp-max-hop command configures a BGP device to establish an EBGP peer relationship with a peer on an indirectly-connected network and set the maximum number of hops between the two devices. The undo peer ebgp-max-hop command cancels the existing configuration. By default, an EBGP connection can be set up only on a directly-connected physical link.",
    "CLIs": [
        "peer { <ipv4-address> | <ipv6-address> } ebgp-max-hop [ <hop-count> ]",
        "undo peer { <ipv4-address> | <ipv6-address> } ebgp-max-hop",
        "peer <ipv4-address> ebgp-max-hop [ <hop-count> ]",
        "undo peer <ipv4-address> ebgp-max-hop"
    ],
    "ParentView": [
        "BGP multi-instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "<hop-count>",
            "Info": "Specifies the maximum number of hops.\nThe value is an integer ranging from 1 to 255. By default, the maximum number of hops in an EBGP connection is 1. If the specified maximum number of hops is 1, EBGP connection cannot be established between non-directly connected devices. If hop-count is not specified in the peer ebgp-max-hop command, 255 is used as the maximum number of hops in EBGP connections."
        },
        {
            "Parameters": "peer <ipv4-address>",
            "Info": "Specifies an IPv4 peer address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "peer <ipv6-address>",
            "Info": "Specifies an IPv6 peer address.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] peer 10.1.1.1 as-number 200",
            "[*HUAWEI-bgp-instance-a] peer 10.1.1.1 ebgp-max-hop"
        ]
    ],
    "ExtraInfo": "Generally, a directly connected physical link must be available between EBGP peers. If a directly connected physical link is unavailable, the peer ebgp-max-hop command must be used to allow EBGP peers to establish a multi-hop connection.\nIf loopback interfaces are used to establish an EBGP peer relationship, the peer ebgp-max-hop command (hop-count â\u0089¥ 2) must be run. Otherwise, the EBGP peer relationship cannot be established."
}