{
    "PageTitle": "peer route-update-interval (BGP multi-instance VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer route-update-interval command sets the interval for sending Update messages with the same route prefix to a peer group.\nThe undo peer route-update-interval command restores the default configuration. The peer route-update-interval command sets the interval for sending Update messages with the same route prefix to a peer group. The undo peer route-update-interval command restores the default configuration. By default, the interval at which routing updates are sent to IBGP peers is 15s, and the interval at which routing updates are sent to EBGP peers is 30s.",
    "CLIs": [
        "peer <group-name> route-update-interval <interval>",
        "undo peer <group-name> route-update-interval"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported.  The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "<interval>",
            "Info": "Specifies the minimum interval at which BGP routing updates are sent.\nThe value is an integer that ranges from 0 to 600, in seconds. The value 0 indicates that the device immediately sends a BGP Update message to notify the peer of the route change."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-a-vpna] group test",
            "[*HUAWEI-bgp-instance-a-vpna] peer test route-update-interval 10"
        ]
    ],
    "ExtraInfo": "When routes change, the device sends routing updates to notify its peers. If a route changes frequently, the peer route-update-interval command can be used to adjust the interval at which Update packets are sent for changes of this route. This frees the device from sending Update packets for every route change."
}