{
    "PageTitle": "peer soo (BGP-VPN instance IPv4 address family view)",
    "FuncDef": "The peer soo command configures the Site-of-Origin (SoO) attribute for a BGP peer in a BGP VPN instance.\nThe undo peer soo command cancels the configuration. The peer soo command configures the Site-of-Origin (SoO) attribute for a BGP peer in a BGP VPN instance. The undo peer soo command cancels the configuration. By default, SoO is not configured for BGP peers in a BGP VPN instance.",
    "CLIs": [
        "peer <ipv4-address> soo <site-of-origin>",
        "undo peer <ipv4-address> soo"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of a BGP peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<site-of-origin>",
            "Info": "Specifies the SoO attribute for a peer.\nThe SoO attribute value can be expressed in any of the following formats:\n2-byte AS number:4-byte user-defined number, for example, 1:3. The AS number is an integer ranging from 0 to 65535, and the user-defined number is an integer ranging from 0 to 4294967295. The AS number and user-defined number cannot both be set to 0. That is, the SoO must not be 0:0.IPv4 address:2-byte user-defined number, for example, 192.168.122.15:1. The IP address ranges from 0.0.0.0 to 255.255.255.255, and the user-defined number is an integer ranging from 0 to 65535.4-byte AS number in integer format:2-byte user-defined number, for example, 65537:3. An AS number ranges from 65536 to 4294967295, and a user-defined number ranges from 0 to 65535.4-byte AS number in dotted notation:2-byte user-defined number, for example, 0.0:3 or 0.1:0. A 4-byte AS number in dotted notation is in the format of x.y, where x and y are integers that range from 0 to 65535. A user-defined number also ranges from 0 to 65535. The AS number and user-defined number must not be both 0s. That is, the SoO must not be 0.0:0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-vpna] peer 1.1.1.1 as-number 200",
            "[*HUAWEI-bgp-vpna] peer 1.1.1.1 soo 2.2.2.2:45"
        ]
    ],
    "ExtraInfo": "In an L3VPN scenario, if the ASs where two VPN sites reside use private AS numbers, the AS numbers of the two VPN sites may be the same. As a result, different sites in the same VPN cannot communicate with each other. In this case, you need to run the peer substitute-as command on the PE to enable AS number substitution.\nHowever, enabling AS number substitution causes another problem. When multiple CEs at a VPN site access different PEs on the L3VPN backbone network through BGP and routing protocols are deployed between the CEs, if AS number substitution is configured on the PEs, the AS numbers of the VPN routes at the VPN site will be replaced on the PEs. In this case, the routes may be sent back to the VPN site through the backbone network and other CEs. As a result, a routing loop occurs. To solve this problem, run the peer soo command on the PEs to configure the SoO feature for the specified CE.\nAfter this command is run on a PE, the PE adds the SoO attribute to the routes received from a CE and advertises the routes to other PE peers. When advertising these routes to the connected CE, the other PE peers check the SoO attribute carried in the VPN routes. If the SoO attribute is the same as the locally configured SoO attribute, the PEs do not advertise the routes to the CE. This prevents routing loops in the VPN site."
}