{
    "PageTitle": "peer route-priority-track interface (BGP-IPv6 unicast address family view)",
    "FuncDef": "The peer route-priority-track interface command configures BGP to detect the status of an Eth-Trunk interface and adjust the route preference.\nThe undo peer route-priority-track interface command restores the default configuration. The peer route-priority-track interface command configures BGP to detect the status of an Eth-Trunk interface and adjust the route preference. The undo peer route-priority-track interface command restores the default configuration. By default, BGP does not detect the status changes of an Eth-Trunk interface connected to a peer or adjust the priority of BGP routes received from a peer. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer { <peerIpv6Addr> } route-priority-trackinterface { <interface-name> | <localIfType> <localIfNum> }",
        "undo peer { <peerIpv6Addr> } route-priority-trackinterface { <interface-name> | <localIfType> <localIfNum> }"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerIpv6Addr>",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of an interface.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "<localIfType>",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "<localIfNum>",
            "Info": "Specifies the number of an interface.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 0",
            "[*HUAWEI-Eth-Trunk0] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 2001:DB8:1::1 as-number 100",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] peer 2001:DB8:1::1 enable",
            "[*HUAWEI-bgp-af-ipv6] peer 2001:DB8:1::1 route-priority-track interface Eth-Trunk 0"
        ]
    ],
    "ExtraInfo": "In a BGP over M-LAG networking scenario, you can run this command on an M-LAG device. If an M-LAG member interface (connected to a specified peer) on the M-LAG device fails, this configuration allows BGP to detect the Eth-Trunk interface fault and change the priority of the routes received from the peer to the lowest (by setting the MED to the maximum value and the Local_Pref to the minimum value). When multiple M-LAG member interfaces on the device are specified, BGP changes the priority of the received routes to the lowest only if all these member interfaces go faulty."
}