{
    "PageTitle": "peer tracking (BGP-VPN instance view)",
    "FuncDef": "The peer tracking command enables BGP Peer Tracking. That is, you can configure BGP to fast detect the unreachable state of a peer and re-establish the connection between the local device and the peer.\nThe undo peer tracking command disables BGP Peer Tracking. The peer tracking command enables BGP Peer Tracking. That is, you can configure BGP to fast detect the unreachable state of a peer and re-establish the connection between the local device and the peer. The undo peer tracking command disables BGP Peer Tracking. By default, BGP Peer Tracking is disabled.",
    "CLIs": [
        "peer <ipv4-address> tracking [ delay <delay-time> ]",
        "undo peer <ipv4-address> tracking",
        "peer <ipv6-address> tracking [ delay <delay-time> ]",
        "undo peer <ipv6-address> tracking"
    ],
    "ParentView": [
        "BGP-VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of a peer.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "delay <delay-time>",
            "Info": "Indicates the interval between when BGP detects the peer unreachable and when BGP tears down the corresponding connection.\nThe value is an integer that ranges from 0 to 65535, in seconds. The default value is 0 seconds."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies an IPv6 peer address.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-vpn1] peer 10.1.1.1 as-number 200",
            "[*HUAWEI-bgp-instance-vpn1] peer 10.1.1.1 tracking"
        ]
    ],
    "ExtraInfo": "In a network where BFD is unsuitable to be deployed, you can configure BGP Peer Tracking on the local device to implement fast network convergence by rapidly detecting the unreachable state of the peer.\nA BGP peer is considered unreachable in either of the following situations:"
}