{
    "PageTitle": "peer public-as-only (BGP-VPN-Target address family view)",
    "FuncDef": "The peer public-as-only command configures the AS-Path attribute in a BGP Update message not to carry the private AS number. Only the public AS number is contained in the update messages.\nThe undo peer public-as-only command allows the AS-Path attribute in a BGP Update message to carry the private AS number. The peer public-as-only command configures the AS-Path attribute in a BGP Update message not to carry the private AS number. Only the public AS number is contained in the update messages. The undo peer public-as-only command allows the AS-Path attribute in a BGP Update message to carry the private AS number. By default, the AS-Path attribute in a BGP Update message is allowed to carry private AS numbers.",
    "CLIs": [
        "peer { <ipv4-address> | <ipv6-address> } public-as-only",
        "undo peer { <ipv4-address> | <ipv6-address> } public-as-only",
        "peer <ipv4-address> public-as-only",
        "undo peer <ipv4-address> public-as-only"
    ],
    "ParentView": [
        "BGP-VPN-target address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of a peer.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies an IPv6 peer address.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.2.2.2 as-number 200",
            "[*HUAWEI-bgp] ipv4-family vpn-target",
            "[*HUAWEI-bgp-af-vpn-target] peer 10.2.2.2 enable",
            "[*HUAWEI-bgp-af-vpn-target] peer 10.2.2.2 public-as-only"
        ]
    ],
    "ExtraInfo": "Generally, AS numbers range from 1 to 4294967295, including the public, private, and reserved AS numbers. If the private-4-byte-as enable command is not run, private AS numbers range from 64512 to 65534. AS number 65535 is reserved for special use. After the private-4-byte-as enable command is run, the private AS numbers range from 64512 to 65534 and from 4200000000-4294967294 to 65535 or 4294967295, which are reserved for special use.\nPublic AS numbers can be used over the Internet, whereas private AS numbers cannot be advertised to the Internet. If private AS numbers are advertised to the Internet, routing loops may occur. Therefore, private AS numbers are used only within a routing domain.\nThis command can be used to process the private and reserved AS numbers in the AS_Path attribute of BGP routes as required. The processing of the reserved AS numbers is the same as that of the private AS numbers. After this command is configured, if the AS path attribute contains only private AS numbers, BGP deletes the private AS numbers and then advertises these update routes."
}