{
    "PageTitle": "peer as-path-filter import (BGP-VPN instance IPv6 address family view)",
    "FuncDef": "The peer as-path-filter import command configures a policy based on an AS_Path list for filtering BGP routes received from a peer.\nThe undo peer as-path-filter import command cancels this configuration. The peer as-path-filter import command configures a policy based on an AS_Path list for filtering BGP routes received from a peer. The undo peer as-path-filter import command cancels this configuration. By default, no policy based on an AS_Path list is configured for filtering BGP routes received from a peer, and all the BGP routes will be received from the peer. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <ipv4-address> as-path-filter { <number> | <name> } import",
        "undo peer <ipv4-address> as-path-filter { <number> | <name> } import"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies an IPv4 peer address.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "<number>",
            "Info": "Specifies the number of the AS_Path filter.\nThe value is an integer ranging from 1 to 256."
        },
        {
            "Parameters": "<name>",
            "Info": "Specifies the name of an AS_Path filter.\nThe value is a string of 1 to 51 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip as-path-filter 3 permit 100",
            "[*HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv6-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpna",
            "[*HUAWEI-bgp-vpna] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp-vpna] quit",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpna",
            "[*HUAWEI-bgp-6-vpna] peer 10.1.1.1 enable",
            "[*HUAWEI-bgp-6-vpna] peer 10.1.1.1 as-path-filter 3 import"
        ]
    ],
    "ExtraInfo": "After the peer as-path-filter import command is used to apply a route filtering policy based on an AS_Path list to BGP routes to be received from a specified peer, the routers that do not match the policy are filtered out."
}