{
    "PageTitle": "peer tracking (BGP-VPN instance view) (group)",
    "FuncDef": "The peer tracking command enables BGP Peer Tracking. That is, you can configure BGP to fast detect the unreachable state of a peer and re-establish the connection between the local device and the peer.\nThe undo peer tracking command disables BGP Peer Tracking. The peer tracking command enables BGP Peer Tracking. That is, you can configure BGP to fast detect the unreachable state of a peer and re-establish the connection between the local device and the peer. The undo peer tracking command disables BGP Peer Tracking. By default, BGP Peer Tracking is disabled.",
    "CLIs": [
        "peer <group-name> tracking [ delay <delay-time> ]",
        "undo peer <group-name> tracking [ delay <delay-time> ]"
    ],
    "ParentView": [
        "BGP-VPN instance view,BGP multi-instance VPN instance session view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a BGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "delay <delay-time>",
            "Info": "Indicates the interval between when BGP detects the peer unreachable and when BGP tears down the corresponding connection.\nThe value is an integer that ranges from 0 to 65535, in seconds. The default value is 0 seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-vpn1] group test external",
            "[*HUAWEI-bgp-instance-vpn1] peer test as-number 200",
            "[*HUAWEI-bgp-instance-vpn1] peer test tracking delay 20"
        ]
    ],
    "ExtraInfo": ""
}