{
    "PageTitle": "peer capability-advertise add-path (BGP view)",
    "FuncDef": "The peer capability-advertise add-path command enables BGP Add-Path function.\nThe undo peer capability-advertise add-path command restores the default setting. The peer capability-advertise add-path command enables BGP Add-Path function. The undo peer capability-advertise add-path command restores the default setting. By default, the Add-Path function is disabled.",
    "CLIs": [
        "peer <ipv4-address> capability-advertiseadd-path { both | receive | send }",
        "undo peer <ipv4-address> capability-advertiseadd-path { both | receive | send }"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view,BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies an IPv4 peer address.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "add-path",
            "Info": "Indicates the Add-Path function.\n-"
        },
        {
            "Parameters": "both",
            "Info": "Enables the RR to receive Add-Path routes from and send Add-Path routes to a specified IBGP peer.\n-"
        },
        {
            "Parameters": "receive",
            "Info": "Enables the RR to receive Add-Path routes from a specified IBGP peer.\n-"
        },
        {
            "Parameters": "send",
            "Info": "Enables the RR to send Add-Path routes to a specified IBGP peer.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.2.3.4 as-number 100",
            "[*HUAWEI-bgp] peer 10.2.3.4 capability-advertise add-path receive"
        ]
    ],
    "ExtraInfo": "This command is used to configure BGP Add-Path. After BGP Add-Path is configured, a device can advertise two or more routes with the same prefix to a BGP peer. These routes can back up each other or load-balance traffic, thereby ensuring data transmission reliability.\nWhen deploying BGP Add-Path, run the peer capability-advertise add-path command to enable the device to advertise Add-Path routes to a specified BGP peer or receive Add-Path routes from a specified BGP peer. In addition, you need to run the peer advertise add-path command to configure the number of routes that the device can advertise to a specified peer."
}