{
    "PageTitle": "peer extended-open-message(BGP View)",
    "FuncDef": "The peer extended-open-message command enables the capability of extending optional parameters in BGP Open messages.\nThe undo peer extended-open-message command restores the default configuration. The peer extended-open-message command enables the capability of extending optional parameters in BGP Open messages. The undo peer extended-open-message command restores the default configuration. By default, Open messages longer than 255 bytes cannot be packed.",
    "CLIs": [
        "peer { <peerIpv4Addr> | <peerIpv6Addr> } extended-open-messagedisable",
        "peer { <peerIpv4Addr> | <peerIpv6Addr> } extended-open-message",
        "undo peer { <peerIpv4Addr> | <peerIpv6Addr> } extended-open-message",
        "undo peer { <peerIpv4Addr> | <peerIpv6Addr> } extended-open-messagedisable",
        "peer { <peerIpv4Addr> } extended-open-messagedisable",
        "peer { <peerIpv4Addr> } extended-open-message",
        "undo peer { <peerIpv4Addr> } extended-open-message",
        "undo peer { <peerIpv4Addr> } extended-open-messagedisable"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerIpv4Addr>",
            "Info": "Specifies an IPv4 peer address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<peerIpv6Addr>",
            "Info": "Specifies the IPv6 address of a peer.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "disable",
            "Info": "Disables the function.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 extended-open-message disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 extended-open-message"
        ]
    ],
    "ExtraInfo": "With the increase of BGP capabilities, when a BGP session negotiates multiple capabilities, the length of an Open message may exceed 255 bytes. You can run the peer extended-open-message command to configure the extended format of an Open message so that the Open message longer than 255 bytes can be packed.\nAfter the peer extended-open-message disable command is run, a peer in a peer group retains the default configuration but does not inherit the configuration of the peer group."
}