{
    "PageTitle": "peer default-route-advertise(BGP-VPN instance IPv6 address family view)(IPv6)",
    "FuncDef": "The peer default-route-advertise command configures a device to advertise only default routes to a peer.\nThe undo peer default-route-advertise command restores the default setting. The peer default-route-advertise command configures a device to advertise only default routes to a peer. The undo peer default-route-advertise command restores the default setting. By default, a BGP device does not advertise any default route to its peer. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <peerIpv6Addr> default-route-advertise [ route-policy <route-policy-name> ]",
        "peer <peerIpv6Addr> default-route-advertise [ route-policy <route-policy-name> ] { conditional-route-match-all | conditional-route-match-any } { <ipv6-address> <mask-length> } &<1-4>",
        "undo peer <peerIpv6Addr> default-route-advertise"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view,BGP multi-instance VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerIpv6Addr>",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of the route-policy.\nThe value is a string of 1 to 200 case-sensitive characters. It cannot contain spaces. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "conditional-route-match-all",
            "Info": "Configures the device to send the default route when all conditional routes are matched.\n-"
        },
        {
            "Parameters": "conditional-route-match-any",
            "Info": "Configures the device to send the default route when any conditional route is matched.\n-"
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a conditional route.\nThe format is X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<mask-length>",
            "Info": "Specifies the IPv6 mask length of a conditional route.\nIt is an integer ranging from 0 to 128."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpna",
            "[*HUAWEI-bgp-6-vpna] peer 2001:DB8:1::1 as-number 100",
            "[*HUAWEI-bgp-6-vpna] peer 2001:DB8:1::1 default-route-advertise"
        ]
    ],
    "ExtraInfo": "Generally, default routes are used on networks that have the following characteristics:"
}