{
    "PageTitle": "peer as-path-filter export (BGP-IPv4 unicast address family view) (group)",
    "FuncDef": "The peer as-path-filter export command configures a route-filter based on the AS_Path for the routes to be advertised to a peer group.\nThe undo peer as-path-filter export command cancels this configuration. The peer as-path-filter export command configures a route-filter based on the AS_Path for the routes to be advertised to a peer group. The undo peer as-path-filter export command cancels this configuration. By default, no policy based on an AS_Path list is configured for filtering BGP routes to be advertised to peers in a peer group, and all the BGP routes will be advertised to the peer group.",
    "CLIs": [
        "peer <group-name> as-path-filter { <number> | <name> } export",
        "undo peer <group-name> as-path-filter { <number> | <name> } export"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a BGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "<number>",
            "Info": "Specifies the number of the AS path filter.\nThe value is a decimal integer ranging from 1 to 256."
        },
        {
            "Parameters": "<name>",
            "Info": "Specifies the name of an AS_Path filter.\nThe value is a string of 1 to 51 case-sensitive characters. If spaces are used, the string must start and end with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip as-path-filter 3 permit ^10_",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test",
            "[*HUAWEI-bgp] ipv4-family unicast",
            "[*HUAWEI-bgp-af-ipv4] peer test as-path-filter 3 export"
        ]
    ],
    "ExtraInfo": "When the peer as-path-filter export command is run to apply a routing policy to the BGP routes to be advertised to a specified peer group, the AS_Path filter filters out unqualified routes."
}