{
    "PageTitle": "peer preferred-value (BGP-VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer preferred-value command sets a preferred value for the peer group.\nThe undo peer preferred-value command deletes the preferred value set for the peer group. The peer preferred-value command sets a preferred value for the peer group. The undo peer preferred-value command deletes the preferred value set for the peer group. By default, the preferred value of the routes learned from other BGP peer groups is 0.",
    "CLIs": [
        "peer <group-name> preferred-value <preferredvalue>",
        "undo peer <group-name> preferred-value"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "<preferredvalue>",
            "Info": "Specifies the preferred value of the routes that a BGP device learns from its peer.\nThe value is an integer that ranges from 0 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-vpna] group test",
            "[*HUAWEI-bgp-vpna] peer test preferred-value 50"
        ]
    ],
    "ExtraInfo": "After a preferred value is configured for a peer group, all the routes learned from the peer group have the preferred value. If multiple routes with the same prefix are available, the route with the largest preferred value is preferred."
}