{
    "PageTitle": "peer public-as-only force (BGP-VPN-Target address family view)",
    "FuncDef": "The peer public-as-only force command configures the AS-Path attribute in a BGP Update message to delete all private AS numbers from the AS_Path attribute except the private AS number of a specified peer.\nThe undo peer public-as-only force command restores the default setting. The peer public-as-only force command configures the AS-Path attribute in a BGP Update message to delete all private AS numbers from the AS_Path attribute except the private AS number of a specified peer. The undo peer public-as-only force command restores the default setting. By default, the AS-Path attribute in a BGP Update message is allowed to carry private AS numbers.",
    "CLIs": [
        "peer { <ipv4-address> | <ipv6-address> } public-as-onlyforce [ replace ] [ include-peer-as ]",
        "undo peer { <ipv4-address> | <ipv6-address> } public-as-onlyforce [ replace ] [ include-peer-as ]",
        "peer <ipv4-address> public-as-onlyforce [ replace ] [ include-peer-as ]",
        "undo peer <ipv4-address> public-as-onlyforce [ replace ] [ include-peer-as ]"
    ],
    "ParentView": [
        "BGP-VPN-target address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of a peer.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies an IPv6 peer address.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "force",
            "Info": "Deletes all private AS numbers from the AS_Path attribute except the private AS number of a specified peer.\n-"
        },
        {
            "Parameters": "replace",
            "Info": "Replaces private AS numbers in an AS_Path list with a local AS number:\nIf both force and replace are specified, private AS numbers in an AS_Path list, except the AS number of a specified peer or peer group, are replaced with the local AS number.\n-"
        },
        {
            "Parameters": "include-peer-as",
            "Info": "Deletes AS numbers:\nIf both force and include-peer-as are specified, all private AS numbers are forcibly deleted.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.2.2.2 as-number 200",
            "[*HUAWEI-bgp] ipv4-family vpn-target",
            "[*HUAWEI-bgp-af-vpn-target] peer 10.2.2.2 enable",
            "[*HUAWEI-bgp-af-vpn-target] peer 10.2.2.2 public-as-only force"
        ]
    ],
    "ExtraInfo": "Generally, AS numbers range from 1 to 4294967295, including the public, private, and reserved AS numbers. If the private-4-byte-as enable command is not run, private AS numbers range from 64512 to 65534, and the AS number 65535 is reserved for special use. If the private-4-byte-as enable command is run, private AS numbers range from 64512 to 65534 and from 4200000000 to 4294967294, and the AS numbers 65535 and 4294967295 are reserved for special use.\nPublic AS numbers can be used over the Internet, whereas private AS numbers cannot be advertised to the Internet. If private AS numbers are advertised to the Internet, routing loops may occur. Therefore, private AS numbers are used only within a routing domain.\nThis command enables BGP to process the private and reserved AS numbers in the AS_Path attribute of BGP routes as required. Reserved AS numbers are processed the same as private AS numbers. The following uses private AS numbers as an example to illustrate the processing modes:\nIf the peer public-as-only command is run without any optional parameter specified and the AS_Path attribute of BGP routes contains only private AS numbers, BGP deletes these private AS numbers before advertising the routes. BGP does not delete private AS numbers in either of the following scenarios if the peer public-as-only command is run, without any parameter following public-as-only specified:\nâ\u0080¢\tThe AS_Path attribute of a route carries the AS number of the remote peer. In this case, deleting private AS numbers may lead to a routing loop.\nâ\u0080¢\tThe AS_Path attribute carries both public and private AS numbers, which indicates that the route has passed through the public network. In this case, deleting private AS numbers may lead to a traffic forwarding error.\nParameters that are used to delete or replace private AS numbers are described as follows:\nâ\u0080¢\tforce: deletes all private AS numbers from the AS_Path attribute except the private AS number of a specified peer group.\nâ\u0080¢\tforce replace: replaces the private AS numbers in the AS_Path attribute with the local AS number except the private AS number of a specified peer group.\nâ\u0080¢\tforce include-peer-as: deletes all private AS numbers from the AS_Path attribute.\nâ\u0080¢\tforce replace include-peer-as: replaces the private AS numbers in the AS_Path attribute with the local AS number. This parameter ensures that the AS_Path attribute length remains unchanged. Therefore, the route selection result is not affected.\nSelect one of the preceding parameters based on the network topology to prevent routing loops or forwarding errors."
}