{
    "PageTitle": "peer capability-advertise (BGP multi-instance VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer capability-advertise command enables the optional functions for BGP to advertise routes, including the route-refresh function, conventional functions, and 4-byte AS number function.\nThe undo peer capability-advertise command restores the default setting. The peer capability-advertise command enables the optional functions for BGP to advertise routes, including the route-refresh function, conventional functions, and 4-byte AS number function. The undo peer capability-advertise command restores the default setting. By default, the BGP route-refresh and 4-byte AS number functions are enabled, but conventional functions are disabled.",
    "CLIs": [
        "peer <group-name> capability-advertise { conventional | route-refresh | 4-byte-as }",
        "undo peer <group-name> capability-advertise { conventional | route-refresh | 4-byte-as }"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "conventional",
            "Info": "Indicates conventional functions.\nThis parameter is valid only in the BGP view and BGP-VPN instance IPv4 address family view.After conventional functions are enabled on a device, the device does not have extended functions, such as route-refresh and GR.\n-"
        },
        {
            "Parameters": "route-refresh",
            "Info": "Indicates the route-refresh function.\n-"
        },
        {
            "Parameters": "4-byte-as",
            "Info": "Indicates the 4-byte AS number function.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-a-vpna] group test",
            "[*HUAWEI-bgp-instance-a-vpna] peer test capability-advertise route-refresh"
        ]
    ],
    "ExtraInfo": "BGP has many optional functions when advertising routes, including the route-refresh function, conventional functions, and 4-byte AS number function. Using the peer capability-advertise command, you can enable or disable these functions as required."
}