{
    "PageTitle": "peer next-hop-invariable (BGP-IPv6 unicast address family view) (IPv6)",
    "FuncDef": "The peer next-hop-invariable command configures the device not to change the next hop of a route when advertising the route to a peer group.\nThe undo peer next-hop-invariable command restores the default configuration. The peer next-hop-invariable command configures the device not to change the next hop of a route when advertising the route to a peer group. The undo peer next-hop-invariable command restores the default configuration. By default: This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <peerIpv6Addr> next-hop-invariable [ include-static-route | include-unicast-route ]",
        "undo peer <peerIpv6Addr> next-hop-invariable"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerIpv6Addr>",
            "Info": "Specifies the IPv6 address of a peer.\nThe address is in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "include-static-route",
            "Info": "Configures the device to retain the original Next_Hop of static routes when advertising the routes to the peer.\n-"
        },
        {
            "Parameters": "include-unicast-route",
            "Info": "Configures the device to retain the original next hop of the unicast routes learned from peers when advertising the routes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 2001:DB8:1::1 as-number 100",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[~HUAWEI-bgp-af-ipv6] peer 2001:DB8:1::1 enable",
            "[*HUAWEI-bgp-af-ipv6] peer 2001:DB8:1::1 next-hop-invariable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 2001:DB8:1::1 as-number 100",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] peer 2001:DB8:1::1 enable",
            "[*HUAWEI-bgp-af-ipv6] peer 2001:DB8:1::1 next-hop-invariable include-static-route"
        ]
    ],
    "ExtraInfo": "The peer next-hop-invariable command has the following functions:"
}