{
    "PageTitle": "peer allow-as-loop (BGP multi-instance VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer allow-as-loop command sets the number of local AS number repetitions.\nThe undo peer allow-as-loop command cancels the configuration. The peer allow-as-loop command sets the number of local AS number repetitions. The undo peer allow-as-loop command cancels the configuration. By default, the local AS number cannot be repeated.",
    "CLIs": [
        "peer <group-name> allow-as-loop [ <number> ]",
        "undo peer <group-name> allow-as-loop"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported.  The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "<number>",
            "Info": "Specifies the maximum number of times the local AS number can be repeated in the AS_Path of each received route.\nThe value is an integer in the range from 1 to 10. The default value is 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-a-vpna] group test",
            "[*HUAWEI-bgp-instance-a-vpna] peer test allow-as-loop 2"
        ]
    ],
    "ExtraInfo": "BGP uses AS numbers to detect routing loops. The AS numbers in the AS_Path of each received route are matched against the local AS number configured using the bgp command and the fake AS number configured using the peer local-as command.\nAfter the peer allow-as-loop command is executed to configure the number of local AS number repetitions, BGP Speaker can allow routes with repeated AS numbers in AS_Path to pass to meet the requirements of special scenarios."
}