{
    "PageTitle": "peer listen-net",
    "FuncDef": "The peer listen-net command specifies a network segment from which a dynamic BGP peer group listens for BGP connection requests.\nThe undo peer listen-net command deletes the specified network segment from which a dynamic BGP peer group listens for BGP connection requests. The peer listen-net command specifies a network segment from which a dynamic BGP peer group listens for BGP connection requests. The undo peer listen-net command deletes the specified network segment from which a dynamic BGP peer group listens for BGP connection requests. By default, no network segment from which a dynamic BGP peer group listens for BGP connection requests is specified.",
    "CLIs": [
        "peer <group-name> listen-net <ipv4-address> [ <mask-length> | <mask> ]",
        "undo peer <group-name> listen-net <ipv4-address> [ <mask-length> | <mask> ]"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a dynamic BGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported.  The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the network segment from which the dynamic peer group listens for connection requests.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "<mask-length>",
            "Info": "Specifies the mask length. A 32-bit mask is represented by consecutive 1s, and the mask in dotted decimal notation can be replaced by the mask length.\nThe value is an integer in the range from 0 to 32."
        },
        {
            "Parameters": "<mask>",
            "Info": "Specifies the mask of the preceding IP address.\nIt is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group ex listen external",
            "[*HUAWEI-bgp] peer ex listen-as 200",
            "[*HUAWEI-bgp] peer ex listen-net 10.10.10.0 24"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group in listen internal",
            "[*HUAWEI-bgp] peer in listen-net 10.10.10.0 24"
        ]
    ],
    "ExtraInfo": "On a BGP network, if multiple peers frequently change, the establishment of peer relationships changes accordingly. If you use the common peer configuration mode, you need to frequently add or delete peer configurations on the local end, which increases the maintenance workload. In this case, you can configure the dynamic BGP peer function and specify a network segment from which a dynamic peer group listens for connection requests. After receiving connection requests, BGP dynamically establishes BGP peer relationships and adds these peers to the same dynamic peer group. In this manner, when one of the peers changes, you do not need to add or delete BGP peer configurations on the local end, which reduces the workload of network maintenance. The peer listen-net command specifies a network segment from which a dynamic BGP peer group listens for BGP connection requests."
}