{
    "PageTitle": "peer allow-as-loop (BGP-IPv6 unicast address family view) (IPv6)",
    "FuncDef": "The peer allow-as-loop command sets the number of times that the local AS number can be repeated.\nThe undo peer allow-as-loop command disables this function. The peer allow-as-loop command sets the number of times that the local AS number can be repeated. The undo peer allow-as-loop command disables this function. By default, local AS number repetition is not allowed. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <ipv6-address> allow-as-loop [ <number> ]",
        "undo peer <ipv6-address> allow-as-loop"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<number>",
            "Info": "Specifies the maximum number of times the local AS number can be repeated in the AS_Path of each received route.\nThe value is an integer ranging from 1 to 10. The default value is 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 2001:DB8:1::1 as-number 100",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] peer 2001:DB8:1::1 enable",
            "[*HUAWEI-bgp-af-ipv6] peer 2001:DB8:1::1 allow-as-loop 2"
        ]
    ],
    "ExtraInfo": "BGP uses AS numbers to detect routing loops. The AS numbers in the AS_Path of each received route are matched against the local AS number configured using the bgp command and the fake AS number configured using the peer local-as command.\nAfter the peer allow-as-loop command is executed to configure the number of local AS number repetitions, the BGP speaker can allow routes with repeated AS numbers in AS_Path to pass to meet the requirements of special scenarios."
}