{
    "PageTitle": "peer advertise-community (BGP-VPN-Target address family view)",
    "FuncDef": "The peer advertise-community command configures a device to advertise a community attribute to its peer.\nThe undo peer advertise-community command cancels the existing configuration. The peer advertise-community command configures a device to advertise a community attribute to its peer. The undo peer advertise-community command cancels the existing configuration. By default, a device advertises no community attribute to its peer.",
    "CLIs": [
        "peer { <ipv4-address> | <ipv6-address> } advertise-community",
        "undo peer { <ipv4-address> | <ipv6-address> } advertise-community",
        "peer <ipv4-address> advertise-community",
        "undo peer <ipv4-address> advertise-community"
    ],
    "ParentView": [
        "BGP-VPN-target address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of a peer.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies an IPv6 peer address.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.2.2.2 as-number 200",
            "[*HUAWEI-bgp] ipv4-family vpn-target",
            "[*HUAWEI-bgp-af-vpn-target] peer 10.2.2.2 enable",
            "[*HUAWEI-bgp-af-vpn-target] peer 10.2.2.2 advertise-community"
        ]
    ],
    "ExtraInfo": "The peer advertise-community command is used to configure a device to advertise a community attribute to its peer. If a device advertises a community attribute to its peer group, all the members of the peer group will inherit the configuration. This simplifies the application of routing policies and facilitates route maintenance and management."
}