{
    "PageTitle": "peer enable (BGP-VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer enable command enables a device to exchange routing information with a specified peer group in the address family view.\nThe undo peer enable command disables a device from exchanging routes with a specified peer group. The peer enable command enables a device to exchange routing information with a specified peer group in the address family view. The undo peer enable command disables a device from exchanging routes with a specified peer group. By default, a device is disabled from exchanging routing information with a specified peer group.",
    "CLIs": [
        "peer <group-name> enable",
        "undo peer <group-name> enable"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view,BGP-VPN instance IPv6 address family view,BGP multi-instance VPN instance IPv4 address family view,BGP multi-instance VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a BGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpna",
            "[*HUAWEI-bgp-instance-vpna] group test",
            "[*HUAWEI-bgp-instance-vpna] quit",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-vpna] peer test enable"
        ]
    ],
    "ExtraInfo": "By default, the device is automatically enabled to exchange routing information only with peer groups in the BGP-IPv4 unicast address family. That is, after the peer as-number command is run in the BGP view, the system automatically configures the corresponding peer enable command. This function must be manually enabled in other address family views."
}