{
    "PageTitle": "peer route-policy export (BGP-IPv4 unicast address family view) (IPv6)",
    "FuncDef": "The peer route-policy export command specifies a route-policy for filtering routes to be advertised to a peer.\nThe undo peer route-policy export command deletes a specified route-policy. The peer route-policy export command specifies a route-policy for filtering routes to be advertised to a peer. The undo peer route-policy export command deletes a specified route-policy. By default, no route-policy is configured for the routes to be advertised to a specified BGP peer. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <peerIpv6Addr> route-policy <policy-name> export",
        "undo peer <peerIpv6Addr> route-policy <policy-name> export"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerIpv6Addr>",
            "Info": "Specifies the IPv6 address of a BGP peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<policy-name>",
            "Info": "Specifies the name of a route-policy.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy aaa permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer FE80::1 as-number 200",
            "[*HUAWEI-bgp] ipv4-family unicast",
            "[*HUAWEI-bgp-af-ipv4] peer FE80::1 enable",
            "[*HUAWEI-bgp-af-ipv4] peer FE80::1 route-policy aaa export"
        ]
    ],
    "ExtraInfo": "After a route-policy is created, the peer route-policy export command is used to apply a Route-Policy to a peer so that the routes advertised to the peer can be controlled. To be specific, only the necessary routes are advertised to the peer. In this manner, route management is implemented, the scale of the routing table is reduced, and fewer network resources are consumed."
}