{
    "PageTitle": "peer local-graceful-restart (BGP view) (IPv4 and IPv6)",
    "FuncDef": "The peer local-graceful-restart enable command enables local GR for a specified peer on a device. After this command is run, the device will not advertise the GR capability to the specified peer.\nThe peer local-graceful-restart disable command disables local GR for a specified peer on a device. The peer local-graceful-restart enable command enables local GR for a specified peer on a device. After this command is run, the device will not advertise the GR capability to the specified peer. The peer local-graceful-restart disable command disables local GR for a specified peer on a device. By default, local GR is not enabled for a peer specified on a device.",
    "CLIs": [
        "peer <ipv4-address> local-graceful-restartdisable",
        "peer <ipv4-address> local-graceful-restartenable",
        "undo peer <ipv4-address> local-graceful-restartenable",
        "undo peer <ipv4-address> local-graceful-restartdisable",
        "peer <ipv6-address> local-graceful-restartdisable",
        "peer <ipv6-address> local-graceful-restartenable",
        "undo peer <ipv6-address> local-graceful-restartdisable",
        "undo peer <ipv6-address> local-graceful-restartenable"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies an IPv4 peer address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a peer.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe address is in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.2 as-number 100",
            "[*HUAWEI-bgp] peer 10.1.1.2 local-graceful-restart enable"
        ]
    ],
    "ExtraInfo": "If a device supports GR but a BGP peer specified on the device does not support GR, you can run the peer local-graceful-restart enable command on the device to enable local GR for the peer. This configuration ensures that the device does not delete the routes received from the peer and related forwarding entries before the GR time elapses, thereby preventing traffic interruption."
}