{
    "PageTitle": "peer as-path-filter export (BGP-MVPN address family view) (group)",
    "FuncDef": "The peer as-path-filter export command configures a route-filter based on the AS_Path for the routes to be advertised to a peer group.\nThe undo peer as-path-filter export command cancels this configuration. The peer as-path-filter export command configures a route-filter based on the AS_Path for the routes to be advertised to a peer group. The undo peer as-path-filter export command cancels this configuration. By default, no policy based on an AS_Path list is configured for filtering BGP routes to be advertised to peers in a peer group, and all the BGP routes will be advertised to the peer group.",
    "CLIs": [
        "peer <group-name> as-path-filter { <number> | <name> } export",
        "undo peer <group-name> as-path-filter { <number> | <name> } export"
    ],
    "ParentView": [
        "BGP-MVPN address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "<number>",
            "Info": "Specifies the number of the AS_Path filter.\nThe value is an integer ranging from 1 to 256."
        },
        {
            "Parameters": "<name>",
            "Info": "Specifies the name of an AS_Path filter.\nThe value is a string of 1 to 51 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip as-path-filter 3 permit ^10_",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test external",
            "[*HUAWEI-bgp] ipv4-family mvpn",
            "[*HUAWEI-bgp-af-mvpn] peer test enable",
            "[*HUAWEI-bgp-af-mvpn] peer test as-path-filter 3 export"
        ]
    ],
    "ExtraInfo": "When the peer as-path-filter export command is run to apply a routing policy to the BGP routes to be advertised to a specified peer group, the AS_Path filter filters out unqualified routes."
}