{
    "PageTitle": "peer ip-prefix export (BGP multi-instance VPN instance IPv4 address family view)(IPv4)",
    "FuncDef": "The peer ip-prefix export command configures a policy based on an IP prefix list for filtering BGP routes to be advertised to a specified peer.\nThe undo peer ip-prefix export command cancels this configuration. The peer ip-prefix export command configures a policy based on an IP prefix list for filtering BGP routes to be advertised to a specified peer. The undo peer ip-prefix export command cancels this configuration. By default, no route filtering policy based on an IP address prefix list is configured for a peer.",
    "CLIs": [
        "peer <ipv4-address> ip-prefix <ip-prefix-name> export",
        "undo peer <ipv4-address> ip-prefix [ <ip-prefix-name> ] export"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies an IPv4 peer address.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "ip-prefix <ip-prefix-name>",
            "Info": "Specifies the name of an IP prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "export",
            "Info": "Applies a filtering policy to the routes to be advertised to a peer.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix prefix1 permit 0.0.0.0 32 greater-equal 32 less-equal 32",
            "[*HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vrf1",
            "[*HUAWEI-bgp-instance-a-vrf1] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp-instance-a-vrf1] peer 10.1.1.1 ip-prefix prefix1 export"
        ]
    ],
    "ExtraInfo": "To filter routes to be advertised to a specified peer, you can run the peer ip-prefix export command to configure a route filtering policy based on an IP prefix list."
}