{
    "PageTitle": "peer route-update-interval (BGP-VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer route-update-interval command sets the interval for sending Update messages with the same route prefix to a peer group.\nThe undo peer route-update-interval command restores the default configuration. The peer route-update-interval command sets the interval for sending Update messages with the same route prefix to a peer group. The undo peer route-update-interval command restores the default configuration. By default, the interval at which routing updates are sent to IBGP peers is 15s, and the interval at which routing updates are sent to EBGP peers is 30s.",
    "CLIs": [
        "peer <group-name> route-update-interval <interval>",
        "undo peer <group-name> route-update-interval"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a BGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "<interval>",
            "Info": "Specifies the minimum interval at which routing updates are sent.\nThe value is an integer that ranges from 0 to 600, in seconds. The value 0 indicates that the device immediately sends a BGP Update packet to notify the peer of the route change."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-vpna] group test",
            "[*HUAWEI-bgp-vpna] peer test route-update-interval 10"
        ]
    ],
    "ExtraInfo": "When routes change, the device sends Update packets to notify the peers. If a route changes frequently, run this command to set an interval at which the device sends Update messages carrying the same route prefix to a specified peer or peer group. This prevents the device from sending Update messages for each route change."
}