{
    "PageTitle": "peer graceful-restart timer restart (BGP-VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer graceful-restart timer restart command sets the maximum duration on a device for each peer in a specified group to wait for its BGP peer relationship to be reestablished with the device. After the command is run, the device will advertise the maximum duration to all the peers in the specified group.\nThe undo peer graceful-restart timer restart command deletes the configured duration. The peer graceful-restart timer restart command sets the maximum duration on a device for each peer in a specified group to wait for its BGP peer relationship to be reestablished with the device. After the command is run, the device will advertise the maximum duration to all the peers in the specified group. The undo peer graceful-restart timer restart command deletes the configured duration. By default, each peer in a specified group on a device waits for its BGP peer relationship to be reestablished for a maximum of 150 seconds.",
    "CLIs": [
        "peer <group-name> graceful-restarttimerrestart <time-value>",
        "undo peer <group-name> graceful-restarttimerrestart"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the peer-group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported.  The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "<time-value>",
            "Info": "Specifies the maximum duration on a device for each peer in a specified group to wait for its BGP peer relationship to be reestablished with the device.\nThe value is an integer ranging from 3 to 3600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpn1",
            "[*HUAWEI-bgp-vpn1] group a",
            "[*HUAWEI-bgp-vpn1] peer a graceful-restart timer restart 100"
        ]
    ],
    "ExtraInfo": "If both the local end and a specified peer group support GR, you can run this command to set the maximum waiting time for the specified peer group to wait for the re-establishment of the local BGP peer relationship. After this command is run, when the specified peer group finds that the local end is Down, the BGP session enters the GR process, and the specified peer group must establish a connection with the local end within the period set by this command. Otherwise, the GR process exits and the optimal route is selected from the existing routes."
}