{
    "PageTitle": "peer bfd (BGP-VPN instance IPv6 address family view) (group)",
    "FuncDef": "The peer bfd command sets BFD detection parameters for a peer group.\nThe undo peer bfd command restores default BFD detection parameter values. The peer bfd command sets BFD detection parameters for a peer group. The undo peer bfd command restores default BFD detection parameter values. By default, the interval for sending BFD packets is 1000 ms, the interval for receiving BFD packets is 1000 ms, and the local detection multiplier is 3. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <group-name> bfd { min-tx-interval <min-tx-interval> | min-rx-interval <min-rx-interval> | detect-multiplier <multiplier> }",
        "undo peer <group-name> bfd { min-tx-interval | min-rx-interval | detect-multiplier }"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view,BGP multi-instance VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "min-tx-interval <min-tx-interval>",
            "Info": "Specifies the interval at which BFD packets are sent.\nThe value is an integer ranging from 3 to 1000, in milliseconds. The default value is 1000."
        },
        {
            "Parameters": "min-rx-interval <min-rx-interval>",
            "Info": "Specifies the interval at which BFD packets are received.\nThe value is an integer ranging from 3 to 1000, in milliseconds. The default value is 1000."
        },
        {
            "Parameters": "detect-multiplier <multiplier>",
            "Info": "Specifies the local detection multiplier.\nThe value is an integer ranging from 3 to 50. The default value is 3."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpn1",
            "[*HUAWEI-bgp-6-vpn1] group test external",
            "[*HUAWEI-bgp-6-vpn1] peer test as-number 200",
            "[*HUAWEI-bgp-6-vpn1] peer test bfd min-tx-interval 100 min-rx-interval 100 detect-multiplier 5"
        ]
    ],
    "ExtraInfo": "BFD provides millisecond-level fault detection. It helps BGP to detect faults in neighboring devices or links more quickly, and instructs BGP to recalculate routes for correct packet forwarding. The peer bfd command can be used to set the values of BFD session parameters on a specified interface.\nThe BFD configuration of a peer takes precedence over that of the peer group to which the peer belongs. If BFD is not configured on a peer and the peer group to which the peer belongs is enabled with BFD, the peer will inherit the BFD configurations of the peer group."
}