{
    "PageTitle": "peer advertise add-path path-number (BGP-IPv4 unicast address family view) (group)",
    "FuncDef": "The peer advertise add-path path-number command sets the number of preferred routes to be advertised to a specified peer group.\nThe undo peer advertise add-path command restores the default configurations. The peer advertise add-path path-number command sets the number of preferred routes to be advertised to a specified peer group. The undo peer advertise add-path command restores the default configurations. By default, BGP advertises only the optimal route to a peer group.",
    "CLIs": [
        "peer <groupName> advertiseadd-pathpath-number <number> [ route-policy <route-policy-name> ]",
        "undo peer <groupName> advertiseadd-path",
        "undo peer <groupName> advertiseadd-pathpath-number <number> route-policy <route-policy-name>"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view,BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<groupName>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported.  The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "path-number <number>",
            "Info": "Specifies the number of preferred routes.\nThe value is an integer ranging from 2 to 64."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a route-policy.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy test-policy permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] bestroute add-path path-number 6",
            "[*HUAWEI-bgp] group test",
            "[*HUAWEI-bgp] peer test as-number 100",
            "[*HUAWEI-bgp] peer test capability-advertise add-path send",
            "[*HUAWEI-bgp] peer test advertise add-path path-number 3 route-policy test-policy"
        ]
    ],
    "ExtraInfo": "After BGP Add-Path is configured on an RR, the RR needs to send BGP Add-Path routes to a specified BGP peer. To configure the maximum number of routes that the RR can send to a specified BGP peer, run the peer advertise add-path path-number command. The actual number of preferred routes advertised to the peer is the smaller value between the number of routes configured using the peer advertise add-path path-number command and the number of selected routes. If the number of routes that the RR can send to the peer is less than the actual number of routes selected by the RR, the RR selects routes based on the BGP route selection rules."
}