{
    "PageTitle": "peer route-policy import (BGP-VPN-Target address family view)",
    "FuncDef": "The peer route-policy import command specifies a route-policy for filtering routes received from a peer.\nThe undo peer route-policy import command deletes a specified route-policy. The peer route-policy import command specifies a route-policy for filtering routes received from a peer. The undo peer route-policy import command deletes a specified route-policy. By default, no route-policy is configured for filtering routes received from a peer.",
    "CLIs": [
        "peer { <ipv4-address> | <ipv6-address> } route-policy <route-policy-name> import",
        "undo peer { <ipv4-address> | <ipv6-address> } route-policy <route-policy-name> import",
        "peer <ipv4-address> route-policy <route-policy-name> import",
        "undo peer <ipv4-address> route-policy <route-policy-name> import"
    ],
    "ParentView": [
        "BGP-VPN-target address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies an IPv6 peer address.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<route-policy-name>",
            "Info": "Specifies the name of a route-policy.\nThe value is a string of 1 to 200 case-sensitive characters without spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy test-policy permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.2 as-number 200",
            "[*HUAWEI-bgp] ipv4-family vpn-target",
            "[*HUAWEI-bgp-af-vpn-target] peer 10.1.1.2 enable",
            "[*HUAWEI-bgp-af-vpn-target] peer 10.1.1.2 route-policy test-policy import"
        ]
    ],
    "ExtraInfo": "After a route-policy is created, the peer route-policy import command is used to apply a Route-Policy to a peer so that the routes received from the peer can be controlled. To be specific, only the necessary routes are received from the peer. In this manner, route management is implemented, the scale of the routing table is reduced, and fewer network resources are consumed."
}