{
    "PageTitle": "peer as-path-filter export (BGP-IPv4 unicast address family view)(IPv4)",
    "FuncDef": "The peer as-path-filter export command applies a routing policy based on an AS_Path list to filter BGP routes to be advertised to a specified peer.\nThe undo peer as-path-filter export command cancels this configuration. The peer as-path-filter export command applies a routing policy based on an AS_Path list to filter BGP routes to be advertised to a specified peer. The undo peer as-path-filter export command cancels this configuration. By default, no policy based on an AS_Path list is configured for filtering BGP routes to be advertised to a peer, and all the BGP routes will be advertised to the peer.",
    "CLIs": [
        "peer <ipv4-address> as-path-filter { <number> | <name> } export",
        "undo peer <ipv4-address> as-path-filter { <number> | <name> } export"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies an IPv4 peer address.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "<number>",
            "Info": "Specifies the number of the AS_Path filter.\nThe value is an integer ranging from 1 to 256."
        },
        {
            "Parameters": "<name>",
            "Info": "Specifies the name of an AS_Path filter.\nThe value is a string of 1 to 51 case-sensitive characters. If spaces are used, the string must start and end with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip as-path-filter 3 permit ^10_",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp] ipv4-family unicast",
            "[*HUAWEI-bgp-af-ipv4] peer 10.1.1.1 as-path-filter 3 export"
        ]
    ],
    "ExtraInfo": "To apply a routing policy based on an AS_Path list to filter BGP routes to be advertised to a specified peer, run the peer as-path-filter export command. This configuration allows the routes that do not match the policy to be filtered out."
}