{
    "PageTitle": "peer ipv6-prefix import (BGP-VPN instance IPv6 address family view) (IPv6)",
    "FuncDef": "The peer ipv6-prefix import command configures a policy based on an IPv6 prefix list for filtering BGP routes received from a specified peer.\nThe undo peer ipv6-prefix import command cancels this configuration. The peer ipv6-prefix import command configures a policy based on an IPv6 prefix list for filtering BGP routes received from a specified peer. The undo peer ipv6-prefix import command cancels this configuration. By default, no route filtering policy based on an IP address prefix list is configured for a peer. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <ipv6-address> ipv6-prefix <ipv6-prefix-name> import",
        "undo peer <ipv6-address> ipv6-prefix [ <ipv6-prefix-name> ] import"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view,BGP multi-instance VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies an IPv6 peer address.\nThe value is in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "ipv6-prefix <ipv6-prefix-name>",
            "Info": "Indicates the filtering policy that is based on the IPv6 prefix list of the peer.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "import",
            "Info": "Applies a filtering policy to the routes received from a peer.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ipv6-prefix list1 permit 2001:DB8:1::1 8 greater-equal 17 less-equal 18",
            "[*HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpna",
            "[*HUAWEI-bgp-6-vpna] peer 2001:DB8:1::1 as-number 100",
            "[*HUAWEI-bgp-6-vpna] peer 2001:DB8:1::1 ipv6-prefix list1 import"
        ]
    ],
    "ExtraInfo": "The peer ipv6-prefix import command can be used to configure a route filtering policy that is based on an IPv6 prefix list for filtering BGP routes to be received from a specified peer, implementing route control."
}