{
    "PageTitle": "peer route-server-client (BGP-VPN instance IPv6 address family view)",
    "FuncDef": "The peer route-server-client command enables the route server function on a device and specifies an EBGP peer as its client.\nThe peer route-server-client disable command disables the route server function on a device and cancels the client configuration.\nThe undo peer route-server-client command cancels the route server function and client configuration.\nThe undo peer route-server-client disable command restores the default configuration and takes effect only when the peer route-server-client disable command is run. The peer route-server-client command enables the route server function on a device and specifies an EBGP peer as its client. The peer route-server-client disable command disables the route server function on a device and cancels the client configuration. The undo peer route-server-client command cancels the route server function and client configuration. The undo peer route-server-client disable command restores the default configuration and takes effect only when the peer route-server-client disable command is run. By default, the route server function is not enabled on a device, and no EBGP peer is configured as its client. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <peerIpv6Addr> route-server-client",
        "peer <peerIpv6Addr> route-server-clientdisable",
        "undo peer <peerIpv6Addr> route-server-client",
        "undo peer <peerIpv6Addr> route-server-clientdisable"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerIpv6Addr>",
            "Info": "Specifies the IPv6 address of a peer.\nThe format is X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn2",
            "[*HUAWEI-vpn-instance-vpn2] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpn2",
            "[*HUAWEI-bgp-6-vpn2] peer 2001:DB8:1::1 as-number 200",
            "[*HUAWEI-bgp-6-vpn2] peer 2001:DB8:1::1 route-server-client"
        ]
    ],
    "ExtraInfo": ""
}