{
    "PageTitle": "peer unnumbered-interface",
    "FuncDef": "The peer unnumbered-interface command specifies an outbound interface for an unnumbered peer group.\nThe undo peer unnumbered-interface command restores the default configuration. The peer unnumbered-interface command specifies an outbound interface for an unnumbered peer group. The undo peer unnumbered-interface command restores the default configuration. By default, no outbound interface is specified for an unnumbered peer group.",
    "CLIs": [
        "peer <peerGroupName> unnumbered-interface { <interface-name> | <IfType> <IFNum> }",
        "undo peer <peerGroupName> unnumbered-interface { <interface-name> | <IfType> <IFNum> }"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerGroupName>",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies an interface name.\n-"
        },
        {
            "Parameters": "<IfType>",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "<IFNum>",
            "Info": "Specifies an interface number.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group a unnumbered",
            "[*HUAWEI-bgp] peer a unnumbered-interface 100GE1/0/1"
        ]
    ],
    "ExtraInfo": "As the BGP network topology becomes increasingly complex, IP address resources are insufficient, a large number of peer relationships are established, and the configurations are more and more complex. BGP Unnumbered is a port multiplexing technology that saves IP address resources and automatically discovers and establishes peer relationships. You can run the peer unnumbered-interface command to configure an outbound interface for an unnumbered peer group. After this command is run, the IPv6 link-local address of the outbound interface and the advertisement protocol are used to automatically discover peers and establish BGP sessions with the peers, implementing IPv4 and IPv6 route distribution."
}