{
    "PageTitle": "peer graceful-shutdown(BGP view)(group)",
    "FuncDef": "The peer graceful-shutdown command enables the g-shut feature for a peer group.\nThe undo peer graceful-shutdown command restores the default configuration. The peer graceful-shutdown command enables the g-shut feature for a peer group. The undo peer graceful-shutdown command restores the default configuration. By default, the g-shut feature of a peer group is not enabled.",
    "CLIs": [
        "peer <groupName> graceful-shutdown [ local-preference <local-preference-value> | as-prepend <as-prepend-value> ]",
        "undo peer <groupName> graceful-shutdown [ local-preference <local-preference-value> | as-prepend <as-prepend-value> ]"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<groupName>",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "local-preference <local-preference-value>",
            "Info": "Specifies the local-preference value of the routes to be advertised to the peers in a peer group. Setting the value to 0 is recommended. If there are alternative routes, you can reduce the local preference of the routes advertised to IBGP peers to affect route selection.\nThe value is an integer that ranges from 0 to 4294967295."
        },
        {
            "Parameters": "as-prepend <as-prepend-value>",
            "Info": "Specifies the number of ASs to be added to the AS_Path of the route advertised to the peers in the peer group. If there are alternative routes, the length of the AS_Path is increased to affect the route selection.\nThe value is an integer ranging from 1 to 6."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group aa",
            "[*HUAWEI-bgp] peer aa graceful-shutdown local-preference 1"
        ]
    ],
    "ExtraInfo": "To enable the g-shut feature for a peer group, run this command. You can specify multiple attribute values as required."
}