{
    "PageTitle": "peer timer (BGP-VPN instance view) (group)",
    "FuncDef": "The peer timer command sets the Keepalive time and hold time for a peer group.\nThe undo peer timer command restores the default Keepalive time and hold time. The peer timer command sets the Keepalive time and hold time for a peer group. The undo peer timer command restores the default Keepalive time and hold time. By default, the Keepalive time is 60s, and the hold time is 180s.",
    "CLIs": [
        "peer <group-name> timerkeepalive <keepalive-time> hold <hold-time>",
        "peer <group-name> timerkeepalive <keepalive-time> hold <hold-time> min-holdtime <min-hold-value>",
        "undo peer <group-name> timerkeepalivehold [ min-holdtime ]",
        "undo peer <group-name> timerkeepalive <keepalive-time> hold <hold-time>",
        "undo peer <group-name> timerkeepalive <keepalive-time> hold <hold-time> min-holdtime <min-hold-value>"
    ],
    "ParentView": [
        "BGP-VPN instance view,BGP multi-instance VPN instance session view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a BGP peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "keepalive <keepalive-time>",
            "Info": "Specifies the Keepalive time.\nThe value is an integer in the range from 0 to 21845, in seconds. The default value is 60."
        },
        {
            "Parameters": "hold <hold-time>",
            "Info": "Indicates the hold time.\nThe value is 0 or an integer ranging from 3 to 65535, in seconds. The default value is 180.\nIt is recommended that the configured hold time be related to the total number of BGP address family peers. For details, see the mapping between the total number of BGP peers in each address family and the recommended minimum hold time in the usage guide of the peer timer command."
        },
        {
            "Parameters": "min-holdtime <min-hold-value>",
            "Info": "Specifies the minimum hold time. On the same device, min-hold-value must be less than hold-time.\nThe value is an integer ranging from 20 to 65535, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-vpn1] group test",
            "[*HUAWEI-bgp-instance-vpn1] peer test timer keepalive 10 hold 30"
        ]
    ],
    "ExtraInfo": "After establishing a BGP connection, two peers periodically send Keepalive messages to each other to detect the status of the BGP connection. If a device receives no Keepalive message or any other type of message from its peer within the specified hold time, the device considers the BGP connection interrupted and closes the BGP connection.\nThe keepalive-time and hold-time values are determined through negotiation between peers. The smaller value of hold-time contained in Open messages of both peers is used as the final value of hold-time. The smaller value of one third of hold-time and the locally configured keepalive-time is used as the final value of keepalive-time.\nYou can run this command to set the Keepalive time and hold time of BGP."
}