{
    "PageTitle": "peer as-path-filter import (BGP-VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer as-path-filter import command configures a BGP route filtering policy based on the AS_Path for the routes received from a peer group.\nThe undo peer as-path-filter import command cancels the existing configuration. The peer as-path-filter import command configures a BGP route filtering policy based on the AS_Path for the routes received from a peer group. The undo peer as-path-filter import command cancels the existing configuration. By default, no policy based on an AS_Path list is configured for filtering BGP routes received from peers in a peer group, and all the received BGP routes will be permitted.",
    "CLIs": [
        "peer <group-name> as-path-filter { <number> | <name> } import",
        "undo peer <group-name> as-path-filter { <number> | <name> } import"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a BGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "<number>",
            "Info": "Specifies the number of the AS path filter.\nThe value is a decimal integer ranging from 1 to 256."
        },
        {
            "Parameters": "<name>",
            "Info": "Specifies the name of an AS_Path filter.\nThe value is a string of 1 to 51 case-sensitive characters. If spaces are used, the string must start and end with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip as-path-filter 3 permit 10",
            "[*HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-vpna] group test",
            "[*HUAWEI-bgp-vpna] peer test as-path-filter 3 import"
        ]
    ],
    "ExtraInfo": "When the peer as-path-filter import command is run to apply a routing policy to BGP routes received from a specified peer group, the AS_Path filter filters out unqualified routes."
}