{
    "PageTitle": "peer graceful-shutdown(BGP view)",
    "FuncDef": "The peer graceful-shutdown command enables the g-shut function for a single peer (without activating the function) and specifies the attributes to be modified during the g-shut period.\nThe undo peer graceful-shutdown command disables the g-shut function of a single peer. The peer graceful-shutdown command enables the g-shut function for a single peer (without activating the function) and specifies the attributes to be modified during the g-shut period. The undo peer graceful-shutdown command disables the g-shut function of a single peer. By default, the g-shut function is disabled on a peer.",
    "CLIs": [
        "peer { <peerIpv4Addr> | <peerIpv6Addr> } graceful-shutdown [ local-preference <local-preference-value> | as-prepend <as-prepend-value> ]",
        "peer { <peerIpv4Addr> | <peerIpv6Addr> } graceful-shutdowndisable",
        "undo peer { <peerIpv4Addr> | <peerIpv6Addr> } graceful-shutdown [ local-preference <local-preference-value> | as-prepend <as-prepend-value> ]",
        "undo peer { <peerIpv4Addr> | <peerIpv6Addr> } graceful-shutdowndisable",
        "peer <peerIpv4Addr> graceful-shutdown [ local-preference <local-preference-value> | as-prepend <as-prepend-value> ]",
        "peer <peerIpv4Addr> graceful-shutdowndisable",
        "undo peer <peerIpv4Addr> graceful-shutdown [ local-preference <local-preference-value> | as-prepend <as-prepend-value> ]",
        "undo peer <peerIpv4Addr> graceful-shutdowndisable"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerIpv4Addr>",
            "Info": "Specifies the IPv4 address of a peer.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "<peerIpv6Addr>",
            "Info": "Specifies the IPv6 address of a peer.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X"
        },
        {
            "Parameters": "local-preference <local-preference-value>",
            "Info": "Indicates the local-preference value of the routes to be advertised to the peer. Setting the value to 0 is recommended. If there are alternative routes, you can reduce the local preference of the routes advertised to IBGP peers to affect route selection.\nThe value is an integer that ranges from 0 to 4294967295."
        },
        {
            "Parameters": "as-prepend <as-prepend-value>",
            "Info": "Specifies the number of ASs to be added to the AS_Path of the routes to be advertised to the peer. If alternative routes exist, the length of the AS_Path is increased to affect the route selection.\nThe value is an integer ranging from 1 to 6."
        },
        {
            "Parameters": "disable",
            "Info": "Disables the g-shut feature of a peer. The difference between this parameter and the undo command is that this parameter disables the peer from inheriting the g-shut feature from a peer group.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 graceful-shutdown local-preference 1"
        ]
    ],
    "ExtraInfo": ""
}