{
    "PageTitle": "peer as-path-filter export (BGP-IPv6 unicast address family view) (IPv6)",
    "FuncDef": "The peer as-path-filter export command applies a routing policy based on an AS_Path list to filter BGP routes to be advertised to a specified peer.\nThe undo peer as-path-filter export command cancels this configuration. The peer as-path-filter export command applies a routing policy based on an AS_Path list to filter BGP routes to be advertised to a specified peer. The undo peer as-path-filter export command cancels this configuration. By default, no policy based on an AS_Path list is configured for filtering BGP routes to be advertised to a peer, and all the BGP routes will be advertised to the peer. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <ipv6-address> as-path-filter { <number> | <name> } export",
        "undo peer <ipv6-address> as-path-filter { <number> | <name> } export"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<number>",
            "Info": "Specifies the number of an AS_Path filter. The value ranges from 1 to 256.\nThe value is an integer in the range from 1 to 256."
        },
        {
            "Parameters": "<name>",
            "Info": "Specifies the name of an AS_Path filter.\nThe value is a string of 1 to 51 case-sensitive characters. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip as-path-filter 3 permit ^10_",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 2001:DB8:1::1 as-number 100",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] peer 2001:DB8:1::1 enable",
            "[*HUAWEI-bgp-af-ipv6] peer 2001:DB8:1::1 as-path-filter 3 export"
        ]
    ],
    "ExtraInfo": "To apply a routing policy based on an AS_Path list to filter BGP routes to be advertised to a specified peer, run the peer as-path-filter export command. This configuration allows the routes that do not match the policy to be filtered out."
}