{
    "PageTitle": "peer advertise hierarchy-convergence",
    "FuncDef": "The peer advertise hierarchy-convergence enable command enables the function of advertising the hierarchical convergence attribute to a peer.\nThe undo peer advertise hierarchy-convergence enable command removes the configuration of enabling the function of advertising the hierarchical convergence attribute to a peer.\nThe peer advertise hierarchy-convergence disable command disables a device from advertising the hierarchical convergence attribute to a peer.\nThe undo peer advertise hierarchy-convergence disable command removes the configuration of disabling the function of advertising hierarchical convergence attributes to a peer. The peer advertise hierarchy-convergence enable command enables the function of advertising the hierarchical convergence attribute to a peer. The undo peer advertise hierarchy-convergence enable command removes the configuration of enabling the function of advertising the hierarchical convergence attribute to a peer. The peer advertise hierarchy-convergence disable command disables a device from advertising the hierarchical convergence attribute to a peer. The undo peer advertise hierarchy-convergence disable command removes the configuration of disabling the function of advertising hierarchical convergence attributes to a peer. By default, the function of advertising the hierarchical convergence attribute to a peer is enabled. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <ipv6-address> advertisehierarchy-convergence { enable | disable }",
        "undo peer <ipv6-address> advertisehierarchy-convergence { enable | disable }"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view,BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is in the format X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 2001:DB8:1::1 as-number 100",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] peer 2001:DB8:1::1 enable",
            "[*HUAWEI-bgp-af-ipv6] peer 2001:DB8:1::1 advertise hierarchy-convergence enable"
        ]
    ],
    "ExtraInfo": ""
}