{
    "PageTitle": "peer oscillation-dampening (BGP multi-instance VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer oscillation-dampening disable command disables a device from suppressing the establishment of BGP connections with peers in a BGP peer group that flap continuously.\nThe undo peer oscillation-dampening disable command cancels the configuration of disabling a device from suppressing the establishment of BGP connections with peers in a BGP peer group that flap continuously.\nThe peer oscillation-dampening command suppresses the establishment of peer relationships that flap continuously in a BGP peer group.\nThe undo peer oscillation-dampening command cancels the configuration of suppressing the establishment of BGP connections with peers in a BGP peer group that flap continuously and restores the default configuration. The peer oscillation-dampening disable command disables a device from suppressing the establishment of BGP connections with peers in a BGP peer group that flap continuously. The undo peer oscillation-dampening disable command cancels the configuration of disabling a device from suppressing the establishment of BGP connections with peers in a BGP peer group that flap continuously. The peer oscillation-dampening command suppresses the establishment of peer relationships that flap continuously in a BGP peer group. The undo peer oscillation-dampening command cancels the configuration of suppressing the establishment of BGP connections with peers in a BGP peer group that flap continuously and restores the default configuration. By default, BGP suppresses the establishment of a specified peer group's peer relationships that flap continuously.",
    "CLIs": [
        "peer <peerGroupName> oscillation-dampeningdisable",
        "peer <peerGroupName> oscillation-dampening",
        "undo peer <peerGroupName> oscillation-dampeningdisable",
        "undo peer <peerGroupName> oscillation-dampening"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerGroupName>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-a-vpna] group test external",
            "[*HUAWEI-bgp-instance-a-vpna] peer test as-number 200",
            "[*HUAWEI-bgp-instance-a-vpna] peer test oscillation-dampening disable"
        ]
    ],
    "ExtraInfo": "After a BGP peer relationship is established, the local device learns all routes from the peer and also advertises its local routes to the peer. If the peer relationship is disconnected, the local device deletes all the routes learned from the peer.\nGenerally, a large number of BGP routes exist, and in this case, a large number of routes change and a large amount of data is processed when the BGP peer relationship is flapping. As a result, a high volume of resources are consumed, causing high CPU usage. To prevent high CPU usage in this case, BGP needs to be enabled to suppress the establishment of the peer relationship if it flaps continuously. Such suppression is implemented for a BGP peer relationship that flaps for more than five times consecutively, and the suppression period increases as the number of flapping times increases. You can run the display bgp peer verbose command to check the remaining time that BGP waits to establish the BGP peer relationship.\nAfter the peer relationship stops flapping for a certain period, suppression on the peer relationship establishment is automatically removed. To immediately remove the suppression, you can run the peer oscillation-dampening disable command. Alternatively, you can run a reset command or another command that can cause the peer relationship to be disconnected and re-established."
}