{
    "PageTitle": "peer capability-advertise (BGP multi-instance view) (group)",
    "FuncDef": "The peer capability-advertise command enables the optional functions for BGP to advertise routes, including the route-refresh function, conventional functions, and 4-byte AS number function.\nThe undo peer capability-advertise command restores the default setting. The peer capability-advertise command enables the optional functions for BGP to advertise routes, including the route-refresh function, conventional functions, and 4-byte AS number function. The undo peer capability-advertise command restores the default setting. By default, the BGP route-refresh and 4-byte AS number functions are enabled, but conventional functions are disabled.",
    "CLIs": [
        "peer <group-name> capability-advertise { conventional | route-refresh | 4-byte-as }",
        "undo peer <group-name> capability-advertise { conventional | route-refresh | 4-byte-as }"
    ],
    "ParentView": [
        "BGP multi-instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported.  The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "conventional",
            "Info": "Indicates conventional functions.\nThis parameter is valid only in the BGP view and BGP-VPN instance IPv4 address family view.After conventional functions are enabled on a device, the device does not have extended functions, such as route-refresh and GR.\n-"
        },
        {
            "Parameters": "route-refresh",
            "Info": "Indicates the route-refresh function.\n-"
        },
        {
            "Parameters": "4-byte-as",
            "Info": "Indicates the 4-byte AS number function.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100 instanc a",
            "[*HUAWEI-bgp-instance-a] group test",
            "[*HUAWEI-bgp-instance-a] peer test capability-advertise route-refresh"
        ]
    ],
    "ExtraInfo": "BGP has many optional functions when advertising routes, including route-refresh, conventional functions, and 4-byte AS numbers. Using the peer capability-advertise command, you can enable or disable these functions as required."
}