{
    "PageTitle": "peer default-route-advertise(BGP-VPN-Target address family view)",
    "FuncDef": "The peer default-route-advertise command configures a device to advertise default routes to its peer.\nThe undo peer default-route-advertise command restores the default configuration. The peer default-route-advertise command configures a device to advertise default routes to its peer. The undo peer default-route-advertise command restores the default configuration. By default, a device does not advertise any default route to its peer.",
    "CLIs": [
        "peer { <ipv4-address> | <ipv6-address> } default-route-advertise",
        "undo peer { <ipv4-address> | <ipv6-address> } default-route-advertise",
        "peer <ipv4-address> default-route-advertise",
        "undo peer <ipv4-address> default-route-advertise"
    ],
    "ParentView": [
        "BGP-VPN-target address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies an IPv6 peer address.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp] ipv4-family vpn-target",
            "[*HUAWEI-bgp-af-vpn-target] peer 10.1.1.1 enable",
            "[*HUAWEI-bgp-af-vpn-target] peer 10.1.1.1 default-route-advertise"
        ]
    ],
    "ExtraInfo": "In an ORF scenario, if a device that does not support ORF exists on the network, you can configure the device to advertise ORF default routes to a peer group in the BGP-VPN-Target address family view to establish an ORF peer relationship."
}