{
    "PageTitle": "peer keychain (BGP-VPN instance view) (IPv6)",
    "FuncDef": "The peer keychain command configures the Keychain authentication for establishing the TCP connection between BGP peers.\nThe undo peer keychain command deletes the Keychain authentication. The peer keychain command configures the Keychain authentication for establishing the TCP connection between BGP peers. The undo peer keychain command deletes the Keychain authentication. By default, the Keychain authentication is not performed during TCP connection establishment between peers. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <ipv6-address> keychain <keychain-name>",
        "undo peer <ipv6-address> keychain"
    ],
    "ParentView": [
        "BGP-VPN instance view,BGP multi-instance VPN instance session view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a peer.\nThe format is X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<keychain-name>",
            "Info": "Specifies the name of the Keychain authentication.\nBefore configuring this parameter, run the keychain command to create a keychain. Then, run the key-id, key-string, and algorithm commands to configure a key ID, a password, and an authentication algorithm for this keychain. Otherwise, the authentication will fail, and the BGP peer relationship fails to be established.\nIf the dependent keychain is deleted, the neighbor relationship may be interrupted. Therefore, exercise caution when deleting the keychain.\nThe value is a string of 1 to 47 case-insensitive characters. The characters do not include question marks (?) or spaces. However, when double quotation marks (\") are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] keychain keychain_1 mode periodic daily",
            "[*HUAWEI-keychain-keychain_1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-vpn1] peer 2001:DB8:1::1 as-number 200",
            "[*HUAWEI-bgp-instance-vpn1] peer 2001:DB8:1::1 keychain keychain_1"
        ]
    ],
    "ExtraInfo": "Configuring Keychain authentication improves the security of the TCP connection. You must configure Keychain authentication specified for TCP-based applications on both BGP peers. Note that encryption algorithms and passwords configured for the Keychain authentication on both peers must be the same; otherwise, the TCP connection cannot be set up between BGP peers and BGP messages cannot be transmitted."
}