{
    "PageTitle": "peer reflect-client (BGP-MVPN address family view)",
    "FuncDef": "The peer reflect-client command configures the local router as the route reflector and the peer or peer group as the client of the route reflector.\nThe undo peer reflect-client command cancels the configuration. The peer reflect-client command configures the local router as the route reflector and the peer or peer group as the client of the route reflector. The undo peer reflect-client command cancels the configuration. By default, the route reflector and its client are not configured.",
    "CLIs": [
        "peer <ipv4-address> reflect-client",
        "undo peer <ipv4-address> reflect-client"
    ],
    "ParentView": [
        "BGP-MVPN address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.2 as-number 100",
            "[*HUAWEI-bgp] ipv4-family mvpn",
            "[*HUAWEI-bgp-af-mvpn] peer 10.1.1.2 enable",
            "[*HUAWEI-bgp-af-mvpn] peer 10.1.1.2 reflect-client"
        ]
    ],
    "ExtraInfo": "Full-meshed connections need to be established between IBGP peers to ensure the connectivity between the IBGP peers. If there are n devices in an AS, n x (n â\u0080\u0093 1)/2 IBGP connections need to be established. When there are a lot of IBGP peers, network resources and CPU resources are greatly consumed. To solve this problem, route reflection is used.\nIn an AS, one device functions as an RR, and the other devices function as clients. The clients establish IBGP connections with the RR. The RR and its clients form a cluster. The RR reflects routes among the clients, and therefore the clients do not need to establish any BGP connection. Assume that an AS has n devices. If one of the devices functions as an RR, and other devices function as clients, the number of IBGP connections to be established is n-1. This means that network and CPU resource consumption is greatly reduced.\nAn RR is easy to configure, because it needs to be configured only on the device that functions as a reflector and clients do not need to know that they are clients."
}