{
    "PageTitle": "peer group (BGP-VPN-Target address family view)",
    "FuncDef": "The peer group command adds a peer to a peer group.\nThe undo peer group command removes a peer from a peer group but retains all the configurations of the peer. The peer group command adds a peer to a peer group. The undo peer group command removes a peer from a peer group but retains all the configurations of the peer. By default, no peer group is created.",
    "CLIs": [
        "peer { <ipv4-address> | <ipv6-address> } group <group-name>",
        "undo peer { <ipv4-address> | <ipv6-address> } group <group-name>",
        "peer <ipv4-address> group <group-name>",
        "undo peer <ipv4-address> group <group-name>"
    ],
    "ParentView": [
        "BGP-VPN-target address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specify an IPv4 peer address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies an IPv6 peer address.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test internal",
            "[*HUAWEI-bgp] peer 10.2.2.2 as-number 100",
            "[*HUAWEI-bgp] ipv4-family vpn-target",
            "[*HUAWEI-bgp-af-vpn-target] peer 10.2.2.2 enable",
            "[*HUAWEI-bgp-af-vpn-target] peer test enable",
            "[*HUAWEI-bgp-af-vpn-target] peer 10.2.2.2 group test"
        ]
    ],
    "ExtraInfo": "On a large-scale BGP network, there are a large number of peers and many of them have the same routing policies. To configure these peers, you have to repeatedly use some commands. In such a case, configuring peer groups can simplify configurations. If you intend to perform the same configuration on several peers, create and configure a peer. Then, add the peers to the peer group. The peers will inherit the configurations of the peer group."
}