{
    "PageTitle": "peer local-graceful-restart timer wait-for-rib (BGP-VPN instance view) (group)",
    "FuncDef": "The peer local-graceful-restart timer wait-for-rib command sets the maximum duration for a BGP restarter to wait for the End-of-RIB flag from each peer in a specified group.\nThe undo peer local-graceful-restart timer wait-for-rib command deletes the configured duration. The peer local-graceful-restart timer wait-for-rib command sets the maximum duration for a BGP restarter to wait for the End-of-RIB flag from each peer in a specified group. The undo peer local-graceful-restart timer wait-for-rib command deletes the configured duration. By default, a BGP restarter waits for the End-of-RIB flag from each peer in a specified group for a maximum of 600s.",
    "CLIs": [
        "peer <group-name> local-graceful-restarttimerwait-for-rib <wfrtime>",
        "undo peer <group-name> local-graceful-restarttimerwait-for-rib"
    ],
    "ParentView": [
        "BGP-VPN instance view,BGP multi-instance VPN instance session view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a BGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "<wfrtime>",
            "Info": "Specifies the maximum duration for a BGP restarter to wait for the End-of-RIB flag.\nThe value is an integer ranging from 3 to 3000, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] route-distinguisher 1:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-vpn1] group aa",
            "[*HUAWEI-bgp-instance-vpn1] peer aa local-graceful-restart timer wait-for-rib 100"
        ]
    ],
    "ExtraInfo": ""
}