{
    "PageTitle": "peer filter-policy export (BGP multi-instance VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer filter-policy export command configures an ACL-based policy for filtering BGP routes to be advertised to a specified peer group.\nThe undo peer filter-policy export command cancels this configuration. The peer filter-policy export command configures an ACL-based policy for filtering BGP routes to be advertised to a specified peer group. The undo peer filter-policy export command cancels this configuration. By default, no filtering policy is configured for the routes to be advertised to a peer group.",
    "CLIs": [
        "peer <group-name> filter-policy <acl-number> export",
        "peer <group-name> filter-policyacl-name <acl-name> export",
        "undo peer <group-name> filter-policy <acl-number> export",
        "undo peer <group-name> filter-policyacl-name <acl-name> export"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported.  The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "<acl-number>",
            "Info": "Specifies the number of the basic ACL.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "export",
            "Info": "Filters advertised routes.\n-"
        },
        {
            "Parameters": "acl-name <acl-name>",
            "Info": "Specifies the name of a named basic ACL.\nThe value is a string of 1 to 64 case-sensitive characters starting with a letter. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl 2001",
            "[*HUAWEI-acl4-basic-2001] rule permit",
            "[*HUAWEI-acl4-basic-2001] quit",
            "[*HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-a-vpna] group test",
            "[*HUAWEI-bgp-instance-a-vpna] peer test filter-policy 2001 export"
        ]
    ],
    "ExtraInfo": "If you do not want all routes to be advertised to a peer group, you can run the peer filter-policy export command to configure an ACL-based filtering policy to filter the routes to be advertised to the peer group."
}