{
    "PageTitle": "peer tracking (BGP multi-instance VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer tracking command enables BGP Peer Tracking. That is, you can configure BGP to fast detect the unreachable state of a peer and re-establish the connection between the local device and the peer.\nThe undo peer tracking command disables BGP Peer Tracking. The peer tracking command enables BGP Peer Tracking. That is, you can configure BGP to fast detect the unreachable state of a peer and re-establish the connection between the local device and the peer. The undo peer tracking command disables BGP Peer Tracking. By default, BGP Peer Tracking is disabled.",
    "CLIs": [
        "peer <group-name> tracking [ delay <delay-time> ]",
        "undo peer <group-name> tracking"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters and cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "delay <delay-time>",
            "Info": "Indicates the interval between when BGP detects the peer unreachable and when BGP tears down the corresponding connection.\nAn integer ranging from 0 to 65535, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-a-vpna] group test",
            "[*HUAWEI-bgp-instance-a-vpna] peer test tracking"
        ]
    ],
    "ExtraInfo": "In a network where BFD is unsuitable to be deployed, you can configure BGP Peer Tracking on the local device to implement fast network convergence by rapidly detecting the unreachable state of the peer.\nA BGP peer is considered unreachable in either of the following situations:"
}