{
    "PageTitle": "peer next-hop-invariable (BGP-IPv6 unicast address family view) (group)",
    "FuncDef": "The peer next-hop-invariable command configures the device not to change the next hop of a route when advertising the route to a peer.\nThe undo peer next-hop-invariable command restores the default configuration. The peer next-hop-invariable command configures the device not to change the next hop of a route when advertising the route to a peer. The undo peer next-hop-invariable command restores the default configuration. By default: This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <peerGroupName> next-hop-invariable [ include-static-route | include-unicast-route ]",
        "undo peer <peerGroupName> next-hop-invariable"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<peerGroupName>",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "include-static-route",
            "Info": "Configures the BGP speaker to retain the original Next_Hop of imported static routes when advertising the routes to the peer.\n-"
        },
        {
            "Parameters": "include-unicast-route",
            "Info": "Configures the device to retain the original Next_Hop of unicast routes learned from peers when advertising the routes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test external",
            "[*HUAWEI-bgp] peer test as-number 200",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[~HUAWEI-bgp-af-ipv6] peer test enable",
            "[*HUAWEI-bgp-af-ipv6] peer test next-hop-invariable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test external",
            "[*HUAWEI-bgp] peer test as-number 200",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[~HUAWEI-bgp-af-ipv6] peer test enable",
            "[*HUAWEI-bgp-af-ipv6] peer test next-hop-invariable include-static-route"
        ]
    ],
    "ExtraInfo": "The peer next-hop-invariable command has the following functions:"
}