{
    "PageTitle": "peer timer (BGP view)",
    "FuncDef": "The peer timer command sets the Keepalive time and hold time for a peer.\nThe undo peer timer command restores the default Keepalive time and hold time. The peer timer command sets the Keepalive time and hold time for a peer. The undo peer timer command restores the default Keepalive time and hold time. By default, the keepalive time is 60s, the hold time is 180s, and the session hold time is 86400s.",
    "CLIs": [
        "peer <ipv4-address> timerkeepalive <keepalive-time> hold <hold-time>",
        "peer <ipv4-address> timerkeepalive <keepalive-time> hold <hold-time> min-holdtime <min-hold-value>",
        "peer <ipv4-address> timersend-hold <send-hold-time>",
        "undo peer <ipv4-address> timerkeepalivehold [ min-holdtime ]",
        "undo peer <ipv4-address> timerkeepalive <keepalive-time> hold <hold-time> min-holdtime <min-hold-value>",
        "undo peer <ipv4-address> timerkeepalive <keepalive-time> hold <hold-time>",
        "undo peer <ipv4-address> timersend-hold <send-hold-time>"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies an IPv4 peer address.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "keepalive <keepalive-time>",
            "Info": "Specifies the Keepalive time.\nThe value is an integer ranging from 0 to 21845, in seconds. The default value is 60 seconds."
        },
        {
            "Parameters": "hold <hold-time>",
            "Info": "Indicates the hold time.\nThe value is 0 or an integer ranging from 3 to 65535, in seconds. The default value is 180.\nIt is recommended that the configured hold time be related to the total number of BGP address family peers. For details, see the mapping between the total number of BGP peers in each address family and the recommended minimum hold time in the usage guide of the peer timer command."
        },
        {
            "Parameters": "min-holdtime <min-hold-value>",
            "Info": "Specifies the minimum hold time. On the same device, min-hold-value must be less than hold-time.\nThe value is an integer ranging from 20 to 65535, in seconds."
        },
        {
            "Parameters": "send-hold <send-hold-time>",
            "Info": "Specifies the interval for holding a session when the local end fails to send messages.\nThe value is 0 or an integer ranging from 360 to 172800, in seconds. The default value is 86400. The value 0 indicates that the function is disabled."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 200",
            "[*HUAWEI-bgp] peer 10.1.1.1 timer keepalive 10 hold 30"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 200",
            "[*HUAWEI-bgp] peer 10.1.1.1 timer send-hold 720"
        ]
    ],
    "ExtraInfo": "After establishing a BGP connection, two peers periodically send Keepalive messages to each other to detect the status of the BGP connection. If a device receives no Keepalive message or any other type of message from its peer within the specified hold time, the device considers the BGP connection interrupted and closes the BGP connection.\nIn addition, if the device fails to send BGP Update and Keepalive messages within twice the hold time, an alarm is reported. If the alarm is not cleared within the specified send hold time, the BGP connection is reset."
}