{
    "PageTitle": "peer ipv6-prefix export (BGP-IPv6 unicast address family view) (group)",
    "FuncDef": "The peer ipv6-prefix export command configures a policy based on an IPv6 prefix list for filtering BGP routes to be advertised to a specified peer group.\nThe undo peer ipv6-prefix export command cancels this configuration. The peer ipv6-prefix export command configures a policy based on an IPv6 prefix list for filtering BGP routes to be advertised to a specified peer group. The undo peer ipv6-prefix export command cancels this configuration. By default, no route filtering policy based on an IP address prefix list is configured for a peer group. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "peer <group-name> ipv6-prefix <ipv6-prefix-name> export",
        "undo peer <group-name> ipv6-prefix [ <ipv6-prefix-name> ] export"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<group-name>",
            "Info": "Specifies the name of a peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "ipv6-prefix <ipv6-prefix-name>",
            "Info": "Indicates the filtering policy that is based on the IPv6 prefix list of the peer.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "export",
            "Info": "Applies a filtering policy to the routes to be advertised to a peer group.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ipv6-prefix list1 permit 2001:DB8:1::1 8 greater-equal 17 less-equal 18",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test external",
            "[*HUAWEI-bgp] peer test as-number 200",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] peer test enable",
            "[*HUAWEI-bgp-af-ipv6] peer test ipv6-prefix list1 export"
        ]
    ],
    "ExtraInfo": "The peer ipv6-prefix export command can be used to configure a route filtering policy that is based on an IPv6 prefix list to filter routes to be advertised, implementing route control."
}