{
    "PageTitle": "peer listen-only connect-only (BGP multi-instance VPN instance IPv4 address family view)(IPv4)",
    "FuncDef": "The peer listen-only command configures a peer group to only listen to connection requests and not to initiatively send connection requests.\nThe undo peer listen-only command cancels the function.\nThe peer connect-only command configures a peer group to send connection requests but rejects connection requests.\nThe undo peer connect-only command restores the default setting. The peer listen-only command configures a peer group to only listen to connection requests and not to initiatively send connection requests. The undo peer listen-only command cancels the function. The peer connect-only command configures a peer group to send connection requests but rejects connection requests. The undo peer connect-only command restores the default setting. By default, a peer listens to and accepts connection requests, and sends connection requests.",
    "CLIs": [
        "peer <ipv4-address> { listen-only | connect-only }",
        "undo peer <ipv4-address> { listen-only | connect-only }"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-a-vpna] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp-instance-a-vpna] peer 10.1.1.1 connect-only"
        ]
    ],
    "ExtraInfo": "To enable a peer to listen to connection requests but not to send connection requests, run the peer listen-only command.\nTo enable a peer to send connection requests but not to accept connection requests, run the peer connect-only command."
}