{
    "PageTitle": "preference (BGP-VPN instance IPv4 address family view)",
    "FuncDef": "The preference command sets a priority for EBGP routes, IBGP routes, or local BGP routes. BGP routes are configured with different priorities in different address family views.\nThe undo preference command restores the default setting. The preference command sets a priority for EBGP routes, IBGP routes, or local BGP routes. BGP routes are configured with different priorities in different address family views. The undo preference command restores the default setting. By default, the priorities of EBGP routes, IBGP routes, and local BGP routes are all 255.",
    "CLIs": [
        "preference { <external> <internal> <local> | route-policy <route-policy-name> }",
        "undo preference"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<external>",
            "Info": "Specifies the priority of an EBGP route. An EBGP route is the optimal route learned from a peer outside the local AS.\nThe value is an integer ranging from 1 to 255. The smaller the value is, the higher the priority is."
        },
        {
            "Parameters": "<internal>",
            "Info": "Specifies the priority of an IBGP route. An IBGP route is a route learned from a peer inside the AS.\nThe value is an integer ranging from 1 to 255. The smaller the value is, the higher the priority is."
        },
        {
            "Parameters": "<local>",
            "Info": "Specifies the priority for summary and leaked routes. This parameter takes effect for the following routes:\nManually summary routes generated using the aggregate (BGP) command.Automatically summary routes generated using the summary automatic command.Routes generated through remote route leaking.Routes generated through local route leaking.For details about these routes, see.Precautions.\nThe value is an integer ranging from 1 to 255. The smaller the value is, the higher the priority is."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a route-policy.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-vpna] preference 2 2 20"
        ]
    ],
    "ExtraInfo": "Running the preference command to set priorities for BGP routes affects route selection among BGP routes and routes of other routing protocols.\nAfter a route-policy or route-filter is configured on a device, the device sets priorities only for the received routes that meet the matching rules. The routes that do not meet the rules use the default priority.\nThe smaller the priority value, the higher the priority.\nA route learned from a VPNv4 peer can be matched to a VPN instance through RT matching, and then the preference command can be run in the VPN address family view to configure a priority for the route."
}