{
    "PageTitle": "preference (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The preference command sets a priority for EBGP routes, IBGP routes, or local BGP routes. BGP routes are configured with different priorities in different address family views.\nThe undo preference command restores the default setting. The preference command sets a priority for EBGP routes, IBGP routes, or local BGP routes. BGP routes are configured with different priorities in different address family views. The undo preference command restores the default setting. By default, the priorities of EBGP routes, IBGP routes, and local BGP routes are all 255.",
    "CLIs": [
        "preference { <external> <internal> <local> | route-policy <route-policy-name> }",
        "undo preference"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "<external>",
            "Info": "Specifies a protocol preference of EBGP external routes, which are the optimal routes learned from peers outside the local AS.\nThe value is an integer that ranges from 1 to 255. A smaller value indicates a higher priority."
        },
        {
            "Parameters": "<internal>",
            "Info": "Specifies the protocol preference of IBGP routes (those learned from peers in the same AS).\nThe value is an integer that ranges from 1 to 255. A smaller value indicates a higher priority."
        },
        {
            "Parameters": "<local>",
            "Info": "Specifies the priority for local routes. This parameter takes effect for the following routes:\nManually summary routes generated using the aggregate (BGP) command.Automatically summary routes generated using the summary automatic command.Routes generated through remote route leaking.Routes generated through local route leaking.For details about these routes, see Precautions.\nThe value is an integer that ranges from 1 to 255. A smaller value indicates a higher priority."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a route-policy.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-instance-vpn1] quit",
            "[~HUAWEI] bgp 100 instance aa",
            "[~HUAWEI-bgp-instance-aa] ipv4-family vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-aa-vpn1] preference 2 2 20"
        ]
    ],
    "ExtraInfo": "Running the preference command to set priorities for BGP routes affects route selection among BGP routes and routes of other routing protocols.\nAfter a route-policy or route-filter is configured on a device, the device sets priorities only for the routes received from peers, which meet the matching rules. The routes that do not meet the rules use the default priority.\nThe smaller the priority value, the higher the priority."
}