{
    "PageTitle": "reflect change-path-attribute (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The reflect change-path-attribute command enables an RR to modify path attributes of BGP routes through an export policy.\nThe undo reflect change-path-attribute command disables an RR from modifying path attributes of BGP routes through an export policy. The reflect change-path-attribute command enables an RR to modify path attributes of BGP routes through an export policy. The undo reflect change-path-attribute command disables an RR from modifying path attributes of BGP routes through an export policy. By default, an RR is disabled from modifying path attributes of BGP routes through an export policy.",
    "CLIs": [
        "reflect change-path-attribute",
        "undo reflect change-path-attribute"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vrf1",
            "[*HUAWEI-bgp-instance-a-vrf1] reflect change-path-attribute"
        ]
    ],
    "ExtraInfo": "According to standard protocols, RRs are disabled from modifying path attributes through an export policy; otherwise, routing loops may occur. Therefore, by default, an export policy cannot be configured on an RR to modify path attributes.\nTo enable an RR to modify path attributes of BGP routes through an export policy, run the reflect change-path-attribute command. The attributes that can be modified are as follows:"
}