{
    "PageTitle": "refresh bgp vpn-instance ipv4-family",
    "FuncDef": "The refresh bgp vpn-instance ipv4-family command softly resets connections in the BGP-VPN instance IPv4 address family. The refresh bgp vpn-instance ipv4-family command softly resets connections in the BGP-VPN instance IPv4 address family.",
    "CLIs": [
        "refresh bgp [ instance <instance-name> ] vpn-instance <vpn-instance-name> ipv4-family { all | <ipv4-address> | external | internal | group <group-name> } { export | import }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance <instance-name>",
            "Info": "Specifies a BGP multi-instance.\nThe value is a string of 1 to 31 case-sensitive characters without any spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Softly resets the connection of a specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name cannot be _public_. If the string is enclosed in double quotation marks (\" \"), the string can contain spaces.."
        },
        {
            "Parameters": "ipv4-family",
            "Info": "Indicates the IPv4 address family.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Softly resets all the BGP IPv4 connections.\n-"
        },
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of a BGP peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "external",
            "Info": "Softly resets EBGP connections.\n-"
        },
        {
            "Parameters": "internal",
            "Info": "Performs a soft reset on IBGP connections.\n-"
        },
        {
            "Parameters": "group <group-name>",
            "Info": "Specifies the name of a BGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "export",
            "Info": "Triggers an inbound soft reset.\n-"
        },
        {
            "Parameters": "import",
            "Info": "Triggers an inbound soft reset.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> refresh bgp vpn-instance vpna ipv4-family all export"
        ]
    ],
    "ExtraInfo": "If the peer of a device supports route-refresh, you can run this command on the device to softly reset the BGP connection with the peer. BGP soft resetting can be used to refresh the BGP routing table and apply new routing policies, without tearing down any BGP connection."
}