{
    "PageTitle": "reset bgp vpn-instance ipv4-family",
    "FuncDef": "The reset bgp vpn-instance ipv4-family command resets BGP connections in the BGP-VPN instance IPv4 address family. The reset bgp vpn-instance ipv4-family command resets BGP connections in the BGP-VPN instance IPv4 address family.",
    "CLIs": [
        "reset bgp [ instance <instance-name> ] vpn-instance <vpn-instance-name> ipv4-family { all | <as-number> | <ipv4-address> | external | internal | group <group-name> }",
        "reset bgp instance <instance-name> all",
        "reset bgp instance <instance-name> vpn-instance <vpn-instance-name> ipv4-family [ <ipv4-address> ] slow-peer"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance <instance-name>",
            "Info": "Specifies a BGP multi-instance.\nThe value is a string of 1 to 31 case-sensitive characters without any spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Resets the connection of a specified VPN instance enabled with an IPv4 address family.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name cannot be _public_. If the string is enclosed in double quotation marks (\" \"), the string can contain spaces.."
        },
        {
            "Parameters": "all",
            "Info": "Reset all BGP connections.\n-"
        },
        {
            "Parameters": "<as-number>",
            "Info": "Specifies a 2-byte AS number (number<1-65535>) or a 4-byte AS number (number<1-65535>.number<0-65535>).\nFor an integral AS number, the value is an integer ranging from 1 to 4294967295.\nFor an AS number in dotted notation, the value is in the format of x.y, where x and y are integers ranging from 1 to 65535 and from 0 to 65535, respectively."
        },
        {
            "Parameters": "<ipv4-address>",
            "Info": "Resets the BGP connection with a specified peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "external",
            "Info": "Reset all EBGP connections.\n-"
        },
        {
            "Parameters": "internal",
            "Info": "Resets all IBGP connections.\n-"
        },
        {
            "Parameters": "group <group-name>",
            "Info": "Resets BGP connections with the specified peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "slow-peer",
            "Info": "Restores a slow peer connection to a normal peer connection.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset bgp instance vpn1 all"
        ]
    ],
    "ExtraInfo": "The reset bgp command is used to make new BGP configurations take effect.\nIf a BGP routing policy is configured on the device that does not support Route-Refresh, the reset bgp command can be used to make the new routing policy to take effect."
}