{
    "PageTitle": "reset bgp flap-info(IPv6)",
    "FuncDef": "The reset bgp flap-info command clears the flapping statistics of IPv6 routes. The reset bgp flap-info command clears the flapping statistics of IPv6 routes. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "reset bgp ipv6 flap-info <network-ipv6-address> <prefix-length>",
        "reset bgp ipv6 <ipv6-address> flap-info",
        "reset bgp ipv6 flap-info",
        "reset bgp [ instance <bgpName> ] vpn-instance <vpn-instance-name> ipv6-familyflap-info [ <network-ipv6-address> <prefix-length> ]",
        "reset bgp ipv6 flap-info as-path-filter { <as-path-filter-num> | <as-path-filter-name> }",
        "reset bgp ipv6 flap-info regexp <as-path-regexp>",
        "reset bgp ipv6 <peerIpv4Addr> flap-info"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "<network-ipv6-address>",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "<prefix-length>",
            "Info": "Specifies the network mask that is used to filter the BGP IPv6 routes. If neither of the mask nor mask length is specified, the address is considered as a classful address.\nIt is an integer ranging from 0 to 128."
        },
        {
            "Parameters": "ipv6",
            "Info": "Clears the route flapping statistics on all IPv6 peers.\n-"
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the network address of an IPv6 peer.\nThe format is X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "instance <bgpName>",
            "Info": "Specifies the BGP multi-instance name.\nThe value is a string of 1 to 31 case-sensitive characters without any spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Clears route dampening information of a specified VPN instance enabled with an IPv6 address family.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name cannot be _public_. If the string is enclosed in double quotation marks (\" \"), the string can contain spaces.."
        },
        {
            "Parameters": "ipv6-family",
            "Info": "Indicates the IPv6 address family.\n-"
        },
        {
            "Parameters": "as-path-filter <as-path-filter-num>",
            "Info": "Clears route flapping statistics based on a specified AS_Path filter.\nThe value is an integer ranging from 1 to 256."
        },
        {
            "Parameters": "as-path-filter <as-path-filter-name>",
            "Info": "Clears route flapping statistics based on a specified AS_Path filter.\nThe value is a string of 1 to 51 case-sensitive characters. If spaces are used, the string must start and end with double quotation marks (\")."
        },
        {
            "Parameters": "regexp <as-path-regexp>",
            "Info": "Clears statistics about the flapping routes that match the AS_Path regular expression.\nThe value is a string of 1 to 80 case-sensitive characters, spaces supported."
        },
        {
            "Parameters": "<peerIpv4Addr>",
            "Info": "Specifies an IPv4 peer address.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset bgp vpn-instance vpn1 ipv6-family flap-info"
        ]
    ],
    "ExtraInfo": "The process of adding a route to and then deleting the route from a routing table is called route flapping.\nWhen route flapping occurs, the routing protocol sends Update packets to neighbors. The neighbors that receive the Update packets need to recalculate routes and modify its routing table. Therefore, frequent route flapping consumes great bandwidth and CPU resources and even seriously affects network operations.\nThe reset bgp flap-info command is used to clear the flapping information about routes. This allows the device to re-collect statistics about flapping routes and helps to monitor route changes and locate network problems."
}