{
    "PageTitle": "reset bgp dampening",
    "FuncDef": "The reset bgp dampening command clears BGP route dampening information and releases suppressed routes. The reset bgp dampening command clears BGP route dampening information and releases suppressed routes.",
    "CLIs": [
        "reset bgp [ instance <bgpName> ] [ vpn-instance <vpn-instance-name> ipv4-family ] dampening",
        "reset bgp [ instance <bgpName> ] [ vpn-instance <vpn-instance-name> ipv4-family ] dampening <ipv4-address> [ <mask> | <mask-length> ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance <bgpName>",
            "Info": "Clears route dampening information about a specified BGP multi-instance.\nThe value is a string of 1 to 31 case-sensitive characters without any spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Resets the connection of a specified VPN instance enabled with an IPv4 address family.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name cannot be _public_. If the string is enclosed in double quotation marks (\" \"), the string can contain spaces.."
        },
        {
            "Parameters": "ipv4-family",
            "Info": "Indicates the IPv4 address family.\n-"
        },
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies an IPv4 network address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<mask>",
            "Info": "Specifies the network mask in dotted decimal notation. If neither of the mask nor mask length is specified, the address is considered as a classful address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<mask-length>",
            "Info": "Specifies the network mask length. If neither of the mask nor mask length is specified, the address is considered as a classful address.\nThe value is an integer in the range from 0 to 32."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset bgp dampening"
        ]
    ],
    "ExtraInfo": "Route dampening is enabled to solve the problem of route instability. In most situations, BGP is applied to complex networks where routes change frequently. Route dampening is then used to suppress unstable routes.\nThe reset bgp dampening command is used to clear dampening information about specified routes on the public network and release specified suppressed routes. If no IP address is specified in the command, dampening information about all routes on the public network is cleared and all suppressed routes are released."
}