{
    "PageTitle": "reset bgp flapping-count(IPv6)",
    "FuncDef": "The reset bgp flapping-count command clears the flapping count of a specified BGP IPv6 peer. The reset bgp flapping-count command clears the flapping count of a specified BGP IPv6 peer. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "reset bgp { ipv6 | [ instance <bgpName> ] vpn-instance <vpn-instance-name> ipv6-family } <ipv6-address> flapping-count"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6",
            "Info": "Clears the flapping count of a specified BGP IPv6 peer.\n-"
        },
        {
            "Parameters": "instance <bgpName>",
            "Info": "Displays BGP routes of a specified BGP multi-instance.\nThe value is a string of 1 to 31 case-sensitive characters without any spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of VPN instance enabled with an IPv6 address family.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name cannot be _public_. If the string is enclosed in double quotation marks (\" \"), the string can contain spaces.."
        },
        {
            "Parameters": "ipv6-family",
            "Info": "Indicates the IPv6 address family.\n-"
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies the IPv6 address of a BGP peer.\nThe format is X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset bgp ipv6 2001:DB8:1::1 flapping-count"
        ]
    ],
    "ExtraInfo": "BGP peer flapping affects the stability of a BGP network and BGP route convergence.\nThe reset bgp flapping-count command can be used to clear the flapping account of a BGP peer. This allows the device to re-collect the flapping statistics of a peer to locate BGP network problems."
}