{
    "PageTitle": "reset bgp flap-info",
    "FuncDef": "The reset bgp flap-info command clears route flapping statistics. The reset bgp flap-info command clears route flapping statistics.",
    "CLIs": [
        "reset bgp [ instance <instance-name> ] [ vpn-instance <vpn-instance-name> ipv4-family ] flap-info <network-address> [ <mask> | <mask-length> ]",
        "reset bgp [ instance <instance-name> ] [ vpn-instance <vpn-instance-name> ipv4-family ] <ipv4-address> flap-info",
        "reset bgp [ instance <instance-name> ] [ vpn-instance <vpn-instance-name> ipv4-family ] flap-info",
        "reset bgp [ instance <instance-name> ] [ vpn-instance <vpn-instance-name> ipv4-family ] flap-infoas-path-filter { <as-path-filter-number> | <as-path-filter-name> }",
        "reset bgp [ instance <instance-name> ] [ vpn-instance <vpn-instance-name> ipv4-family ] flap-inforegexp <as-path-regexp>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance <instance-name>",
            "Info": "Specifies a BGP multi-instance.\nThe value is a string of 1 to 31 case-sensitive characters without any spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Clears the route flapping information of a specified VPN instance enabled with an IPv4 address family.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name cannot be _public_. If the string is enclosed in double quotation marks (\" \"), the string can contain spaces.."
        },
        {
            "Parameters": "ipv4-family",
            "Info": "Indicates the IPv4 address family.\n-"
        },
        {
            "Parameters": "<network-address>",
            "Info": "Specifies the network address of an IPv4 peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<mask>",
            "Info": "Specifies the network mask that is used to filter the BGP IPv4 routes. If neither of the mask nor mask length is specified, the address is considered as a classful address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<mask-length>",
            "Info": "Specifies the network mask length that is used to filter the BGP IPv4 routes. If neither of the mask nor mask length is specified, the address is considered as a classful address.\nThe value is an integer in the range from 0 to 32."
        },
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies an IPv4 peer address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "as-path-filter <as-path-filter-number>",
            "Info": "Clears route flapping statistics based on a specified AS_Path filter.\nThe value is an integer ranging from 1 to 256."
        },
        {
            "Parameters": "<as-path-filter-name>",
            "Info": "Clears route flapping statistics based on a specified AS_Path filter.\nThe value is a string of 1 to 51 case-sensitive characters. If spaces are used, the string must start and end with double quotation marks (\")."
        },
        {
            "Parameters": "regexp <as-path-regexp>",
            "Info": "Clear statistics about the flapping routes that match the AS_Path regular expression.\nThe value is a string of 1 to 80 case-sensitive characters with spaces supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset bgp flap-info as-path-filter 10"
        ]
    ],
    "ExtraInfo": "The process of adding a route to and then deleting the route from a routing table is called route flapping.\nWhen route flapping occurs, the routing protocol sends Update packets to neighbors. The neighbors that receive the Update packets need to recalculate routes and modify its routing table. Therefore, frequent route flapping consumes great bandwidth and CPU resources and even seriously affects network operations.\nThe reset bgp flap-info command is used to clear the flapping information about routes. This allows the device to re-collect statistics about flapping routes and helps to monitor route changes and locate network problems."
}