{
    "PageTitle": "reset bgp unnumbered peer interface flap-info",
    "FuncDef": "The reset bgp unnumbered peer interface flap-info command clears the statistics of BGP route flapping of BGP unnumbered peers. The reset bgp unnumbered peer interface flap-info command clears the statistics of BGP route flapping of BGP unnumbered peers.",
    "CLIs": [
        "reset bgp unnumbered peer interface { <interface-name> | <IfType> <IFNum> } flap-info",
        "reset bgp ipv6 unnumbered peer interface { <interface-name> | <IfType> <IFNum> } flap-info"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies an interface name.\nThe value is a string of 1 to 63 characters."
        },
        {
            "Parameters": "<IfType>",
            "Info": "Specifies an interface type.\n-"
        },
        {
            "Parameters": "<IFNum>",
            "Info": "Specifies an interface number.\nThe value is a string of 1 to 63  case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "ipv6",
            "Info": "Indicates the IPv6 unicast address family.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset bgp unnumbered peer interface 100GE 1/0/1 flap-info"
        ]
    ],
    "ExtraInfo": "The process of adding a route to and then deleting the route from a routing table is called route flapping.\nWhen route flapping occurs, the routing protocol sends Update messages to peers. The peers that receive the Update messages need to recalculate routes and modify its routing table. Frequent route flapping consumes extensive bandwidth and CPU resources and can even affect network operations.\nYou can run the reset bgp unnumbered peer interface flap-info command to clear the flapping statistics about BGP routes of unnumbered peer. This allows the device to re-collect statistics about flapping routes, which helps you monitor route changes and locate network faults."
}