{
    "PageTitle": "route-mode local-rib (BMP monitor view)",
    "FuncDef": "The route-mode local-rib command enables a device to send statistics about Local-RIB (Routing Information Base) best routes in a specified BGP address family to a monitoring server.\nThe undo route-mode local-rib command restores the default configuration. The route-mode local-rib command enables a device to send statistics about Local-RIB (Routing Information Base) best routes in a specified BGP address family to a monitoring server. The undo route-mode local-rib command restores the default configuration. By default, a BMP device is not enabled to report any routing information to any server.",
    "CLIs": [
        "route-mode { ipv4-family | ipv6-family } unicastlocal-rib [ add-path | all ] [ path-marking ]",
        "undo route-mode { ipv4-family | ipv6-family } unicastlocal-rib [ add-path | all ] [ path-marking ]"
    ],
    "ParentView": [
        "BMP monitor view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-family",
            "Info": "Configures the device to send statistics about Local-RIB routes of BGP peers in the IPv4 address family to the monitoring server.\n-"
        },
        {
            "Parameters": "ipv6-family",
            "Info": "Configures the device to send statistics about Local-RIB routes of BGP peers in the IPv6 address family to the monitoring server.\n-"
        },
        {
            "Parameters": "unicast",
            "Info": "Configures the device to send statistics about Local-RIB routes of BGP peers in the unicast address family to the monitoring server.\n-"
        },
        {
            "Parameters": "add-path",
            "Info": "Configures the device to send statistics about Add-Path routes of BGP peers to the monitoring server.If the parameter is specified, statistics about load balancing routes are reported to the monitoring server.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Configures the device to report all routes.\n-"
        },
        {
            "Parameters": "path-marking",
            "Info": "Configures the device to report path status.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bmp",
            "[*HUAWEI-bmp] bmp-session 10.1.1.1",
            "[*HUAWEI-bmp-session-10.1.1.1] monitor public",
            "[*HUAWEI-bmp-session-10.1.1.1-public] route-mode ipv4-family unicast local-rib"
        ]
    ],
    "ExtraInfo": "To configure the device to send statistics about Local-RIB routes (routes received from peers and locally imported routes) of BGP peers in a specified address family to the monitoring server, run the route-mode local-rib command."
}