{
    "PageTitle": "slow-peer detection (BGP-VPN instance IPv6 address family view)",
    "FuncDef": "The slow-peer detection threshold command enables slow peer detection.\nThe undo slow-peer detection threshold command disables slow peer detection.\nThe slow-peer detection disable command disables slow peer detection.\nThe undo slow-peer detection disable command enables slow peer detection. The slow-peer detection threshold command enables slow peer detection. The undo slow-peer detection threshold command disables slow peer detection. The slow-peer detection disable command disables slow peer detection. The undo slow-peer detection disable command enables slow peer detection. By default, slow peer detection is enabled, and the slow peer detection threshold is 300s. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "slow-peer detection threshold <threshold-value>",
        "slow-peer detection disable",
        "undo slow-peer detection [ threshold <threshold-value> ]",
        "undo slow-peer detection disable"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view,BGP multi-instance VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold <threshold-value>",
            "Info": "Specifies a slow peer detection threshold. If the difference between the time taken to send packets to BGP peer 1 and the shortest time taken to send packets to BGP peer 2 is greater than the threshold, BGP peer 1 is considered as a slow peer.\nThe value is an integer ranging from 120 to 3600, in seconds. The default value is 300."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv6-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpna",
            "[*HUAWEI-bgp-6-vpna] slow-peer detection threshold 200"
        ]
    ],
    "ExtraInfo": "An update peer-group may contain multiple peers. If the local device advertises routes to one peer slowly due to network congestion, the speed at which the local device advertises routes to other peers in the update peer-group is affected. To prevent this problem, slow peer detection is enabled by default.\nAfter slow peer detection is enabled, the local device calculates the difference between the time taken to send messages to each peer in the update peer-group and the shortest time taken to send messages to each peer in the group. If the difference between the time taken to send messages to a peer and the shortest time is greater than the threshold specified for slow peer detection, the local device considers this peer as a slow peer and removes it from the update peer-group, which prevents this slow peer from affecting route advertisement to other peers in the group."
}