{
    "PageTitle": "slow-peer absolute-detection (BGP-VPN instance IPv4 address family view)",
    "FuncDef": "The slow-peer absolute-detection threshold command configures an absolute threshold for slow peer detection.\nThe undo slow-peer absolute-detection threshold command restores the absolute threshold of slow peer detection.\nThe slow-peer absolute-detection disable command disables slow peer detection in absolute mode.\nThe undo slow-peer absolute-detection disable command enables slow peer detection in absolute mode. The slow-peer absolute-detection threshold command configures an absolute threshold for slow peer detection. The undo slow-peer absolute-detection threshold command restores the absolute threshold of slow peer detection. The slow-peer absolute-detection disable command disables slow peer detection in absolute mode. The undo slow-peer absolute-detection disable command enables slow peer detection in absolute mode. By default, slow peer detection in absolute mode is enabled, and the threshold for slow peer detection in absolute mode is 9s.",
    "CLIs": [
        "slow-peer absolute-detection threshold <threshold>",
        "slow-peer absolute-detection disable",
        "undo slow-peer absolute-detection threshold <threshold>",
        "undo slow-peer absolute-detection disable"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold <threshold>",
            "Info": "Specifies an absolute threshold for slow peer detection.\nThe value is an integer that ranges from 3 to 3600. The default value is 60."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpna",
            "[*HUAWEI-bgp-instance-vpna] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp-instance-vpna] quit",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-vpna] slow-peer absolute-detection threshold 100"
        ]
    ],
    "ExtraInfo": ""
}