{
    "PageTitle": "timer keepalive hold (BGP multi-instance view)",
    "FuncDef": "The timer keepalive hold command sets the Keepalive time and hold time of BGP.\nThe undo timer keepalive hold command restores the default Keepalive time and hold time.\nThe timer send-hold command sets the hold time of a BGP session on the sender.\nThe undo timer send-hold command restores the default value of the hold time of a BGP session on the sender. The timer keepalive hold command sets the Keepalive time and hold time of BGP. The undo timer keepalive hold command restores the default Keepalive time and hold time. The timer send-hold command sets the hold time of a BGP session on the sender. The undo timer send-hold command restores the default value of the hold time of a BGP session on the sender. By default, the keepalive time is 60s, the hold time is 180s, and the session hold time is 86400s.",
    "CLIs": [
        "timer keepalive <keepalive-time> hold <hold-time> [ min-holdtime <min-hold-value> ]",
        "timer send-hold <send-hold-time>",
        "undo timer keepalive hold [ min-holdtime ]",
        "undo timer keepalive <keepalive-time> hold <hold-time> [ min-holdtime <min-hold-value> ]",
        "undo timer send-hold <send-hold-time>"
    ],
    "ParentView": [
        "BGP multi-instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "hold <hold-time>",
            "Info": "Specifies the hold time.\nThe value is 0 or an integer ranging from 3 to 65535, in seconds. The default value is 180.\nIt is recommended that the configured hold time be related to the total number of BGP address family peers. For details, see the mapping between the total number of BGP peers in each address family and the recommended minimum hold time in the usage guide of the peer timer command."
        },
        {
            "Parameters": "min-holdtime <min-hold-value>",
            "Info": "Specifies the minimum hold time. On the same device, min-hold-value must be less than hold-time.\nThe value is an integer ranging from 20 to 65535, in seconds."
        },
        {
            "Parameters": "send-hold <send-hold-time>",
            "Info": "Specifies the interval for holding a session when the local end fails to send messages.\nThe value is 0 or an integer ranging from 360 to 172800, in seconds. The default value is 86400. The value 0 indicates that the function is disabled."
        },
        {
            "Parameters": "keepalive <keepalive-time>",
            "Info": "Specifies the Keepalive time.\nThe value is an integer ranging from 0 to 21845, in seconds. The default value is 60."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] timer keepalive 30 hold 90 min-holdtime 60"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] timer keepalive 30 hold 90"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] timer send-hold 720"
        ]
    ],
    "ExtraInfo": "After a connection is established between peers, the values of keepalive-time and hold-time are negotiated by the peers. In the preceding information:"
}