{
    "PageTitle": "timer keepalive hold (BGP view)",
    "FuncDef": "The timer keepalive hold command sets the Keepalive time and hold time.\nThe undo timer keepalive hold command restores the default Keepalive time and hold time. The timer keepalive hold command sets the Keepalive time and hold time. The undo timer keepalive hold command restores the default Keepalive time and hold time. By default, the Keepalive time is 60s, and the hold time is 180s.",
    "CLIs": [
        "timer keepalive <keepalive-time> hold <hold-time> [ min-holdtime <min-hold-value> ]",
        "undo timer keepalive hold [ min-holdtime ]",
        "undo timer keepalive <keepalive-time> hold <hold-time> [ min-holdtime <min-hold-value> ]"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "hold <hold-time>",
            "Info": "Specifies the hold time.\nThe value is 0 or an integer ranging from 3 to 65535, in seconds. The default value is 180.\nIt is recommended that the configured hold time be related to the total number of BGP address family peers. For details, see the mapping between the total number of BGP peers in each address family and the recommended minimum hold time in the usage guide of the peer timer command."
        },
        {
            "Parameters": "min-holdtime <min-hold-value>",
            "Info": "Specifies the minimum hold time. On the same device, min-hold-value must be less than hold-time.\nThe value is an integer ranging from 20 to 65535, in seconds."
        },
        {
            "Parameters": "keepalive <keepalive-time>",
            "Info": "Specifies the Keepalive time.\nThe value is an integer ranging from 0 to 21845, in seconds. The default value is 60."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] timer keepalive 30 hold 90 min-holdtime 60"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] timer keepalive 30 hold 90"
        ]
    ],
    "ExtraInfo": "After a connection is established between peers, keepalive-time and hold-time are negotiated by the peers."
}