{
    "PageTitle": "vrf-route-distribute disable (BGP multi-instance view)",
    "FuncDef": "The vrf-route-distribute vpnv4 disable command prevents BGP unicast VPN routes from being sent to BGP VPNv4.\nThe undo vrf-route-distribute vpnv4 disable command restores the default configuration. BGP unicast VPN routes are sent to BGP VPNv4.\nThe vrf-route-distribute vpnv6 disable command prevents BGP unicast VPN routes from being sent to BGP VPNv6.\nThe undo vrf-route-distribute vpnv6 disable command restores the default configuration. BGP unicast VPN routes are sent to BGP VPNv6. The vrf-route-distribute vpnv4 disable command prevents BGP unicast VPN routes from being sent to BGP VPNv4. The undo vrf-route-distribute vpnv4 disable command restores the default configuration. BGP unicast VPN routes are sent to BGP VPNv4. The vrf-route-distribute vpnv6 disable command prevents BGP unicast VPN routes from being sent to BGP VPNv6. The undo vrf-route-distribute vpnv6 disable command restores the default configuration. BGP unicast VPN routes are sent to BGP VPNv6. By default, BGP unicast VPN routes can be sent to BGP VPNv4 or BGP VPNv6.",
    "CLIs": [
        "vrf-route-distribute { vpnv4 | vpnv6 } disable",
        "undo vrf-route-distribute { vpnv4 | vpnv6 } disable",
        "vrf-route-distribute vpnv4 disable",
        "undo vrf-route-distribute vpnv4 disable"
    ],
    "ParentView": [
        "BGP multi-instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpnv4",
            "Info": "Configures the device not to send BGP unicast VPN routes to BGP VPNv4.\n-"
        },
        {
            "Parameters": "vpnv6",
            "Info": "Configures the device not to send BGP unicast VPN routes to BGP VPNv6.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] vrf-route-distribute vpnv4 disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] vrf-route-distribute vpnv6 disable"
        ]
    ],
    "ExtraInfo": "When EVPN is used to replace L3VPN, BGP unicast VPN routes are still copied to the BGP VPNv4 or BGP VPNv6 routing table by default, consuming system resources. You can run this command to disable replication of BGP unicast VPN routes to the BGP VPNv4 or BGP VPNv6 routing table to save system resources."
}