{
    "PageTitle": "keepalive (Tunnel interface view)",
    "FuncDef": "The keepalive command enables the Keepalive function for a GRE tunnel.\nThe undo keepalive command disables the Keepalive function for a GRE tunnel. The keepalive command enables the Keepalive function for a GRE tunnel. The undo keepalive command disables the Keepalive function for a GRE tunnel. By default, the Keepalive function of a GRE tunnel is disabled. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "keepalive [ period <period> [ retry-times <retry-times> ] ]",
        "undo keepalive [ period <period> [ retry-times <retry-times> ] ]"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "period <period>",
            "Info": "Specifies the interval for sending Keepalive messages.\nThe value is an integer ranging from 1 to 32767, in seconds. The default value is 5."
        },
        {
            "Parameters": "retry-times <retry-times>",
            "Info": "Specifies the count of the unreachable counter.\nThe value is an integer ranging from 1 to 255. The default value is 3."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface tunnel 100",
            "[*HUAWEI-Tunnel100] tunnel-protocol gre",
            "[*HUAWEI-Tunnel100] keepalive"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface tunnel 100",
            "[*HUAWEI-Tunnel100] tunnel-protocol gre",
            "[*HUAWEI-Tunnel100] keepalive period 12"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface tunnel 100",
            "[*HUAWEI-Tunnel100] tunnel-protocol gre",
            "[*HUAWEI-Tunnel100] keepalive period 12 retry-times 4"
        ]
    ],
    "ExtraInfo": "To prevent an unavailable GRE tunnel from being selected to transmit packets, enable the Keepalive function for GRE tunnels. Before the Keepalive function is enabled, the local tunnel interface may be Up even if the peer tunnel interface is unreachable. After the Keepalive function is enabled, the local tunnel interface goes Down if the peer tunnel interface is unreachable.\nAfter the Keepalive function is enabled on a GRE tunnel, the tunnel periodically sends Keepalive messages. The unreachable counter increases by one each time a message is sent. If no Keepalive response message is received when the value of the counter reaches the configured retry-times, the peer is considered unreachable.\nThe Keepalive function immediately takes effect after the keepalive command is run on a GRE tunnel interface. The undo keepalive command disables this function."
}