{
    "PageTitle": "dhcp snooping check dhcp-chaddr enable(system view)",
    "FuncDef": "The dhcp snooping check dhcp-chaddr enable command enables the device to check whether the CHADDR field matches the source MAC address in the header of a DHCP Request message.\nThe undo dhcp snooping check dhcp-chaddr enable command disables the device from checking whether the CHADDR field matches the source MAC address in the header of a DHCP Request message. The dhcp snooping check dhcp-chaddr enable command enables the device to check whether the CHADDR field matches the source MAC address in the header of a DHCP Request message. The undo dhcp snooping check dhcp-chaddr enable command disables the device from checking whether the CHADDR field matches the source MAC address in the header of a DHCP Request message. By default, the device does not check whether the source MAC address in the header of a DHCP Request message is the same as the CHADDR field value.",
    "CLIs": [
        "dhcp snooping check dhcp-chaddr enable vlan { <vlan-id1> [ to <vlan-id2> ] } &<1-10>",
        "undo dhcp snooping check dhcp-chaddr enable vlan { <vlan-id1> [ to <vlan-id2> ] } &<1-10>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "to <vlan-id2>",
            "Info": "Specifies the ID of the last VLAN.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "vlan <vlan-id1>",
            "Info": "Represents the number of the first VLAN.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] dhcp snooping enable",
            "[*HUAWEI] vlan batch 20 to 40",
            "[*HUAWEI] dhcp snooping check dhcp-chaddr enable vlan 20 to 40"
        ]
    ],
    "ExtraInfo": "In normal situations, the CHADDR field in a DHCP Request message is the same as the MAC address of the client that sends the message. The DHCP server identifies the client MAC address based on the CHADDR field. If attackers continuously apply for IP addresses by changing the CHADDR field in the DHCP Request message, addresses in the address pool on the DHCP server will be exhausted. As a result, authorized users cannot obtain IP addresses."
}