{
    "PageTitle": "dhcp snooping trusted",
    "FuncDef": "The dhcp snooping trusted command configures an interface as a trusted interface.\nThe undo dhcp snooping trusted command configures an interface as an untrusted interface. The dhcp snooping trusted command configures an interface as a trusted interface. The undo dhcp snooping trusted command configures an interface as an untrusted interface. By default, an interface is untrusted.",
    "CLIs": [
        "dhcp snooping trusted",
        "undo dhcp snooping trusted"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,Interface group view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] dhcp snooping enable",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] dhcp snooping trusted"
        ]
    ],
    "ExtraInfo": "To enable DHCP clients to obtain IP addresses from valid DHCP servers, the DHCP snooping security mechanism allows interfaces to be configured as trusted and untrusted interfaces. Trusted interfaces forward received DHCP messages normally. Untrusted interfaces receive DHCP ACK and DHCP Offer messages from DHCP servers, the discards the packet.\nThe interface directly or indirectly connected to the DHCP server trusted by the administrator must be configured as a trusted interface, and other interfaces must be configured as untrusted interfaces. This ensures that DHCP clients can obtain IP addresses only from authorized DHCP servers. Bogus DHCP servers cannot allocate IP addresses to DHCP clients.\nIf the interface connected to the DHCP client is configured as a trusted interface, the DHCP client does not need to be verified, and the device does not generate dynamic binding entries for the DHCP clients connected to the trusted interface.\nThe trusted interface status is not affected by the dhcp snooping enable command. After the dhcp snooping disable command is run on the interface, the trusted interface status is not affected.\nThe packet processing mode in this scenario is also applicable to DHCPv6 packets."
}