{
    "PageTitle": "dhcp snooping trusted(vlan view)",
    "FuncDef": "The dhcp snooping trusted command configures an interface as a trusted interface.\nThe undo dhcp snooping trusted command configures an interface as an untrusted interface. The dhcp snooping trusted command configures an interface as a trusted interface. The undo dhcp snooping trusted command configures an interface as an untrusted interface. By default, an interface is untrusted.",
    "CLIs": [
        "dhcp snooping trusted interface { <interface-type> <interface-number> | <interface-name> }",
        "undo dhcp snooping trusted interface { <interface-type> <interface-number> | <interface-name> }"
    ],
    "ParentView": [
        "VLAN view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the interface number.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the interface name.\n-"
        },
        {
            "Parameters": "interface <interface-type>",
            "Info": "Specifies the interface type.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] dhcp snooping enable",
            "[*HUAWEI] vlan 100",
            "[*HUAWEI-vlan100] dhcp snooping trusted interface 100GE 1/0/1"
        ]
    ],
    "ExtraInfo": "To enable DHCP clients to obtain IP addresses from authorized DHCP servers, the DHCP snooping security mechanism allows you to configure trusted and untrusted interfaces. The trusted interface forwards DHCP messages, and untrusted interfaces discard DHCP ACK messages and DHCP Offer messages from DHCP servers.\nThe interface directly or indirectly connected to the DHCP server trusted by the administrator needs to be configured as the trusted interface, and other interfaces are configured as untrusted interfaces. This ensures that DHCP clients can obtain IP addresses only from authorized DHCP servers and prevents bogus DHCP servers from assigning IP addresses to DHCP clients.\nThe message processing method in this scenario also applies to DHCPv6 messages."
}