{
    "PageTitle": "dhcp snooping alarm enable",
    "FuncDef": "The dhcp snooping alarm enable command enables the alarm function for DHCP snooping.\nThe undo dhcp snooping alarm enable command disables the alarm function for DHCP snooping. The dhcp snooping alarm enable command enables the alarm function for DHCP snooping. The undo dhcp snooping alarm enable command disables the alarm function for DHCP snooping. By default, the alarm function is disabled for DHCP snooping.",
    "CLIs": [
        "dhcp snooping alarm { dhcp-request | dhcp-chaddr | dhcp-reply } enable",
        "undo dhcp snooping alarm { dhcp-request | dhcp-chaddr | dhcp-reply } enable"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLAN view,Bridge domain view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "dhcp-request",
            "Info": "Indicates that an alarm is generated when the number of DHCPv4 Request messages discarded because they do not match the binding entries reaches the threshold.\n-"
        },
        {
            "Parameters": "dhcp-chaddr",
            "Info": "Indicates that an alarm is generated when the number of DHCPv4 Request messages discarded because the CHADDR field in the messages does not match the MAC address in the frame header reaches the alarm threshold.\n-"
        },
        {
            "Parameters": "dhcp-reply",
            "Info": "Indicates that an alarm is generated when the number of DHCPv4 or DHCPv6 Reply messages discarded by untrusted interfaces from the server reaches the threshold.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] dhcp snooping enable",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] dhcp snooping enable",
            "[*HUAWEI-100GE1/0/1] dhcp snooping check dhcp-chaddr enable",
            "[*HUAWEI-100GE1/0/1] dhcp snooping alarm dhcp-chaddr enable"
        ]
    ],
    "ExtraInfo": "After the alarm function is enabled, alarm messages are displayed if DHCP attacks occur and the number of discarded attack messages reaches the threshold. The minimum interval for sending alarm messages is 1 minute. The alarm threshold is set using the dhcp snooping alarm threshold command."
}