{
    "PageTitle": "dhcp snooping alarm dhcp-rate vlan",
    "FuncDef": "The dhcp snooping alarm dhcp-rate vlan command enables the alarm function for discarded DHCP messages and sets the alarm threshold for the number of discarded DHCP messages in different VLANs in batches.\nThe undo dhcp snooping alarm dhcp-rate vlan command disables the alarm function for discarded DHCP messages and cancels the alarm threshold for the number of discarded DHCP messages in different VLANs in batches. The dhcp snooping alarm dhcp-rate vlan command enables the alarm function for discarded DHCP messages and sets the alarm threshold for the number of discarded DHCP messages in different VLANs in batches. The undo dhcp snooping alarm dhcp-rate vlan command disables the alarm function for discarded DHCP messages and cancels the alarm threshold for the number of discarded DHCP messages in different VLANs in batches. By default, the device does not generate an alarm when the number of discarded DHCP messages reaches the alarm threshold. The alarm threshold for the number of discarded DHCP messages is 100.",
    "CLIs": [
        "dhcp snooping alarm dhcp-rate { enable | threshold <threshold> } vlan { <vlan-id1> [ to <vlan-id2> ] } &<1-10>",
        "undo dhcp snooping alarm dhcp-rate { enable | threshold } vlan { <vlan-id1> [ to <vlan-id2> ] } &<1-10>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "enable",
            "Info": "Sets enabling status.\n-"
        },
        {
            "Parameters": "threshold <threshold>",
            "Info": "Specifies the alarm threshold. When the number of discarded DHCP messages reaches the threshold, an alarm is generated.\nThe value is an integer ranging from 1 to 1000. The default value is 100."
        },
        {
            "Parameters": "<vlan-id1>",
            "Info": "Indicates the number of the first VLAN.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "to <vlan-id2>",
            "Info": "Indicates the ID of the last VLAN.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] dhcp snooping enable",
            "[*HUAWEI] vlan batch 10 to 20",
            "[*HUAWEI] dhcp snooping alarm dhcp-rate enable vlan 10 to 20"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] dhcp snooping enable",
            "[*HUAWEI] vlan batch 10 to 20",
            "[*HUAWEI] dhcp snooping alarm dhcp-rate threshold 50 vlan 10 to 20"
        ]
    ],
    "ExtraInfo": ""
}