{
    "PageTitle": "dhcp snooping user-bind autosave",
    "FuncDef": "The dhcp snooping user-bind autosave command enables local automatic backup of the DHCP snooping binding table and configures the file to be saved.\nThe undo dhcp snooping user-bind autosave command disables local automatic backup of the DHCP snooping binding table and deletes the configured file. The dhcp snooping user-bind autosave command enables local automatic backup of the DHCP snooping binding table and configures the file to be saved. The undo dhcp snooping user-bind autosave command disables local automatic backup of the DHCP snooping binding table and deletes the configured file. By default, local automatic backup of the DHCP snooping binding table is disabled.",
    "CLIs": [
        "dhcp snooping user-bind autosave <file-name> [ write-delay <delay-time> ]",
        "undo dhcp snooping user-bind autosave"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<file-name>",
            "Info": "Specifies the path for storing the file that backs up the binding table and the file name. The file path and name supported by the device must be both entered.\nThe value is a string of 12 to 51 case-insensitive characters, spaces not supported. The file name with a full path must be flash:/*.tbl. The file name without a path or format can contain only digits, letters, and special characters ('_' and'-')."
        },
        {
            "Parameters": "write-delay <delay-time>",
            "Info": "Specifies the interval for local automatic backup of the DHCP snooping binding table.\nIf this parameter is not specified, the backup interval is the default value.\nThe value is an integer that ranges from 60 to 4294967295. The default value is 3600."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] dhcp snooping enable",
            "[*HUAWEI] dhcp snooping user-bind autosave flash:/backup.tbl write-delay 5000"
        ]
    ],
    "ExtraInfo": "When the device generates DHCP snooping binding entries for DHCP users, you can run the dhcp snooping user-bind autosave command to enable local automatic backup of the DHCP snooping binding table to prevent the binding entries from being lost after the device restarts."
}