{
    "PageTitle": "dhcp snooping enable(system view)",
    "FuncDef": "The dhcp snooping enable command enables DHCP snooping.\nThe undo dhcp snooping enable command disables DHCP snooping. The dhcp snooping enable command enables DHCP snooping. The undo dhcp snooping enable command disables DHCP snooping. By default, DHCP snooping is disabled on the device.",
    "CLIs": [
        "dhcp snooping enable [ vlan { <vlan-id1> [ to <vlan-id2> ] } &<1-10> ]",
        "undo dhcp snooping enable [ vlan { <vlan-id1> [ to <vlan-id2> ] } &<1-10> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan <vlan-id1>",
            "Info": "Represents the number of the first VLAN.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "to <vlan-id2>",
            "Info": "Specifies the ID of the last VLAN.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] dhcp snooping enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] dhcp snooping enable",
            "[*HUAWEI] vlan batch 20 to 25",
            "[*HUAWEI] dhcp snooping enable vlan 20 to 25"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo dhcp snooping enable",
            "Warning: DHCP snooping will be disabled on the device. Continue? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "DHCP snooping is a DHCP security feature. Enabling DHCP snooping on a device can effectively improve DHCP security. After DHCP snooping is enabled using the dhcp snooping enable command, the device processes both DHCPv4 and DHCPv6 packets. If only DHCPv4 or DHCPv6 packets need to be processed, run the undo dhcp snooping enable ipv4 or undo dhcp snooping enable ipv6 command to disable DHCPv4 snooping or DHCPv6 snooping. This effectively reduces the CPU usage of the device.\nYou must enable DHCP snooping globally before enabling DHCP snooping on an interface, in a VLAN, or in a BD."
}