{
    "PageTitle": "dhcp snooping alarm threshold",
    "FuncDef": "The dhcp snooping alarm threshold command sets the alarm threshold for the number of DHCP messages discarded by DHCP snooping.\nThe undo dhcp snooping alarm threshold command restores the default alarm threshold. The dhcp snooping alarm threshold command sets the alarm threshold for the number of DHCP messages discarded by DHCP snooping. The undo dhcp snooping alarm threshold command restores the default alarm threshold. By default, the alarm threshold for the number of messages discarded by DHCP snooping is the value configured using the dhcp snooping alarm threshold command in the system view.",
    "CLIs": [
        "dhcp snooping alarm { dhcp-request | dhcp-chaddr | dhcp-reply } threshold <threshold>",
        "undo dhcp snooping alarm { dhcp-request | dhcp-chaddr | dhcp-reply } threshold"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,VLAN view,Bridge domain view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "dhcp-request",
            "Info": "Specifies the alarm threshold for the number of DHCPv4 Request messages discarded because they do not match the binding entries.\n-"
        },
        {
            "Parameters": "dhcp-chaddr",
            "Info": "Specifies the alarm threshold for the number of DHCP messages discarded because the CHADDR field in the DHCPv4 Request message does not match the MAC address in the data frame header.\n-"
        },
        {
            "Parameters": "dhcp-reply",
            "Info": "Specifies the alarm threshold for the number of DHCPv4 or DHCPv6 Reply messages discarded by untrusted interfaces from the server.\n-"
        },
        {
            "Parameters": "<threshold>",
            "Info": "Specifies the alarm threshold for the number of DHCP messages discarded by DHCP snooping.\nThe value is an integer ranging from 1 to 1000, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] dhcp snooping enable",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] dhcp snooping enable",
            "[*HUAWEI-100GE1/0/1] dhcp snooping check dhcp-chaddr enable",
            "[*HUAWEI-100GE1/0/1] dhcp snooping alarm dhcp-chaddr enable",
            "[*HUAWEI-100GE1/0/1] dhcp snooping alarm dhcp-chaddr threshold 1000"
        ]
    ],
    "ExtraInfo": "After the DHCP snooping alarm function is enabled, you can run the dhcp snooping alarm threshold command to set the alarm threshold for the number of discarded DHCPv4 and DHCPv6 messages."
}