{
    "PageTitle": "dhcp snooping check dhcp-rate vlan",
    "FuncDef": "The dhcp snooping check dhcp-rate vlan command enables the device to check the rate of sending DHCP messages from different VLANs to the processing unit.\nThe undo dhcp snooping check dhcp-rate vlan command disables the device from checking the rate of sending DHCP messages from different VLANs to the processing unit in a batch. The dhcp snooping check dhcp-rate vlan command enables the device to check the rate of sending DHCP messages from different VLANs to the processing unit. The undo dhcp snooping check dhcp-rate vlan command disables the device from checking the rate of sending DHCP messages from different VLANs to the processing unit in a batch. By default, the device does not check the rate of sending DHCP messages to the processing unit, and the maximum rate of sending DHCP messages to the processing unit is 5000 pps.",
    "CLIs": [
        "dhcp snooping check dhcp-rate { enable | <rate> } vlan { <vlan-id1> [ to <vlan-id2> ] } &<1-10>",
        "undo dhcp snooping check dhcp-rate [ enable ] vlan { <vlan-id1> [ to <vlan-id2> ] } &<1-10>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "enable",
            "Info": "Sets enabling status.\n-"
        },
        {
            "Parameters": "<vlan-id1>",
            "Info": "Indicates the number of the first VLAN.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "to <vlan-id2>",
            "Info": "Indicates the ID of the last VLAN.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "dhcp-rate <rate>",
            "Info": "Specifies the maximum rate of sending DHCP messages to the processing unit.\nThe value is an integer ranging from 1 to 5000. The default value is 5000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] dhcp snooping enable",
            "[*HUAWEI] vlan batch 10 to 20",
            "[*HUAWEI] dhcp snooping check dhcp-rate enable vlan 10 to 20"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[*HUAWEI] dhcp snooping enable",
            "[*HUAWEI] vlan batch 10 to 20",
            "[*HUAWEI] dhcp snooping check dhcp-rate 300 vlan 10 to 20"
        ]
    ],
    "ExtraInfo": ""
}