{
    "PageTitle": "display user-bind static",
    "FuncDef": "The display user-bind static command displays information about a static DHCP snooping binding table. The display user-bind static command displays information about a static DHCP snooping binding table.",
    "CLIs": [
        "display user-bind static { { interface { <interface-type> <interface-number> | <interface-name> } | ip-address <ip-address> | mac-address <mac-address> | vlan <vlan-id> } | all } [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Displays static binding entries on a specified interface.\nâ\u0080¢interface-type specifies the interface type.\nâ\u0080¢interface-number specifies the interface number.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "interface-name specifies the name of an interface.\nThe value is a string of 1 to 128 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "ip-address <ip-address>",
            "Info": "Displays information about the static binding table with a specified IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mac-address <mac-address>",
            "Info": "Displays information about the static binding table with a specified MAC address.\nThe value is in hexadecimal notation."
        },
        {
            "Parameters": "vlan <vlan-id>",
            "Info": "Displays information about the static binding table with a specified VLAN ID.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "all",
            "Info": "Displays static binding entries of all users.\n-"
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about the static binding table.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display user-bind static all"
        ],
        [
            "<HUAWEI> display user-bind static all verbose"
        ]
    ],
    "ExtraInfo": ""
}