{
    "PageTitle": "display dhcp snooping",
    "FuncDef": "The display dhcp snooping command displays DHCP snooping running information. The display dhcp snooping command displays DHCP snooping running information.",
    "CLIs": [
        "display dhcp snooping [ interface { <interface-type> <interface-number> | <interface-name> } | vlan <vlan-id> | bridge-domain <bd-id> ]",
        "display dhcp snooping [ interface { <interface-type> <interface-number> | <interface-name> } | vlan <vlan-id> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Displays DHCP snooping running information on a specified interface.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "interface-name specifies the name of an interface.\nThe value is a string of 1 to 128 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "vlan <vlan-id>",
            "Info": "Displays DHCP snooping running information in a specified VLAN.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "bridge-domain <bd-id>",
            "Info": "Displays DHCP snooping running information in a specified BD.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer that ranges from 1 to 16777215."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display dhcp snooping"
        ]
    ],
    "ExtraInfo": ""
}