{
    "PageTitle": "user-bind static",
    "FuncDef": "The user-bind static command configures a static binding table.\nThe undo user-bind static command deletes a static binding table. The user-bind static command configures a static binding table. The undo user-bind static command deletes a static binding table. By default, no static binding table exists.",
    "CLIs": [
        "user-bind static { ip-address { <start-ip> [ to <end-ip> ] } &<1-10> | mac-address <mac-address> } [ interface { <interface-type> <interface-number> | <interface-name> } ] [ vlan <vlan-id> [ ce-vlan <ce-vlan-id> ] ]",
        "undo user-bind static [ ip-address { <start-ip> [ to <end-ip> ] } &<1-10> | mac-address <mac-address> | interface { <interface-type> <interface-number> | <interface-name> } | vlan <vlan-id> [ ce-vlan <ce-vlan-id> ] ]",
        "user-bind static { ip-address { <start-ip> [ to <end-ip> ] } &<1-10> | mac-address <mac-address> } [ interface { <interface-type> <interface-number> | <interface-name> } ] [ vlan <vlan-id> ]",
        "undo user-bind static [ ip-address { <start-ip> [ to <end-ip> ] } &<1-10> | mac-address <mac-address> | interface { <interface-type> <interface-number> | <interface-name> } | vlan <vlan-id> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address <start-ip>",
            "Info": "Specifies the IP address of a user in a static binding entry. start-ip specifies the first IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "to <end-ip>",
            "Info": "Specifies the last IP address.\nThe value is in dotted decimal notation. The value of end-ip must be greater than that of start-ip. start-ip and end-ip specify a range of IP addresses."
        },
        {
            "Parameters": "mac-address <mac-address>",
            "Info": "Specifies the user MAC address in a static binding entry.\nThe value is in hexadecimal notation. The value is in the format of H-H-H."
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Specifies the interface connected to a user in a static binding entry.\nâ\u0080¢interface-type specifies the interface type.\nâ\u0080¢interface-number specifies the interface number.\n-"
        },
        {
            "Parameters": "<interface-name>",
            "Info": "interface-name specifies the name of an interface.\nThe value is a string of 1 to 128 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "vlan <vlan-id>",
            "Info": "Specifies the user VLAN ID in a static binding entry.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 4094.\nFor the CE6885-LL (low latency mode):The value is an integer ranging from 1 to 1023."
        },
        {
            "Parameters": "ce-vlan <ce-vlan-id>",
            "Info": "Specifies the inner VLAN tag of a QinQ packet in a static binding entry.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer ranging from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-bind static ip-address 10.1.1.1 vlan 2"
        ]
    ],
    "ExtraInfo": "When DHCP snooping is enabled, the device generates dynamic DHCP snooping binding entries for dynamic users, but cannot generate dynamic DHCP snooping binding entries for static users. Therefore, if no static user binding table is available, the device discards all the packets forwarded by static users. To enable the device to forward packets of static users, run the command to configure a static binding table."
}