{
    "PageTitle": "display ip source check user-bind status",
    "FuncDef": "The display ip source check user-bind status command displays IPSG binding entries and their status. The display ip source check user-bind status command displays IPSG binding entries and their status. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display ip source check user-bind status [ [ [ dynamic | static ] [ { interface { <interface-name> | <interface-type> <interface-number> } | ip-address <ip-address> | mac-address <mac-address> | vlan <vlan-id> } ] [ valid | invalid ] ] | summary ] [ slot <slot-id> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "dynamic",
            "Info": "Displays information about the IPSG dynamic binding table.\n-"
        },
        {
            "Parameters": "static",
            "Info": "Displays information about the IPSG static binding table.\n-"
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Displays binding entries mapping a specified interface:\ninterface-type.interface-number.\nThe value is a string of 1 to 64 case-sensitive characters without spaces."
        },
        {
            "Parameters": "interface <interface-name>",
            "Info": "Specifies an interface name.\n-"
        },
        {
            "Parameters": "ip-address <ip-address>",
            "Info": "Displays binding entries mapping a specified IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mac-address <mac-address>",
            "Info": "Displays binding entries mapping a specified MAC address.\nThe value is in H-H-H format and an H is a hexadecimal number of 4 digits."
        },
        {
            "Parameters": "vlan <vlan-id>",
            "Info": "Displays binding entries mapping a specified VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "valid",
            "Info": "Checks the IPSG that has taken effect.\n-"
        },
        {
            "Parameters": "invalid",
            "Info": "Displays invalid IPSG entries.\n-"
        },
        {
            "Parameters": "summary",
            "Info": "Displays brief information about the binding table.\n-"
        },
        {
            "Parameters": "slot <slot-id>",
            "Info": "Displays the IPSG status in a specified slot.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ip source check user-bind status dynamic"
        ],
        [
            "<HUAWEI> display ip source check user-bind status static"
        ],
        [
            "<HUAWEI> display ip source check user-bind status"
        ],
        [
            "<HUAWEI> display ip source check user-bind status summary"
        ]
    ],
    "ExtraInfo": ""
}