{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "diag",
    "FuncDef": [
        "To perform field diagnostics on a line card, on the Gigabit Route Processor (GRP), on the Switch Fabric Cards (SFCs), and on the Clock Scheduler Card (CSC) in Cisco 12000 series Gigabit Switch Routers (GSRs), use the **diag**command in privileged EXEC mode. To disable field diagnostics on a line card, use the **no** form of this command. "
    ],
    "CLIs": [
        "diag <slot-number> [ halt | previous | post | verbose [ wait ] | wait ]",
        "no diag <slot-number>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *slot-number* ",
            "Info": " Slot number of the line card you want to test. Slot numbers range from 0 to 11 for the Cisco 12012 and 0 to 7 for the Cisco 12008 router. Slot numbers for the CSC are 16 and 17, and for the FSC are 18, 19, and 20. "
        },
        {
            "Parameters": " **halt** ",
            "Info": " (Optional) Stops the field diagnostic testing on the line card. "
        },
        {
            "Parameters": " **previous** ",
            "Info": " (Optional) Displays previous test results (if any) for the line card. "
        },
        {
            "Parameters": " **post** ",
            "Info": " (Optional) Initiates an EPROM-based extended power-on self-test (EPOST) only. The EPOST test suite is not as comprehensive as the field diagnostics, and a pass/fail message is the only message displayed on the console. "
        },
        {
            "Parameters": " **verbose** [**wait**] ",
            "Info": " (Optional) Enables the maximum status messages to be displayed on the console. By default, only the minimum status messages are displayed on the console. If you specify the optional **wait** keyword, the Cisco IOS software is not automatically reloaded on the line card after the test completes. "
        },
        {
            "Parameters": " **wait** ",
            "Info": " (Optional) Stops the automatic reloading of the Cisco IOS software on the line card after the completion of the field diagnostic testing. If you use this keyword, you must use the **microcode reload** *slot* global configuration command, or manually remove and insert the line card (to power it up) in the slot so that the GRP will recognize the line card and download the Cisco IOS software image to the line card. "
        }
    ],
    "Examples": [
        [
            "In the following example, a user is shown the output when field diagnostics are performed on the line card in slot 3. After the line card passes all field diagnostic tests, the Cisco IOS software is automatically reloaded on the card. Before starting the diagnostic tests, you must confirm the request to perform these tests on the line card because all activity on the line card is halted. The total/indiv. timeout set to 600/220 sec. message indicates that 600 seconds are allowed to perform all field diagnostics tests, and that no single test should exceed 220 seconds to complete.",
            "```",
            "```",
            "```",
            "Router# diag 3",
            "```",
            "```",
            "```",
            "```",
            "Running Diags will halt ALL activity on the requested slot. [ confirm ]",
            "```",
            "```",
            "Router#",
            "```",
            "```",
            "Launching a Field Diagnostic for slot 3",
            "```",
            "```",
            "Running DIAG config check",
            "```",
            "```",
            "RUNNING DIAG download to slot 3 (timeout set to 400 sec.)",
            "```",
            "```",
            "sending cmd FDIAG-DO ALL to fdiag in slot 3",
            "```",
            "```",
            "(total/indiv. timeout set to 600/220 sec.)",
            "```",
            "```",
            "Field Diagnostic PASSED for slot 3",
            "```",
            "```",
            "Field Diag eeprom values: run 159 fial mode 0 (PASS) slot 3",
            "```",
            "```",
            "last test failed was 0, error code 0",
            "```",
            "```",
            "sending SHUTDOWN FDIAG_QUIT to fdiag in slot 3",
            "```",
            "```",
            "```",
            "```",
            "Board will reload",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            "Router#",
            "```",
            "```",
            "```",
            "In the following example, a user is shown the output when field diagnostics are performed on the line card in slot 3 in verbose mode:",
            "```",
            "Router# diag 3 verbose",
            "```",
            "```",
            "```",
            "```",
            "Running Diags will halt ALL activity on the requested slot. [ confirm ]",
            "```",
            "```",
            "Router#",
            "```",
            "```",
            "Launching a Field Diagnostic for slot 3",
            "```",
            "```",
            "Running DIAG config check",
            "```",
            "```",
            "RUNNING DIAG download to slot 3 (timeout set to 400 sec.)",
            "```",
            "```",
            "sending cmd FDIAG-DO ALL to fdiag in slot 3",
            "```",
            "```",
            "(total/indiv. timeout set to 600/220 sec.)",
            "```",
            "```",
            "FDIAG_STAT_IN_PROGRESS: test #1 R5K Internal Cache",
            "```",
            "```",
            "FDIAG_STAT_PASS test_num 1",
            "```",
            "```",
            "FDIAG_STAT_IN_PROGRESS: test #2 Sunblock Ordering",
            "```",
            "```",
            "FDIAG_STAT_PASS test_num 2",
            "```",
            "```",
            "FDIAG_STAT_IN_PROGRESS: test #3 Dram Datapins",
            "```",
            "```",
            "FDIAG_STAT_PASS test_num 3",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            "Field Diags: FDIAG_STAT_DONE",
            "```",
            "```",
            "Field Diagnostic PASSED for slot 3",
            "```",
            "```",
            "Field Diag eeprom values: run 159 fial mode 0 (PASS) slot 3",
            "```",
            "```",
            "last test failed was 0, error code 0",
            "```",
            "```",
            "sending SHUTDOWN FDIAG_QUIT to fdiag in slot 3",
            "```",
            "```",
            "```",
            "```",
            "Board will reload",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            "Router#",
            "```"
        ]
    ],
    "ExtraInfo": "The **diag** command must be executed from the GRP main console port.Perform diagnostics on the CSC only if a redundant CSC is in the router.Diagnostics will stop and ask you for confirmation before altering the router's configuration. For example, running diagnostics on a SFC or CSC will cause the fabric to go from full bandwidth to one-fourth bandwidth. Bandwidth is not affected by GRP or line card diagnostics.The field diagnostic software image is bundled with the Cisco IOS software and is downloaded automatically from the GRP to the target line card prior to testing.![](/c/dam/en/us/td/i/templates/caut.gif)---**Caution** ![](/c/dam/en/us/td/i/templates/blank.gif)Performing field diagnostics on a line card stops all activity on the line card. Before the**diag** EXEC command begins running diagnostics, you are prompted to confirm the request to perform field diagnostics on the line card.---In normal mode, if a test fails, the title of the failed test is displayed on the console. However, not all tests that are performed are displayed. To view all the tests that are performed, use the **verbose** keyword.After all diagnostic tests are completed on the line card, a PASSED or TEST FAILURE message is displayed. If the line card sends a PASSED message, the Cisco IOS software image on the line card is automatically reloaded unless the **wait** keyword is specified. If the line card sends a TEST FAILURE message, the Cisco IOS software image on the line card is not automatically reloaded.If you want to reload the line card after it fails diagnostic testing, use the **microcode reload** *slot* global configuration command.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)When you stop the field diagnostic test, the line card remains down (that is, in an unbooted state). In most cases, you stopped the testing because you need to remove the line card or replace the line card. If that is not the case, and you want to bring the line card back up (that is, online), you must use the **microcode reload** global configuration command or power cycle the line card.---If the line card fails the test, the line card is defective and should be replaced. In future releases this might not be the case because DRAM and SDRAM SIMM modules might be field replaceable units. For example, if the DRAM test failed you might only need to replace the DRAM on the line card.For more information, refer to the Cisco 12000 series installation and configuration guides.",
    "RelatedCmds": [
        {
            "cmd": " **microcode reload** ",
            "description": " Reloads the Cisco IOS image on a line card on the Cisco 7000 series with RSP7000, Cisco 7500 series, or Cisco 12000 series routers after all microcode configuration commands have been entered. "
        }
    ]
}