{
    "PageTitle": "adjust",
    "FuncDef": "The adjust command adjusts the queue priority and DSCP value of packets in a hook-shaped flow matching a PFC uplink interface group.\nThe undo adjust command deletes the configuration for a hook-shaped flow matching a PFC uplink interface group. The adjust command adjusts the queue priority and DSCP value of packets in a hook-shaped flow matching a PFC uplink interface group. The undo adjust command deletes the configuration for a hook-shaped flow matching a PFC uplink interface group. By default, there is no configuration for a hook-shaped flow matching a PFC uplink interface group. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "adjust original-dscp <original-dscpvalue> topriority <prioritynumber> dscp <dscpvalue>",
        "undo adjust original-dscp <original-dscpvalue> topriority <prioritynumber> dscp <dscpvalue>"
    ],
    "ParentView": [
        "PFC uplink group view"
    ],
    "ParaDef": [
        {
            "Parameters": "to",
            "Info": "Adjusts information of packets in a hook-shaped flow matching a PFC uplink interface group.\n-"
        },
        {
            "Parameters": "priority <prioritynumber>",
            "Info": "Adjusts the queue priority of packets in a hook-shaped flow matching a PFC uplink interface group so that the packets are forwarded through the specified queue.\nThe value is an integer ranging from 0 to 7."
        },
        {
            "Parameters": "dscp <dscpvalue>",
            "Info": "Adjusts the DSCP value of packets in a hook-shaped flow matching a PFC uplink interface group so that the packets are still mapped to the specified queue on the downstream device.\nThe value is an integer ranging from 0 to 63."
        },
        {
            "Parameters": "original-dscp <original-dscpvalue>",
            "Info": "Specifies the DSCP value of packets in a hook-shaped flow to be adjusted.\nThe value is an integer ranging from 0 to 63."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcb pfc uplink group myuplink",
            "[*HUAWEI-dcb-pfc-uplink-group-myuplink] adjust original-dscp 10 to priority 4 dscp 32"
        ]
    ],
    "ExtraInfo": "If the system detects that a service flow enters and exits through interfaces in a PFC uplink interface group, the service flow is considered as a high-risk hook-shaped flow that may cause a PFC deadlock. You can run this command to configure a PFC uplink interface group. For a hook-shaped flow that matches the interface group, the device proactively adjusts the queue priority and DSCP value in the packets to change the PFC backpressure path and prevent loops caused by PFC frames."
}