{
    "PageTitle": "group-member interface",
    "FuncDef": "The group-member interface command adds specified interfaces to a PFC uplink interface group.\nThe undo group-member interface command removes specified interfaces from a PFC uplink interface group. The group-member interface command adds specified interfaces to a PFC uplink interface group. The undo group-member interface command removes specified interfaces from a PFC uplink interface group. By default, no interface is added to a PFC uplink interface group. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "group-member interface { <interface-name> | <interface-type> <interface-number> } [ to { <interface-name> | <interface-type> <interface-number> } ] &<1-32>",
        "undo group-member interface { <interface-name> | <interface-type> <interface-number> } [ to { <interface-name> | <interface-type> <interface-number> } ] &<1-32>"
    ],
    "ParentView": [
        "PFC uplink group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of an interface to be added to a PFC uplink interface group.\n-"
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of interfaces to be added to a PFC uplink interface group.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of the interface to be added to a PFC uplink interface group.\n-"
        },
        {
            "Parameters": "to",
            "Info": "The to keyword specifies an interface range that includes all interfaces between these two interfaces.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcb pfc uplink group myuplink",
            "[*HUAWEI-dcb-pfc-uplink-group-myuplink] group-member interface 100GE 1/0/1 to 100GE 1/0/4"
        ]
    ],
    "ExtraInfo": "After a PFC uplink interface group is created on a leaf switch, you can add the leaf switch's interfaces connecting to a spine switch to the PFC uplink interface group. If the system detects that a service flow enters and exits through interfaces in the interface group, the service flow is a high-risk hook-shaped flow that may cause a PFC deadlock."
}