{
    "PageTitle": "classifier behavior(Micro-segment policy view)",
    "FuncDef": "The classifier behavior command configures a segment behavior for a specified microsegmentation classifier in a microsegmentation grouping policy, that is, binds a microsegmentation classifier to a microsegmentation behavior.\nThe undo classifier command unbinds a microsegmentation classifier from a microsegmentation behavior in a microsegmentation grouping policy. The classifier behavior command configures a segment behavior for a specified microsegmentation classifier in a microsegmentation grouping policy, that is, binds a microsegmentation classifier to a microsegmentation behavior. The undo classifier command unbinds a microsegmentation classifier from a microsegmentation behavior in a microsegmentation grouping policy. By default, no microsegmentation classifier or behavior is bound to a microsegmentation grouping policy. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "classifier <classifier-name> behavior <behavior-name> [ precedence <precedence-value> ]",
        "undo classifier <classifier-name> [ behavior <behavior-name> [ precedence <precedence-value> ] ]"
    ],
    "ParentView": [
        "Micro-segment policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "behavior <behavior-name>",
            "Info": "Specifies the name of a segment behavior. The value must be a defined segment behavior name. This parameter is configured using the traffic behavior command.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The first character must be a letter or digit."
        },
        {
            "Parameters": "precedence <precedence-value>",
            "Info": "Specifies the priority of a CB pair.\nThe value is an integer that ranges from 0 to 511."
        },
        {
            "Parameters": "classifier <classifier-name>",
            "Info": "Specifies the name of a segment classifier. The segment classifier must have been defined. This parameter is configured using the traffic classifier command.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The first character must be a letter or digit."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic-segment enable",
            "[*HUAWEI] segment classifier c1",
            "[*HUAWEI-segmentclassifier-c1] rule permit source-segment 32768",
            "[*HUAWEI-segmentclassifier-c1] quit",
            "[*HUAWEI] segment behavior b1",
            "[*HUAWEI-segmentbehavior-b1] statistics enable",
            "[*HUAWEI-segmentbehavior-b1] quit",
            "[*HUAWEI] segment policy p1",
            "[*HUAWEI-segmentpolicy-p1] classifier c1 behavior b1"
        ]
    ],
    "ExtraInfo": "On a data center network, servers are grouped into EPGs based on certain rules. If you do not want to use the default microsegmentation policy for packets matching EPGs but specify GBPs for the packets, configure and apply GBPs as follows:"
}