{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "parser config cache interface",
    "FuncDef": [
        "To reduce the time required for the command-line interpreter to execute commands that manage the running system configuration files, use the **parser config cache interface** command in global configuration mode. To disable the reduced command execution time functionality, use the **no** form of this command. "
    ],
    "CLIs": [
        "parser config cache interface",
        "no parser config cache interface"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "The following example shows how to enable the functionality for reducing the time required for the command-line interpreter to execute commands that manage the running system configuration files:",
            "```",
            "Router(config)# parser config cache interface",
            "```"
        ]
    ],
    "ExtraInfo": "Enable the **parser config cache interface** command to reduce the execution time required for running configuration management commands such as the **show running-configuration**, **write terminal**, and **copy system:running-configuration** commands. Information for these configuration management commands is supplied by nonvolatile generation (NVGEN) processes that query the system for configuration details. The **parser config cache interface** command is especially useful for managing large system configurations that contain numerous interface configurations.Once enabled, the command provides faster execution of the NVGEN commands that process the running system configuration by caching interface configurations in system memory, and by retrieving only configuration information that has changed. For this reason, the device on which this command is enabled must have enough memory available to store the interface configuration. For example, if the interface configurations take up 15 KB of memory, using this command would require having an additional 15 KB of memory space available.The first time you display the configuration file, you will not see much evidence of improvement in performance because the interface cache will be filled up. However, you will notice performance improvements when you enter subsequent NVGEN-type commands such as the **show running-configuration** EXEC command.Each time the interface configuration is changed, the interface cache is flushed. Entering an NVGEN-type command after modifying the interface configuration will once again not show any performance improvement until the next NVGEN-type command is entered.",
    "RelatedCmds": [
        {
            "cmd": " **copy system:running-configuration** ",
            "description": " Copies the running configuration to another destination. "
        },
        {
            "cmd": " **show running-configuration** ",
            "description": " Displays the configuration currently running on the terminal. "
        },
        {
            "cmd": " **write terminal** ",
            "description": " Displays the configuration currently running on the terminal. "
        }
    ]
}