{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "path (archive configuration)",
    "FuncDef": [
        "To specify the location and filename prefix for the files in the Cisco IOS configuration archive, use the **path** command in archive configuration mode. To disable this function, use the **no** form of this command. "
    ],
    "CLIs": [
        "path <url>",
        "no path <url>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *url* ",
            "Info": " URL (accessible by the Cisco IOS file system) used for saving archive files of the running configuration file in the Cisco IOS configuration archive. "
        }
    ],
    "Examples": [
        [
            "The following example of the path command shows how to specify the hostname, date, and time as the filename prefix for which to save archive files of the running configuration. In this example, the time-period command is also configured to automatically save an archive file of the running configuration every 20 minutes.",
            "```",
            "configure terminal",
            "```",
            "```",
            "!",
            "```",
            "```",
            "archive",
            "```",
            "```",
            "path disk0:$h$t",
            "```",
            "```",
            "time-period 20",
            "```",
            "```",
            "end",
            "```",
            "```",
            "```",
            "The following is sample output from the show archive command illustrating the format of the resulting configuration archive filenames.",
            "```",
            "Router# show archive",
            "```",
            "```",
            "```",
            "```",
            "There are currently 3 archive configurations saved.",
            "```",
            "```",
            "The next archive file will be named routerJan-16-01:12:23.019-4",
            "```",
            "```",
            "Archive # Name",
            "```",
            "```",
            "0",
            "```",
            "```",
            "1 disk0:routerJan-16-00:12:23.019-1",
            "```",
            "```",
            "2 disk0:routerJan-16-00:32:23.019-2",
            "```",
            "```",
            "3 disk0:routerJan-16-00:52:23.019-3 <- Most Recent",
            "```",
            "```",
            "4",
            "```",
            "```",
            "5",
            "```",
            "```",
            "6",
            "```",
            "```",
            "7",
            "```",
            "```",
            "8",
            "```",
            "```",
            "9",
            "```",
            "```",
            "10",
            "```",
            "```",
            "11",
            "```",
            "```",
            "12",
            "```",
            "```",
            "13",
            "```",
            "```",
            "14",
            "```",
            "Cisco IOS Configuration Archive on the TFTP File Server",
            "The following example shows how to use the path command to specify the TFTP file server, address 10.48.71.226, as the archive configuration location and router-cfg as the configuration filename. First you create the configuration file on the TFTP server and change the file's privileges, then you can save the configuration file to the configuration archive.",
            "The following example shows the commands to use to create the file and change the file's privileges on the TFTP server (UNIX commands):",
            "```",
            "> touch router-cfg-1",
            "```",
            "```",
            "> chmod 777 router-cfg-1",
            "```",
            "```",
            "```",
            "The following example show how to create the configuration archive, save the running configuration to the archive, and display the files in the archive:",
            "```",
            "configure terminal",
            "```",
            "```",
            "!",
            "```",
            "```",
            "archive",
            "```",
            "```",
            "path tftp://10.48.71.226/router-cfg",
            "```",
            "```",
            "exit",
            "```",
            "```",
            "exit",
            "```",
            "```",
            "!",
            "```",
            "```",
            "archive config",
            "```",
            "```",
            "```",
            "```",
            "Router# show archive",
            "```",
            "```",
            "```",
            "```",
            "The next archive file will be named tftp://10.48.71.226/router-cfg-2",
            "```",
            "```",
            "Archive # Name",
            "```",
            "```",
            "0",
            "```",
            "```",
            "1 tftp://10.48.71.226/router-cfg-1 <- Most Recent",
            "```",
            "```",
            "2",
            "```",
            "```",
            "3",
            "```",
            "```",
            "4",
            "```",
            "```",
            "5",
            "```",
            "```",
            "6",
            "```",
            "```",
            "7",
            "```",
            "```",
            "8",
            "```",
            "```",
            "9",
            "```",
            "```",
            "10",
            "```",
            "```",
            "11",
            "```",
            "```",
            "12",
            "```",
            "```",
            "13",
            "```",
            "```",
            "14",
            "```",
            "```",
            "```",
            "The following is sample output from the show archive command if you did not create the configuration file on the TFTP server before attempting to archive the current running configuration file:",
            "```",
            "configure terminal",
            "```",
            "```",
            "!",
            "```",
            "```",
            "archive",
            "```",
            "```",
            "path tftp://10.48.71.226/router-cfg",
            "```",
            "```",
            "exit",
            "```",
            "```",
            "exit",
            "```",
            "```",
            "```",
            "```",
            "archive config",
            "```",
            "```",
            "```",
            "```",
            "Router# show archive",
            "```",
            "```",
            "```",
            "```",
            "The next archive file will be named tftp://10.48.71.226/router-cfg-1",
            "```",
            "```",
            "Archive # Name",
            "```",
            "```",
            "0",
            "```",
            "```",
            "1",
            "```",
            "```",
            "2",
            "```",
            "```",
            "3",
            "```",
            "```",
            "4",
            "```",
            "```",
            "5",
            "```",
            "```",
            "6",
            "```",
            "```",
            "7",
            "```",
            "```",
            "8",
            "```",
            "```",
            "9",
            "```",
            "```",
            "10",
            "```",
            "```",
            "11",
            "```",
            "```",
            "12",
            "```",
            "```",
            "13",
            "```",
            "```",
            "14",
            "```"
        ]
    ],
    "ExtraInfo": "When this command is entered, an archive file of the running configuration is saved when the **archive config**, **write-memory**, or **copy running-config startup-config** command is entered.URLs are commonly used to specify files or location on the World Wide Web. On Cisco routers, URLs can be used to specify the location of a file or directory on a router or a remote file server. The **path** command uses a URL to specify the location and filename prefix for the Cisco IOS configuration archive.The locations or file systems that you can specify in the *url* argument are as follows:•![](/c/dam/en/us/td/i/templates/blank.gif)If your platform has disk0—disk0:, disk1:, ftp:, pram:, rcp:, slavedisk0:, slavedisk1:, or tftp:•![](/c/dam/en/us/td/i/templates/blank.gif)If your platform does not have disk0—ftp:, http:, pram:, rcp:, or tftp:The colon is required in the location format.The filename of the first archive file is the filename specified in the *url* argument followed by -1. The filename of the second archive file is the filename specified in the *url* argument followed by -2 and so on.Because some file systems are incapable of storing the date and time that a file was written, the filename of the archive file can contain the date, time, and router hostname. To include the router hostname in the archive file filename, enter the characters $h (for example, disk0:$h). To include the date and time in the archive file filename, enter the characters $t.When a configuration archive operation is attempted on a local file system, the file system is tested to determine if it is writable and if it has sufficient space to save an archive file. If the file system is read-only or if there is not enough space to save an archive file, an error message is displayed.If you specify the tftp: file server as the location with the **path** command, you need to create the configuration file on the TFTP file server and change the file's privileges before the **archive config** command works properly.",
    "RelatedCmds": [
        {
            "cmd": " **archive** ",
            "description": " Enters archive configuration mode. "
        },
        {
            "cmd": " **archive config** ",
            "description": " Saves a copy of the current running configuration to the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **configure confirm** ",
            "description": " Confirms replacement of the current running configuration with a saved Cisco IOS configuration file. "
        },
        {
            "cmd": " **configure replace** ",
            "description": " Replaces the current running configuration with a saved Cisco IOS configuration file. "
        },
        {
            "cmd": " **maximum** ",
            "description": " Sets the maximum number of archive files of the running configuration to be saved in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **show archive** ",
            "description": " Displays information about the files saved in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **time-period** ",
            "description": " Sets the time increment for automatically saving an archive file of the current running configuration in the Cisco IOS configuration archive. "
        }
    ]
}