{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "printer",
    "FuncDef": [
        "To configure a printer and assign a server tty line (or lines) to it, use the **printer**command in global configuration mode. To disable printing on a tty line, use the **no** form of this command. "
    ],
    "CLIs": [
        "printer <printer-name> { line <number> | rotary <number> } [ formfeed ] [ jobtimeout <seconds> ] [ newline-convert ] [ jobtypes <type> ]",
        "no printer <printer-name>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *printer-name* ",
            "Info": " Printer name. "
        },
        {
            "Parameters": " **line** *number* ",
            "Info": " Assigns a tty line to the printer.  The *number* argument can be any one of the following parameters:  •**aux**—Specifies the auxiliary line.  •**console**—Specifies the primary terminal line.  •*slot*/*port*—First slot and port numbers for the internal modems.  •**tty** *number*—Specifies the terminal controller value.  •*tty-number*—tty number, in the range 0 to 491.  •**vty** *value*—Specifies the virtual terminal value. "
        },
        {
            "Parameters": " **rotary** *number* ",
            "Info": " Assigns a rotary group of tty lines to the printer. "
        },
        {
            "Parameters": " **formfeed** ",
            "Info": " (Optional) Causes the Cisco IOS software to send a form-feed character (ASCII 0x0C) to the printer tty line immediately following each print job received from the network. "
        },
        {
            "Parameters": " **jobtimeout** *seconds* ",
            "Info": " (Optional) Changes the default time for line acquisition. The range is from 1 to 3600 seconds. "
        },
        {
            "Parameters": " **newline-convert** ",
            "Info": " (Optional) Converts newline (linefeed) characters to a two-character sequence \"carriage-return, linefeed\" (CR+LF). "
        },
        {
            "Parameters": " **jobtypes** *type* ",
            "Info": " (Optional) Specifies allowed job types. "
        }
    ],
    "Examples": [
        [
            "The following example shows how to configure a printer named printer1 and to assign the output to tty line 4:",
            "```",
            "Router# configure terminal",
            "```",
            "```",
            "Router(config)# printer printer1 line 4",
            "```"
        ]
    ],
    "ExtraInfo": "This command enables you to configure a printer for operations and assign either a single tty line or a group of tty lines to it. To make multiple printers available through the same printer name, specify the number of a rotary group.In addition to configuring the printer with the **printer** command, you must modify the file /etc/printcap on your UNIX system to include the definition of the remote printer in the Cisco IOS software. Refer to the *Cisco IOS Configuration Fundamentals Configuration Guide* for additional information.Use the optional **newline-convert** keyword in UNIX environments that cannot handle single-character line terminators. This converts newline characters to a carriage-return, linefeed sequence. Use the **formfeed** keyword when using the line printer daemon (lpd) protocol to print and your system is unable to separate individual output jobs with a form feed (page eject). You can enter the **newline-convert** and **formfeed** keywords together and in any order.",
    "RelatedCmds": [
        {
            "cmd": " **clear line** ",
            "description": " Returns a terminal line to idle state. "
        }
    ]
}