{
    "PageTitle": "macsec cipher-suite",
    "FuncDef": "The macsec cipher-suite command configures an encryption algorithm for MACsec data packets. The macsec cipher-suite command configures an encryption algorithm for MACsec data packets. By default, the encryption algorithms supported by different devices vary. The actually used algorithm is automatically negotiated by the devices at both ends in descending order of encryption strength. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "macsec cipher-suite { gcm-aes-128 | gcm-aes-256 | gcm-aes-xpn-128 | gcm-aes-xpn-256 }",
        "undo macsec cipher-suite [ gcm-aes-128 | gcm-aes-256 | gcm-aes-xpn-128 | gcm-aes-xpn-256 ]",
        "macsec cipher-suite { gcm-aes-128 | gcm-aes-256 | gcm-aes-xpn-128 | gcm-aes-xpn-256 | gcm-sm4-128 | gcm-sm4-xpn-128 }",
        "undo macsec cipher-suite [ gcm-aes-128 | gcm-aes-256 | gcm-aes-xpn-128 | gcm-aes-xpn-256 | gcm-sm4-128 | gcm-sm4-xpn-128 ]"
    ],
    "ParentView": [
        "mac security profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "gcm-aes-128",
            "Info": "Sets the encryption algorithm for MACsec data packets to GCM-AES-128.\n-"
        },
        {
            "Parameters": "gcm-aes-256",
            "Info": "Sets the encryption algorithm for MACsec data packets to GCM-AES-256.\n-"
        },
        {
            "Parameters": "gcm-aes-xpn-128",
            "Info": "Sets the encryption algorithm for MACsec data packets to GCM-AES-XPN-128.\n-"
        },
        {
            "Parameters": "gcm-aes-xpn-256",
            "Info": "Sets the encryption algorithm for MACsec data packets to GCM-AES-XPN-256.\n-"
        },
        {
            "Parameters": "gcm-sm4-128",
            "Info": "Sets the encryption algorithm for MACsec data packets to GCM-SM4-128.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "gcm-sm4-xpn-128",
            "Info": "Sets the encryption algorithm for MACsec data packets to GCM-SM4-XPN-128.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mac-security-profile name test",
            "[*HUAWEI-macsec-profile-test] macsec cipher-suite gcm-aes-xpn-256"
        ]
    ],
    "ExtraInfo": "The encryption strength of the MACsec data packet encryption algorithm is GCM-AES-XPN-256 > GCM-AES-XPN-128 > GCM-AES-256 > GCM-AES-128, GCM-SM4-XPN-128 > GCM-SM4-128 in descending order. You can run this command to specify multiple encryption algorithms. The algorithms to be used are automatically negotiated by the devices at both ends in descending order of encryption strength."
}