{
    "PageTitle": "mka cryptographic-algorithm",
    "FuncDef": "The mka cryptographic-algorithm command configures the MKA key generation algorithm.\nThe undo mka cryptographic-algorithm command restores the default MKA key generation algorithm. The mka cryptographic-algorithm command configures the MKA key generation algorithm. The undo mka cryptographic-algorithm command restores the default MKA key generation algorithm. By default, the MKA key generation algorithm is AES-CMAC-128. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "mka cryptographic-algorithm { aes-cmac-128 | aes-cmac-256 }",
        "undo mka cryptographic-algorithm",
        "mka cryptographic-algorithm sm4-cmac-128"
    ],
    "ParentView": [
        "mac security profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "aes-cmac-128",
            "Info": "Sets the MKA key generation algorithm to AES-CMAC-128.\n-"
        },
        {
            "Parameters": "aes-cmac-256",
            "Info": "Sets the MKA key generation algorithm to AES-CMAC-256.\n-"
        },
        {
            "Parameters": "sm4-cmac-128",
            "Info": "Sets the MKA key generation algorithm to SM4-CMAC-128.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mac-security-profile name test",
            "[*HUAWEI-macsec-profile-test] mka cryptographic-algorithm aes-cmac-256"
        ]
    ],
    "ExtraInfo": "The MKA key generation algorithm is used to generate the key encrypting key (KEK) for encrypting and decrypting the SAK and the integrity check key (ICK). After generating an SAK, the key server sends an MKA packet carrying the encrypted SAK to the peer device. After receiving the MKA packet, the peer device checks the integrity of the packet. If the check fails, the peer device discards the packet. If the check succeeds, the peer device decrypts the packet to obtain the SAK."
}