{
    "PageTitle": "aaa-quiet administrator except-list",
    "FuncDef": "The aaa-quiet administrator except-list command configures a user to access the network using a specified IP address when the user account is locked.\nThe undo aaa-quiet administrator except-list command restores the default setting. The aaa-quiet administrator except-list command configures a user to access the network using a specified IP address when the user account is locked. The undo aaa-quiet administrator except-list command restores the default setting. By default, a user cannot access the network when the account is locked.",
    "CLIs": [
        "aaa-quiet administrator except-list { <ipv4-address> | <ipv6-address> } &<1-32>",
        "undo aaa-quiet administrator except-list [ <ipv4-address> | <ipv6-address> ]",
        "aaa-quiet administrator except-list { <ipv4-address> } &<1-32>",
        "undo aaa-quiet administrator except-list { <ipv4-address> }"
    ],
    "ParentView": [
        "AAA view,Vsys aaa view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies an IPv4 address. A user can access the network using this IPv4 address when the user account is locked.\nThe value is a valid unicast address in dotted decimal notation."
        },
        {
            "Parameters": "<ipv6-address>",
            "Info": "Specifies an IPv6 address. A user can access the network using this IPv6 address when the user account is locked.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] aaa-quiet administrator except-list 10.1.1.1"
        ]
    ],
    "ExtraInfo": "In the AAA view, after the account locking function is configured for AAA local authentication users or AAA remote authentication users, if a user enters incorrect passwords for a specified number of consecutive times, the user account is locked. During the locking period, the user cannot access the network. To facilitate maintenance and management, you can run the aaa-quiet administrator except-list command to allow a user to use a specified IP address to access the network when the user account is locked."
}