{
    "PageTitle": "access-user cib-record",
    "FuncDef": "The access-user cib-record cache-record-num cache-aging-time command sets the maximum number of CIB cache entries that can be recorded and the aging time.\nThe undo access-user cib-record cache-record-num cache-aging-time command restores the default maximum number of CIB cache entries that can be recorded and the default aging time. The access-user cib-record cache-record-num cache-aging-time command sets the maximum number of CIB cache entries that can be recorded and the aging time. The undo access-user cib-record cache-record-num cache-aging-time command restores the default maximum number of CIB cache entries that can be recorded and the default aging time. By default, the maximum number of cached users is 2% of the user specification, and the maximum cache aging time is 48 hours.",
    "CLIs": [
        "access-user cib-record cache-record-num <cache-record-num> cache-aging-time <cache-aging-time>",
        "undo access-user cib-record cache-record-num <cache-record-num> cache-aging-time <cache-aging-time>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "cache-record-num <cache-record-num>",
            "Info": "Maximum number of cached records for a single process.\nThe value is an integer ranging from 0 to 100.\nThe value 0 indicates that no record is generated.\n\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 0 to 100.\nThe value 0 indicates that no record is generated.\n\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S:The value is an integer that ranges from 0 to 4,096.\nThe value 0 indicates that no record is generated."
        },
        {
            "Parameters": "cache-aging-time <cache-aging-time>",
            "Info": "Cache aging time.\nThe value is an integer that ranges from 0 to 240, in hours.\nThe value 0 indicates that no record is generated. The default value is 48 hours."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access-user cib-record cache-record-num 200 cache-aging-time 24"
        ]
    ],
    "ExtraInfo": ""
}