{
    "PageTitle": "access-user remote authen-fail",
    "FuncDef": "The access-user remote authen-fail command enables the account locking function for access users who fail remote authentication.\nThe undo access-user remote authen-fail command disables the account locking function for access users who fail remote authentication. The access-user remote authen-fail command enables the account locking function for access users who fail remote authentication. The undo access-user remote authen-fail command disables the account locking function for access users who fail remote authentication. By default, the account locking function is disabled for access users who fail remote authentication. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "access-user remote authen-fail retry-interval <retry-interval> retry-time <retry-time> block-time <block-time>",
        "undo access-user remote authen-fail"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "retry-interval <retry-interval>",
            "Info": "Specifies the authentication retry interval after a remote AAA authentication failure.\nThe value is an integer that ranges from 5 to 65535."
        },
        {
            "Parameters": "retry-time <retry-time>",
            "Info": "Specifies the maximum number of consecutive authentication failures.\nThe value is an integer that ranges from 3 to 65535."
        },
        {
            "Parameters": "block-time <block-time>",
            "Info": "Specifies the account lockout duration.\nThe value is an integer that ranges from 5 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] access-user remote authen-fail retry-interval 5 retry-time 3 block-time 5"
        ]
    ],
    "ExtraInfo": "To ensure account and password security for access users, you are advised to enable the account locking function for access users who fail remote authentication. If the number of consecutive incorrect account or password attempts reaches the upper limit within the retry interval, the account is locked and will be automatically unlocked after a specified period."
}