{
    "PageTitle": "accounting interim-fail",
    "FuncDef": "The accounting interim-fail command sets the maximum number of real-time accounting failures and configures a policy used after the number of real-time accounting failures exceeds the maximum.\nThe undo accounting interim-fail command restores the default maximum number of real-time accounting failures and the default policy. The accounting interim-fail command sets the maximum number of real-time accounting failures and configures a policy used after the number of real-time accounting failures exceeds the maximum. The undo accounting interim-fail command restores the default maximum number of real-time accounting failures and the default policy. By default, the maximum number of real-time accounting failures is 3 and the device keeps users online after the number of real-time accounting failures exceeds the maximum.",
    "CLIs": [
        "accounting interim-fail [ max-times <times> ] { online | offline }",
        "undo accounting interim-fail"
    ],
    "ParentView": [
        "Accounting scheme view"
    ],
    "ParaDef": [
        {
            "Parameters": "max-times <times>",
            "Info": "Specifies the maximum number of real-time accounting failures. If the maximum number of real-time accounting failures is reached and the next accounting request still has no response, the device considers that accounting fails and takes a policy for users.\nThe value is an integer that ranges from 1 to 255. The default value is 3."
        },
        {
            "Parameters": "online",
            "Info": "Keeps users online if real-time accounting fails.\n-"
        },
        {
            "Parameters": "offline",
            "Info": "Disconnects users if real-time accounting fails.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] accounting-scheme scheme1",
            "[*HUAWEI-aaa-accounting-scheme1] accounting realtime 3",
            "[*HUAWEI-aaa-accounting-scheme1] accounting interim-fail max-times 5 offline"
        ]
    ],
    "ExtraInfo": "After the real-time accounting function takes effect, the device sends real-time accounting requests to an accounting server, and the accounting server responds to the accounting requests. If the network is unstable, for example, a jitter occurs, the device may not receive response packets. As a result, accounting is interrupted for a short period of time. To reduce or prevent accounting interruption, run the accounting interim-fail command to set the maximum number of real-time accounting failures. The device considers that real-time accounting fails only after the number of consecutive real-time accounting failures exceeds the maximum.\nChoose one of the following policies to be applied after the maximum number of real-time accounting failures is reached:"
}