{
    "PageTitle": "accounting realtime",
    "FuncDef": "The accounting realtime command enables the real-time accounting function and sets the interval for real-time accounting in an accounting scheme.\nThe undo accounting realtime command disables the real-time accounting function. The accounting realtime command enables the real-time accounting function and sets the interval for real-time accounting in an accounting scheme. The undo accounting realtime command disables the real-time accounting function. By default, the device performs accounting based on user online duration, the real-time accounting function is disabled.",
    "CLIs": [
        "accounting realtime <interval>",
        "undo accounting realtime"
    ],
    "ParentView": [
        "Accounting scheme view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interval>",
            "Info": "Specifies the interval for real-time accounting.\nThe value is an integer in the range from 0 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] accounting-scheme scheme1",
            "[*HUAWEI-aaa-accounting-scheme1] accounting realtime 6"
        ]
    ],
    "ExtraInfo": "This command applies to the users who are charged based on online duration. If a user goes offline unexpectedly, the accounting server cannot receive the accounting-stop packet, so it keeps charging the user while they are not receiving a service. To solve the problem, configure the real-time accounting function on the device. After the real-time accounting function is configured, the device periodically sends real-time accounting packets to the accounting server. After receiving the real-time accounting packets, the accounting server charges the user. If the device detects that the user goes offline, it stops sending real-time accounting packets and the accounting server stops accounting. The result of real-time accounting is precise."
}