{
    "PageTitle": "administrator remote authen-fail",
    "FuncDef": "The administrator remote authen-fail command enables the account locking function for administrators who fail remote authentication. The undo administrator remote authen-fail command disables the account locking function for administrators who fail remote authentication. By default, the account locking function is enabled for administrators who fail remote authentication. The authentication retry interval is 5 minutes, the maximum number of consecutive authentication failures is 30, and the account lockout duration is 5 minutes.",
    "CLIs": [
        "administrator remote authen-fail retry-interval <retry-interval> retry-time <retry-time> block-time <block-time>",
        "undo administrator remote authen-fail"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "retry-interval <retry-interval>",
            "Info": "Specifies the authentication retry interval after a remote AAA authentication failure.\nThe value is an integer that ranges from 5 to 65535, in minutes. The default value is 5."
        },
        {
            "Parameters": "retry-time <retry-time>",
            "Info": "Specifies the maximum number of consecutive authentication failures.\nThe value is an integer ranging from 3 to 65535. The default value is 30."
        },
        {
            "Parameters": "block-time <block-time>",
            "Info": "Specifies the account lockout duration.\nThe value is an integer that ranges from 5 to 65535, in minutes. The default value is 5."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] administrator remote authen-fail retry-interval 5 retry-time 3 block-time 5"
        ]
    ],
    "ExtraInfo": "To ensure account and password security of administrators, you are advised to enable the account locking function for administrators who fail remote authentication. If an administrator enters the incorrect account and password more than the maximum number of consecutive authentication failures within the authentication retry interval, the account is locked. After a certain period, the account is automatically unlocked."
}