{
    "PageTitle": "authentication-mode (authentication scheme view)",
    "FuncDef": "The authentication-mode command configures an authentication mode for an authentication scheme.\nThe undo authentication-mode command restores the default authentication mode in an authentication scheme. The authentication-mode command configures an authentication mode for an authentication scheme. The undo authentication-mode command restores the default authentication mode in an authentication scheme. By default, local authentication is used.",
    "CLIs": [
        "authentication-mode none",
        "authentication-mode { hwtacacs | ldap | { local | local-case } | radius } [ none ]",
        "undo authentication-mode"
    ],
    "ParentView": [
        "Authentication scheme view"
    ],
    "ParaDef": [
        {
            "Parameters": "hwtacacs",
            "Info": "Authenticates users using an HWTACACS server. To perform HWTACACS authentication, configure an HWTACACS authentication server in an HWTACACS server template.\n-"
        },
        {
            "Parameters": "local",
            "Info": "Authenticates users locally and sets local user names to case-insensitive.\n-"
        },
        {
            "Parameters": "local-case",
            "Info": "Authenticates users locally and sets local user names to case-sensitive.\n-"
        },
        {
            "Parameters": "radius",
            "Info": "Authenticates users using a RADIUS server. To perform RADIUS authentication, configure a RADIUS authentication server in a RADIUS server template.\n-"
        },
        {
            "Parameters": "ldap",
            "Info": "Authenticates users using an LDAP server. To perform LDAP authentication, configure an LDAP authentication server in an LDAP server template.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Indicates non-authentication. That is, users access the network without being authenticated.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] authentication-scheme scheme1",
            "[*HUAWEI-aaa-authen-scheme1] authentication-mode radius"
        ]
    ],
    "ExtraInfo": "To authenticate users, configure an authentication mode in an authentication scheme.\nIf multiple authentication modes are configured in an authentication scheme, the authentication modes are used according to the sequence in which they were configured."
}