{
    "PageTitle": "authorization-cmd",
    "FuncDef": "The authorization-cmd command configures command-specific authorization for an administrator of a specific level. After command-specific authorization is enabled and an administrator of a specific level logs in to the device, the commands that the administrator enters can be executed only after being authorized by the HWTACACS server. The undo authorization-cmd command disables command-specific authorization for an administrator of a specific level. By default, the command-specific authorization is disabled. That is, an administrator of any level can execute only commands of or below its level after logging in to the device.",
    "CLIs": [
        "authorization-cmd [ <privilege-level> ] { hwtacacs | local } [ none ]",
        "undo authorization-cmd [ <privilege-level> ]"
    ],
    "ParentView": [
        "Authorization scheme view"
    ],
    "ParaDef": [
        {
            "Parameters": "<privilege-level>",
            "Info": "Specified the administrator level.\nThe value is an integer that ranges from 0 to 3."
        },
        {
            "Parameters": "hwtacacs",
            "Info": "Indicates HWTACACS authorization.\n-"
        },
        {
            "Parameters": "local",
            "Info": "Indicates local authorization.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Indicates that command line authorization is directly performed for a user if the HWTACACS server does not respond to the authorization request of the user.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] authorization-scheme scheme1",
            "[*HUAWEI-aaa-author-scheme1] authorization-cmd 2 hwtacacs"
        ]
    ],
    "ExtraInfo": "After being authorized, the users at a certain level can run the commands of the same or lower levels. Command line authorization can be configured to implement minimum user rights control. When command line authorization is enabled, each command entered by users can be executed only after being authorized. After command line authorization is enabled for users at a certain level, the commands run by the users at that level must be authorized by an HWTACACS server."
}