{
    "PageTitle": "called-station-id mac-format",
    "FuncDef": "The called-station-id mac-format command sets the encapsulation format of the MAC address in the called-station-id (Type 30) attribute of RADIUS packets.\nThe undo called-station-id mac-format command restores the default encapsulation format of the MAC address in the called-station-id (Type 30) attribute of RADIUS packets. The called-station-id mac-format command sets the encapsulation format of the MAC address in the called-station-id (Type 30) attribute of RADIUS packets. The undo called-station-id mac-format command restores the default encapsulation format of the MAC address in the called-station-id (Type 30) attribute of RADIUS packets. By default, the encapsulation format of the MAC address in the called-station-id attribute of RADIUS packets is XX-XX-XX-XX-XX-XX, in uppercase. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "called-station-id mac-format { dot-split | hyphen-split } [ mode1 | mode2 ] [ lowercase | uppercase ]",
        "called-station-id mac-format unformatted [ lowercase | uppercase ]",
        "undo called-station-id mac-format"
    ],
    "ParentView": [
        "RADIUS server template view"
    ],
    "ParaDef": [
        {
            "Parameters": "dot-split",
            "Info": "Indicates that the dot (.) is used as the separator in a MAC address in the called-station-id attribute.\n-"
        },
        {
            "Parameters": "hyphen-split",
            "Info": "Indicates that the hyphen (-) is used as the separator in a MAC address in the called-station-id attribute.\n-"
        },
        {
            "Parameters": "mode1",
            "Info": "Indicates that the MAC address in the called-station-id attribute uses the XXXX-XXXX-XXXX or XXXX.XXXX.XXXX format.\n-"
        },
        {
            "Parameters": "mode2",
            "Info": "Indicates that the MAC address in the called-station-id attribute uses the XX-XX-XX-XX-XX-XX or XX.XX.XX.XX.XX.XX format.\n-"
        },
        {
            "Parameters": "lowercase",
            "Info": "Indicates that the MAC address in the called-station-id attribute is in lowercase.\n-"
        },
        {
            "Parameters": "uppercase",
            "Info": "Indicates that the MAC address in the called-station-id attribute is in uppercase.\n-"
        },
        {
            "Parameters": "unformatted",
            "Info": "Indicates that no separator is used in a MAC address in the called-station-id attribute.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server template huawei",
            "[*HUAWEI-radius-huawei] called-station-id mac-format dot-split mode2 uppercase"
        ]
    ],
    "ExtraInfo": ""
}