{
    "PageTitle": "calling-station-id mac-format",
    "FuncDef": "The calling-station-id mac-format command sets the encapsulation format of the MAC address in the calling-station-id (Type 31) attribute of RADIUS packets.\nThe undo calling-station-id mac-format command restores the default encapsulation format of the MAC address in the calling-station-id attribute of RADIUS packets. The calling-station-id mac-format command sets the encapsulation format of the MAC address in the calling-station-id (Type 31) attribute of RADIUS packets. The undo calling-station-id mac-format command restores the default encapsulation format of the MAC address in the calling-station-id attribute of RADIUS packets. By default, the encapsulation format of the MAC address in the calling-station-id attribute of RADIUS packets is xxxx-xxxx-xxxx, in lowercase. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "calling-station-id mac-format { dot-split | hyphen-split | colon-split } [ mode1 | mode2 ] [ lowercase | uppercase ]",
        "calling-station-id mac-format unformatted [ lowercase | uppercase ]",
        "calling-station-id mac-format bin",
        "undo calling-station-id mac-format"
    ],
    "ParentView": [
        "RADIUS server template view"
    ],
    "ParaDef": [
        {
            "Parameters": "dot-split",
            "Info": "Indicates that the dot (.) is used as the separator in a MAC address.\n-"
        },
        {
            "Parameters": "hyphen-split",
            "Info": "Indicates that the hyphen (-) is used as the separator in a MAC address.\n-"
        },
        {
            "Parameters": "colon-split",
            "Info": "Indicates that the colon (:) is used as the separator in a MAC address.\n-"
        },
        {
            "Parameters": "mode1",
            "Info": "Indicates that the MAC address in the calling-station-id attribute uses the XXXX-XXXX-XXXX, XXXX.XXXX.XXXX, or XXXX:XXXX:XXXX format.\n-"
        },
        {
            "Parameters": "mode2",
            "Info": "Indicates that the MAC address in the calling-station-id attribute uses the XX-XX-XX-XX-XX-XX, XX.XX.XX.XX.XX.XX, or XX:XX:XX:XX:XX:XX.\n-"
        },
        {
            "Parameters": "lowercase",
            "Info": "Indicates that the MAC address in the calling-station-id attribute uses the lowercase.\n-"
        },
        {
            "Parameters": "uppercase",
            "Info": "Indicates that the MAC address in the calling-station-id attribute uses the uppercase.\n-"
        },
        {
            "Parameters": "unformatted",
            "Info": "Indicates that no separator is used in a MAC address.\n-"
        },
        {
            "Parameters": "bin",
            "Info": "Indicates that the MAC address in the calling-station-id attribute uses the binary form.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server template huawei",
            "[*HUAWEI-radius-huawei] calling-station-id mac-format dot-split mode2 uppercase"
        ]
    ],
    "ExtraInfo": ""
}