{
    "PageTitle": "hwtacacs-server authentication",
    "FuncDef": "The hwtacacs-server authentication command configures the HWTACACS authentication server. The undo hwtacacs-server authentication command deletes configurations of the HWTACACS authentication server. By default, no HWTACACS authentication server is configured.",
    "CLIs": [
        "hwtacacs-server authentication <ipv4-address> [ <port> ] [ public-net | vpn-instance <vpn-instance-name> ] [ secondary | third | fourth ] [ shared-keycipher <cipher-string> ] [ mux-mode ]",
        "undo hwtacacs-server authentication [ <ipv4-address> [ <port> ] [ public-net | vpn-instance <vpn-instance-name> ] [ secondary | third | fourth ] [ mux-mode ] ]"
    ],
    "ParentView": [
        "HWTACACS server template view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of an HWTACACS authentication server.\nThe value is a valid unicast address in dotted decimal notation."
        },
        {
            "Parameters": "<port>",
            "Info": "Specifies the port number of an HWTACACS authentication server.\nThe value is an integer that ranges from 1 to 65535. The default value is 49."
        },
        {
            "Parameters": "public-net",
            "Info": "Indicates that the HWTACACS authentication server is connected to the public network.\n-"
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance. This parameter is supported only in the HWTACACS server template view.\nThe value is a string of 1 to 31 case-sensitive characters. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "secondary",
            "Info": "Configures the second HWTACACS authentication server as the secondary server. If no secondary HWTACACS authentication server is configured, the primary HWTACACS authentication server is specified.\n-"
        },
        {
            "Parameters": "third",
            "Info": "Configures the third HWTACACS authentication server as the secondary server. If no secondary HWTACACS authentication server is configured, the primary HWTACACS authentication server is specified.\n-"
        },
        {
            "Parameters": "fourth",
            "Info": "Configures the fourth HWTACACS authentication server as the secondary server. If no secondary HWTACACS accounting server is configured, the primary HWTACACS accounting server is configured.\n-"
        },
        {
            "Parameters": "shared-key",
            "Info": "Specifies the shared key of an HWTACACS authentication server.\n-"
        },
        {
            "Parameters": "cipher <cipher-string>",
            "Info": "Specifies the shared key of an HWTACACS authentication server.\nThe value is a string of 1 to 255 case-sensitive characters in plaintext or a string of 128 to 428 case-sensitive characters in ciphertext. The string can contain spaces if it is enclosed in double quotation marks (\")."
        },
        {
            "Parameters": "mux-mode",
            "Info": "Indicates that the HWTACACS server works in multiplexing mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] hwtacacs-server template test1",
            "[*HUAWEI-hwtacacs-test1] hwtacacs-server authentication 10.163.155.12 49"
        ]
    ],
    "ExtraInfo": "To authenticate users using HWTACACS, you must configure the HWTACACS authentication server. When both the primary and secondary authentication servers are configured, the device sends an authentication request packet to the secondary authentication server in any of the following situations:"
}