{
    "PageTitle": "local-user",
    "FuncDef": "The local-user command creates a local user and sets parameters of the local user. The undo local-user command deletes a local user. By default, no local user is created in the system.",
    "CLIs": [
        "local-user <user-name> { passwordirreversible-cipher <ir-password> | access-limit <max-number> | idle-timeout <minutes> [ <seconds> ] | privilegelevel <level> | state { block | active } }",
        "local-user <user-name> privilegelevel <level>",
        "local-user <user-name> user-group <user-group-value>",
        "local-user <user-name> ftp-directory <directory> [ readexecute [ write ] ]",
        "undo local-user <user-name> [ access-limit | ftp-directory | idle-timeout | privilegelevel ]",
        "undo local-user <user-name> privilegelevel",
        "undo local-user <user-name> user-group"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "<user-name>",
            "Info": "Specifies the user name of a local administrator. If the user name contains a domain name delimiter such as @, the character before @ is the user name and the character after @ is the domain name. If the value does not contain @, the entire character string is the user name and the domain name is the default one.\nThe value is a string of 1 to 253 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "password",
            "Info": "Specifies the login password of the local administrator.\n-"
        },
        {
            "Parameters": "irreversible-cipher",
            "Info": "irreversible-cipher indicates that the user password is encrypted using the irreversible algorithm. Unauthorized users cannot obtain the plain text by using the decryption algorithm.\nIf irreversible-cipher is specified, the password can be a string of 8 to 128 characters in plaintext or a string of 62 characters in ciphertext."
        },
        {
            "Parameters": "<ir-password>",
            "Info": "Specifies the password of a local user.\nThe value is a string of 8 to 128 case-sensitive characters in plaintext or 62 case-sensitive characters in ciphertext. By default, the password must contain at least four types of the following characters, including uppercase letters, lowercase letters, digits, and special characters. Special characters do not include question marks (?) and spaces. However, if the password is enclosed in double quotation marks (\" \"), spaces are allowed in the password. ? If double quotation marks are used to set a password with spaces, the double quotation marks cannot contain other double quotation marks. ? If double quotation marks are used to set a password without any space, the double quotation marks can contain other double quotation marks. For example, \"a 123\"45\"\" is an invalid password, but \"a123\"45\"\" is a valid password."
        },
        {
            "Parameters": "access-limit <max-number>",
            "Info": "Indicates the maximum number of connections that can be created with a specified user name. If this parameter is not specified, a user can establish a maximum of 4294967295 connections by default.\nThe value is an integer ranging from 1 to 4294967295. The actual number of connections is the smaller value between max-number and the maximum number of users of a type on different models."
        },
        {
            "Parameters": "idle-timeout",
            "Info": "Specifies the timeout period of the user interface.\n-"
        },
        {
            "Parameters": "<minutes>",
            "Info": "minutes specifies the period when the user interface is disconnected, in minutes.\nThe value is an integer that ranges from 0 to 35791, in minutes."
        },
        {
            "Parameters": "<seconds>",
            "Info": "seconds specifies the period when the user interface is disconnected, in seconds.\nThe value is an integer that ranges from 0 to 59, in seconds."
        },
        {
            "Parameters": "privilege",
            "Info": "Specifies the privilege level of the local administrator.\n-"
        },
        {
            "Parameters": "level <level>",
            "Info": "Specifies the privilege level of a local administrator. After logging in to the device, a user can run only the commands of the same or lower privilege level. By default, a local administrator does not have a privilege level.\nThe value is an integer that ranges from 0 to 3. A larger value indicates a higher user privilege level."
        },
        {
            "Parameters": "state",
            "Info": "Indicates the status of the local administrator.\n-"
        },
        {
            "Parameters": "block",
            "Info": "block indicates that a local user is in blocking state. The device rejects the authentication request from the user and does not allow the user to change the password.\n-"
        },
        {
            "Parameters": "active",
            "Info": "active indicates that a local user is in active state. The device accepts and processes the authentication request from the user, and allows the user to change the password.\n-"
        },
        {
            "Parameters": "user-group <user-group-value>",
            "Info": "Name of a user group.\nThe value is a string of 1 to 32 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "ftp-directory <directory>",
            "Info": "Sets the directory that FTP users can access. Ensure that the configured FTP directory is an absolute path; otherwise, the configuration does not take effect.\nThe value is a string of 1 to 255 case-sensitive characters without a blank space."
        },
        {
            "Parameters": "read",
            "Info": "Grants the read permission.\n-"
        },
        {
            "Parameters": "execute",
            "Info": "Grants the execute permission.\n-"
        },
        {
            "Parameters": "write",
            "Info": "Grants the write permission.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] local-user user1@vipdomain password irreversible-cipher YsHsjx_202206 access-limit 100 idle-timeout 10"
        ]
    ],
    "ExtraInfo": "To facilitate device maintenance , create a local administrator on the device and configure the password, privilege level, and FTP directory.\nBy default, the permission on the FTP directory is read, write, and execute.\nAfter the weak password dictionary maintenance function is enabled, the passwords defined in the weak password dictionary cannot be used. You can run the display security weak-password-dictionary command to view the passwords.\nBy default, a password must contain at least four types of the following characters, including uppercase letters, lowercase letters, digits, and special characters. You can run the password complexity command in the administrator password policy view to change the password complexity."
}