{
    "PageTitle": "radius-server retransmit timeout dead-time",
    "FuncDef": "The radius-server retransmit timeout dead-time command sets the number of times RADIUS authentication request packets are retransmitted, the timeout period, and the interval for the server to revert to the active state. The undo radius-server retransmit timeout dead-time command restores the default number of times that RADIUS authentication request packets are retransmitted, the default timeout period, and the default interval for the server to revert to the active state. By default, the number of times RADIUS authentication request packets are retransmitted is 3, the timeout period is 5 seconds, and the interval for the server to revert to the active state is 5 minutes.",
    "CLIs": [
        "radius-server { retransmit <retry-times> | timeout <time-value> | dead-time <dead-time> }",
        "undo radius-server { retransmit [ <retry-times> ] | timeout [ <time-value> ] | dead-time [ <dead-time> ] }"
    ],
    "ParentView": [
        "RADIUS server template view"
    ],
    "ParaDef": [
        {
            "Parameters": "retransmit <retry-times>",
            "Info": "Specifies the number of retransmissions due to timeout.\nThe value is an integer that ranges from 1 to 5. The default value is 3."
        },
        {
            "Parameters": "timeout <time-value>",
            "Info": "Specifies the timeout period.\nThe value is an integer that ranges from 1 to 100, in seconds. The default value is 5."
        },
        {
            "Parameters": "dead-time <dead-time>",
            "Info": "Specifies the interval for the server to revert to the active state.\nThe value is an integer ranging from 1 to 65535, in minutes. The default value is 5."
        }
    ],
    "Examples": [
        [
            "<~HUAWEI> system-view",
            "[~HUAWEI] radius-server template test1",
            "[*HUAWEI-radius-test1] radius-server retransmit 3 timeout 2 dead-time 10"
        ]
    ],
    "ExtraInfo": "The retransmission upon timeout mechanism is configured for a device to forward RADIUS authentication request packets sourced from users to the server. The overall retransmission time depends on the retransmission interval, number of retransmissions, RADIUS server status, and number of servers configured in the RADIUS server template."
}