{
    "PageTitle": "radius-server dead-interval dead-count detect-cycle",
    "FuncDef": "The radius-server dead-interval dead-count detect-cycle command configures the RADIUS server detection interval, number of times the detection interval cycles, and maximum number of consecutive unacknowledged packets in each detection interval. The undo radius-server dead-interval dead-count detect-cycle command restores the default settings. By default, the RADIUS server detection interval is 5 seconds, the number of times the detection interval cycles is 2, and the maximum number of consecutive unacknowledged packets in each detection interval is 2.",
    "CLIs": [
        "radius-server { dead-interval <dead-interval> | dead-count <dead-count> | detect-cycle <detect-cycle> }",
        "undo radius-server { dead-interval | dead-count | detect-cycle }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<dead-interval>",
            "Info": "Specifies the RADIUS server detection interval.\nThe value is an integer that ranges from 1 to 300, in seconds."
        },
        {
            "Parameters": "<dead-count>",
            "Info": "Specifies the maximum number of consecutive unacknowledged packets in each detection interval.\nThe value is an integer that ranges from 1 to 65535."
        },
        {
            "Parameters": "<detect-cycle>",
            "Info": "Specifies the number of times the detection interval cycles.\nThe value is an integer that ranges from 1 to 5."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server dead-interval 10",
            "[*HUAWEI] radius-server dead-count 2",
            "[*HUAWEI] radius-server detect-cycle 2"
        ]
    ],
    "ExtraInfo": "After the system starts, the RADIUS server status detection timer runs. The device sets the RADIUS server status to Up. When the device sends a RADIUS request packet to the RADIUS server, if the conditions for setting the RADIUS server status to Down are met, the device sets the RADIUS server status to Down; if the conditions are not met, the RADIUS server status remains to be Up."
}