{
    "PageTitle": "radius-server format-attribute",
    "FuncDef": "The radius-server format-attribute command configures the format of the NAS-Port attribute. The undo radius-server format-attribute command deletes the configured attribute format. By default, the format of the NAS-Port attribute is new.",
    "CLIs": [
        "radius-server format-attribute nas-port <nas-port-string>",
        "undo radius-server format-attribute nas-port"
    ],
    "ParentView": [
        "RADIUS server template view"
    ],
    "ParaDef": [
        {
            "Parameters": "nas-port <nas-port-string>",
            "Info": "Specifies the format of the NAS-Port attribute. In the nas-port-string parameter in binary format: The keywords s, t, p, o, and i indicate slot, subslot, port, out-vlan (qinqvlan)/vpi, and vlan (user-vlan)/vci respectively. The keywords n and z are used as paddings. The keyword n indicates 1 and the keyword z indicates 0. The keywords s, t, p, o, and i must be followed by numbers, and the numbers must range from 1 to 32. The keywords s, t, p, o, and i can appear in the format string only once. The keywords s, t, p, o, i, n, and z must range from 1 to 9. n and z can appear multiple times at any position. They are followed by numbers. For example, n12 indicates that this position is filled in with twelve 1s, and z12 indicates that this position is filled in with twelve 0s. The character string must contain 32 bits. The format string must start with s, t, p, o, i, n, or z and end with a number. If no VLAN exists, you can add n or z before o or i to indicate whether this position is filled in with 0s or 1s. That is, n and z can be followed by numbers, o, or i in this case, and the numbers must range from 1 to 32. To specify the format string, determine the interface type, and then determine the encapsulation type of the interface. If the format string does not contain o or i, the NAS-Port attribute does not contain the QinQ VLAN or user VLAN field. If the format string contains o or i but no outer VLAN exists, the outer VLAN field is filled in with 0s. If n is added before o or i, this field is filled in with 1s when no outer VLAN or inner VLAN exists.\nThe value is a string of 1 to 32 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server template template1",
            "[*HUAWEI-radius-template1] radius-server format-attribute nas-port s2t2p6no10ni12"
        ]
    ],
    "ExtraInfo": ""
}