{
    "PageTitle": "download",
    "FuncDef": "The download command downloads the version package or configuration file of a specified URL to the corresponding path of the device. The download command downloads the version package or configuration file of a specified URL to the corresponding path of the device.",
    "CLIs": [
        "download <file-url> [ save-as <file-path> | [ ssl-policy <policy-name> [ ssl-verifypeer [ verify-dns ] ] | verify-dns ] | vpn-instance <vpn-name> | source-ip <ip-address> ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "<file-url>",
            "Info": "Specifies a URL of downloading files.\nThe value is a string of 1 to 255 characters."
        },
        {
            "Parameters": "save-as <file-path>",
            "Info": "Specifies a path to store files.\nThe value is a string of 1 to 255 characters."
        },
        {
            "Parameters": "ssl-policy <policy-name>",
            "Info": "Specifies an SSL policy name.\nThe value is a string of 1 to 23 characters. If an initial certificate is loaded to the PKI realm to which the specified SSL policy is bound, the certificate is delivered in interactive mode."
        },
        {
            "Parameters": "ssl-verifypeer",
            "Info": "Specifies to perform SSL verification on the server.\n-"
        },
        {
            "Parameters": "verify-dns",
            "Info": "Enables CN/SAN verification.\n-"
        },
        {
            "Parameters": "vpn-instance <vpn-name>",
            "Info": "Specifies a VPN name.\nThe value is a string of 1 to 31 characters."
        },
        {
            "Parameters": "source-ip <ip-address>",
            "Info": "Specifies the source IP address of a device. The options are as follows:\nIPv4.\nIPv6.\nIPv4 addresses are in dotted decimal notation.\nIPv6 addresses are in colon hexadecimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> download https://10.1.1.1:443/test.cc ssl-policy test save-as flash:/test.cc vpn-instance test"
        ],
        [
            "<HUAWEI> download https://10.1.1.1:443/test.cc ssl-policy a",
            "Warning: A preset certificate is loaded to the PKI domain bound to the specified SSL policy. The current operation has security risks. Continue? [Y/N]:Y"
        ],
        [
            "<HUAWEI> download https://[2001:db8:1::1]:443/test.cc ssl-policy test save-as cfcard:/test.cc source-ip 2001:db8:1::2 vpn-instance test"
        ]
    ],
    "ExtraInfo": "When you run the download command to download the version package or configuration file of a specified URL to the corresponding path of the device, the file can be saved to the corresponding path with the file name extension .cc or .cfg.If no path is specified, the SSL policy is downloaded to the current path. If no SSL policy name is specified, the SSL policy name in the HTTP view is used.If verify-dns is specified, the CN/SAN field verification is enabled for the server certificate."
}