{
    "PageTitle": "http server ip-block failed-times period",
    "FuncDef": "The http server ip-block failed-times period command sets the maximum number of consecutive authentication failures and the period before the client IP address is locked by HTTP.\nThe undo http server ip-block failed-times period command restores the default number of consecutive authentication failures and period before the client IP address is locked by HTTP. The http server ip-block failed-times period command sets the maximum number of consecutive authentication failures and the period before the client IP address is locked by HTTP. The undo http server ip-block failed-times period command restores the default number of consecutive authentication failures and period before the client IP address is locked by HTTP. By default, the maximum number of consecutive authentication failures before the client IP address is locked is 6, and the period of consecutive authentication failures is 5 minutes.",
    "CLIs": [
        "http server ip-block failed-times <failed-times-value> period <period-value>",
        "undo http server ip-block failed-times <failed-times-value> period <period-value>"
    ],
    "ParentView": [
        "Service-RESTCONF view"
    ],
    "ParaDef": [
        {
            "Parameters": "<failed-times-value>",
            "Info": "Specifies the number of consecutive authentication failures within a period before the client IP address is locked by HTTP.\nThe value is an integer ranging from 1 to 10."
        },
        {
            "Parameters": "<period-value>",
            "Info": "Specifies the interval at which authentication fails before the client IP address is locked by HTTP.\nThe value is an integer ranging from 1 to 120, in minutes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] http",
            "[*HUAWEI-http] service restconf",
            "[*HUAWEI-http-service-restconf] http server ip-block failed-times 3 period 6"
        ]
    ],
    "ExtraInfo": ""
}