{
    "PageTitle": "server-source",
    "FuncDef": "The server-source command specifies a source interface for the HTTP server to receive and respond to requests from a client.\nThe server-source all-interface command allows all interfaces on the device to be used by the HTTP server to receive and respond to requests from a client.\nThe undo server-source command restores the default configuration. The server-source command specifies a source interface for the HTTP server to receive and respond to requests from a client. The server-source all-interface command allows all interfaces on the device to be used by the HTTP server to receive and respond to requests from a client. The undo server-source command restores the default configuration. By default, no HTTP server source interface is specified.",
    "CLIs": [
        "server-source { <interface-name> | <interface-type> <interface-number> }",
        "server-source all-interface",
        "undo server-source"
    ],
    "ParentView": [
        "Service-RESTCONF view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of a source interface.\n-"
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of a source interface.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of a source interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface loopback1",
            "[*HUAWEI-LoopBack1] ip address 10.1.1.1 255.255.255.255",
            "[*HUAWEI-LoopBack1] quit",
            "[*HUAWEI] http",
            "[*HUAWEI-http] service restconf",
            "[*HUAWEI-http-service-restconf] server-source LoopBack1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] http",
            "[*HUAWEI-http] service restconf",
            "[*HUAWEI-http-service-restconf] server-source all-interface"
        ]
    ],
    "ExtraInfo": "To improve system security, you can run this command to specify a source interface for an HTTP server. This configuration allows only authorized users to log in to the HTTP server.\nYou can run the server-source command with the <interface-name>|<interface-type> <interface-number> parameter specified to specify the source interface for the HTTP server to receive and respond to request packets from the client.\nTo enable an HTTP server to use all interfaces to receive and respond to requests from clients, you can run the server-source all-interface command."
}