{
    "PageTitle": "ssl-policy",
    "FuncDef": "The ssl-policy command configures an SSL policy for an HTTP server.\nThe undo ssl-policy command deletes the SSL policy on an HTTP server. The ssl-policy command configures an SSL policy for an HTTP server. The undo ssl-policy command deletes the SSL policy on an HTTP server. By default, no SSL policy is configured on an HTTP server.",
    "CLIs": [
        "ssl-policy <ssl-policy-name>",
        "undo ssl-policy"
    ],
    "ParentView": [
        "Service-RESTCONF view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ssl-policy-name>",
            "Info": "Specifies the name of an SSL policy.\nThe value is a string of 1 to 23 case-insensitive characters, without spaces. If an initial certificate is loaded to the PKI realm to which the specified SSL policy is bound, the certificate is delivered in interactive mode."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] http",
            "[~HUAWEI-http] service restconf",
            "[*HUAWEI-http-service-restconf] secure-server enable",
            "[*HUAWEI-http-service-restconf] ssl-policy policy1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] http",
            "[~HUAWEI-http] service restconf",
            "[*HUAWEI-http-service-restconf] secure-server enable",
            "[*HUAWEI-http-service-restconf] ssl-policy policy1",
            "Warning: A preset certificate is loaded to the PKI domain bound to the specified SSL policy. The current operation has security risks. Continue? [Y/N]:Y"
        ]
    ],
    "ExtraInfo": "Conventional HTTP does not have any security mechanism. It transmits data in plaintext and does not verify the identities of communications parties. Therefore, data transmitted over HTTP may be tampered with. In applications that require high security, such as e-commerce and online banking, HTTP is inapplicable. To enhance security, run the ssl-policy command to specify an SSL policy for an HTTP server."
}