{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "verify",
    "FuncDef": [
        "To verify the checksum of a file on a flash memory file system or compute a Message Digest 5 (MD5) signature for a file, use the **verify** command in privileged EXEC mode. "
    ],
    "CLIs": [
        "verify [ /md5 [ <md5-value> ] ] <filesystem>: [ <file-url> ]",
        "Cisco 7600 Series Router",
        "verify { /md5<flash-filesystem> [ <expected-md5-signature> ] | /ios <flash-filesystem> | <flash-filesystem> }"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **/md5** ",
            "Info": " (Optional) Calculates and displays the MD5 value for the specified software image. Compare this value with the value available on Cisco.com for this image. "
        },
        {
            "Parameters": " *md5-value* ",
            "Info": " (Optional) The known MD5 value for the specified image. When an MD5 value is specified in the command, the system calculates the MD5 value for the specified image and display a message verifying that the MD5 values match or that there is a mismatch. "
        },
        {
            "Parameters": " *filesystem*: ",
            "Info": " File system or directory containing the files to list, followed by a colon. Standard file system keywords for this command are **flash:** and **bootflash:**. "
        },
        {
            "Parameters": " *file-url* ",
            "Info": " (Optional) The name of the files to display on a specified device. The files can be of any type. You can use wildcards in the filename. A wildcard character (*) matches all patterns. Strings after a wildcard are ignored. "
        },
        {
            "Parameters": " **/md5** *flash-filesystem* ",
            "Info": " Computes an MD5 signature for a file; valid values are **bootflash:**, **disk0:**, **disk1:**, **flash:**, or **sup-bootflash:**. "
        },
        {
            "Parameters": " *expected-md5-signature* ",
            "Info": " (Optional) MD5 signature. "
        },
        {
            "Parameters": " *flash-filesystem* ",
            "Info": " Device where the Flash memory resides; valid values are **bootflash:**, **disk0:**, **disk1:**, **flash:**, or **sup-bootflash:**. "
        }
    ],
    "Examples": [
        [
            "Supported Platforms Other than Cisco 7600 Series Router",
            "The following example shows how to use the verify command to check the integrity of the file c7200-js-mz on the flash memory card inserted in slot 0:",
            "```",
            "```",
            "```",
            "Router# dir slot0:",
            "```",
            "```",
            "```",
            "```",
            "Directory of slot0:/",
            "```",
            "```",
            "```",
            "```",
            "1 -rw- 4720148 Aug 29 1997 17:49:36 hampton/nitro/c7200-j-mz",
            "```",
            "```",
            "2 -rw- 4767328 Oct 01 1997 18:42:53 c7200-js-mz",
            "```",
            "```",
            "5 -rw- 639 Oct 02 1997 12:09:32 rally",
            "```",
            "```",
            "7 -rw- 639 Oct 02 1997 12:37:13 the_time",
            "```",
            "```",
            "```",
            "```",
            "20578304 bytes total (3104544 bytes free)",
            "```",
            "```",
            "```",
            "```",
            "Router# verify slot0:c7200-js-mz",
            "```",
            "```",
            "```",
            "```",
            "Verified slot0:c7200-js-mz",
            "```",
            "```",
            "```",
            "In the following example, the /md5 keyword is used to display the MD5 value for the image:",
            "```",
            "Router# verify /md5 disk1:",
            "```",
            "```",
            "```",
            "```",
            "Verify filename [ ] ? c7200-js-mz",
            "```",
            "```",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            "Done",
            "```",
            "```",
            "!",
            "```",
            "```",
            "verify /md5 (disk1:c7200-js-mz) = 0f369ed9e98756f179d4f29d6e7755d3",
            "```",
            "```",
            "```",
            "In the following example, the known MD5 value for the image (obtained from Cisco.com) is specified in the verify command, and the system checks the value against the stored value:",
            "```",
            "Router# verify /md5 disk1:c7200-js-mz ?",
            "```",
            "```",
            "```",
            "```",
            "WORD Expected md5 signature",
            "```",
            "```",
            "<cr>",
            "```",
            "```",
            "```",
            "```",
            "router# verify /md5 disk1:c7200-js-mz 0f369ed9e98756f179d4f29d6e7755d3",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            "Done",
            "```",
            "```",
            "!",
            "```",
            "```",
            "Verified (disk1:c7200-js-mz) = 0f369ed9e98756f179d4f29d6e7755d3",
            "```",
            "```",
            "```",
            "The following example shows how the output of the verify command was enhanced to show the hash value in addition to the entire hash image (CCO hash):",
            "```",
            "Router# verify disk0:c7200-js-mz",
            "```",
            "```",
            "```",
            "```",
            "%Filesystem does not support verify operations",
            "```",
            "```",
            "Verifying file integrity of disk0:c7200-js-mz",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            "Done",
            "```",
            "```",
            "!",
            "```",
            "```",
            "Embedded Hash MD5 :CFA258948C4ECE52085DCF428A426DCD",
            "```",
            "```",
            "Computed Hash MD5 :CFA258948C4ECE52085DCF428A426DCD",
            "```",
            "```",
            "CCO Hash MD5 :44A7B9BDDD9638128C35528466318183",
            "```",
            "```",
            "```",
            "```",
            "Signature Verified",
            "```",
            "```",
            "```",
            "Cisco 7600 Series Router"
        ],
        [
            "```",
            "Router# verify cat6k_r47_1.cbi",
            "```",
            "```",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            "File cat6k_r47_1.cbi verified OK.",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "Router# verify /md5 c6msfc2-jsv-mz",
            "```",
            "```",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            "Done",
            "```",
            "```",
            "!",
            "```",
            "```",
            "verify /md5 (disk0:c6msfc2-jsv-mz) = 0f369ed9e98756f179d4f29d6e7755d3",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "Router# verify /md5 disk0:c6msfc2-jsv-mz 0f369ed9e98756f179d4f29d6e7755d3",
            "```",
            "```",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            "Done",
            "```",
            "```",
            "!",
            "```",
            "```",
            "verified /md5 (disk0:c6sup12-jsv-mz) = 0f369ed9e98756f179d4f29d6e7755d3",
            "```",
            "```",
            "Router#",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "Router# verify /ios disk0:c6k222-jsv-mz",
            "```",
            "```",
            "```",
            "```",
            "Verified compressed IOS image checksum for disk0:c6k222-jsv-mz",
            "```"
        ]
    ],
    "ExtraInfo": "This command replaces the **copy verify** and **copy verify flash** commands.Use the **verify** command to verify the checksum of a file before using it.Each software image that is distributed on disk uses a single checksum for the entire image. This checksum is displayed only when the image is copied into flash memory; it is not displayed when the image file is copied from one disk to another.Supported Platforms Other than the Cisco 7600 Series RouterBefore loading or duplicating a new image, record the checksum and MD5 information for the image so that you can verify the checksum when you copy the image into flash memory or onto a server. A variety of image information is available on Cisco.com. For example, you can get the Release, Feature Set, Size, BSD Checksum, Router Checksum, MD5, and Publication Date information by clicking on the image file name prior to downloading it from the Software Center on Cisco.com.To display the contents of flash memory, use the **show flash** command. The flash contents listing does not include the checksum of individual files. To recompute and verify the image checksum after the image has been copied into flash memory, use the **verify**command. Note, however, that the **verify** command only performs a check on the integrity of the file after it has been saved in the file system. It is possible for a corrupt image to be transferred to the router and saved in the file system without detection. If a corrupt image is transferred successfully to the router, the software will be unable to tell that the image is corrupted and the file will verify successfully.To use the message-digest5 (MD5) hash algorithm to ensure file validation, use the **verify** command with the **/md5** option. MD5 is an algorithm (defined in RFC 1321) that is used to verify data integrity through the creation of a unique 128-bit message digest. The **/md5** option of the **verify** command allows you to check the integrity of a Cisco IOS software image by comparing its MD5 checksum value against a known MD5 checksum value for the image. MD5 values are now made available on Cisco.com for all Cisco IOS software images for comparison against local system image values.To perform the MD5 integrity check, issue the **verify** command using the **/md5** keyword. For example, issuing the **verify flash:c7200-is-mz.122-2.T.bin /md5** command will calculate and display the MD5 value for the software image. Compare this value with the value available on Cisco.com for this image.Alternatively, you can get the MD5 value from Cisco.com first, then specify this value in the command syntax. For example, issuing the **verify flash:c7200-is-mz.122-2.T.bin /md5 8b5f3062c4caeccae72571440e962233** command will display a message verifying that the MD5 values match or that there is a mismatch. A mismatch in MD5 values means that either the image is corrupt or the wrong MD5 value was entered.Cisco 7600 Series RouterThe Readme file, which is included with the image on the disk, lists the name, file size, and checksum of the image. Review the contents of the Readme file before loading or duplicating the new image so that you can verify the checksum when you copy it into the flash memory or onto a server.Use the **verify** **/md5** command to verify the MD5 signature of a file before using it. This command validates the integrity of a copied file by comparing a precomputed MD5 signature with the signature that is computed by this command. If the two MD5 signatures match, the copied file is identical to the original file.You can find the MD5 signature that is posted on the Cisco.com page with the image.You can use the **verify****/md5** command in one of the following ways:•![](/c/dam/en/us/td/i/templates/blank.gif)Verify the MD5 signatures manually by entering the **verify** **/md5** *filename*command.Check the displayed signature against the MD5 signature that is posted on the Cisco.com page.•![](/c/dam/en/us/td/i/templates/blank.gif)Allow the system to compare the MD5 signatures by entering the **verify** **/md5** *flash-filesystem**:**filenam expected-md5-signature* command.After completing the comparison, the system returns with a verified message. If an error is detected, the output is similar to the following:```Router# verify /md5 disk0:c6msfc2-jsv-mz 0f``````  ``````.``````.``````.``````Done``````!`````` %Error verifying disk0:c6msfc2-jsv-mz`````` Computed signature  = 0f369ed9e98756f179d4f29d6e7755d3`````` Submitted signature = 0f``````  ```To display the contents of the flash memory, enter the **show flash** command. The listing of the flash contents does not include the checksum of the individual files. To recompute and verify the image checksum after the image has been copied into the flash memory, enter the **verify**command.A colon (:) is required after the specified device.",
    "RelatedCmds": [
        {
            "cmd": " **cd** ",
            "description": " Changes the default directory or file system. "
        },
        {
            "cmd": " **copy** ",
            "description": " Copies any file from a source to a destination. "
        },
        {
            "cmd": " **copy /noverify** ",
            "description": " Disables the automatic image verification for the current copy operation. "
        },
        {
            "cmd": " **dir** ",
            "description": " Displays a list of files on a file system. "
        },
        {
            "cmd": " **file verify auto** ",
            "description": " Verifies the compressed Cisco IOS image checksum. "
        },
        {
            "cmd": " **pwd** ",
            "description": " Displays the current setting of the cd command. "
        },
        {
            "cmd": " **show file systems** ",
            "description": " Lists available file systems. "
        },
        {
            "cmd": " **show flash** ",
            "description": " Displays the layout and contents of flash memory. "
        }
    ]
}