{
    "PageTitle": "mirroring observe-port (VLAN view)",
    "FuncDef": "The mirroring observe-port command configures VLAN mirroring.\nThe undo mirroring command deletes VLAN mirroring configuration. The mirroring observe-port command configures VLAN mirroring. The undo mirroring command deletes VLAN mirroring configuration. By default, VLAN mirroring is not configured.",
    "CLIs": [
        "mirroring observe-port { <observe-port-index> | group <group-id> } { inbound | outbound | both }",
        "undo mirroring [ observe-port { <observe-port-index> | group <group-id> } ] { inbound | outbound | both }"
    ],
    "ParentView": [
        "VLAN view"
    ],
    "ParaDef": [
        {
            "Parameters": "group <group-id>",
            "Info": "Specifies the index of an observing port group.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer ranging from 1 to 128.\nFor the CE6885-LL (low latency mode):The value is an integer that ranges from 1 to 8."
        },
        {
            "Parameters": "inbound",
            "Info": "Indicates that mirroring is configured for the incoming traffic in the VLAN.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Indicates that mirroring is configured for the outgoing traffic in the VLAN.\n-"
        },
        {
            "Parameters": "both",
            "Info": "Indicates that mirroring is configured for the incoming and outgoing traffic in the VLAN.\n-"
        },
        {
            "Parameters": "observe-port <observe-port-index>",
            "Info": "Specifies the index of an observing port.\nThe value is an integer that ranges from 1 to 8."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] observe-port 1 interface 100GE 1/0/1",
            "[*HUAWEI] vlan 10",
            "[*HUAWEI-vlan10] mirroring observe-port 1 inbound"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] observe-port group 1",
            "[*HUAWEI-observe-port-group-1] vlan 10",
            "[*HUAWEI-vlan10] mirroring observe-port group 1 inbound"
        ]
    ],
    "ExtraInfo": "Users can use the mirroring observe-port command to mirror the traffic on all active ports in a specified VLAN to an observing port. Users can also run the mirroring observe-port group command to mirror the traffic to an observing port group so that the packets are copied to all the member ports of the observing port group."
}