{
    "PageTitle": "observe-port (local observing port)",
    "FuncDef": "The observe-port command configures a local observing port.\nThe undo observe-port command deletes a local observing port. The observe-port command configures a local observing port. The undo observe-port command deletes a local observing port. By default, no local observing port is configured.",
    "CLIs": [
        "undo observe-port <observe-port-index>",
        "observe-port [ <observe-port-index> ] interface { <interface-type> <interface-number> | <interface-name> } [ cir <cir-value> [ gbps | kbps | mbps ] ]",
        "observe-port [ <observe-port-index> ] interface { <interface-type> <interface-number> | <interface-name> } [ cir <cir-value> [ gbps | kbps | mbps ] ] [ truncatepacket <packet-length> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<observe-port-index>",
            "Info": "Specifies the index of the observing port.\nThe value is an integer that ranges from 1 to 8."
        },
        {
            "Parameters": "interface <interface-type> <interface-number>",
            "Info": "Specifies the type and number of the interface.\ninterface-type indicates the type of the interface.interface-number indicates the number of the interface.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The interface type can be Ethernet or Eth-Trunk interface.\nFor the CE6885-LL (low latency mode):The interface type can be Ethernet interface."
        },
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies an interface name.\nThe interface type can be Ethernet or Eth-Trunk interface."
        },
        {
            "Parameters": "cir <cir-value>",
            "Info": "Specifies the committed information rate (CIR), which is the average rate of traffic that can pass through an interface.\nThe value is an integer in the range from 24 to 400000000."
        },
        {
            "Parameters": "gbps",
            "Info": "Indicates that the rate unit is Gbit/s.\n-"
        },
        {
            "Parameters": "kbps",
            "Info": "Specifies the rate unit as kbit/s.\n-"
        },
        {
            "Parameters": "mbps",
            "Info": "Specifies the rate unit as Mbit/s.\n-"
        },
        {
            "Parameters": "packet <packet-length>",
            "Info": "Configures packet truncation on the observing port.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer that ranges from 64 to 256 and must be a multiple of 32. The unit is byte."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] observe-port 1 interface 100GE 1/0/1 cir 20000 kbps"
        ]
    ],
    "ExtraInfo": "When configuring local mirroring, you must specify the ports that are directly connected to monitoring devices as local observing ports.\nIf traffic of mirrored ports is copied to observing ports and exceeds the bandwidth of observing ports, congestion will occur or a large number of packets will be dropped, affecting the device forwarding performance. You can limit the rate at which interfaces send data to so that interfaces can send packets evenly."
}