{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "editing",
    "FuncDef": [
        "To reenable Cisco IOS enhanced editing features for a particular line after they have been disabled, use the **editing** command in line configuration mode. To disable these features, use the **no** form of this command. "
    ],
    "CLIs": [
        "editing",
        "noediting"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "In the following example, enhanced editing mode is disabled on line 3:",
            "```",
            "Router(config)# line 3",
            "```",
            "```",
            "Router(config-line)# no editing",
            "```"
        ]
    ],
    "ExtraInfo": "Enhanced editing features are enabled by default. However, there may be situations in which you need to disable these features. The **no** form of this command disables these enhanced editing features, and the plain form of the command can be used to reenable these features.[Table 30](#wp1015025) provides a description of the keys used to enter and edit commands when the editing features are enabled. Ctrl indicates the Control key, which must be pressed simultaneously with its associated letter key. Esc indicates the Escape key, which must be pressed first, followed by its associated letter key. A comma is used in the following table to indicate a key sequence (the comma key should not be pressed). Keys are not case sensitive. Many letters used for CLI navigation and editing were chosen to provide an easy way of remembering their functions. In the following table ([Table 30](#wp1015025)), characters are bolded in the \"Function Summary\" column to indicate the relation between the letter used and the function.Table 30 Command Editing Keys and Functions| Keys | Function Summary | Function Details || --- | --- | --- || Tab | Complete command | Completes a partial command name entry. When you enter a unique set of characters and press the Tab key, the system completes the command name. If you enter a set of characters that could indicate more than one command, the system beeps to indicate an error. To view the commands which match the set of characters you have entered, enter a question mark (?) immediately following the partial command (no space). The CLI will then list the commands that begin with that string. || Return (at the command line) | Execute | Executes the command. || Return (at the --More-- prompt) | Continue | Displays the next line of output. || Space Bar(at the --More-- prompt) | Continue | Displays the next screen of output. The amount of output you see will depend on the screen depth setting of your terminal. || Delete or Backspace | Backspace | Erases the character to the left of the cursor. || Left Arrow[1](#wp1015070)  or Ctrl-B | **B**ack character | Moves the cursor one character to the left.When you enter a command that extends beyond a single line, you can press the Left Arrow or Ctrl-B keys repeatedly to scroll back toward the system prompt and verify the beginning of the command entry. || Right Arrow1 or Ctrl-F | **F**orward character | Moves the cursor one character to the right. || Esc, B | **B**ack word | Moves the cursor back one word. || Esc, F | **F**orward word | Moves the cursor forward one word. || Ctrl-A | Beginning of line | Moves the cursor to the beginning of the line. || Ctrl-E | **E**nd of line | Moves the cursor to the end of the command line. || Ctrl-D | **D**elete character | Deletes the character at the cursor. || Esc, D | **D**elete next word | Deletes from the cursor to the end of the word. || Ctrl-W | Delete previous **w**ord | Deletes the word to the left of the cursor. || Ctrl-K | Delete line forward | Deletes all characters from the cursor to the end of the command line. || Ctrl-U or Ctrl-X | Delete line backward | Deletes all characters from the cursor back to the beginning of the command line. || Ctrl-T | **T**ranspose characters | Transposes the character to the left of the cursor with the character located at the cursor. || Ctrl-R or Ctrl-L | **R**edisplay **l**ine | Redisplays the system prompt and command line. || Ctrl-V or Esc, Q | Ignore editing | Inserts a code to indicate to the system that the keystroke immediately following should be treated as a command entry, not as an editing key. || Up Arrow1 or Ctrl-P | **P**revious command | Recalls commands in the history buffer, beginning with the most recent command. Repeat the key sequence to recall successively older commands. || Down Arrow1 or Ctrl-N (next) | **N**ext command | Returns to more recent commands in the history buffer (after recalling commands with the Up Arrow or Ctrl-P). Repeat the key sequence to recall successively more recent commands. || Ctrl-Y | Recall last deleted command | Recalls the most recent entry in the delete buffer. The delete buffer contains the last ten items you have deleted or cut. Ctrl-Y can be used in conjunction with Esc Y. || Esc, Y | Recall next deleted command | Recalls the next entry in the delete buffer. The delete buffer contains the last ten items you have deleted. Press Ctrl-Y first to recall the most recent entry. Then press Esc Y up to nine times to recall the remaining entries in the buffer. If you bypass an entry, continue to press Esc Y to cycle back to it. || Esc, C | **C**apitalize word | Capitalizes the word from the cursor to the end of the word. || Esc, U | Make word **u**ppercase | Changes all letters from the cursor to the next space on the line appear in uppercase letters. || Esc, L | Make word **l**owercase | Changes the word to lowercase from the cursor to the end of the word. || [1](#wp1015071) The arrow keys function only with ANSI-compatible terminals. || --- |  ",
    "RelatedCmds": [
        {
            "cmd": " **terminal editing** ",
            "description": " Controls CLI enhanced editing feature for the current terminal session. "
        }
    ]
}