{
    "PageTitle": "qos car inbound",
    "FuncDef": "The qos car inbound command applies a QoS CAR profile to an interface in the inbound direction to police traffic entering the interface.\nThe undo qos car inbound command unbinds a QoS CAR profile from an interface in the inbound direction. The qos car inbound command applies a QoS CAR profile to an interface in the inbound direction to police traffic entering the interface. The undo qos car inbound command unbinds a QoS CAR profile from an interface in the inbound direction. By default, no QoS CAR profile is applied to an interface. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "qos car inbound <car-name>",
        "undo qos car inbound"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,50GE interface view,Eth-Trunk interface view,Layer 2 sub-interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<car-name>",
            "Info": "Specifies the name of a QoS CAR profile.\nThe value must be the name of an existing QoS CAR profile on the device."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] qos car qoscar1 cir 10000 kbps cbs 10240 bytes",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] qos car inbound qoscar1",
            "[*HUAWEI-100GE1/0/1] quit"
        ]
    ],
    "ExtraInfo": "After a QoS CAR profile is created, you must apply the QoS CAR profile to an interface to police user service traffic (such as voice and video service traffic). This command applies a created QoS CAR profile to a specified interface in the inbound direction."
}