{
    "PageTitle": "qos lr",
    "FuncDef": "The qos lr command sets the traffic shaping rate to limit the rate of data packets sent by an interface.\nThe undo qos lr command cancels the traffic shaping rate. The qos lr command sets the traffic shaping rate to limit the rate of data packets sent by an interface. The undo qos lr command cancels the traffic shaping rate. By default, the traffic shaping rate is the maximum bandwidth of an interface.",
    "CLIs": [
        "undo qos lr [ outbound ]",
        "qos lr cir <cir-value> [ kbps | mbps | gbps ] [ cbs <cbs-value> [ bytes | kbytes | mbytes ] ] [ outbound ]",
        "qos lr cir <cir-value> [ kbps | mbps | gbps ] [ outbound ]"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "kbps",
            "Info": "Indicates that the rate unit is kbit/s.\n-"
        },
        {
            "Parameters": "mbps",
            "Info": "Indicates that the rate unit is Mbit/s.\n-"
        },
        {
            "Parameters": "gbps",
            "Info": "Indicates that the rate unit is Gbit/s.\n-"
        },
        {
            "Parameters": "cbs <cbs-value>",
            "Info": "Specifies the committed burst size (CBS).\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S:The value is an integer. The value range differs depending on the CBS unit. The default unit is byte. Where:\nIf the CBS is expressed in bytes, the value ranges from 10000 to 33554432. By default, the value of cbs-value is eight times the value of cir-value (kbit/s).If the CBS is expressed in kbytes, the value ranges from 10 to 32768. By default, the value of cbs-value is eight times the value of cir-value (mbit/s).If the CBS is expressed in mbytes, the value ranges from 1 to 32. By default, the value of cbs-value is eight times the value of cir-value (gbit/s)."
        },
        {
            "Parameters": "bytes",
            "Info": "Indicates that the CBS is expressed in bytes.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.\n-"
        },
        {
            "Parameters": "kbytes",
            "Info": "Indicates that the CBS is expressed in Kbytes.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Limits the rate of outgoing packets.\n-"
        },
        {
            "Parameters": "cir <cir-value>",
            "Info": "Specifies the committed information rate (CIR).\nThe value is an integer that ranges from 1 to 400000000."
        },
        {
            "Parameters": "mbytes",
            "Info": "Indicates that the CBS is expressed in Mbytes.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] qos lr cir 20000 kbps",
            "[*HUAWEI-100GE1/0/1] quit"
        ]
    ],
    "ExtraInfo": "When a large amount of data flows are sent from the upstream device to its downstream device, to prevent congestion or packet loss, run the qos lr command to configure traffic shaping on the outbound interface of the device to limit the traffic and burst traffic transmitted over a connection so that packets are sent at an even rate.\nSimilar to traffic policing, traffic shaping limits the traffic rate. When traffic policing is used, the system directly discards the packets whose rate is larger than the traffic shaping rate. Traffic shaping, however, buffers the packets whose rate is larger than the traffic shaping rate. When there are sufficient tokens in the token bucket, the device forwards buffered packets at an even rate. Traffic shaping increases the delay, whereas traffic policing does not."
}