{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "errdisable recovery",
    "FuncDef": [
        "To configure recovery mechanism variables, use the **errdisable recovery** command in global configuration mode. To return to the default state, use the **no** form of this command. "
    ],
    "CLIs": [
        "errdisable recovery { cause { all | arp-inspection | bpduguard | channel-misconfig | dhcp-rate-limit | dtp-flap | gbic-invalid | l2ptguard | link-flap | pagp-flap | psecure-violation | security-violation | rootguard | udld | unicast-flood } | interval <seconds> }",
        "no errdisable recovery { cause { all | arp-inspection | bpduguard | channel-misconfig | dhcp-rate-limit | dtp-flap | gbic-invalid | l2ptguard | link-flap | pagp-flap | psecure-violation | security-violation | rootguard | udld | unicast-flood } | interval <seconds> }"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **cause** ",
            "Info": " Enables error-disable recovery from a specific cause. "
        },
        {
            "Parameters": " **all** ",
            "Info": " Enables the recovery timers for all error-disable causes. "
        },
        {
            "Parameters": " **arp-inspection** ",
            "Info": " Enables error-disable recovery from an Address Resolution Protocol (ARP) inspection cause. "
        },
        {
            "Parameters": " **bpduguard** ",
            "Info": " Enables the recovery timer for the Bridge Protocol Data Unit (BPDU)-guard error-disable cause. "
        },
        {
            "Parameters": " **channel-misconfig** ",
            "Info": " Enables the recovery timer for the channel-misconfig error-disable cause. "
        },
        {
            "Parameters": " **dhcp-rate-limit** ",
            "Info": " Enables the recovery timer for the Dynamic Host Configuration Protocol (DHCP)-rate-limit error-disable cause. "
        },
        {
            "Parameters": " **dtp-flap** ",
            "Info": " Enables the recovery timer for the Dynamic Trunking Protocol (DTP)-flap error-disable cause. "
        },
        {
            "Parameters": " **gbic-invalid** ",
            "Info": " Enables the recovery timer for the Gigabit Interface Converter (GBIC)-invalid error-disable cause. "
        },
        {
            "Parameters": " **l2ptguard** ",
            "Info": " Enables the recovery timer for the Layer 2 Protocol Tunneling (L2PT) error-disable cause. "
        },
        {
            "Parameters": " **link-flap** ",
            "Info": " Enables the recovery timer for the link-flap error-disable cause. "
        },
        {
            "Parameters": " **pagp-flap** ",
            "Info": " Enables the recovery timer for the Port Aggregation Protocol (PAgP)-flap error-disable cause. "
        },
        {
            "Parameters": " **psecure-violation** ",
            "Info": " Enables the recovery timer for the psecure-violation error-disable cause. "
        },
        {
            "Parameters": " **security-violation** ",
            "Info": " Enables the automatic recovery of ports that were disabled because of 802.1X security violations. "
        },
        {
            "Parameters": " **rootguard** ",
            "Info": " Enables the recovery timer for the root-guard error-disable cause. "
        },
        {
            "Parameters": " **udld** ",
            "Info": " Enables the recovery timer for the Unidirectional Link Detection (UDLD) error-disable cause. "
        },
        {
            "Parameters": " **unicast-flood** ",
            "Info": " Enables the recovery timer for the unicast-flood error-disable cause. "
        },
        {
            "Parameters": " **interval***seconds* ",
            "Info": " Specifies the time, in seconds, to recover from a specified error-disable cause. The range is from 30 to 86400. The default interval is 300. "
        }
    ],
    "Examples": [
        [
            "```",
            "Router(config)# errdisable recovery cause bpduguard",
            "```",
            "```",
            "```"
        ],
        [
            "```",
            "Router(config)# errdisable recovery interval 300",
            "```"
        ]
    ],
    "ExtraInfo": "A cause (bpduguard, channel-misconfig, dhcp-rate-limit, dtp-flap, l2ptguard, link-flap, pagp-flap, psecure-violation, security-violation, rootguard, udld, or unicast-flood) is defined as the reason why the error-disable state occurred. When a cause is detected on an interface, the interface is placed in an error-disable state (an operational state that is similar to the link-down state). If you do not enable error-disable recovery for the cause, the interface stays in the error-disable state until a shutdown and no shutdown occur. If you enable recovery for a cause, the interface is brought out of the error-disable state and allowed to retry operation once all the causes have timed out.You must enter the **shutdown** command and then the **no shutdown** command to manually recover an interface from the error-disable state.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)A separate line is required each time you want to enter the **errdisable recovery cause** command to add a new reason for recovery; each new reason does not get appended to the original single line. This means you must enter each new reason separately.---",
    "RelatedCmds": [
        {
            "cmd": " **show errdisable recovery** ",
            "description": " Displays the information about the error-disable recovery timer. "
        },
        {
            "cmd": " **show interfaces status** ",
            "description": " Displays the interface status or a list of interfaces in an error-disabled state on LAN ports only. "
        },
        {
            "cmd": " **shutdown** ",
            "description": " Disables an interface. "
        }
    ]
}