{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "escape-character",
    "FuncDef": [
        "To define a system escape character, use the **escape-character** command in line configuration mode. To set the escape character to Break, use the **no** or **default** form of this command. "
    ],
    "CLIs": [
        "escape-character { break | <char> | default | none | soft }",
        "no escape-character [ soft ]",
        "default escape-character [ soft ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **break** ",
            "Info": " Sets the escape character to Break. Note that the Break key should not be used as an escape character on a console terminal. "
        },
        {
            "Parameters": " *char* ",
            "Info": " Character (for example, **!**) or its ASCII decimal representation (integer in the range of 0 to 255) to be used as the escape character. "
        },
        {
            "Parameters": " **default** ",
            "Info": " Sets the escape key sequence to the default of Ctrl-^, X. "
        },
        {
            "Parameters": " **none** ",
            "Info": " Disables escape entirely. "
        },
        {
            "Parameters": " **soft** ",
            "Info": " Sets an escape character that will wait until pending input is processed before it executes. "
        }
    ],
    "Examples": [
        [
            "The following example sets the escape character for the console line to the keyboard entry Ctrl-P, which is represented by the ASCII decimal value of 16:",
            "```",
            "Router(config)# line console",
            "```",
            "```",
            "Router(config-line)# escape-character 16",
            "```",
            "```",
            "```",
            "The following example sets the escape character for line 1 to !, which is represented in the configuration file as the ASCII number 33:",
            "```",
            "Router(config)# line 1",
            "```",
            "```",
            "Router(config-line)# escape-character !",
            "```",
            "```",
            "Router(config-line)# end",
            "```",
            "```",
            "Router# show running-config",
            "```",
            "```",
            "Building configuration...",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            "line 1",
            "```",
            "```",
            "autoselect during-login",
            "```",
            "```",
            "autoselect ppp",
            "```",
            "```",
            "modem InOut",
            "```",
            "```",
            "transport preferred none",
            "```",
            "```",
            "transport output telnet",
            "```",
            "```",
            "escape-character 33",
            "```"
        ]
    ],
    "ExtraInfo": "See the [\"ASCII Character Set and Hexidecimal Values\"](http://www.cisco.com/univercd/cc/td/doc/product/software/ios123/123tcr/123tfr/cfrgtapp.htm) appendix for a list of ASCII characters.The escape character (or key sequence) suspends any actively running processes and returns you to privileged EXEC mode or, if a menu is being used, to the system menu interface. The escape character is used for interrupting or aborting a process started by previously executed command. Examples of processes from which you can escape include Domain-Name lookup, **ping**, **trace**, and Telnet sessions initiated from the device to which you are connected.To view the current setting of the escape sequence for a line, use the **show line** command followed by the specific line identifier (for example, **show line 0**, or **show line console**). The default escape sequence for a line is often displayed as ^^X . The first caret symbol represents the Control (Ctrl) key, the second caret symbol is literal (Shift-6), and the X is literal (for most systems, the X is not required).To set the escape key for the active terminal line session, use the **terminal escape-character** command.The Break key cannot be used as an escape character on a console terminal because the Cisco IOS software interprets Break as an instruction to halt the system. Depending upon the configuration register setting, break commands issued from the console line either will be ignored or cause the server to shut down.To send an escape sequence over a Telnet connection, press **Ctrl-Shift-6** twice.The **escape-character soft** form of this command defines a character or character sequence that will cause the system to wait until pending input is processed before suspending the current session. This option allows you to program a key sequence to perform multiple actions, such as using the F1 key to execute a command, then execute the escape function after the first command is executed.The following restrictions apply when using the **soft** keyword:•![](/c/dam/en/us/td/i/templates/blank.gif)The length of the logout sequence must be 14 characters or fewer.•![](/c/dam/en/us/td/i/templates/blank.gif)The soft escape character cannot be the same as the generic Cisco escape character, Break, or the characters b, d, n, or s.•![](/c/dam/en/us/td/i/templates/blank.gif)The soft escape character should be an ASCII value from 1 to 127. Do not use the number 30.",
    "RelatedCmds": [
        {
            "cmd": " **show line** ",
            "description": " Displays information about the specified line connection, or all the lines. "
        },
        {
            "cmd": " **terminal escape-character** ",
            "description": " Sets the escape character for the current terminal line for the current session. "
        }
    ]
}