{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "exec-banner",
    "FuncDef": [
        "To reenable the display of EXEC and message-of-the-day (MOTD) banners on the specified line or lines, use the **exec-banner** command in line configuration mode. To suppress the banners on the specified line or lines, use the **no** form of this command. "
    ],
    "CLIs": [
        "exec-banner",
        "no exec-banner"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "The following example suppresses the EXEC and MOTD banners on virtual terminal lines 0 to 4:",
            "```",
            "Router(config)# line vty 0 4",
            "```",
            "```",
            "Router(config-line)# no exec-banner",
            "```"
        ]
    ],
    "ExtraInfo": "This command determines whether the router will display the EXEC banner and the message-of-the-day (MOTD) banner when an EXEC session is created. These banners are defined with the **banner exec** and **banner motd** global configurationcommands. By default, these banner are enabled on all lines. Disable the EXEC and MOTD banners using the **no****exec-banner** command.This command has no effect on the incoming banner, which is controlled by the **banner incoming** command.The MOTD banners can also be disabled by the **no****motd-banner** line configuration command, which disables MOTD banners on a line. If the **no****exec-banner** command is configured on a line, the MOTD banner will be disabled regardless of whether the **motd-banner** command is enabled or disabled. [Table 31](#wp1011937) summarizes the effects of the **exec-banner** command and the **motd-banner** command.Table 31 Banners Displayed Based On exec-banner and motd-banner Combinations|  | exec-banner  (default) | no exec-banner || --- | --- | --- || motd-banner  (default) | MOTD banner  EXEC banner | None || no motd-banner | EXEC banner | None |  For reverse Telnet connections, the EXEC banner is never displayed. Instead, the incoming banner is displayed. The MOTD banner is displayed by default, but it is disabled if either the **no exec-banner** command or **no motd-banner** command is configured. [Table 32](#wp1011969) summarizes the effects of the **exec-banner** command and the **motd-banner** command for reverse Telnet connections.Table 32 Banners Displayed Based On exec-banner and motd-banner Combinations   for Reverse Telnet Sessions to Async Lines|  | exec-banner  (default) | no exec-banner || --- | --- | --- || motd-banner  (default) | MOTD banner  Incoming banner | Incoming banner || no motd-banner | Incoming banner | Incoming banner |  ",
    "RelatedCmds": [
        {
            "cmd": " **banner exec** ",
            "description": " Defines and enables a customized banner to be displayed whenever the EXEC process is initiated. "
        },
        {
            "cmd": " **banner incoming** ",
            "description": " Defines and enables a customized message to be displayed when there is an incoming connection to a terminal line from a host on the network. "
        },
        {
            "cmd": " **banner motd** ",
            "description": " Defines and enables a customized message-of-the-day banner. "
        },
        {
            "cmd": " **motd-banner** ",
            "description": " Controls (enables or disables) the display of message-of-the-day banners on a specified line or lines. "
        }
    ]
}