{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "exit (global)",
    "FuncDef": [
        "To exit any configuration mode to the next highest mode in the CLI mode hierarchy, use the **exit** command in any configuration mode. "
    ],
    "CLIs": [
        "exit"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "The following example shows how to exit from the subinterface configuration mode and to return to the interface configuration mode:",
            "```",
            "Router(config-subif)# exit",
            "```",
            "```",
            "Router(config-if)#",
            "```",
            "```",
            "```",
            "```",
            "The following example displays an exit from the interface configuration mode to return to",
            "the global configuration mode:",
            "```",
            "```",
            "```",
            "```",
            "Router(config-if)# exit",
            "```",
            "```",
            "Router(config)#",
            "```"
        ]
    ],
    "ExtraInfo": "The **exit** command is used in the Cisco IOS CLI to exit from the current command mode to the next highest command mode in the CLI mode hierarchy.For example, use the **exit** command in global configuration mode to return to privileged EXEC mode. Use the **exit** command in interface, line, or router configuration mode to return to global configuration mode. Use the **exit** command in subinterface configuration mode to return to interface configuration mode. At the highest level, EXEC mode, the **exit** command will exit the EXEC mode and disconnect from the router interface (see the description of the **exit** (EXEC) command for details).",
    "RelatedCmds": [
        {
            "cmd": " **disconnect** ",
            "description": " Disconnects a line. "
        },
        {
            "cmd": " **end** ",
            "description": " Ends your configuration session by exiting to privileged EXEC mode. "
        },
        {
            "cmd": " **exit (EXEC)** ",
            "description": " Closes the active terminal session by logging off the router. "
        }
    ]
}