{
    "PageTitle": "port",
    "FuncDef": "The port command specifies the port to be added to an ERPS ring and sets the port role.\nThe undo port command deletes a port from the ERPS ring and cancels the port role. The port command specifies the port to be added to an ERPS ring and sets the port role. The undo port command deletes a port from the ERPS ring and cancels the port role. By default, ports are not added to ERPS rings, and no port roles are specified. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "port { <interface-name> | <interface-type> <interface-number> } [ rpl { neighbour | owner } ]",
        "undo port { <interface-name> | <interface-type> <interface-number> }"
    ],
    "ParentView": [
        "ERPS ring view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of an interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the port number.\n-"
        },
        {
            "Parameters": "rpl",
            "Info": "Specifies the port type to be added to an ERPS ring.\n-"
        },
        {
            "Parameters": "neighbour",
            "Info": "Specifies the port to be added to an ERPS ring as the RPL neighbor port.\n-"
        },
        {
            "Parameters": "owner",
            "Info": "Specifies the port to be added to an ERPS ring as the RPL owner port.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] portswitch",
            "[*HUAWEI-100GE1/0/1] shutdown",
            "[*HUAWEI-100GE1/0/1] stp disable",
            "[*HUAWEI-100GE1/0/1] quit",
            "[~HUAWEI] erps ring 10",
            "[*HUAWEI-erps-ring10] version v2",
            "[*HUAWEI-erps-ring10] control-vlan 100",
            "[*HUAWEI-erps-ring10] protected-instance all",
            "[*HUAWEI-erps-ring10] port 100GE 1/0/1 rpl owner"
        ]
    ],
    "ExtraInfo": "After an ERPS ring is created, run the port command to add Layer 2 ports to the ERPS ring to allow transmission of R-APS PDUs. Each device that is added to an ERPS ring is a node, and each node cannot have more than two ports being added to the ERPS ring.\nERPS defines three port roles: RPL owner port, RPL neighbor port (only in ERPSv2), and ordinary port. The link where the RPL owner port resides is the RPL."
}