{
    "PageTitle": "rmon event",
    "FuncDef": "The rmon event command configures a way to process an event: to record a log or send trap messages.\nThe undo rmon event cancels the configuration. The rmon event command configures a way to process an event: to record a log or send trap messages. The undo rmon event cancels the configuration. By default, no event is triggered. Therefore, no log is recorded, and no trap message is sent.",
    "CLIs": [
        "rmon event <entry-number> [ description <string> ] { log | trap <object> | log-trap <object> | none } [ owner <owner-name> ]",
        "undo rmon event <entry-number>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<entry-number>",
            "Info": "Specifies the index number of an event MIB entry.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "description <string>",
            "Info": "Specifies an event description.\nThe value is a string of 1 to 127 characters.\nIf spaces are used, the string must start and end with double quotation marks (\")."
        },
        {
            "Parameters": "log",
            "Info": "Logs an event.\n-"
        },
        {
            "Parameters": "trap <object>",
            "Info": "Indicates that events are processed by sending trap messages to the NMS with the specified community name or user name.\nThe value is a string of 1 to 127 characters."
        },
        {
            "Parameters": "log-trap <object>",
            "Info": "The event is processed by recording logs and sending trap messages to the NMS with the specified community name or user name.\nThe value is a string of 1 to 127 characters."
        },
        {
            "Parameters": "none",
            "Info": "Indicates events that do not trigger actions. If such an event occurs, the system will not handle it.\n-"
        },
        {
            "Parameters": "owner <owner-name>",
            "Info": "Specifies the creator of the event entry.\nThe value is a string of 1 to 127 case-sensitive characters. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rmon event 10 trap public"
        ]
    ],
    "ExtraInfo": "The RMON threshold alarm function triggers events. The rmon event command can be used to set a way to process the events, to record a log or send trap messages to the NMS."
}