{
    "PageTitle": "ip path detection packet-format arp",
    "FuncDef": "The ip path detection packet-format arp command enables the connectivity detection function and sets the packet type for connectivity detection to ARP Request packet.\nThe undo ip path detection packet-format arp command restores the default settings. The ip path detection packet-format arp command enables the connectivity detection function and sets the packet type for connectivity detection to ARP Request packet. The undo ip path detection packet-format arp command restores the default settings. By default, the connectivity detection function is disabled. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ip path detection packet-format arp [ src-mac <srcmacaddr> ] [ dst-mac <dstmacaddr> ] src-ip <srcip> dst-ip <dstip>",
        "undo ip path detection packet-format arp [ src-mac <srcmacaddr> ] [ dst-mac <dstmacaddr> ] src-ip <srcip> dst-ip <dstip>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "src-mac <srcmacaddr>",
            "Info": "Specifies the source MAC address as the detection flag.\nThe value is in H-H-H format. H is a 4-bit hexadecimal number, such as 00e0 or fc01.\nIf an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0.\nThe MAC address cannot be set to FFFF-FFFF-FFFF."
        },
        {
            "Parameters": "dst-mac <dstmacaddr>",
            "Info": "Specifies the destination MAC address as the detection flag.\nThe value is in H-H-H format. H is a 4-bit hexadecimal number, such as 00e0 or fc01.\nIf an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0.\nThe MAC address cannot be set to FFFF-FFFF-FFFF."
        },
        {
            "Parameters": "src-ip <srcip>",
            "Info": "Sets the source IPv4 address as the detection flag.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "dst-ip <dstip>",
            "Info": "Specifies the destination IPv4 address as the detection flag.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip path detection packet-format arp src-ip 10.1.1.1 dst-ip 10.2.2.2"
        ]
    ],
    "ExtraInfo": ""
}