{
    "PageTitle": "dual-active detection error-down mode routing-switch",
    "FuncDef": "The dual-active detection error-down mode routing-switch command triggers logical interfaces to enter the Error-Down state when the peer-link fails but the DAD status is normal in an M-LAG scenario.\nThe undo dual-active detection error-down mode routing-switch command restores the default configuration. The dual-active detection error-down mode routing-switch command triggers logical interfaces to enter the Error-Down state when the peer-link fails but the DAD status is normal in an M-LAG scenario. The undo dual-active detection error-down mode routing-switch command restores the default configuration. By default, logical interfaces are not triggered to enter the Error-Down state when the peer-link fails but the DAD status is normal in an M-LAG scenario.",
    "CLIs": [
        "dual-active detection error-down mode routing-switch",
        "undo dual-active detection error-down mode routing-switch"
    ],
    "ParentView": [
        "DFS group view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dfs-group 1",
            "[*HUAWEI-dfs-group-1] dual-active detection error-down mode routing-switch"
        ]
    ],
    "ExtraInfo": "By default, logical interfaces are not triggered to enter the Error-Down state when the peer-link fails but the DAD status is normal in an M-LAG scenario. When M-LAG is used for dual-homing access on a common Ethernet or IP network (VRRP active-active gateways), if the peer-link fails but the DAD status is normal, physical interfaces except the logical interfaces, interface configured with the reserved function, management interface, and peer-link interface on one device are triggered to enter the Error-Down state.\nOn an IP network or a VXLAN network where M-LAG is deployed, when logical interfaces are configured to enter the Error-Down state when the peer-link fails but the DAD status is normal, only VLANIF interfaces, VBDIF interfaces, loopback interfaces, and M-LAG member interface on one M-LAG device are triggered to enter the Error-Down state."
}