{
    "PageTitle": "dual-active detection source ipv6",
    "FuncDef": "The dual-active detection source ipv6 command specifies the IPv6 address bound to a DFS group.\nThe undo dual-active detection source ipv6 command cancels the configuration. The dual-active detection source ipv6 command specifies the IPv6 address bound to a DFS group. The undo dual-active detection source ipv6 command cancels the configuration. By default, no IPv6 address is bound to a DFS group. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "dual-active detection source ipv6 <ipv6-address1> [ peer <ipv6-address2> [ udp-port <portnum> ] ] [ timeout <seconds> ]",
        "undo dual-active detection source ipv6 <ipv6-address1> [ [ peer <ipv6-address2> [ udp-port <portnum> ] ] [ timeout <seconds> ] ]"
    ],
    "ParentView": [
        "DFS group view"
    ],
    "ParaDef": [
        {
            "Parameters": "peer <ipv6-address2>",
            "Info": "Specifies the peer device's IPv6 address bound to a DFS group.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "udp-port <portnum>",
            "Info": "Specifies the UDP port number bound to a DFS group.\nThe value is an integer that ranges from 1025 to 2048. The default value is the smallest idle port number between 1025 and 2048."
        },
        {
            "Parameters": "timeout <seconds>",
            "Info": "Specifies the timeout duration.\nThe value is an integer ranging from 3 to 60, in seconds. The default value is 45."
        },
        {
            "Parameters": "ipv6 <ipv6-address1>",
            "Info": "Specifies the IPv6 address bound to a DFS group.\nThe value is a 32-bit hexadecimal string in format X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dfs-group 1",
            "[*HUAWEI-dfs-group-1] dual-active detection source ipv6 2001:db8:1::1 peer 2001:db8:1::2 udp-port 2048 timeout 30"
        ]
    ],
    "ExtraInfo": "When a CE is dual-homed to two PEs on an Ethernet, VXLAN, or IP network, to enable PEs to exchange heartbeat packets, DFS groups need to be bound to IP addresses of Layer 3 interfaces connecting the two PEs. If the IP network uses IPv6 addresses, a DFS group needs to be bound to an IPv6 address. If the CE connects to a VPN, you must specify the VPN instance bound to a DFS group.\nAssume that the heartbeat IP address and UDP port number of the peer device are specified when the heartbeat IP address bound to a DFS group is configured. When the configuration takes effect, the two M-LAG devices immediately start to send and receive heartbeat packets and negotiate the HB DFS master/backup status. In scenarios where enhanced DAD for secondary faults is enabled, if faults on the original DFS master device are rectified and the peer-link fault persists, the corresponding interfaces on the backup device are triggered to enter the Error-Down state based on the HB DFS master/backup status. This mechanism prevents abnormal traffic forwarding in the scenario where two master devices exist and improves device reliability."
}