{
    "PageTitle": "m-lag forward route convergence enhanced enable",
    "FuncDef": "The m-lag forward route convergence enhanced enable command enables enhanced M-LAG route convergence in IPv4 and IPv6 scenarios.\nThe undo m-lag forward route convergence enhanced enable command disables enhanced M-LAG route convergence in IPv4 and IPv6 scenarios. The m-lag forward route convergence enhanced enable command enables enhanced M-LAG route convergence in IPv4 and IPv6 scenarios. The undo m-lag forward route convergence enhanced enable command disables enhanced M-LAG route convergence in IPv4 and IPv6 scenarios. By default, enhanced M-LAG route convergence is disabled in IPv4 and IPv6 scenarios. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "m-lag forward route convergence enhanced enable",
        "undo m-lag forward route convergence enhanced enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo m-lag forward route convergence enhanced enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] m-lag for layer-3 enhanced enable",
            "[*HUAWEI] m-lag forward route convergence enhanced enable"
        ]
    ],
    "ExtraInfo": "After enhanced M-LAG route convergence is enabled in an IPv4 or IPv6 scenario, backup FRR resources are requested for all routing entries with M-LAG member interfaces as outbound interfaces. The outbound interfaces can be changed to peer-link interfaces, and active and standby paths are established and delivered. If the system detects that an M-LAG member interface fails, dual-homing networking is changed to single-homing networking. The next hop in the corresponding routing entry is changed from the M-LAG member interface to the peer-link interface. This improves the switchover performance when faults occur."
}