{
    "PageTitle": "m-lag unpaired-port reserved",
    "FuncDef": "The m-lag unpaired-port reserved command configures an interface not to enter the error-down state when the peer-link fails but the DAD status is normal.\nThe undo m-lag unpaired-port reserved command restores the default configuration of an interface when the peer-link fails but the DAD status is normal. The m-lag unpaired-port reserved command configures an interface not to enter the error-down state when the peer-link fails but the DAD status is normal. The undo m-lag unpaired-port reserved command restores the default configuration of an interface when the peer-link fails but the DAD status is normal. By default, this command is not configured on any interface.",
    "CLIs": [
        "m-lag unpaired-port reserved",
        "undo m-lag unpaired-port reserved"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Eth-Trunk interface view,Loopback interface view,VBDIF interface view,VLANIF interface view,Interface group view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 2",
            "[*HUAWEI-Eth-Trunk2] m-lag unpaired-port reserved"
        ]
    ],
    "ExtraInfo": "When M-LAG is used for dual-homing access on a common Ethernet, VXLAN, or IP network, if the peer-link fails but the DAD status is normal, interfaces excluding the management interface and peer-link interface on one M-LAG device are triggered to enter the error-down state. When the peer-link recovers, the M-LAG member interface in the error-down state automatically restores to the up state after 4 minutes by default, and the other interfaces in the error-down state automatically restore to the up state immediately.\nIn actual networking, however, uplink interfaces running a routing protocol or interfaces at both ends of the DAD link should not enter the error-down state. You can configure this function on such interfaces based on actual requirements."
}