{
    "PageTitle": "m-lag up-delay",
    "FuncDef": "The m-lag up-delay command sets the delay for the M-LAG member interface to report the Up event.\nThe undo m-lag up-delay command restores the default configuration. The m-lag up-delay command sets the delay for the M-LAG member interface to report the Up event. The undo m-lag up-delay command restores the default configuration. By default, the delay for the M-LAG member interface to report the Up event is 240 seconds, and the automatic recovery interval is 0 seconds.",
    "CLIs": [
        "m-lag up-delay <updelay> [ auto-recoveryinterval <intervaltime> ]",
        "undo m-lag up-delay <updelay> [ auto-recoveryinterval <intervaltime> ]"
    ],
    "ParentView": [
        "DFS group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<updelay>",
            "Info": "Specifies the delay for the M-LAG member interface to report the Up event.\nThe value is an integer that ranges from 0 to 3600 and the default value is 240, in seconds."
        },
        {
            "Parameters": "auto-recovery",
            "Info": "Specifies the automatic recovery delay.\n-"
        },
        {
            "Parameters": "interval <intervaltime>",
            "Info": "Specifies the automatic recovery interval between M-LAG member interfaces based on the delay in reporting the Up event.\nThe value is an integer that ranges from 0 to 180 and the default value is 0, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dfs-group 1",
            "[*HUAWEI-dfs-group-1] m-lag up-delay 90"
        ]
    ],
    "ExtraInfo": "When the physical status of an interface changes, the device notifies the upper-layer protocol modules (such as routing and forwarding modules) of the change to guide packet sending and receiving. However, after the device restarts or a card resets, the physical status of the interface changes to Up. In this case, the status of the upper-layer protocol modules does not meet forwarding requirements. If the interface receives a packet and sends it to the upper-layer protocol modules, the upper-layer protocol modules cannot correctly process the packet. As a result, the upper-layer protocol negotiation mechanism does not take effect, causing packet loss. Generally, you can run the set up-delay command to set the delay for an interface to go Up. In an M-LAG scenario, you can also run the m-lag up-delay command to configure a delay after which an M-LAG member interface goes Up.\nHowever, in a device restart or subcard reset fault recovery scenario, if the delays for all interfaces to go Up are the same, M-LAG member interfaces go Up at the same time and service entries are delivered at the same time. As a result, services are interrupted for a long time. You can use auto-recovery interval interval-time to specify the automatic recovery delay between M-LAG member interfaces. M-LAG member interfaces automatically recover one by one based on M-LAG IDs in ascending order. In this manner, interfaces go Up at different time, and entries of each service do not affect each other."
}