{
    "PageTitle": "m-lag forward layer-3 enhanced",
    "FuncDef": "For the CE6820H, CE6820H-K, CE6820S, CE6863H, CE6863H-K, CE6881H, and CE6881H-K:\nThe m-lag forward layer-3 enhanced enable command enables enhanced M-LAG Layer 3 forwarding.\nThe undo m-lag forward layer-3 enhanced enable command disables enhanced M-LAG Layer 3 forwarding.\nFor the CE6866, CE6860-SAN, CE6860-HAM, CE6866K, CE8851-32CQ8DQ-P, CE8850-SAN, CE8850-HAM, CE8851K, CE8865, CE8865-SAN, CE8875, CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode), CE6863E-48S8CQ, CE6885-SAN, and CE6885-LL (low latency mode):\nThe m-lag forward layer-3 enhanced disable command disables enhanced M-LAG Layer 3 forwarding.\nThe undo m-lag forward layer-3 enhanced disable command enables enhanced M-LAG Layer 3 forwarding. For the CE6820H, CE6820H-K, CE6820S, CE6863H, CE6863H-K, CE6881H, and CE6881H-K: The m-lag forward layer-3 enhanced enable command enables enhanced M-LAG Layer 3 forwarding. The undo m-lag forward layer-3 enhanced enable command disables enhanced M-LAG Layer 3 forwarding. For the CE6866, CE6860-SAN, CE6860-HAM, CE6866K, CE8851-32CQ8DQ-P, CE8850-SAN, CE8850-HAM, CE8851K, CE8865, CE8865-SAN, CE8875, CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode), CE6863E-48S8CQ, CE6885-SAN, and CE6885-LL (low latency mode): The m-lag forward layer-3 enhanced disable command disables enhanced M-LAG Layer 3 forwarding. The undo m-lag forward layer-3 enhanced disable command enables enhanced M-LAG Layer 3 forwarding. For the CE6820H, CE6820H-K, CE6820S, CE6863H, CE6863H-K, CE6881H, and CE6881H-K:\n\n\nBy default, enhanced M-LAG Layer 3 forwarding is disabled.\n\n\nFor the CE6866, CE6860-SAN, CE6860-HAM, CE6866K, CE8851-32CQ8DQ-P, CE8850-SAN, CE8865, CE8865-SAN, CE8875, CE8850-HAM, CE8851K, CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode), CE6863E-48S8CQ, CE6885-SAN, and CE6885-LL (low latency mode):\n\n\nBy default, enhanced M-LAG Layer 3 forwarding is enabled. For the CE6820H, CE6820H-K, CE6820S, CE6863H, CE6863H-K, CE6881H, and CE6881H-K: By default, enhanced M-LAG Layer 3 forwarding is disabled. For the CE6866, CE6860-SAN, CE6860-HAM, CE6866K, CE8851-32CQ8DQ-P, CE8850-SAN, CE8865, CE8865-SAN, CE8875, CE8850-HAM, CE8851K, CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode), CE6863E-48S8CQ, CE6885-SAN, and CE6885-LL (low latency mode): By default, enhanced M-LAG Layer 3 forwarding is enabled.",
    "CLIs": [
        "m-lag forward layer-3 enhanced enable",
        "undo m-lag forward layer-3 enhanced enable",
        "m-lag forward layer-3 enhanced disable",
        "undo m-lag forward layer-3 enhanced disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] m-lag forward layer-3 enhanced enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo m-lag forward layer-3 enhanced disable"
        ]
    ],
    "ExtraInfo": "After enhanced M-LAG Layer 3 forwarding is enabled, backup FRR resources are requested for all ARP/ND entries with M-LAG member interfaces as outbound interfaces. The outbound interfaces can be changed to peer-link interfaces to establish active and standby paths for traffic forwarding. If the system detects that an M-LAG member interface fails, dual-homing networking is changed to single-homing networking. The next hop in the corresponding ARP/ND entry is changed from the M-LAG member interface to the peer-link interface. This improves the switchover performance when faults occur."
}