{
    "PageTitle": "mac-address m-lag notification disable",
    "FuncDef": "The mac-address m-lag notification evpn disable command enables a device not to send the MAC address of the VBDIF interface synchronized from the peer device to EVPN in an M-LAG scenario.\nThe undo mac-address m-lag notification evpn disable command disables a device from not sending the MAC address of the VBDIF interface synchronized from the peer device to EVPN in an M-LAG scenario.\nThe mac-address m-lag notification vbdif disable command enables a device not to synchronize the MAC address of the VBDIF interface to the peer device in an M-LAG scenario.\nThe undo mac-address m-lag notification vbdif disable command disables a device from not synchronizing the MAC address of the VBDIF interface to the peer device in an M-LAG scenario.\nThe mac-address m-lag notification vlanif disable command enables a device not to synchronize the MAC address of the VLANIF interface to the peer device in an M-LAG scenario.\nThe undo mac-address m-lag notification vlanif disable command disables a device from not synchronizing the MAC address of the VLANIF interface to the peer device in an M-LAG scenario. The mac-address m-lag notification evpn disable command enables a device not to send the MAC address of the VBDIF interface synchronized from the peer device to EVPN in an M-LAG scenario. The undo mac-address m-lag notification evpn disable command disables a device from not sending the MAC address of the VBDIF interface synchronized from the peer device to EVPN in an M-LAG scenario. The mac-address m-lag notification vbdif disable command enables a device not to synchronize the MAC address of the VBDIF interface to the peer device in an M-LAG scenario. The undo mac-address m-lag notification vbdif disable command disables a device from not synchronizing the MAC address of the VBDIF interface to the peer device in an M-LAG scenario. The mac-address m-lag notification vlanif disable command enables a device not to synchronize the MAC address of the VLANIF interface to the peer device in an M-LAG scenario. The undo mac-address m-lag notification vlanif disable command disables a device from not synchronizing the MAC address of the VLANIF interface to the peer device in an M-LAG scenario. By default, DeviceA synchronizes the MAC address of the local VLANIF/VBDIF interface to DeviceB in an M-LAG scenario. In the M-LAG scenario, after receiving the MAC address of the VBDIF interface synchronized from DeviceA, DeviceB sends the MAC address to the EVPN.",
    "CLIs": [
        "mac-address m-lag notification evpn disable",
        "mac-address m-lag notification vbdif disable",
        "undo mac-address m-lag notification evpn disable",
        "undo mac-address m-lag notification vbdif disable",
        "mac-address m-lag notification vlanif disable",
        "undo mac-address m-lag notification vlanif disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mac-address m-lag notification evpn disable"
        ]
    ],
    "ExtraInfo": ""
}