{
    "PageTitle": "peer-link mac-address remain enable",
    "FuncDef": "The peer-link mac-address remain enable command configures an M-LAG device not to trigger the local or peer M-LAG device to delete the corresponding MAC address on the peer-link interface under certain conditions.\nThe undo peer-link mac-address remain enable command configures an M-LAG device to trigger the local or peer M-LAG device to delete the corresponding MAC address on the peer-link interface under certain conditions. The peer-link mac-address remain enable command configures an M-LAG device not to trigger the local or peer M-LAG device to delete the corresponding MAC address on the peer-link interface under certain conditions. The undo peer-link mac-address remain enable command configures an M-LAG device to trigger the local or peer M-LAG device to delete the corresponding MAC address on the peer-link interface under certain conditions. By default, the M-LAG device does not trigger the local or peer M-LAG device to delete the corresponding MAC address on the peer-link interface under certain conditions.",
    "CLIs": [
        "peer-link mac-address remain enable { unpaired-port | paired-port }",
        "undo peer-link mac-address remain enable { unpaired-port | paired-port }"
    ],
    "ParentView": [
        "DFS group view"
    ],
    "ParaDef": [
        {
            "Parameters": "unpaired-port",
            "Info": "Indicates that the M-LAG device does not trigger the peer M-LAG device to delete the corresponding MAC address on the peer-link interface when an M-LAG single-homing interface fails.\n-"
        },
        {
            "Parameters": "paired-port",
            "Info": "Indicates that the M-LAG device does not trigger the local M-LAG device to delete the corresponding MAC address on the peer-link interface when an M-LAG single-homing interface is changed to a dual-homing interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dfs-group 1",
            "[*HUAWEI-dfs-group-1] undo peer-link mac-address remain enable unpaired-port"
        ]
    ],
    "ExtraInfo": ""
}