{
    "PageTitle": "set lacp system-id switch-delay",
    "FuncDef": "The set lacp system-id switch-delay command sets the delay in switching the LACP M-LAG system ID.\nThe undo set lacp system-id switch-delay command restores the default delay in switching the LACP M-LAG system ID. The set lacp system-id switch-delay command sets the delay in switching the LACP M-LAG system ID. The undo set lacp system-id switch-delay command restores the default delay in switching the LACP M-LAG system ID. By default, the delay in switching the LACP M-LAG system ID is 0, that is, the LACP M-LAG system ID is not switched.",
    "CLIs": [
        "set lacp system-id switch-delay { <switch-delay-time> | immediately }",
        "undo set lacp system-id switch-delay [ <switch-delay-time> | immediately ]"
    ],
    "ParentView": [
        "DFS group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<switch-delay-time>",
            "Info": "Specifies the delay in switching the LACP M-LAG system ID.\nThe value is an integer that ranges from 0 to 3600, in seconds. The default value is 0."
        },
        {
            "Parameters": "immediately",
            "Info": "Indicates that the LACP M-LAG system ID is switched immediately.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dfs-group 1",
            "[*HUAWEI-dfs-group-1] set lacp system-id switch-delay 1200"
        ]
    ],
    "ExtraInfo": "When devices successfully pair into a DFS group, the master device synchronizes its LACP M-LAG system ID to the backup device. The M-LAG member interface on the backup device uses the synchronized LACP M-LAG system ID for LACP negotiation. However, when devices fail to pair into a DFS group, the M-LAG splits, and the devices do not join the M-LAG again within the delay specified by switch-delay-time, the backup device switches the synchronized LACP M-LAG system ID to its own LACP M-LAG system ID. If the backup device joins the M-LAG again within the time specified by switch-delay-time, the LACP M-LAG system ID is not switched.\nIf the value of switch-delay-time is set to 0, the LACP M-LAG system ID is not switched."
}