{
    "PageTitle": "carrier",
    "FuncDef": "The carrier command configures the delay in reporting an interface status change event.\nThe undo carrier command restores the default delay in reporting an interface status change event. The carrier command configures the delay in reporting an interface status change event. The undo carrier command restores the default delay in reporting an interface status change event. By default, the delay in reporting an interface Up event and delay in reporting an interface Down event are both 0 milliseconds.",
    "CLIs": [
        "carrier { down-hold-time <hold-down> | up-hold-time <hold-up> }",
        "undo carrier up-hold-time [ <hold-up> ]",
        "undo carrier down-hold-time [ <hold-down> ]"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,100GE interface view,Layer 2 10GE interface view,10GE interface view,Layer 2 200GE interface view,200GE interface view,25GE-L2 view,25GE interface view,400GE-L2 view,400GE interface view,Layer 2 50GE interface view,50GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "down-hold-time <hold-down>",
            "Info": "Specifies the delay in reporting an interface Down event.\nThe value is an integer that ranges from 0 to 3600000, in milliseconds."
        },
        {
            "Parameters": "up-hold-time <hold-up>",
            "Info": "Specifies the delay in reporting an interface Up event.\nThe value is an integer that ranges from 0 to 3600000, in milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] carrier up-hold-time 1000"
        ]
    ],
    "ExtraInfo": "An Ethernet interface can be physically up or down.  When the physical status of an interface changes, the device where the interface resides notifies upper-layer protocol modules, such as the routing and forwarding modules, of the change to guide packet receiving and forwarding. In addition, the device automatically generates traps and logs to remind users to perform the corresponding operations on physical links.\nAfter you configure a delay in reporting changes in interfaces' physical status, the device will not detect physical status changes during that delay. After the delay, if the physical status has not resumed its original status, the physical status changes are reported to the device.\nYou can configure the delay in reporting physical status changes based on the network connection status."
}