{
    "PageTitle": "error-down auto-recovery",
    "FuncDef": "The error-down auto-recovery command configures the auto recovery function on a port to enable the port in the error-down state to automatically go Up, and sets the delay for the transition from Down to Up.\nThe undo error-down auto-recovery command disables the auto recovery function on the port. The error-down auto-recovery command configures the auto recovery function on a port to enable the port in the error-down state to automatically go Up, and sets the delay for the transition from Down to Up. The undo error-down auto-recovery command disables the auto recovery function on the port. By default, the auto recovery function is disabled on a port.",
    "CLIs": [
        "error-down auto-recovery cause <error-down-type> interval <interval-value>",
        "undo error-down auto-recovery cause <error-down-type>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval <interval-value>",
            "Info": "Specifies the auto recovery delay.\nThe value is an integer ranging from 30 to 86400, in seconds."
        },
        {
            "Parameters": "cause <error-down-type>",
            "Info": "Specifies the cause of the error-down event.\nThe value is a string. You can enter a question mark (?) and select a value from the displayed value range."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] error-down auto-recovery cause bpdu-protection interval 50"
        ]
    ],
    "ExtraInfo": "On a network running the Spanning Tree Protocol (STP), after BPDU protection is configured on an edge port, if attackers send pseudo BPDUs to attack a switching device, the switching device automatically makes the edge port go Down immediately after the edge port receives BPDUs. As a result, all services on the edge port are interrupted.\nBy default, the port in the Down state can communicate with other ports only after the administrator manually turns it Up.  To enable the interface to go Up automatically, run this command to enable the interface to go Up automatically and set the delay time for the interface to go Up automatically.\nAfter a port goes Up, if it receives BPDUs again or the link is considered unavailable within a specific period, the port goes Down again."
}