{
    "PageTitle": "interface range",
    "FuncDef": "The interface range command creates a temporary interface group and adds specified interfaces to this temporary interface group. Commands configured for a temporary interface group then automatically run on all member interfaces. The interface range command creates a temporary interface group and adds specified interfaces to this temporary interface group. Commands configured for a temporary interface group then automatically run on all member interfaces. By default, no temporary interface group is created.",
    "CLIs": [
        "interface range { { <interface-name-start> | <interface-type-start> <interface-number-start> } [ to { <interface-name-end> | <interface-type-end> <interface-number-end> } ] } &<1-10>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-type-start>",
            "Info": "Specifies the type of a start interface.\n-"
        },
        {
            "Parameters": "<interface-number-start>",
            "Info": "Specifies the number of a start interface.\n-"
        },
        {
            "Parameters": "to <interface-name-start>",
            "Info": "Specifies a start interface name.\n-"
        },
        {
            "Parameters": "<interface-name-end>",
            "Info": "Specifies an end interface name.\n-"
        },
        {
            "Parameters": "<interface-type-end>",
            "Info": "Specifies the type of an end interface.\n-"
        },
        {
            "Parameters": "<interface-number-end>",
            "Info": "Specifies the number of an end interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface range 100GE 1/0/1 to 100GE 1/0/2",
            "[*HUAWEI-port-group] undo shutdown"
        ]
    ],
    "ExtraInfo": "Typically, the device has a large number of ports and has the same configuration under many ports. At this point, configuring these interfaces on a case-by-case basis can be cumbersome and prone to input errors. Therefore, the interface that will need to execute the same configuration command, defined as a port group, will automatically execute these command lines under all member interfaces bound by the port group when the port group is configured."
}