{
    "PageTitle": "jumboframe enable",
    "FuncDef": "The jumboframe enable command configures the maximum length of a jumbo frame allowed by an interface.\nThe undo jumboframe enable command restores the default maximum length of a jumbo frame allowed by an interface. The jumboframe enable command configures the maximum length of a jumbo frame allowed by an interface. The undo jumboframe enable command restores the default maximum length of a jumbo frame allowed by an interface. By default, the maximum length of a jumbo frame and the maximum length of a non-jumbo frame allowed by an Ethernet interface are 9216 bytes and 1518 bytes, respectively. A frame whose length is less than or equal to 1518 bytes is a non-jumbo frame.",
    "CLIs": [
        "jumboframe enable <value>",
        "undo jumboframe enable [ <value> ]"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,100GE interface view,Layer 2 10GE interface view,10GE interface view,Layer 2 200GE interface view,200GE interface view,25GE-L2 view,25GE interface view,400GE-L2 view,400GE interface view,Layer 2 50GE interface view,50GE interface view,Eth-Trunk interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<value>",
            "Info": "Specifies the maximum frame length allowed by an Ethernet interface. A frame whose length exceeds value is discarded.\nFor CE6866, CE6866K, CE6860-SAN, CE6860-HAM, CE8851-32CQ8DQ-P, CE8851K, CE8850-SAN, CE8850-HAM, CE8855, CE8851-32CQ4BQ, CE6855-48XS8CQ, CE6885, CE6885-SAN, CE6885-LL, CE6885-T and CE6863E-48S8CQ:\nThe value is an integer that ranges from 1518 to 9500.\nFor CE6820H, CE6820S, CE6820H-K, CE6863H, CE6863H-K, CE6881H-48S6CQ and CE6881H-48S6CQ-K:\nThe value is an integer that ranges from 1518 to 15360.\nFor CE6881H-48T6CQ and CE6881H-48T6CQ-K:\nThe value is an integer that ranges from 1518 to 10240."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] jumboframe enable 5000"
        ]
    ],
    "ExtraInfo": "When exchanging a large amount of data (for example, transmitting files), Ethernet interfaces may receive Jumbo frames whose length exceeds that of common packets. If the length of the received Jumbo frames exceeds the default data frame length that can be processed, the device directly discards the Jumbo frames. You can set the Jumbo frame length allowed on an interface.\nAfter the Jumbo frame length allowed on an interface is adjusted, packet forwarding becomes flexible. If multiple common Ethernet frames are used to transmit a data packet, redundant information such as inter-packet gaps (IPGs) and headers is also transmitted. If Jumbo frames are used to transmit a data packet of the same length, there are fewer frames without unnecessary IPGs and headers to transmit, improving bandwidth utilization."
}