{
    "PageTitle": "negotiation compatible-mode",
    "FuncDef": "The negotiation compatible-mode command switches the working mode of an interface to compatible mode.\nThe undo negotiation compatible-mode command switches the working mode of an interface to incompatible mode. The negotiation compatible-mode command switches the working mode of an interface to compatible mode. The undo negotiation compatible-mode command switches the working mode of an interface to incompatible mode. By default, an interface works in incompatible mode.",
    "CLIs": [
        "negotiation compatible-mode [ precursor <precursor-value> postcursor <postcursor-value> ]",
        "undo negotiation compatible-mode [ precursor <precursor-value> postcursor <postcursor-value> ]"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,100GE interface view,Layer 2 200GE interface view,200GE interface view,25GE-L2 view,25GE interface view,400GE-L2 view,400GE interface view,Layer 2 50GE interface view,50GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "precursor <precursor-value>",
            "Info": "Set a pre-emphasis value before data transition.\nThe value is an integer that ranges from -15 to 15."
        },
        {
            "Parameters": "postcursor <postcursor-value>",
            "Info": "Set a pre-emphasis value after data transition.\nThe value is an integer that ranges from -15 to 15."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] negotiation compatible-mode",
            "Warning: The operation may cause port down. Continue? [Y/N]:Y"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo negotiation compatible-mode",
            "Warning: The operation may cause port down. Continue? [Y/N]:Y"
        ]
    ],
    "ExtraInfo": "Auto-negotiation may fail on an interface in incompatible mode. If the interface goes Down due to an auto-negotiation failure, run the negotiation compatible-mode command to switch the interface to compatible mode and check whether the interface is Up.\nBefore running this command, you are advised to contact technical support engineers to determine whether to use this command and set the parameters. Incorrect use of this command may cause an interface in the Up state to go Down.\nThe CE6820H, CE6820S, CE6820H-K, CE6863H, CE6863H-K, CE6881H, and CE6881H-K do not support this command."
}