{
    "PageTitle": "port link-flap trigger error-down",
    "FuncDef": "The port link-flap trigger error-down command enables an Ethernet interface to transit to the Error-Down state due to link flapping.\nThe undo port link-flap trigger error-down command disables an Ethernet interface from transiting to the Error-Down state due to link flapping. The port link-flap trigger error-down command enables an Ethernet interface to transit to the Error-Down state due to link flapping. The undo port link-flap trigger error-down command disables an Ethernet interface from transiting to the Error-Down state due to link flapping. By default, link flapping protection is enabled on an interface.",
    "CLIs": [
        "port link-flap trigger error-down",
        "undo port link-flap trigger error-down"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] port link-flap trigger error-down"
        ]
    ],
    "ExtraInfo": "Faults such as network cable faults or active/standby switchover may cause the interface status to frequently alternate between Up and Down. As a result, the network topology changes frequently. If some Layer 2 protocols are configured on an interface, the interface sends TC BPDUs to update ARP entries. If ARP entries are not updated in a timely manner, user network services are interrupted, affecting user communication.\nTo solve this problem, configure an interface to enter the Error-Down state due to link flapping. After this function is configured, the device checks the number of interface flapping times and interval when receiving an interface Up/Down message. If the number of interface flapping times within a specified period reaches the specified value, the interface enters the Error-Down state to protect the network. After this function is enabled, an interface enters the Error-Down state if the interface status changes five times within 10s by default. When a device detects a fault on an interface, the device sets the interface status to Error-Down. The interface cannot send or receive packets, and the interface indicator is off."
}