{
    "PageTitle": "port transceiver-power-low trigger error-down",
    "FuncDef": "The port transceiver-power-low trigger error-down command enables the Error-Down function triggered by low optical power on an Ethernet optical interface.\nThe undo port transceiver-power-low trigger error-down command disables the Error-Down function triggered by low optical power on an Ethernet optical interface. The port transceiver-power-low trigger error-down command enables the Error-Down function triggered by low optical power on an Ethernet optical interface. The undo port transceiver-power-low trigger error-down command disables the Error-Down function triggered by low optical power on an Ethernet optical interface. By default, an Ethernet optical interface does not transit to the Error-Down state when the optical power is too low.",
    "CLIs": [
        "port transceiver-power-low trigger error-down",
        "undo port transceiver-power-low trigger error-down"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,100GE interface view,Layer 2 10GE interface view,10GE interface view,Layer 2 200GE interface view,200GE interface view,25GE-L2 view,25GE interface view,400GE-L2 view,400GE interface view,Layer 2 50GE interface view,50GE interface view,Interface group view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] port transceiver-power-low trigger error-down"
        ]
    ],
    "ExtraInfo": "When the receive optical power of the device is too low, services are interrupted intermittently. To prevent services from being affected, you need to configure the interface to enter the Error-Down state when the receive optical power of the optical module is too low so that services can be switched immediately when a fault occurs. When a device detects a fault on an interface, the device sets the interface status to Error-Down. The interface cannot send or receive packets, and the interface indicator is off."
}