{
    "PageTitle": "port crc-statistics trigger error-down",
    "FuncDef": "The port crc-statistics trigger error-down command configures an interface to transit to the Error-Down state when the number of received CRC error packets reaches the alarm threshold.\nThe undo port crc-statistics trigger error-down command disables an interface from transiting to the Error-Down state when the number of received CRC error packets reaches the alarm threshold. The port crc-statistics trigger error-down command configures an interface to transit to the Error-Down state when the number of received CRC error packets reaches the alarm threshold. The undo port crc-statistics trigger error-down command disables an interface from transiting to the Error-Down state when the number of received CRC error packets reaches the alarm threshold. By default, an interface does not transit to the Error-Down state when the number of received CRC error packets reaches the alarm threshold.",
    "CLIs": [
        "port crc-statistics trigger error-down",
        "undo port crc-statistics trigger error-down"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,100GE interface view,Layer 2 10GE interface view,10GE interface view,Layer 2 200GE interface view,200GE interface view,25GE-L2 view,25GE interface view,400GE-L2 view,400GE interface view,Layer 2 50GE interface view,50GE interface view,Interface group view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] port crc-statistics trigger error-down"
        ]
    ],
    "ExtraInfo": "If an interface receives CRC error packets, faults such as packet loss occur on the link. If a backup link is configured on an Ethernet interface, you can configure the interface to transit to the Error-Down state when the number of received CRC error packets reaches the alarm threshold. In this manner, services can be switched to the backup link in a timely manner, ensuring correct data transmission. When a device detects a fault on an interface, the device sets the interface status to Error-Down. The interface cannot send or receive packets, and the interface indicator is off.\nYou can run the trap-threshold crc-statistics command to set the alarm threshold for the number of CRC error packets and the alarm interval."
}