{
    "PageTitle": "port split",
    "FuncDef": "The port split command splits a specified interface.\nThe undo port split command cancels the split configuration on a specified interface. The port split command splits a specified interface. The undo port split command cancels the split configuration on a specified interface. By default, an interface is not split.",
    "CLIs": [
        "port split dimension interface { { <interface-name1> | <interface-type1> <interface-number1> } [ to { <interface-name2> | <interface-type2> <interface-number2> } ] } &<1-24> [ split-type <split-type> ]",
        "undo port split dimension interface { { <interface-name1> | <interface-type1> <interface-number1> } [ to { <interface-name2> | <interface-type2> <interface-number2> } ] } &<1-24> [ split-type <split-type> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-name1>",
            "Info": "Specifies the name of the start interface.\nYou can enter a question mark (?) and select a value based on the prompt."
        },
        {
            "Parameters": "<interface-type1>",
            "Info": "Specifies the type of a start interface.\nYou can enter a question mark (?) and select a value based on the prompt."
        },
        {
            "Parameters": "<interface-number1>",
            "Info": "Specifies the number of a start interface.\nYou can enter a question mark (?) and select a value based on the prompt."
        },
        {
            "Parameters": "to",
            "Info": "The keyword to specifies an interface range that includes all interfaces between these two interfaces. These interfaces must be of the same type.\n-"
        },
        {
            "Parameters": "<interface-name2>",
            "Info": "Specifies the name of the end interface.\nThe value of interface-number2 must not be less than that of interface-number1."
        },
        {
            "Parameters": "<interface-type2>",
            "Info": "Specifies the type of an end interface.\nYou can enter a question mark (?) and select a value based on the prompt."
        },
        {
            "Parameters": "<interface-number2>",
            "Info": "Specifies the number of an end interface.\nYou can enter a question mark (?) and select a value based on the prompt."
        },
        {
            "Parameters": "split-type <split-type>",
            "Info": "Specifies the interface split type.\nYou can enter a question mark (?) and select a value from the displayed value range. A 100GE interface supports four 25GE or two 50GE interfaces. A 200GE interface supports two 100GE or four 50GE interfaces. A 400GE interface supports four 100GE or two 200GE interfaces."
        },
        {
            "Parameters": "undo",
            "Info": "Cancels current configuration.\n-"
        },
        {
            "Parameters": "port",
            "Info": "Specifies a port.\n-"
        },
        {
            "Parameters": "split",
            "Info": "Indicates port splitting.\n-"
        },
        {
            "Parameters": "dimension",
            "Info": "Indicates that converted interfaces are numbered using the dimension numbering rule.\n-"
        },
        {
            "Parameters": "interface",
            "Info": "Specifies an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] port split dimension interface 100GE 1/0/1 split-type 4*25GE"
        ]
    ],
    "ExtraInfo": "The interface split function allows a high-bandwidth physical interface on the device to be split into multiple independent low-bandwidth interfaces. A high-bandwidth interface on the device can be split into multiple low-bandwidth interfaces or directly used based on the interface type on the remote device. The interface split function allows for flexible networking and lowers hardware costs.\nConverted interfaces are numbered using the dimension numbering rule. For example, after 100GE 1/0/1 is split into four 25GE interfaces, the 25GE interfaces are still in the 100GE interface view and are numbered 100GE 1/0/1:1, 100GE 1/0/1:2, 100GE 1/0/1:3, and 100GE 1/0/1:4.\nDynamic interface split indicates that interfaces take effect after being split without the need of restarting the device. Currently, all devices support dynamic interface split.\nYou can check whether dynamic interface split is supported according to the displayed message. When the port split command is run, if the message \"Warning: This operation will delete current port(s) and create new port(s). New port(s) will be offline before the board of slot 1 is reset.\" is displayed, you need to restart the device to make converted interfaces take effect; if the message \"Warning: This operation will delete current port(s) and all configurations of the current port(s) will be cleared. After the operation is done, it may take a few seconds before viewing the port information.\" is displayed, converted interfaces can directly take effect without the need of restarting the device."
}