{
    "PageTitle": "single-fiber enable",
    "FuncDef": "The single-fiber enable command enables the single-fiber communication function of the optical interface.\nThe undo single-fiber enable command to disable the single-fiber communication function of the optical interface. The single-fiber enable command enables the single-fiber communication function of the optical interface. The undo single-fiber enable command to disable the single-fiber communication function of the optical interface. By default, the single-fiber communication function of the optical interface is disabled.",
    "CLIs": [
        "single-fiber enable",
        "undo single-fiber enable"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,100GE interface view,Layer 2 10GE interface view,10GE interface view,Layer 2 200GE interface view,200GE interface view,25GE-L2 view,25GE interface view,400GE-L2 view,400GE interface view,Layer 2 50GE interface view,50GE interface view,Interface group view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] single-fiber enable"
        ]
    ],
    "ExtraInfo": "During network management and maintenance, the administrator may send user traffic to a specified server for analysis, recording, and processing. If a server can receive and send packets, there is a possibility that the server forwards user traffic to other devices, causing a security risk. The unidirectional single-fiber communication function can address this issue. A single fiber means that two optical modules are connected by only one fiber, and unidirectional communication means that packets can be sent in only one direction. With this function, a device can only send but not receive packets, and an analysis server can only receive but not send packets, thereby ensuring data security.\nAfter you run the single-fiber enable command on an interface of the local device, the interface can only send or receive packets through a single fiber. The specific value depends on the connection mode between the transmit end (TX) and the receive end (RX) of the optical module. For example, if the TX end of the optical module on the local device is connected to the RX end of the optical module on the peer device, the local device only sends packets, and the peer device only receives packets. Conversely, if the RX end of the optical module on the local device is connected to the TX end of the optical module on the peer device, the local device only receives packets, and the peer device only sends packets."
}