{
    "PageTitle": "trap-threshold crc-statistics",
    "FuncDef": "The trap-threshold crc-statistics command sets the alarm threshold for CRC error packets and the interval for collecting statistics on CRC error packets.\nThe undo trap-threshold crc-statistics command restores the default alarm threshold for CRC error packets and the default interval for collecting statistics on CRC error packets. The trap-threshold crc-statistics command sets the alarm threshold for CRC error packets and the interval for collecting statistics on CRC error packets. The undo trap-threshold crc-statistics command restores the default alarm threshold for CRC error packets and the default interval for collecting statistics on CRC error packets. By default, the alarm threshold for CRC error packets is 3, and the interval for collecting statistics on CRC error packets is 10 seconds.",
    "CLIs": [
        "trap-threshold crc-statistics <threshold-value> interval <interval-value>",
        "undo trap-threshold crc-statistics [ <threshold-value> interval <interval-value> ]"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,100GE interface view,Layer 2 10GE interface view,10GE interface view,Layer 2 200GE interface view,200GE interface view,25GE-L2 view,25GE interface view,400GE-L2 view,400GE interface view,Layer 2 50GE interface view,50GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "<threshold-value>",
            "Info": "Specifies the alarm threshold for CRC error packets.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "interval <interval-value>",
            "Info": "Specifies the interval for collecting statistics on CRC error packets.\nThe value is an integer ranging from 10 to 65535, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] trap-threshold crc-statistics 10 interval 30"
        ]
    ],
    "ExtraInfo": ""
}