{
    "PageTitle": "clear device alarm hardware",
    "FuncDef": "The clear device alarm hardware command clears hardware alarms.\nThe clear device alarm hardware history command clears historical hardware alarms. The clear device alarm hardware command clears hardware alarms. The clear device alarm hardware history command clears historical hardware alarms.",
    "CLIs": [
        "clear device alarm hardware all { send-trap | no-trap }",
        "clear device alarm hardware slot <slotid> { send-trap | no-trap }",
        "clear device alarm hardware index <indexID> { send-trap | no-trap }",
        "clear device alarm hardware history { all | slot <slotid> }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "send-trap",
            "Info": "Indicates that alarms are sent to the NMS when hardware alarms are cleared.\n-"
        },
        {
            "Parameters": "no-trap",
            "Info": "Indicates that no alarm is sent to the NMS when hardware alarms are cleared.\n-"
        },
        {
            "Parameters": "slot <slotid>",
            "Info": "Specifies a slot ID.\nThe value is a string of 1 to 49 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "index <indexID>",
            "Info": "Specifies the index of an alarm.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "all",
            "Info": "Clears all hardware alarms or historical hardware alarms.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> clear device alarm hardware history slot 1",
            "Warning: Confirm to delete. Continue? [Y/N]:y"
        ],
        [
            "<HUAWEI> clear device alarm hardware index 1 no-trap",
            "Warning: Confirm to delete. Continue? [Y/N]:y"
        ],
        [
            "<HUAWEI> clear device alarm hardware all send-trap",
            "Warning: Confirm to delete. Continue? [Y/N]:Y"
        ],
        [
            "<HUAWEI> clear device alarm hardware slot 1 send-trap",
            "Warning: Confirm to delete. Continue? [Y/N]:Y"
        ]
    ],
    "ExtraInfo": "To clear hardware alarms on a device, run the display device alarm hardware command to view all hardware alarms on the device, select the hardware alarms to be cleared, and run the clear device alarm hardware command. Index-specific, slot ID-specific, or all alarms can be cleared. You can also allow the device to send alarms to the NMS.To clear historical hardware alarms on a device, run the display device alarm hardware history command to view all historical hardware alarms on the device, select the historical hardware alarms to be cleared, and run the clear device alarm hardware history command. You can specify different parameters to clear historical hardware alarms of a specified board or all historical hardware alarms of the device in batches."
}