{
    "PageTitle": "device temperature threshold",
    "FuncDef": "The device temperature threshold command sets the temperature alarm threshold of a board.\nThe undo device temperature threshold command restores the default temperature alarm threshold of a board. The device temperature threshold command sets the temperature alarm threshold of a board. The undo device temperature threshold command restores the default temperature alarm threshold of a board. By default, the temperature alarm threshold of a board varies according to the hardware used by the device.",
    "CLIs": [
        "device temperature threshold slot <slot-id> sensor <sensor-id> minor <minor-value> major <major-value> fatal <fatal-value> [ tmin <tmin-value> tmax <tmax-value> ]",
        "undo device temperature threshold slot <slot-id> sensor <sensor-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "sensor <sensor-id>",
            "Info": "Specifies the ID of a sensor.\nThe value is an integer. You can enter a question mark (?) and select a value from the displayed value range."
        },
        {
            "Parameters": "minor <minor-value>",
            "Info": "Specifies the minor overtemperature alarm threshold of a board.\nThe value is an integer ranging from 80 to 120, in percentage."
        },
        {
            "Parameters": "major <major-value>",
            "Info": "Specifies the major alarm threshold of a board.\nThe value is an integer ranging from 80 to 120, in percentage."
        },
        {
            "Parameters": "fatal <fatal-value>",
            "Info": "Specifies the fatal alarm threshold of a board.\nThe value is an integer ranging from 80 to 120, in percentage."
        },
        {
            "Parameters": "tmin <tmin-value>",
            "Info": "Specifies the lowest temperature for fan speed adjustment.\nThe value is an integer that ranges from -50 to 127, in degrees Celsius."
        },
        {
            "Parameters": "tmax <tmax-value>",
            "Info": "Specifies the highest temperature for fan speed adjustment.\nThe value is an integer ranging from â\u0080\u009350 to 127, in degrees Celsius."
        },
        {
            "Parameters": "slot <slot-id>",
            "Info": "Specifies a slot ID.\nThe value is a character string. You can enter a question mark (?) and select a value as prompted. The value is a string of 1 to 29 case-insensitive characters. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] device temperature threshold slot 1 sensor 1 minor 80 major 90 fatal 100 tmin 60 tmax 70"
        ]
    ],
    "ExtraInfo": "To adapt to changes in the external environment, you can run this command to manually adjust the temperature alarm threshold so that the system can detect board temperature changes more accurately and quickly.\n\nWhen the fan works in automatic speed adjustment mode, the fan speed can be automatically adjusted according to the board temperature. The adjustment policy varies according to the hardware. The main policies are as follows:\nSpeed adjustment policy 1:\nWhen the temperature is greater than or equal to tmax-value, the fan speed increases.When the temperature is lower than tmax-value-2, the fan speed decreases.\nSpeed adjustment policy 2:\nWhen the temperature is lower than or equal to tmin-value, the fan speed decreases to the lower limit.When the temperature is higher than tmin-value, the fan speed increases with the temperature.When the temperature reaches tmax-value, the fan speed is adjusted to 100%."
}