{
    "PageTitle": "memory-usage reliability",
    "FuncDef": "The memory-usage reliability command sets thresholds for memory usage reliability.\nThe undo memory-usage reliability command restores the default thresholds for memory usage reliability. The memory-usage reliability command sets thresholds for memory usage reliability. The undo memory-usage reliability command restores the default thresholds for memory usage reliability. The default notice, overload, and exception thresholds for memory usage reliability are 70, 85, and 95, respectively. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.",
    "CLIs": [
        "memory-usage reliability notice-threshold <notice-threshold-value> overload-threshold <overload-threshold-value> exception-threshold <exception-threshold-value> [ slot <slotId> ]",
        "undo memory-usage reliability [ notice-threshold <notice-threshold-value> overload-threshold <overload-threshold-value> exception-threshold <exception-threshold-value> ] [ slot <slotId> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "overload-threshold <overload-threshold-value>",
            "Info": "Memory reliability overload threshold.\nThe value is an integer ranging from (notice-threshold-value + 5) to 95."
        },
        {
            "Parameters": "exception-threshold <exception-threshold-value>",
            "Info": "Specifies the exception threshold for memory overload reliability.\nThe value is an integer ranging from max(overload-threshold-value+5, 75) to 100."
        },
        {
            "Parameters": "slot <slotId>",
            "Info": "Specifies the slot ID of a board.\nThe value depends on the device. You can enter a question mark (?) and select a value from the displayed value range."
        },
        {
            "Parameters": "notice-threshold <notice-threshold-value>",
            "Info": "Specifies the notice threshold for memory overload reliability.\nThe value is an integer ranging from 5 to 90."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] memory-usage reliability switch on",
            "[~HUAWEI] memory-usage reliability notice-threshold 75 overload-threshold 88 exception-threshold 96 slot 1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] memory-usage reliability switch on",
            "[~HUAWEI] memory-usage reliability notice-threshold 75 overload-threshold 88 exception-threshold 96"
        ]
    ],
    "ExtraInfo": "You can run this command to set proper thresholds for memory usage reliability based on service deployment on the device. In this way, when the memory usage of the device is too high, the device can detect the high memory usage in a timely manner and release the memory to prevent unexpected board resets."
}