{
    "PageTitle": "schedule reboot",
    "FuncDef": "The schedule reboot command configures the scheduled restart of a device and sets the specific time when the device restarts or the delay time before the device restarts.\nThe undo schedule reboot command disables the scheduled restart function. The schedule reboot command configures the scheduled restart of a device and sets the specific time when the device restarts or the delay time before the device restarts. The undo schedule reboot command disables the scheduled restart function. By default, the scheduled restart is disabled.",
    "CLIs": [
        "schedule reboot { at <exact-time> [ <date> ] | delay <interval> [ force ] }",
        "undo schedule reboot"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "at <exact-time>",
            "Info": "Specifies the device restart time.\nexact-time is in the format of hh:mm. It must be later than the current time of the device and the difference between them must be less than 720 hours. In this parameter:\nhh indicates the hour, and the value ranges from 0 to 23.mm indicates the minute, and the value ranges from 0 to 59."
        },
        {
            "Parameters": "<date>",
            "Info": "Specifies the device restart date.\nThe format of date is YYYY/MM/DD, in which YYYY/MM/DD indicates the year, month, and day. In this parameter:\nYYYY is an integer that ranges from 2000 to 2099.MM is an integer that ranges from 1 to 12.DD is an integer that ranges from 1 to 31."
        },
        {
            "Parameters": "delay <interval>",
            "Info": "Specifies the delay time before the device restarts.\nThe format of interval is hh:mm or mm. The value must be no more than 720 hours. In this parameter:\nHh:mm: hh indicates the hour, ranging from 0 to 720, and mm indicates minutes, ranging from 0 to 59.mm indicates the minutes, ranging from 0 to 43200.\nCurrently, the system supports a string of 1 to 6 characters."
        },
        {
            "Parameters": "force",
            "Info": "Specifies forcible scheduled restart.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> undo schedule reboot"
        ],
        [
            "<HUAWEI> schedule reboot at 22:00",
            "Warning: The current configuration will be saved to the next startup saved-configuration file. Continue? [Y/N]:N",
            "Confirm? [Y/N]:Y"
        ]
    ],
    "ExtraInfo": "When upgrading or restarting the device, you can configure the device to restart at time when few services are running to minimize the impact on services."
}