{
    "PageTitle": "set cpu-usage threshold(System view)",
    "FuncDef": "The set cpu-usage threshold command is used to set the overload threshold, recovery threshold, and overload detection period for board-level CPU usage.\nThe undo set cpu-usage threshold command is used to reset the overload threshold, recovery threshold, and overload detection period of the board-level CPU usage. The set cpu-usage threshold command is used to set the overload threshold, recovery threshold, and overload detection period for board-level CPU usage. The undo set cpu-usage threshold command is used to reset the overload threshold, recovery threshold, and overload detection period of the board-level CPU usage. By default, the CPU usage monitoring alarm overload threshold is 90%, the monitoring alarm recovery threshold is 75%, and the overload detection cycle is 1 minute.",
    "CLIs": [
        "set cpu-usage threshold <thresholdValue> [ restore <restoreValue> ] [ interval <interval-time> ] [ slot <slotId> [ cpu <cpuid> ] ]",
        "undo set cpu-usage threshold [ slot <slotId> [ cpu <cpuid> ] ]",
        "undo set cpu-usage threshold <thresholdValue> restore <restoreValue> interval <interval-time> slot <slotId> cpu <cpuid>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<thresholdValue>",
            "Info": "Specify the CPU overload threshold.\nThe value is an integer ranging from 4 to 100, default value is 90."
        },
        {
            "Parameters": "restore <restoreValue>",
            "Info": "Specifies the CPU restore overload threshold.\nThe value is an integer ranging from 1 to threshold-value - 3, default value is 75."
        },
        {
            "Parameters": "interval <interval-time>",
            "Info": "Specifies a CPU overload detection period.\nThe value is an integer ranging from 1 to 60, in minutes, default value is 1."
        },
        {
            "Parameters": "slot <slotId>",
            "Info": "Specifies an available slot ID.\nThe value is a string of 1 to 49 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "cpu <cpuid>",
            "Info": "Specifies an available CPU ID.\nThe value is a string of 1 to 49 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set cpu-usage threshold 60 restore 50 interval 5"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set cpu-usage threshold 80 slot 1 cpu 0"
        ]
    ],
    "ExtraInfo": "You can use the set cpu-usage threshold command to set the CPU usage alarm threshold and CPU usage alarm recovery threshold. When CPU usage exceeds the alarm threshold, the system logs the event and generates an alarm. By viewing log information, you can learn about CPU usage. When CPU usage falls within the recovery threshold, the system generates a clear alarm."
}