{
    "PageTitle": "set memory threshold",
    "FuncDef": "The set memory threshold command sets the board memory overload threshold and recovery threshold.\nThe undo set memory threshold command resets the board-level memory overload threshold and recovery threshold. The set memory threshold command sets the board memory overload threshold and recovery threshold. The undo set memory threshold command resets the board-level memory overload threshold and recovery threshold. By default:",
    "CLIs": [
        "set memory threshold <thresholdValue> [ restore <restoreValue> ] [ slot <slotId> [ cpu <cpuid> ] ]",
        "undo set memory threshold [ slot <slotId> [ cpu <cpuid> ] ]",
        "undo set memory threshold <thresholdValue> restore <restoreValue> slot <slotId> cpu <cpuid>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<thresholdValue>",
            "Info": "Specify the memory overload threshold.\nThe value is an integer ranging from 50 to 100.\nFor a device whose total physical memory is greater than 4 GB, the default value is 95.For a device whose total physical memory is less than or equal to 4 GB, the default value is 92.\nTo check the total physical memory size, run the display memory command in any view and check the Total Physical Available Memory field."
        },
        {
            "Parameters": "restore <restoreValue>",
            "Info": "Specifies the memory restore overload threshold.\nThe value is an integer ranging from 1 to threshold-value - 3. The default value is 75."
        },
        {
            "Parameters": "slot <slotId>",
            "Info": "Specifies an available slot ID.\nThe value is a string of 1 to 49 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "cpu <cpuid>",
            "Info": "Specifies an available CPU ID.\nThe value is a string of 1 to 49 case-sensitive characters. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set memory threshold 90 restore 70"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set memory threshold 80 slot 1 cpu 0"
        ]
    ],
    "ExtraInfo": "You can use the set memory threshold command to set the memory usage threshold. When memory usage exceeds the alarm threshold, the system logs the event and generates an alarm. By viewing log information, you can learn about memory usage. When memory usage falls within the recovery threshold, the system generates a clear alarm."
}