{
    "PageTitle": "system resource",
    "FuncDef": "The system resource command configures the system forwarding resource mode.\nThe undo system resource command cancels the current system resource mode. The system resource command configures the system forwarding resource mode. The undo system resource command cancels the current system resource mode. By default, the card forwarding resource mode is standard. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "system resource { standard | large-mac | user-defined { mac <mac-value> } | large-multicast }",
        "system resource { standard | large-mac | large-route | balance }",
        "undo system resource",
        "system resource { standard | large-mac | large-route | large-multicast | large-flow }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "standard",
            "Info": "Sets the forwarding resource mode to standard.\n-"
        },
        {
            "Parameters": "large-mac",
            "Info": "Sets the forwarding resource mode to large-mac.\n-"
        },
        {
            "Parameters": "large-route",
            "Info": "Set the forwarding resource mode to large-route.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "user-defined",
            "Info": "Sets the forwarding resource mode to user-defined.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.\n-"
        },
        {
            "Parameters": "mac <mac-value>",
            "Info": "Specifies the number of MAC addresses when the forwarding resource mode is user-defined.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.\nThe value is an integer that ranges from 32 to 800."
        },
        {
            "Parameters": "large-multicast",
            "Info": "Sets the forwarding resource mode to large multicast mode.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "balance",
            "Info": "Sets the forwarding resource mode to load balancing.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.\n-"
        },
        {
            "Parameters": "large-flow",
            "Info": "Set the forwarding resource mode to large-flow.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] system resource standard"
        ]
    ],
    "ExtraInfo": "Typically, entry resources in a board are shared among services. If the standard or MAC address entries cannot meet service requirements, you can adjust the entry resource mode to obtain more configuration entries."
}