{
    "PageTitle": "color",
    "FuncDef": "The color command sets parameters of a WRED drop profile, including the absolute values of upper and lower drop thresholds, upper drop threshold, lower drop threshold, and maximum drop probability.\nThe undo color command restores the default settings of a WRED drop profile. The color command sets parameters of a WRED drop profile, including the absolute values of upper and lower drop thresholds, upper drop threshold, lower drop threshold, and maximum drop probability. The undo color command restores the default settings of a WRED drop profile. By default, the upper drop threshold, lower drop threshold, and maximum drop probability of a WRED drop profile are all 100, and absolute values of upper and lower drop thresholds are not configured.",
    "CLIs": [
        "color { green | red | yellow } { buffer-sizelow-limit <low-buffer-size> high-limit <high-buffer-size> | buffer-sizecelllow-limit <low-buffer-size-cell> high-limit <high-buffer-size-cell> | low-limit <low-limit-percentage> high-limit <high-limit-percentage> } discard-percentage <discard-percentage>",
        "undo color { green | red | yellow }"
    ],
    "ParentView": [
        "Drop profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "high-limit <high-buffer-size>",
            "Info": "Specifies the absolute value of the upper drop threshold. When the length of packets in a queue reaches this value, all subsequent packets are discarded.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer that ranges from low-buffer-size to 34078720, in bytes.\nFor the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM:The value is an integer that ranges from low-buffer-size to 16000000, in bytes.\nFor the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S:The value is an integer that ranges from low-buffer-size to 36000000, in bytes.\nFor the CE6885-LL (low latency mode):The value is an integer that ranges from low-buffer-size to 10223616, in bytes."
        },
        {
            "Parameters": "high-limit <high-buffer-size-cell>",
            "Info": "Specifies the absolute value of the upper drop threshold. The unit is cell.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer that ranges from low-buffer-size-cell to 106496.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S:The value is an integer that ranges from low-buffer-size-cell to 125000."
        },
        {
            "Parameters": "high-limit <high-limit-percentage>",
            "Info": "Specifies the upper drop threshold. When the percentage of the packet count in a queue to the queue length reaches this value, all subsequent packets are discarded.\nThe value is an integer that ranges from low-limit-percentage to 100. The default value is 100."
        },
        {
            "Parameters": "discard-percentage <discard-percentage>",
            "Info": "Specifies the maximum drop probability.\nThe value is an integer that ranges from 1 to 100. The default value is 100."
        },
        {
            "Parameters": "green",
            "Info": "Indicates WRED parameters for green packets.\n-"
        },
        {
            "Parameters": "red",
            "Info": "Indicates WRED parameters for red packets.\n-"
        },
        {
            "Parameters": "yellow",
            "Info": "Indicates WRED parameters for yellow packets.\n-"
        },
        {
            "Parameters": "low-limit <low-buffer-size>",
            "Info": "Specifies the absolute value of the lower drop threshold. When the length of packets in a queue reaches this value, packets start to be discarded.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer that ranges from 320 to 34078720, in bytes.\nFor the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM:The value is an integer that ranges from 128 to 16000000, in bytes.\nFor the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S:The value is an integer that ranges from 288 to 36000000, in bytes.\nFor the CE6885-LL (low latency mode):The value is an integer that ranges from 96 to 10223616, in bytes."
        },
        {
            "Parameters": "low-limit <low-buffer-size-cell>",
            "Info": "Specifies the absolute value of the lower drop threshold. The unit is cell.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer that ranges from 1 to 106496.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S:The value is an integer that ranges from 1 to 125000."
        },
        {
            "Parameters": "low-limit <low-limit-percentage>",
            "Info": "Specifies the lower drop threshold. When the percentage of the packet count in a queue to the queue length reaches this value, packets start to be discarded.\nThe value is an integer in the range from 0 to 100. The default value is 100."
        },
        {
            "Parameters": "buffer-size",
            "Info": "Specifies the absolute value of the WRED threshold.\n-"
        },
        {
            "Parameters": "cell",
            "Info": "Specifies that the absolute value of the WRED threshold is in cells. If this parameter is not specified, the absolute value of the WRED threshold is in bytes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] drop-profile wred1",
            "[*HUAWEI-drop-wred1] color green low-limit 80 high-limit 100 discard-percentage 10",
            "[*HUAWEI-drop-wred1] color yellow low-limit 60 high-limit 80 discard-percentage 20",
            "[*HUAWEI-drop-wred1] color red low-limit 40 high-limit 60 discard-percentage 40"
        ]
    ],
    "ExtraInfo": "When packets enter a device, the packets are colored based on the mapping in a DiffServ domain. The system processes packets with different colors based on the WRED configuration.\nWhen upper and lower drop thresholds in percentage are used:"
}