{
    "PageTitle": "display qos micro-burst statistics interface",
    "FuncDef": "The display qos micro-burst statistics interface command displays statistics about microburst detection on an interface. The display qos micro-burst statistics interface command displays statistics about microburst detection on an interface. This command is supported only on the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S.",
    "CLIs": [
        "display qos micro-burst statistics interface { <interface-name> | <interface-type> <interface-number> }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of an interface.\nThe value is a string case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of an interface.\nThe value is a string case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display qos micro-burst statistics interface 10GE 1/0/1"
        ]
    ],
    "ExtraInfo": "In default microburst detection mode, the packet sampling interval is 5 ms. In enhanced microburst detection mode, the packet sampling interval is 1 ms.\nThe microburst detection period is 5 minutes. That is, key performance indicators of an interface are collected every 5 minutes and related entries are generated. You can run the display qos micro-burst statistics interface interface-type interface-number command to view statistics collected within 300 minutes after microburst detection is enabled on an interface, including the average rate of burst traffic, maximum rate of burst traffic, number of discarded packets, average buffer usage on the interface, peak buffer usage on the interface, and entry generation time."
}