{
    "PageTitle": "ecn",
    "FuncDef": "The ecn command sets Explicit Congestion Notification (ECN) parameters including the upper and lower drop thresholds in percentage, absolute values of upper and lower drop thresholds, and maximum drop probability.\nThe undo ecn command deletes ECN parameters. The ecn command sets Explicit Congestion Notification (ECN) parameters including the upper and lower drop thresholds in percentage, absolute values of upper and lower drop thresholds, and maximum drop probability. The undo ecn command deletes ECN parameters. By default, the upper and lower drop thresholds in percentage, absolute values of upper and lower drop thresholds, and maximum drop probability are not set.",
    "CLIs": [
        "ecn { buffer-sizelow-limit <low-buffer-size> high-limit <high-buffer-size> | buffer-sizecelllow-limit <low-buffer-cell-size> high-limit <high-buffer-cell-size> | low-limit <low-limit-percentage> high-limit <high-limit-percentage> } discard-percentage <discard-percentage-value>",
        "undo ecn"
    ],
    "ParentView": [
        "Drop profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "buffer-size",
            "Info": "Specifies the absolute value of the ECN threshold.\n-"
        },
        {
            "Parameters": "low-limit <low-buffer-cell-size>",
            "Info": "Specifies the absolute value of the upper drop threshold. When the packet length in a queue reaches this value, the ECN field of all packets is set to CE.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer that ranges from 1 to 106496.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S:The value is an integer that ranges from 1 to 125000."
        },
        {
            "Parameters": "low-limit <low-limit-percentage>",
            "Info": "Specifies the lower drop threshold, in percentage. When the packet length in a queue reaches this value, the ECN field of packets is set to CE based on the probability.\nThe value is an integer in the range from 0 to 100. The default value is 100."
        },
        {
            "Parameters": "low-limit <low-buffer-size>",
            "Info": "Specifies the absolute value of the lower drop threshold. When the packet length in a queue reaches this value, the ECN field of packets is set to CE based on the probability.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer that ranges from 320 to 34078720.\nFor the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM:The value is an integer in the range from 128 to 16000000.\nFor the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S:The value is an integer that ranges from 256 to 1073741824.\nFor the CE6885-LL (low latency mode):The value is an integer that ranges from 96 to 10223616."
        },
        {
            "Parameters": "high-limit <high-buffer-size>",
            "Info": "Specifies the absolute value of the lower drop threshold. When the packet length in a queue reaches this value, the ECN field of packets is set to CE based on the probability.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer that ranges from low-buffer-size to 34078720.\nFor the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM:The value is an integer that ranges from low-buffer-size to 16000000.\nFor the CE6863H, CE6863H-K, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S:The value is an integer that ranges from low-buffer-size to 1073741824.\nFor the CE6885-LL (low latency mode):The value is an integer that ranges from low-buffer-size to 10223616."
        },
        {
            "Parameters": "high-limit <high-buffer-cell-size>",
            "Info": "Specifies the absolute value of the upper drop threshold. When the packet length in a queue reaches this value, the ECN field of all packets is set to CE.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer that ranges from low-buffer-cell-size to 106496.\nFor the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K and CE6820S:The value is an integer that ranges from low-buffer-cell-size to 125000."
        },
        {
            "Parameters": "high-limit <high-limit-percentage>",
            "Info": "Specifies the upper drop threshold, in percentage. When the packet length in a queue reaches this value, the ECN field of all packets is set to CE.\nThe value is an integer that ranges from low-limit-percentage to 100. The default value is 100."
        },
        {
            "Parameters": "cell",
            "Info": "Specifies that the absolute value of the ECN threshold is in cells. If this parameter is not specified, the absolute value of the WRED threshold is in bytes.\n-"
        },
        {
            "Parameters": "discard-percentage <discard-percentage-value>",
            "Info": "Specifies the maximum drop probability when the ECN field of packets is set to CE, in percentage.\nThe value is an integer that ranges from 1 to 100. The default value is 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] drop-profile dp1",
            "[*HUAWEI-drop-dp1] ecn low-limit 30 high-limit 50 discard-percentage 20"
        ]
    ],
    "ExtraInfo": "To enable the ECN function for a queue, configure the lower and upper ECN thresholds and apply ECN on the queue."
}