{
    "PageTitle": "qos queue drr",
    "FuncDef": "The qos queue drr command sets the WDRR weight of queues that participate in WDRR scheduling.\nThe undo qos queue drr command restores the default WDRR weight of queues that participate in WDRR scheduling. The qos queue drr command sets the WDRR weight of queues that participate in WDRR scheduling. The undo qos queue drr command restores the default WDRR weight of queues that participate in WDRR scheduling. The default WDRR weight of queues that participate in DRR scheduling is 1.",
    "CLIs": [
        "qos queue <queue-index> drrweight <weight-value>",
        "undo qos queue <queue-index> drrweight"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,400GE interface view,50GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "weight <weight-value>",
            "Info": "Specifies a WDRR weight.\nThe value is an integer that ranges from 1 to 100."
        },
        {
            "Parameters": "queue <queue-index>",
            "Info": "Specifies the index of a queue.\nThe value is an integer that ranges from 0 to 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] qos drr 4",
            "[*HUAWEI-100GE1/0/1] qos queue 4 drr weight 9"
        ]
    ],
    "ExtraInfo": "WDRR schedules packets based on the packet length used as the weight. If the packet length is too long, WDRR allows the negative weight value so that long packets can be scheduled. In the next round, the queue with the negative weight value is not scheduled until its weight value becomes positive.\nWDRR offsets the disadvantages of PQ scheduling. That is, in PQ scheduling, packets in queues with lower priorities cannot be scheduled for a long time.\nWhen WDRR scheduling is used, set the weight for each queue. The device schedules queues in turn according to the weights."
}