{
    "PageTitle": "qos burst-mode (Interface View)",
    "FuncDef": "The qos burst-mode command configures the burst traffic buffer mode on a device.\nThe undo qos burst-mode command restores the default burst traffic buffer mode on a device. The qos burst-mode command configures the burst traffic buffer mode on a device. The undo qos burst-mode command restores the default burst traffic buffer mode on a device. By default, the burst traffic buffer mode is standard on an interface.",
    "CLIs": [
        "qos burst-mode { enhanced | shared }",
        "undo qos burst-mode { enhanced | shared }",
        "qos burst-mode enhanced",
        "undo qos burst-mode enhanced",
        "qos burst-mode { enhanced | extreme }",
        "undo qos burst-mode { enhanced | extreme }"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE interface view,50GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "enhanced",
            "Info": "Indicates the enhanced burst traffic buffer mode.\n-"
        },
        {
            "Parameters": "shared",
            "Info": "Indicates the shared burst traffic buffer mode.\n\n NOTE: This parameter is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM.\n-"
        },
        {
            "Parameters": "extreme",
            "Info": "Sets the burst traffic buffer mode to extreme.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] qos burst-mode enhanced"
        ]
    ],
    "ExtraInfo": "The device buffer is allocated in static and dynamic modes. By default, each interface is allocated some static buffer resources for the basic buffer requirement. The remaining buffer is used as the dynamic buffer of the device.\nThe buffer modes are as follows:"
}