{
    "PageTitle": "ntp unsync max-poll-interval",
    "FuncDef": "The ntp unsync max-poll-interval command sets the maximum polling interval in unsynchronized mode and the step to be decreased in the actual polling interval.\nThe undo ntp unsync max-poll-interval command restores the default maximum polling interval in unsynchronized mode and the step to be decreased in the actual polling interval. The ntp unsync max-poll-interval command sets the maximum polling interval in unsynchronized mode and the step to be decreased in the actual polling interval. The undo ntp unsync max-poll-interval command restores the default maximum polling interval in unsynchronized mode and the step to be decreased in the actual polling interval. By default, the maximum polling interval in unsynchronized mode and the step length to be decreased in the actual polling interval is no set.",
    "CLIs": [
        "ntp unsync max-poll-interval <poll-interval-value> dec-step <step-value>",
        "undo ntp unsync max-poll-interval"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<poll-interval-value>",
            "Info": "Specifies the maximum polling interval in unsynchronized mode.\nThe value is an integer ranging from 6 to 10, expressed in the Nth power of 2 seconds."
        },
        {
            "Parameters": "dec-step <step-value>",
            "Info": "Specifies the step length to be decreased in the actual polling interval.\nThe value is an integer ranging from 1 to 6, expressed in the Nth power of 2 seconds.\nIf the value of poll-interval-value is 10, step-value can be set to 6 only."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ntp unsync max-poll-interval 7 dec-step 6"
        ]
    ],
    "ExtraInfo": "Network Time Protocol (NTP) is an application-layer protocol in the TCP/IP suite. It synchronizes time among a set of distributed time servers and clients. An NTP client sends NTP clock synchronization packets to the NTP server at a specified polling interval to request time synchronization. In unsynchronized mode, the polling interval increases by the Nth power of 2. If time synchronization is always not achieved, the interval increases to 2^10s (1024s) at most. To set a fixed polling interval in unsynchronized mode, run the ntp unsync max-poll-interval command."
}