{
    "PageTitle": "ntp authentication-keyid",
    "FuncDef": "The ntp authentication-keyid authentication-mode command sets the NTP verification key.\nThe undo ntp authentication-keyid command cancels the NTP verification key. The ntp authentication-keyid authentication-mode command sets the NTP verification key. The undo ntp authentication-keyid command cancels the NTP verification key. By default, no authentication key is set.",
    "CLIs": [
        "ntp authentication-keyid <keyId> authentication-mode { md5 | hmac-sha256 | aes-128-cmac | aes-256-cmac } { <password> | cipher <password> }",
        "undo ntp authentication-keyid <keyId>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "md5",
            "Info": "Indicates MD5 authentication.\nThe MD5 algorithm is insecure and is not recommended. You are advised to use other encryption algorithms for NTP key authentication.\n-"
        },
        {
            "Parameters": "hmac-sha256",
            "Info": "Indicates HMAC-SHA256 authentication.\n-"
        },
        {
            "Parameters": "aes-128-cmac",
            "Info": "Indicates AES-128-CMAC authentication.\n-"
        },
        {
            "Parameters": "aes-256-cmac",
            "Info": "Indicates AES-256-CMAC authentication.\n-"
        },
        {
            "Parameters": "<password>",
            "Info": "Sets an authentication password, which is in simple text.\nWhen password complexity-check is disabled: the new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters.When password complexity-check is enabled: the password must consist of at least 12 characters, and consist 4 types of characters, including lowercase letters, uppercase letters, digits, and special characters.For security purposes, you are advised to configure a password in ciphertext mode. To further improve device security, periodically change the password.\nIf the password complexity check is enabled, the value is a string of 12 to 255 case-sensitive characters, spaces supported.\nIf the password complexity check is disabled, the value is a string of 1 to 255 case-sensitive characters, spaces supported.\nIn aes-128-cmac mode, the value is a string of case-sensitive characters, spaces supported.  Its length is 16 in cleartext mode.\nIn AES-256-CMAC authentication mode, the value is a string of case-sensitive characters, spaces supported. Its length is 32 in cleartext mode."
        },
        {
            "Parameters": "cipher <password>",
            "Info": "Sets a ciphertext authentication password.\nThe password is a string of case-sensitive characters, with spaces supported. A ciphertext password is a string of 20 to 432 characters."
        },
        {
            "Parameters": "authentication-keyid <keyId>",
            "Info": "Authentication key number.\nThe value is an integer in the range from 1 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ntp authentication-keyid 10 authentication-mode hmac-sha256 YsHsjx_202206"
        ]
    ],
    "ExtraInfo": "On some networks that require high security, you need to enable the authentication function when running the NTP protocol. Password authentication on the client and server ensures that the client synchronizes only with the authenticated device, improving network security."
}