{
    "PageTitle": "ntp kod-enable",
    "FuncDef": "The ntp kod-enable command enables a device to send kiss codes on appropriate conditions.\nThe undo ntp kod-enable command disables a device from sending kiss codes. The ntp kod-enable command enables a device to send kiss codes on appropriate conditions. The undo ntp kod-enable command disables a device from sending kiss codes. By default, KoD is not enabled.",
    "CLIs": [
        "ntp kod-enable",
        "undo ntp kod-enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ntp kod-enable"
        ]
    ],
    "ExtraInfo": "The ntp kod-enable command is used on the server. In specific scenarios, the server sends kiss codes RATE and DENY to the client.\nScenario where the server sends the DENY code to the client:\nIf the NTP ACL access control level is set to peer, server, synchronization, or query on the server and the source IP address of NTP packets received by the server matches the ACL deny rule or does not match any rule, the server sends the DENY code to the client. After the client receives the DENY code, all NTP sessions with the server should be disconnected and NTP request packets should be stopped.\nScenario where the server sends the RATE code to the client:\nIf the NTP ACL access control level is set to limited on the server, the source IP address of the NTP packets received by the server matches the ACL permit rule, and the polling interval for the client to send NTP packets is less than the minimum interval for sending packets set on the server, the server sends the RATE code to the client. After receiving the RATE code, the client should reduce the polling interval for sending NTP request packets to the server. Each time the client receives the RATE code, it reduces the polling interval for sending NTP request packets by 1.\nYou can run the ntp discard command to set the minimum inter-packet interval and average inter-packet interval of NTP."
}