{
    "PageTitle": "ntp unicast-server",
    "FuncDef": "The ntp unicast-server command configures an NTP server on a local device.\nThe undo ntp unicast-server command deletes the NTP server configuration. The ntp unicast-server command configures an NTP server on a local device. The undo ntp unicast-server command deletes the NTP server configuration. By default, no NTP server is set.",
    "CLIs": [
        "ntp unicast-server { <ipv4-address> [ version <number> | authentication-keyid <key-id> | port <port-number> | source-interface { <ifName> | <interface-type> <interface-number> } | vpn-instance <vpn-instance-name> | preferred | maxpoll <max-number> | minpoll <min-number> | burst | iburst | preempt ] | ipv6 <ipv6-address> [ authentication-keyid <key-id> | port <port-number> | source-interface { <ifName> | <interface-type> <interface-number> } | vpn-instance <vpn-instance-name> | preferred | maxpoll <max-number> | minpoll <min-number> | burst | iburst | preempt ] | domain <domain-name> [ version <number> | authentication-keyid <key-id> | port <port-number> | source-interface { <ifName> | <interface-type> <interface-number> } | vpn-instance <vpn-instance-name> | preferred | maxpoll <max-number> | minpoll <min-number> | burst | iburst | preempt ] }",
        "undo ntp unicast-server { <ipv4-address> | ipv6 <ipv6-address> | domain <domain-name> } [ vpn-instance <vpn-instance-name> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies the IPv4 address of a remote server.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "version <number>",
            "Info": "Specifies an NTP version number.\nThe value is an integer ranging from 1 to 4. The default value is 3."
        },
        {
            "Parameters": "authentication-keyid <key-id>",
            "Info": "Specifies an authentication key number used when messages are transmitted to a remote server.\nThe value is an integer and ranges as: 1 to 4294967295 (version 1 to 3), or 1 to 65535 (version 4)."
        },
        {
            "Parameters": "port <port-number>",
            "Info": "Specifies the destination port number to transmit NTP unicast packets.\nThe value is 123 or an integer ranging from 1025 to 65535. The default value is 123."
        },
        {
            "Parameters": "source-interface <ifName>",
            "Info": "Specify interface whose address should be used as source.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specify the interface type.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specify the interface number.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "preferred",
            "Info": "Specifies the remote server as a preferred one. By default, the remote server is not preferred.\n-"
        },
        {
            "Parameters": "maxpoll <max-number>",
            "Info": "Specifies the maximum NTP polling interval. The value that takes effect is 2 to the power of max-number, in seconds.\nThe value is an integer ranging from 10 to 17, in seconds. The default value is 10."
        },
        {
            "Parameters": "minpoll <min-number>",
            "Info": "Specifies the minimum NTP polling interval. The value that takes effect is 2 to the power of min-number, in seconds.\nThe value is an integer ranging from 3 to 6, in seconds. The default value is 6."
        },
        {
            "Parameters": "burst",
            "Info": "Specifies that a burst of packets will be sent at every poll interval. This is useful to accurately measure a jitter with long poll intervals.\n-"
        },
        {
            "Parameters": "iburst",
            "Info": "Specifies that a burst of packets will be sent when an unreachable server sends a reply. This is useful to rapidly synchronize the clock.\n-"
        },
        {
            "Parameters": "preempt",
            "Info": "Enables the preemption mode for the server. The specified server is marked unavailable for selection if any error (authentication failure) is detected on a connection between the local device and reference clock. The server is marked available for selection if no other connections are available and no error is detected on the connection between the local device and reference clock.\n-"
        },
        {
            "Parameters": "ipv6 <ipv6-address>",
            "Info": "Specifies the IPv6 address of a remote server. The ipv6-address is a host address and cannot be a multicast address, loopback address, or IP address of a reference clock.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "domain <domain-name>",
            "Info": "Specifies a domain name of a remote server.\nThe value is a string of 1 to 255 characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ntp unicast-server 10.10.1.1 version 3"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance abc",
            "[~HUAWEI-vpn-instance-abc] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-abc-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-abc] quit",
            "[*HUAWEI] ntp unicast-server 10.10.1.1 vpn-instance abc"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ntp unicast-server 10.10.1.1 version 3 port 5000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ntp unicast-server 1.1.1.1 burst iburst maxpoll 11 minpoll 4 preempt"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ntp unicast-server ipv6 2001:db8::1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ntp unicast-server domain www.example.com"
        ]
    ],
    "ExtraInfo": "A specified remote server can be configured as the local time server. The local device works in client mode. The local client can be synchronized to the time of the remote server, and the remote server cannot be synchronized to the time of the local client."
}