{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "slave sync config",
    "FuncDef": [
        "To manually synchronize configuration files on the master and slave Route Switch Processor (RSP) cards of a Cisco 7507 or Cisco 7513 router, use the **slave sync config**privileged EXEC command. "
    ],
    "CLIs": [
        "slave sync config"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "In the following example, the configuration files on the master and slave RSP card are synchronized:",
            "```",
            "c7507(config)# slave sync config",
            "```"
        ]
    ],
    "ExtraInfo": "Use this command for a Cisco 7507 or Cisco 7513 router that is configured for Dual RSP Cards. On the Cisco 7507 and Cisco 7513 router, you can install two RSP cards in a single router to improve system availability. Dual RSP Cards is a High System Availability (HSA) feature.This command allows you to synchronize the configuration files of the master and slave RSP cards on a case-by-case basis when you do not have automatic synchronization turned on. This command copies the master's configuration file to the slave RSP card.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)You *must* use this command when you insert a new slave RSP card into a Cisco 7507 or Cisco 7513 router for the first time to ensure that the new slave is configured consistently with the master.---",
    "RelatedCmds": [
        {
            "cmd": " **show controller cbus** ",
            "description": " Displays detailed information on the cards connected to the CBus controller. "
        },
        {
            "cmd": " **show stack**s ",
            "description": " Displays the stack trace and version information of the master and slave RSP cards. "
        },
        {
            "cmd": " **show version** ",
            "description": " Displays the software version running on the master and slave RSP cards. "
        },
        {
            "cmd": " slave auto-sync config ",
            "description": " Turns on automatic synchronization of configuration files for a Cisco 7507 or Cisco 7513 router that is configured for HSA. "
        }
    ]
}