{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "slave default-slot",
    "FuncDef": [
        "To specify the default slave Route Switch Processor (RSP) card on a Cisco 7507 or Cisco 7513 router, use the **slave default-slot**global configuration command. "
    ],
    "CLIs": [
        "slave default-slot<processor-slot-number>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *processor-slot-number* ",
            "Info": " Number of a processor slot that contains the default slave RSP. On the Cisco 7507 router, valid values are 2 or 3. On the Cisco 7513 router, valid values are 6 or 7. The default is the higher number processor slot. "
        }
    ],
    "Examples": [
        [
            "In the following example, the user sets the default slave RSP to processor slot 2 on a Cisco 7507 router:",
            "```",
            "c7507(config)# slave default-slot 2",
            "```"
        ]
    ],
    "ExtraInfo": "Use this command for a Cisco 7507 or Cisco 7513 router that is configured for Dual RSP Cards. On the Cisco 7507 and Cisco 7513 router, you can install two RSP cards in a single router to improve system availability. Dual RSP Cards is a High System Availability (HSA) feature.The router uses the default slave information when booting as follows:•![](/c/dam/en/us/td/i/templates/blank.gif)If a system boot is due to powering up the router or using the **reload** EXEC command, then the specified default slave will be the slave RSP.•![](/c/dam/en/us/td/i/templates/blank.gif)If a system boot is due to a system crash or hardware failure, then the system ignores the default slave designation, and makes the crashed or faulty RSP card the slave RSP.",
    "RelatedCmds": [
        {
            "cmd": " **reload** ",
            "description": " Reloads the operating system. "
        },
        {
            "cmd": " **show controller cbus** ",
            "description": " Displays detailed information on the cards connected to the CBus controller. "
        },
        {
            "cmd": " **show stack**s ",
            "description": " Displays the stack trace and version information of the master and slave RSP cards. "
        },
        {
            "cmd": " **show version** ",
            "description": " Displays the software version running on the master and slave RSP cards. "
        }
    ]
}