{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "slave reload",
    "FuncDef": [
        "To force a reload of the image that the slave Route Switch Processor (RSP) card is running on a Cisco 7507 or Cisco 7513 router, use the **slave reload** global configuration command. "
    ],
    "CLIs": [
        "slave reload"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "In the following example, an inactive slave RSP card is reloaded. If the slave reloads, it will return to an active slave state. If the master RSP fails, the slave RSP will become the master.",
            "```",
            "c7507(config)# slave reload",
            "```"
        ]
    ],
    "ExtraInfo": "Use this command for a Cisco 7507 or Cisco 7513 router that is configured for Dual RSP Cards. On the Cisco 7507 and Cisco 7513 router, you can install two RSP cards in a single router to improve system availability. Dual RSP Cards is a High System Availability (HSA) feature.After using the **slave image** global configuration command to specify the image that the slave RSP runs on a Cisco 7507 or Cisco 7513 router, use the **slave reload**command to reload the slave with the new image. The **slave reload** command can also be used to force the slave to reboot its existing image.",
    "RelatedCmds": [
        {
            "cmd": " **show controller cbus** ",
            "description": " Displays detailed information on the cards connected to the CBus controller. "
        },
        {
            "cmd": " **show stack**s ",
            "description": " Displays the stack trace and version information of the master and slave RSP cards. "
        },
        {
            "cmd": " **show version** ",
            "description": " Displays the software version running on the master and slave RSP cards. "
        },
        {
            "cmd": " slave image ",
            "description": " Specifies the image that the slave RSP runs on a Cisco 7507 or Cisco 7513 router. "
        }
    ]
}