{
    "PageTitle": "default-route originate",
    "FuncDef": "The default-route originate command configures a device to generate a default route and advertise it to its neighbors, or advertise an exist default route to its neighbors.\nThe undo default-route originate command deletes the default route. The default-route originate command configures a device to generate a default route and advertise it to its neighbors, or advertise an exist default route to its neighbors. The undo default-route originate command deletes the default route. By default, the device does not advertise the default route to its neighbors.",
    "CLIs": [
        "default-route originate [ [ cost <cost> ] | [ tag <tag> ] | { { matchdefault | route-policy <route-policy-name> [ advertise-tag ] } [ avoid-learning ] } ]",
        "undo default-route originate"
    ],
    "ParentView": [
        "RIP view"
    ],
    "ParaDef": [
        {
            "Parameters": "cost <cost>",
            "Info": "Specifies the metric value to be applied while generating a default route.\nThe value is an integer ranging from 0 to 15. By default, the value is 0."
        },
        {
            "Parameters": "tag <tag>",
            "Info": "Specifies the tag value to be applied while advertising a default route.\nThe value is an integer in the range from 0 to 65535. The default value is 0."
        },
        {
            "Parameters": "matchdefault",
            "Info": "Advertises the default routes (if any) in the routing table generated by other routing protocols or RIP processes to neighbors.\n-"
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a route-policy. RIP generates the default route only if the route that matches the route-policy is active in the routing table.\nTo configure a route-policy, run the route-policy command.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "advertise-tag",
            "Info": "Specifies inherit the tag value applied through route-policy while advertising default route.\n-"
        },
        {
            "Parameters": "avoid-learning",
            "Info": "Prevents a RIP process from importing default routes. If there is an active default route in the routing table and avoid-learning is specified, the default route becomes inactive.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy filter permit node 10",
            "[*HUAWEI] quit",
            "[*HUAWEI] rip 100",
            "[*HUAWEI-rip-100] default-route originate route-policy filter cost 15"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rip 100",
            "[*HUAWEI-rip-100] default-route originate cost 2"
        ]
    ],
    "ExtraInfo": "In a routing table, the destination address and mask of a default route are all 0s. If the destination address of a packet does not match any entry in the routing table, the packet is sent along the default route.\nIf no default route exists and the destination address of the packet does not exist in the routing table, the device discards the packet and returns an Internet Control Message Protocol (ICMP) packet to notify the source that the destination address or network is unreachable.\nWhen configuring parameters of the command, not the following rules:"
}