{
    "PageTitle": "import-route bgp permit-ibgp (RIP view)",
    "FuncDef": "The import-route bgp permit-ibgp command imports other routing protocol routes to RIP.\nThe undo import-route bgp permit-ibgp command deletes other routing protocol routes from RIP. The import-route bgp permit-ibgp command imports other routing protocol routes to RIP. The undo import-route bgp permit-ibgp command deletes other routing protocol routes from RIP. By default, RIP does not import routes from any other processes or routing protocols.",
    "CLIs": [
        "import-route bgp permit-ibgp [ [ cost <cost> ] | [ route-policy <route-policy-name> ] ]",
        "import-route bgp permit-ibgp { costtransparentroute-policy <route-policy-name> | route-policy <route-policy-name> costtransparent | costtransparent }",
        "undo import-route bgp permit-ibgp"
    ],
    "ParentView": [
        "RIP view"
    ],
    "ParaDef": [
        {
            "Parameters": "cost <cost>",
            "Info": "Specifies the cost for imported routes.\nThe value is an integer ranging from 0 to 15. The default value is 0."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a route-policy used to filter imported routes. A device imports only routes matching the policy.\nThe value is a string of 1 to 200 case-sensitive characters. It cannot contain spaces. If spaces are used, the string must start and end with double quotation marks (\")."
        },
        {
            "Parameters": "bgp",
            "Info": "Imports BGP routes.\n-"
        },
        {
            "Parameters": "permit-ibgp",
            "Info": "Imports IBGP routes to the public network instance.\nIf this parameter is not specified, RIP can import only EBGP routes, not IBGP routes.\n-"
        },
        {
            "Parameters": "transparent",
            "Info": "Retains the Multi_Exit Discriminator (MED) value of an imported BGP route as its cost. transparent takes effect only when the protocol is BGP.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy abc permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] rip 1",
            "[*HUAWEI-rip-1] import-route bgp permit-ibgp cost 5 route-policy abc"
        ]
    ],
    "ExtraInfo": "When RIP and other routing protocols are deployed on a network, you can import routes to other routing domains to RIP using the import-route command so that the traffic within a RIP domain can reach a destination outside the RIP domain.\nIf the import-route bgp command is run in the public network instance view, RIP can import only EBGP routes by default. To enable RIP to import both EBGP and IBGP routes, run the import-route bgp permit-ibgp command.\nHowever, if the import-route bgp command is run in a VPN instance view, both EBGP and IBGP routes can be imported by default. Therefore, the import-route bgp permit-ibgp command does not need to be run in the VPN instance view."
}