{
    "PageTitle": "silent-interface (RIP view)",
    "FuncDef": "The silent-interface command enables an interface to receive RIP packets to update its routing table but disables it from sending RIP packets.\nThe undo silent-interface command re-enables an interface to send updated packets. The silent-interface command enables an interface to receive RIP packets to update its routing table but disables it from sending RIP packets. The undo silent-interface command re-enables an interface to send updated packets. By default, an interface is not suppressed.",
    "CLIs": [
        "silent-interface [ disable ] { <interface-type> <interface-number> | <interface-name> }",
        "undo silent-interface { <interface-type> <interface-number> | <interface-name> }",
        "undo silent-interface disable { <interface-type> <interface-number> | <interface-name> }"
    ],
    "ParentView": [
        "RIP view"
    ],
    "ParaDef": [
        {
            "Parameters": "disable",
            "Info": "Enables interfaces to send RIP packets.\n-"
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rip 100",
            "[*HUAWEI-rip-100] silent-interface all",
            "[*HUAWEI-rip-100] silent-interface disable 100GE 1/0/1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rip 100",
            "[*HUAWEI-rip-100] silent-interface 100GE 1/0/1",
            "[*HUAWEI-rip-100] peer 10.1.1.1"
        ]
    ],
    "ExtraInfo": "When a device running RIP is connected to a network running other routing protocols, you can run the silent-interface command on the interface that connects the device to the network to prevent the interface from sending packets to the network. This also prevents routing loops.\nIf you want only a small number of interfaces to be active while the rest interfaces are suppressed, run the silent-interface all command to suppress all interfaces and then run the silent-interface disable interface-type interface-number command to activate specified interfaces.\nThis command can be used together with the peer (RIP) command to advertise routes to a specified device."
}