{
    "PageTitle": "storm suppression (bridge domain view)",
    "FuncDef": "The storm suppression command configures the maximum volume of broadcast, unknown multicast, or unknown unicast packets that can pass through a BD.\nThe undo storm suppression command cancels the configuration. The storm suppression command configures the maximum volume of broadcast, unknown multicast, or unknown unicast packets that can pass through a BD. The undo storm suppression command cancels the configuration. By default, the rate of broadcast, unknown multicast, or unknown unicast traffic is not limited in a BD. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "storm suppression { broadcast | multicast | unknown-unicast } cir <cir-value> [ gbps | kbps | mbps ] [ cbs <cbs-value> [ bytes | kbytes | mbytes ] ]",
        "undo storm suppression { broadcast | multicast | unknown-unicast }"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "broadcast",
            "Info": "Configures broadcast packet suppression.\n-"
        },
        {
            "Parameters": "multicast",
            "Info": "Configures unknown multicast packet suppression.\n-"
        },
        {
            "Parameters": "unknown-unicast",
            "Info": "Configures unknown unicast packet suppression.\n-"
        },
        {
            "Parameters": "cir <cir-value>",
            "Info": "Specifies the committed information rate (CIR), which is the allowed rate at which traffic can pass through.\nThe value is an integer that ranges from 0 kbit/s to 4294967295 kbit/s."
        },
        {
            "Parameters": "gbps",
            "Info": "Specifies the CIR in the unit of Gbit/s.\n-"
        },
        {
            "Parameters": "kbps",
            "Info": "Specifies the CIR in the unit of kbit/s.\n-"
        },
        {
            "Parameters": "mbps",
            "Info": "Specifies the CIR in the unit of Mbit/s.\n-"
        },
        {
            "Parameters": "cbs <cbs-value>",
            "Info": "Specifies the committed burst size (CBS), which is the committed volume of traffic that can pass through.\nThe value is an integer that ranges from 10000 bytes to 4294967295 bytes."
        },
        {
            "Parameters": "bytes",
            "Info": "Specifies the CBS in the unit of bytes.\n-"
        },
        {
            "Parameters": "kbytes",
            "Info": "Specifies the CBS in the unit of kbytes.\n-"
        },
        {
            "Parameters": "mbytes",
            "Info": "Specifies the CBS in the unit of Mbytes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 3",
            "[*HUAWEI-bd3] storm suppression unknown-unicast cir 100 cbs 18800"
        ]
    ],
    "ExtraInfo": ""
}