{
    "PageTitle": "storm suppression mac-address flapping",
    "FuncDef": "The storm suppression mac-address flapping command configures the threshold for MAC drift linkage traffic suppression on an interface.\nThe undo storm suppression mac-address flapping command removes the configured MAC drift linkage traffic suppression threshold for an interface. The storm suppression mac-address flapping command configures the threshold for MAC drift linkage traffic suppression on an interface. The undo storm suppression mac-address flapping command removes the configured MAC drift linkage traffic suppression threshold for an interface. By default, the percentage of bandwidth occupied by packets is 1% when traffic suppression associated with MAC address flapping is enabled.",
    "CLIs": [
        "storm suppression mac-address flapping { <percent-value> | cir <cir-value> [ kbps | mbps | gbps ] } [ force ]",
        "undo storm suppression mac-address flapping { <percent-value> | cir <cir-value> [ kbps | mbps | gbps ] } [ force ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<percent-value>",
            "Info": "Specifies a percentage, that is, the ratio of the packet rate to the interface rate.\nThe value is an integer that ranges from 1 to 100. The default value is 1."
        },
        {
            "Parameters": "cir <cir-value>",
            "Info": "Specifies the committed information rate (CIR), which is the allowed rate at which traffic can pass through.\nThe value is an integer that ranges from 1 to 400000000."
        },
        {
            "Parameters": "kbps",
            "Info": "Specifies the CIR in the unit of kbit/s.\n-"
        },
        {
            "Parameters": "mbps",
            "Info": "Specifies the CIR in the unit of Mbit/s.\n-"
        },
        {
            "Parameters": "gbps",
            "Info": "Specifies the CIR in the unit of Gbit/s.\n-"
        },
        {
            "Parameters": "force",
            "Info": "Forcibly forwards packets based on the threshold for traffic suppression associated with MAC address flapping.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] storm suppression mac-address flapping cir 100"
        ]
    ],
    "ExtraInfo": "By default, the MAC flapping linkage traffic suppression action distinguishes between packet types (unknown unicast, unknown multicast, and broadcast). The suppression threshold is configured as a percentage, and the ratio is 1%. That is, the proportions of the three types of unknown unicast, unknown multicast and broadcast are 1%. The storm suppression mac-address flapping command can be executed to make the threshold of MAC drift linkage traffic suppression on the interface flexibly configured, and can make packets to be forwarded according to the threshold of MAC drift linkage traffic suppression."
}