{
    "PageTitle": "storm suppression (interface view)",
    "FuncDef": "The storm suppression command configures the maximum volume of broadcast, unknown multicast, or unknown unicast packets that can pass through an interface.\nThe undo storm suppression command cancels the configuration. The storm suppression command configures the maximum volume of broadcast, unknown multicast, or unknown unicast packets that can pass through an interface. The undo storm suppression command cancels the configuration. By default, the percentage of bandwidth occupied by broadcast packets is 10%, the percentage of bandwidth occupied by unknown multicast packets is 100%, the percentage of bandwidth occupied by unknown unicast packets is 100%.",
    "CLIs": [
        "storm suppression { multicast | unknown-unicast } { <percent-value> | cir <cir-value> [ gbps | kbps | mbps ] [ cbs <cbs-value> [ bytes | kbytes | mbytes ] ] | packets <packets-per-second> }",
        "undo storm suppression { broadcast | multicast | unknown-unicast }",
        "storm suppression broadcast { <broadcast-percent> | cir <cir-value> [ gbps | kbps | mbps ] [ cbs <cbs-value> [ bytes | kbytes | mbytes ] ] | packets <packets-per-second> }"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,Layer 2 10GE interface view,Layer 2 200GE interface view,25GE-L2 view,400GE-L2 view,Layer 2 50GE interface view,Layer 2 GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "multicast",
            "Info": "Configures unknown multicast packet suppression.\n-"
        },
        {
            "Parameters": "unknown-unicast",
            "Info": "Configures unknown unicast packet suppression.\n-"
        },
        {
            "Parameters": "<percent-value>",
            "Info": "Specifies a percentage, that is, the ratio of the packet rate to the interface rate.\nThe value is an integer ranging from 0 to 100, in percentage."
        },
        {
            "Parameters": "cir <cir-value>",
            "Info": "Specifies the committed information rate (CIR), which is the allowed rate at which traffic can pass through.\nThe value is an integer that ranges from 0 to 400000000, in kbit/s."
        },
        {
            "Parameters": "gbps",
            "Info": "Specifies the CIR in the unit of Gbit/s.\n-"
        },
        {
            "Parameters": "kbps",
            "Info": "Specifies the CIR in the unit of kbit/s.\n-"
        },
        {
            "Parameters": "mbps",
            "Info": "Specifies the CIR in the unit of Mbit/s.\n-"
        },
        {
            "Parameters": "cbs <cbs-value>",
            "Info": "Specifies the committed burst size (CBS), which is the committed volume of traffic that can pass through.\nThe value is an integer that ranges from 10000 to 4294967295, in bytes."
        },
        {
            "Parameters": "bytes",
            "Info": "Specifies the CBS in the unit of bytes.\n-"
        },
        {
            "Parameters": "kbytes",
            "Info": "Specifies the CBS in the unit of kbytes.\n-"
        },
        {
            "Parameters": "mbytes",
            "Info": "Specifies the CBS in the unit of Mbytes.\n-"
        },
        {
            "Parameters": "packets <packets-per-second>",
            "Info": "Specifies the number of packets transmitted per second.\nThe value is an integer that ranges from 0 to 595240000."
        },
        {
            "Parameters": "broadcast",
            "Info": "Configures broadcast packet suppression.\n-"
        },
        {
            "Parameters": "<broadcast-percent>",
            "Info": "Specifies a percentage, that is, the ratio of the packet rate to the interface rate.\nThe value is an integer ranging from 0 to 100. The default value is 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] storm suppression broadcast cir 100"
        ]
    ],
    "ExtraInfo": "To rate-limit broadcast, unknown multicast, or unknown unicast packets entering an interface and prevent broadcast storms, run this command in the interface view to configure traffic suppression for the corresponding type of packets. After this command is run, the device rate-limits broadcast, unknown multicast, or unknown unicast packets on a specified interface and discards excess packets."
}