{
    "PageTitle": "storm suppression (vlan view)",
    "FuncDef": "The storm suppression command configures the maximum traffic rate in a VLAN.\nThe undo storm suppression command cancels the rate limit in a VLAN. The storm suppression command configures the maximum traffic rate in a VLAN. The undo storm suppression command cancels the rate limit in a VLAN. By default, the rate of broadcast, unknown multicast, or unknown unicast traffic is not limited in VLAN view.",
    "CLIs": [
        "storm suppression { broadcast | multicast | unknown-unicast } cir <cir-value> [ gbps | kbps | mbps ] [ cbs <cbs-value> [ bytes | kbytes | mbytes ] ]",
        "undo storm suppression { broadcast | multicast | unknown-unicast }"
    ],
    "ParentView": [
        "VLAN view"
    ],
    "ParaDef": [
        {
            "Parameters": "gbps",
            "Info": "Specifies the CIR in the unit of Gbit/s.\n-"
        },
        {
            "Parameters": "kbps",
            "Info": "Specifies the CIR in the unit of kbit/s.\n-"
        },
        {
            "Parameters": "mbps",
            "Info": "Specifies the CIR in the unit of Mbit/s.\n-"
        },
        {
            "Parameters": "cbs <cbs-value>",
            "Info": "Specifies the committed burst size (CBS), which is the committed volume of traffic that can pass through.\nThe value is an integer that ranges from 1 to 4294967295, in bytes."
        },
        {
            "Parameters": "bytes",
            "Info": "Specifies the CBS in the unit of bytes.\n-"
        },
        {
            "Parameters": "kbytes",
            "Info": "Specifies the CBS in the unit of kbytes.\n-"
        },
        {
            "Parameters": "mbytes",
            "Info": "Specifies the CBS in the unit of Mbytes.\n-"
        },
        {
            "Parameters": "broadcast",
            "Info": "Configures broadcast packet suppression.\n-"
        },
        {
            "Parameters": "multicast",
            "Info": "Configures unknown multicast packet suppression.\n-"
        },
        {
            "Parameters": "unknown-unicast",
            "Info": "Configures unknown unicast packet suppression.\n-"
        },
        {
            "Parameters": "cir <cir-value>",
            "Info": "Specifies the committed information rate (CIR), which is the allowed rate at which traffic can pass through.\nThe value is an integer that ranges from 1 to 4294967295, in kbit/s."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 2",
            "[~HUAWEI-vlan2] storm suppression broadcast cir 100 cbs 18800"
        ]
    ],
    "ExtraInfo": "To rate-limit broadcast, unknown multicast, or unknown unicast packets in a VLAN and prevent broadcast storms, run this command in the VLAN view to configure traffic suppression for the corresponding type of packets. After this command is run, the device rate-limits broadcast, unknown multicast, or unknown unicast packets in the specified VLAN view and discards excess packets."
}