{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "ip finger",
    "FuncDef": [
        "To configure a system to accept Finger protocol requests (defined in RFC 742), use the**ip finger** command in global configuration mode. To disable this service, use the **no** form of this command. "
    ],
    "CLIs": [
        "ip finger [ rfc-compliant ]",
        "no ip finger"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **rfc-compliant** ",
            "Info": " (Optional) Configures the system to wait for \"Return\" or \"/W\" input when processing Finger requests. This keyword should not be used for those systems. "
        }
    ],
    "Examples": [
        [
            "The following example disables the Finger protocol:",
            "```",
            "Router(config)# no ip finger",
            "```"
        ]
    ],
    "ExtraInfo": "The Finger service allows remote users to view the output equivalent to the **show users** [**wide**] command.When **ip finger** is configured, the router will respond to a **telnet** *a.b.c.d* **finger** command from a remote host by immediately displaying the output of the **show users** command and then closing the connection.When the **ip finger rfc-compliant** commandis configured, the router will wait for input before displaying anything (as required by RFC 1288). The remote user can then enter the Return key to display the output of the **show users** EXEC command, or enter **/W** to display the output of the **show users wide** EXEC command. After this information is displayed, the connection is closed.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)As with all minor services, the Finger service should be disabled on your system if you do not have a need for it in your network.   Any network device that has UDP, TCP, BOOTP, or Finger services should be protected by a firewall or have the services disabled to protect against Denial of Service attacks.---Because of the potential for hung lines, the **rfc-compliant** form of this command should not be configured for devices with more than 20 simultaneous users.",
    "RelatedCmds": []
}