{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "ip rcmd remote-host",
    "FuncDef": [
        "To create an entry for the remote user in a local authentication database so that remote users can execute commands on the router using remote shell protocol (rsh) or remote copy protocol (rcp), use the **ip rcmd remote-host** command in global configuration mode. To remove an entry for a remote user from the local authentication database, use the **no** form of this command. "
    ],
    "CLIs": [
        "ip rcmd remote-host <local-username> { <ip-address> | <host-name> } <remote-username> [ enable [ <level> ] ]",
        "no ip rcmd remote-host <local-username> { <ip-address> | <host-name> } <remote-username> [ enable [ <level> ] ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *local-username* ",
            "Info": " Name of the user on the local router. You can specify the router name as the username. This name needs to be communicated to the network administrator or to the user on the remote system. To be allowed to remotely execute commands on the router, the remote user must specify this value correctly. "
        },
        {
            "Parameters": " *ip-address* ",
            "Info": " IP address of the remote host from which the local router will accept remotely executed commands. Either the IP address or the host name is required. "
        },
        {
            "Parameters": " *host-name* ",
            "Info": " Name of the remote host from which the local router will accept remotely executed commands. Either the host name or the IP address is required. "
        },
        {
            "Parameters": " *remote-username* ",
            "Info": " Name of the user on the remote host from which the router will accept remotely executed commands. "
        },
        {
            "Parameters": " **enable**[*level*] ",
            "Info": " (Optional) Enables the remote user to execute privileged EXEC commands using rsh or to copy files to the router using rcp. The range is from 1 to 15. The default is 15. For information on the enable level, refer to the **privilege level** global configuration command in the Release 12.2 *Cisco IOS Security Command Reference*. "
        }
    ],
    "Examples": [
        [
            "The following example allows the remote user <named netadmin3> on a remote host with the IP address 172.16.101.101 to execute commands on <router1> using the rsh or rcp protocol. User netadmin3 is allowed to execute commands in privileged EXEC mode.",
            "```",
            "Router(config)# ip rcmd remote-host router1 172.16.101.101 netadmin3 enable",
            "```"
        ]
    ],
    "ExtraInfo": "A TCP connection to a router is established using an IP address. Using the host name is valid only when you are initiating an rcp or rsh command from a local router. The host name is converted to an IP address using DNS or host-name aliasing.To allow a remote user to execute rcp or rsh commands on a local router, you must create an entry for the remote user in the local authentication database. You must also enable the router to act as an rsh or rcp server.To enable the router to act as an rsh server, issue the**ip rcmd rsh-enable** command. To enable the router to act as an rcp server, issue the **ip rcmd rcp-enable** command.The router cannot act as a server for either of these protocols unless you explicitly enable the capacity.A local authentication database, which is similar to a UNIX *.rhosts* file, is used to enforce security on the router through access control. Each entry that you configure in the authentication database identifies the local user, the remote host, and the remote user. To permit a remote user of rsh to execute commands in privileged EXEC mode or to permit a remote user of rcp to copy files to the router, specify the **enable** keyword and level. For information on the enable level, refer to the **privilege level** global configuration command in the Release 12.2 *Cisco IOS Security Command Reference*.An entry that you configure in the authentication database differs from an entry in a UNIX *.rhosts* file in the following aspect. Because the *.rhosts* file on a UNIX system resides in the home directory of a local user account, an entry in a UNIX*.rhosts* file need not include the local username; the local username is determined from the user account. To provide equivalent support on a router, specify the local username along with the remote host and remote username in each authentication database entry that you configure.For a remote user to be able to execute commands on the router in its capacity as a server, the local username, host address or name, and remote username sent with the remote client request must match values configured in an entry in the local authentication file.A remote client host should be registered with DNS. The Cisco IOS software uses DNS to authenticate the remote host's name and address. Because DNS can return several valid IP addresses for a host name, the Cisco IOS software checks the address of the requesting client against all of the IP addresses for the named host returned by DNS. If the address sent by the requester is considered invalid, that is, it does not match any address listed with DNS for the host name, then the software will reject the remote-command execution request.Note that if no DNS servers are configured for the router, then that device cannot authenticate the host in this manner. In this case, the Cisco IOS software sends a broadcast request to attempt to gain access to DNS services on another server. If DNS services are not available, you must use the **no****ip domain-lookup** command to disable the attempt to gain access to a DNS server by sending a broadcast request.If DNS services are not available and, therefore, you bypass the DNS security check, the software will accept the request to remotely execute a command only if all three values sent with the request match exactly the values configured for an entry in the local authentication file.",
    "RelatedCmds": [
        {
            "cmd": " **ip rcmd rcp-enable** ",
            "description": " Configures the Cisco IOS software to allow remote users to copy files to and from the router. "
        },
        {
            "cmd": " **ip domain-lookup** ",
            "description": " Enables the IP DNS-based host name-to-address translation. "
        },
        {
            "cmd": " **ip rcmd rsh-enable** ",
            "description": " Configures the router to allow remote users to execute commands on it using the rsh protocol. "
        }
    ]
}