{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "ip rarp-server",
    "FuncDef": [
        "To enable the router to act as a Reverse Address Resolution Protocol (RARP) server, use the **ip rarp-server** command in interface configuration mode. To restore the interface to the default of no RARP server support, use the **no** form of this command. "
    ],
    "CLIs": [
        "ip rarp-server <ip-address>",
        "no ip rarp-server <ip-address>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *ip-address* ",
            "Info": " IP address that is to be provided in the source protocol address field of the RARP response packet. Normally, this is set to whatever address you configure as the primary address for the interface. "
        }
    ],
    "Examples": [
        [
            "The following partial example configures a router to act as a RARP server. The router is configured to use the primary address of the specified interface in its RARP responses.",
            "```",
            "arp 172.30.2.5 0800.2002.ff5b arpa",
            "```",
            "```",
            "interface ethernet 0",
            "```",
            "```",
            "ip address 172.30.3.100 255.255.255.0",
            "```",
            "```",
            "ip rarp-server 172.30.3.100",
            "```",
            "```",
            "```",
            "In the following example, a router is configured to act as a RARP server, with TFTP and portmapper requests forwarded to the Sun server:",
            "```",
            "! Allow the router to forward broadcast portmapper requests",
            "```",
            "```",
            "ip forward-protocol udp 111",
            "```",
            "```",
            "! Provide the router with the IP address of the diskless sun",
            "```",
            "```",
            "arp 172.30.2.5 0800.2002.ff5b arpa",
            "```",
            "```",
            "interface ethernet 0",
            "```",
            "```",
            "! Configure the router to act as a RARP server, using the Sun Server's IP",
            "```",
            "```",
            "! address in the RARP response packet.",
            "```",
            "```",
            "ip rarp-server 172.30.3.100",
            "```",
            "```",
            "! Portmapper broadcasts from this interface are sent to the Sun Server.",
            "```",
            "```",
            "ip helper-address 172.30.3.100",
            "```"
        ]
    ],
    "ExtraInfo": "This feature makes diskless booting of clients possible between network subnets where the client and server are on separate subnets.RARP server support is configurable on a per-interface basis, so that the router does not interfere with RARP traffic on subnets that need no RARP assistance.The Cisco IOS software answers incoming RARP requests only if both of the following two conditions are met:•![](/c/dam/en/us/td/i/templates/blank.gif)The **ip rarp-server** command has been configured for the interface on which the request was received.•![](/c/dam/en/us/td/i/templates/blank.gif)A static entry is found in the IP ARP table that maps the MAC address contained in the RARP request to an IP address.Use the **show ip arp** EXEC command to display the contents of the IP ARP cache.Sun Microsystems, Inc. makes use of RARP and UDP-based network services to facilitate network-based booting of SunOS on it's workstations. By bridging RARP packets and using both the **ip helper-address** interface configuration command and the **ip forward-protocol** global configuration command, the Cisco IOS software shouldbe able to perform the necessary packet switching to enable booting of Sun workstations across subnets. Unfortunately, some Sun workstations assume that the sender of the RARP response, in this case the router, is the host that the client can contact to TFTP load the bootstrap image. This causes the workstations to fail to boot.By using the **ip rarp-server** command, the Cisco IOS software can be configured to answer these RARP requests, and the client machine should be able to reach its server by having its TFTP requests forwarded through the router that acts as the RARP server.In the case of RARP responses to Sun workstations attempting to diskless boot, the IP address specified in the **ip rarp-server** interface configuration command should be the IP address of the TFTP server. In addition to configuring RARP service, the Cisco IOS software must be configured to forward UDP-based Sun portmapper requests to completely support diskless booting of Sun workstations. This can be accomplished using configuration commands of the following form:```ip forward-protocol udp 111``````interface interface name``````ip helper-address target-address``````  ```RFC 903 documents the RARP.",
    "RelatedCmds": [
        {
            "cmd": " **ip forward-protocol** ",
            "description": " Speeds up flooding of UDP datagrams using the spanning-tree algorithm. "
        },
        {
            "cmd": " **ip helper-address** ",
            "description": " Forwards UDP broadcasts, including BOOTP, received on an interface. "
        }
    ]
}