{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "ip rcmd remote-username",
    "FuncDef": [
        "To configure the remote username to be used when requesting a remote copy using remote copy protocol (rcp), use the **ip rcmd remote-username** command in global configuration mode. To remove from the configuration the remote username, use the **no** form of this command. "
    ],
    "CLIs": [
        "ip rcmd remote-username <username>",
        "noip rcmd remote-username <username>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *username* ",
            "Info": " Name of the remote user on the server. This name is used for rcp copy requests. All files and images to be copied are searched for or written relative to the directory of the remote user's account, if the server has a directory structure, for example, as do UNIX systems. "
        }
    ],
    "Examples": [
        [
            "The following example configures the remote <username> to netadmin1:",
            "```",
            "Router(config)# ip rcmd remote-<username> netadmin1",
            "```"
        ]
    ],
    "ExtraInfo": "The rcp protocol requires that a client send the remote username on an rcp request to the server. Use this command to specify the remote username to be sent to the server for an rcp copy request. If the server has a directory structure, as do UNIX systems, all files and images to be copied are searched for or written relative to the directory of the remote user's account.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)Cisco IOS Release 10.3 added the **ip** keyword to **rcmd** commands. If you are upgrading from Release 10.2 to Release 10.3 or a later release, this keyword is automatically added to any **rcmd** commands you have in your Release 10.2 configuration files.---",
    "RelatedCmds": [
        {
            "cmd": " **boot network rcp** ",
            "description": " Changes the default name of the network configuration file from which to load configuration commands. "
        },
        {
            "cmd": " **boot system rcp** ",
            "description": " Specifies the system image that the router loads at startup. "
        },
        {
            "cmd": " **bridge acquire** ",
            "description": " Forwards any frames for stations that the system has learned about dynamically. "
        },
        {
            "cmd": " **copy** ",
            "description": " Copies any file from a source to a destination. "
        }
    ]
}