{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "ip rcmd source-interface",
    "FuncDef": [
        "To force remote copy protocol (rcp) or remote shell protocol (rsh) to use the IP address of a specified interface for all outgoing rcp/rsh communication packets, use the **ip rcmd source-interface** command in global configuration mode. To disable a previously configured **ip rcmd source-interface** command, use the **no** form of this command. "
    ],
    "CLIs": [
        "ip rcmd source-interface <interface-id>",
        "no ip rcmd source-interface <interface-id>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *interface-id* ",
            "Info": " The name and number used to identify the interface. For example, Loopback2. "
        }
    ],
    "Examples": [
        [
            "In the following example, Loopback interface 0 is assigned an IP address of 220.144.159.200, and the ip rcmd source-interface command is used to specify that the source IP address for all rcp/rsh packets will be the IP address assigned to the Loopback0 interface:",
            "interface Loopback0",
            "description Loopback interface",
            "ip address 220.144.159.200 255.255.255.255",
            "no ip directed-broadcast",
            "!",
            ".",
            ".",
            ".",
            "clock timezone GMT 0",
            "ip subnet-zero",
            "no ip source-route",
            "no ip finger",
            "ip rcmd source-interface Loopback0",
            "ip telnet source-interface Loopback0",
            "ip tftp source-interface Loopback0",
            "ip ftp source-interface Loopback0",
            "ip ftp username cisco",
            "ip ftp password shhhhsecret",
            "no ip bootp server",
            "ip domain-name net.galaxy",
            "ip name-server 220.144.159.1",
            "ip name-server 220.144.159.2",
            "ip name-server 219.10.2.1",
            "!",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```",
            "```",
            ".",
            "```"
        ]
    ],
    "ExtraInfo": "If this command is not used, or if the interface specified in this command is not available (not up), the Cisco IOS software uses the address of the interface closest to the destination as the source address.Use this command to force the system to tag all outgoing rcp/rsh packets with the IP address associated with the specified interface. This address is used as the source address as long as the interface is in the up state.This command is especially useful in cases where the router has many interfaces, and you want to ensure that all rcp and/or rsh packets from this router have the same source IP address. A consistent address is preferred so that the other end of the connection (the rcp/rsh server or client) can maintain a single session. The other benefit of a consistent address is that an access list can be configured on the remote device.The specified interface must have an IP address associated with it. If the specified interface does not have an IP address or is in a down state, then rcp/rsh reverts to the default. To avoid this, add an IP address to the subinterface or bring the interface to the up state.",
    "RelatedCmds": [
        {
            "cmd": " **ip rcmd remote-host** ",
            "description": " Creates an entry for the remote user in a local authentication database so that remote users can execute commands on the router using rsh or rcp. "
        }
    ]
}