{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "tdm clock priority",
    "FuncDef": [
        "To configure the clock source and priority of the clock source used by the time-division multiplexing (TDM) bus on the Cisco AS5350, AS5400, and AS5850 access servers, use the **tdm clock priority** command in global configuration mode. To return the clock source and priority to the default values, use the **no** form of this command. "
    ],
    "CLIs": [
        "tdm clock priority <priority-number> { <slot>/<ds1-port> | <slot>/<ds3-port>:<ds1-port> | external | freerun }",
        "no tdm clock priority <priority-number> { <slot>/<ds1-port> | <slot>/<ds3-port>:<ds1-port> | external | freerun }"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *priority-number* ",
            "Info": " Priority of the clock source. The priority range is from 1 to 99. A clock set to priority 100 will not drive the TDM bus. "
        },
        {
            "Parameters": " *slot*/*ds1-port* ",
            "Info": " Trunk-card slot is a value from 1 to 7. DS1 port number controller is a value between 0 and 7. Specify with a slash separating the numbers; for example, 1/1. "
        },
        {
            "Parameters": " *slot*/*ds3-port*:*ds1-port* ",
            "Info": " Trunk-card slot is a value from 1 to 7. DS3 port specifies the T3 port. DS1 port number controller is a value from 1 to 28. Specify with a slash separating the slot and port numbers, and a colon separating the DS1 port number. An example is 1/0:19. "
        },
        {
            "Parameters": " **external** ",
            "Info": " Synchronizes the TDM bus with an external clock source that can be used as an additional network reference. "
        },
        {
            "Parameters": " **freerun** ",
            "Info": " Selects the free-running clock from the local oscillator when there is no good clocking source from a trunk card or an external clock source. "
        }
    ],
    "Examples": [
        [
            "In the following example, BITS clock is set at priority 1:",
            "```",
            "AS5400(config)# tdm clock priority priority 1 external",
            "```",
            "```",
            "```",
            "In the following example, a trunk clock from a CT1 trunk card is set at priority 2 and uses <<slot>> 4 and DS1 port (controller) 6:",
            "```",
            "AS5400(config)# tdm clock priority priority 2 4/6",
            "```",
            "```",
            "```",
            "In the following example, a trunk clock from a CT3 trunk card is set at priority 2 and uses <<slot>> 1, DS3 port 0, and DS1 port 19:",
            "```",
            "AS5400(config)# tdm clock priority priority 2 1/0:19",
            "```",
            "```",
            "```",
            "In the following example, free-running clock is set at priority 3:",
            "```",
            "AS5400(config)# tdm clock priority priority 3 freerun",
            "```"
        ]
    ],
    "ExtraInfo": "The TDM bus can receive an input clock from one of three sources on the gateway:•![](/c/dam/en/us/td/i/templates/blank.gif)CT1, CE1, and CT3 trunk cards•![](/c/dam/en/us/td/i/templates/blank.gif)An external T1/E1 clock source feed directly through the Building Integrated Timing Supply (BITS) interface port on the motherboard•![](/c/dam/en/us/td/i/templates/blank.gif)Free-running clock providing clock from an oscillator![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)BITS is a single building master timing supply. BITS generally supplies DS1- and DS0-level timing throughout an office. BITS is the clocks that provide and distribute timing to a wireline network's lower levels.---Trunk-Card PortsThe TDM bus can be synchronized with any trunk cards. On the CT1/CE1 trunk card, each port receives the clock from the T1/E1 line. The CT3 trunk card uses an M13 multiplexer to receive the DS1 clock. Each port on each trunk-card slot has a default clock priority. Also, clock priority is configurable through the **tdm clock priority** command.External ClockThe TDM bus can be synchronized with an external clock source that can be used as an additional network reference. If no clocks are configured, the system uses a primary clock through a software-controlled default algorithm. If you want the external T1/E1 clock (from the BITS interface) as the primary clock source, you must configure it using the **external** keyword with the **tdm clock priority** command; the external clock is never selected by default.The BITS interface requires a T1 line composite clock reference set at 1.544 MHz and an E1 line composite clock reference set at 2.048 MHz.Free-Running ClockIf there is no good clocking source from a trunk card or an external clock source, then select the free-running clock from the internal oscillator using the **freerun** keyword with the **tdm clock priority** command.",
    "RelatedCmds": [
        {
            "cmd": " **dial-tdm-clock** ",
            "description": " Configures the clock source and priority of the clock source used by the TDM bus on the dial shelf of the Cisco AS5800. "
        },
        {
            "cmd": " **show tdm clocks** ",
            "description": " Displays default system clocks and clock history. "
        }
    ]
}