{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "terminal history",
    "FuncDef": [
        "To enable the command history function with 10 lines for the current terminal session, use the **terminal history** command in user EXEC or privileged EXEC mode. To disable the command history function, use the **no** form of this command. "
    ],
    "CLIs": [
        "terminal history",
        "terminal no history"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "In the following example, the command history feature is disabled for the current terminal session:",
            "```",
            "Router> terminal no history",
            "```"
        ]
    ],
    "ExtraInfo": "The history function provides a record of commands you have entered. This function is particularly useful for recalling long or complex commands or entries for the purposes of modifying them slightly and reexecuting them.The **terminal history** command enables the command history function with the default buffer size or the last buffer size specified using the **terminal history size** command.Table 1 lists the keys and functions you can use to recall commands from the history buffer.Table 166 History Keys| Key(s) | Function || --- | --- || Ctrl-P or Up Arrow[1](#wp1033177) | Recalls commands in the history buffer in a backward sequence, beginning with the most recent command. Repeat the key sequence to recall successively older commands. || Ctrl-N or Down Arrow1 | Returns to more recent commands in the history buffer after recalling commands with Ctrl-P or the Up Arrow. Repeat the key sequence to recall successively more recent commands. || [1](#wp1033178) The arrow keys function only with ANSI-compatible terminals. || --- |  ",
    "RelatedCmds": [
        {
            "cmd": " **history** ",
            "description": " Enables the command history function, or changes the command history buffer size for a particular line. "
        },
        {
            "cmd": " **show history** ",
            "description": " Lists the commands you have entered in the current EXEC session. "
        },
        {
            "cmd": " **terminal history size** ",
            "description": " Sets the size of the history buffer for the command history feature for the current terminal session. "
        }
    ]
}