{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "terminal telnet break-on-ip",
    "FuncDef": [
        "To cause an access server to generate a hardware Break signal when an interrupt-process (ip) command is received, use the **terminal telnet break-on-ip** command in EXEC mode. "
    ],
    "CLIs": [
        "terminal telnet break-on-ip"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": "No parameters.",
            "Info": "This commmand has no arguments or keywords."
        }
    ],
    "Examples": [
        [
            "In the following example, a Break signal is generated for the current connection when an interrupt-process command is issued:",
            "```",
            "Router# terminal telnet break-on-ip",
            "```"
        ]
    ],
    "ExtraInfo": "The hardware Break signal occurs when a Telnet interrupt-process (ip) command is received on that connection. The **terminal telnet break-on-ip** command can be used to control the translation of Telnet interrupt-process commands into X.25 Break indications.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)In this command, the acronym \"ip\" indicates \"interrupt-process,\" not Internet Protocol (IP).---This command is also a useful workaround in the following situations:•![](/c/dam/en/us/td/i/templates/blank.gif)Several user Telnet programs send an ip command, but cannot send a Telnet Break signal.•![](/c/dam/en/us/td/i/templates/blank.gif)Some Telnet programs implement a Break signal that sends an ip command.Some EIA/TIA-232 hardware devices use a hardware Break signal for various purposes. A hardware Break signal is generated when a Telnet Break command is received.You can verify if this command is enabled with the **show terminal** EXEC command. If enabled the following line will appear in the output: `Capabilities: Send BREAK on IP`.",
    "RelatedCmds": [
        {
            "cmd": " **terminal telnet ip-on-break** ",
            "description": " Configures the system to send an interrupt-process (ip) signal when the Break command is issued. "
        }
    ]
}