{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "terminal special-character-bits",
    "FuncDef": [
        "To change the ASCII character widths to accept special characters for the current terminal line and session, use the **terminal special-character-bits** command in EXEC mode. "
    ],
    "CLIs": [
        "terminal special-character-bits { 7 | 8 }"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " **7** ",
            "Info": " Selects the 7-bit ASCII character set. This is the default. "
        },
        {
            "Parameters": " **8** ",
            "Info": " Selects the full 8-bit ASCII character set. "
        }
    ],
    "Examples": [
        [
            "The following example temporarily configures a router to use a full 8-bit user interface for system banners and prompts.",
            "```",
            "Router# terminal special-character-bits 8",
            "```"
        ]
    ],
    "ExtraInfo": "Configuring the width to 8 bits enables you to use twice as many special characters as with the 7-bit setting. This selection enables you to add special graphical and international characters in banners, prompts, and so on.This command is useful, for example, if you want the router to provide temporary support for international character sets. It overrides the **default-value special-character-bits** global configuration command and is used to compare character sets typed by the user with the special character available during a data connection, which includes software flow control and escape characters.When you exit the session, character width is reset to the width established by the **default-value exec-character-bits** global configuration command.Note that setting the EXEC character width to eight bits can cause failures. For example, if a user on a terminal that is sending parity enters the **help** command, an \"unrecognized command\" message appears because the Cisco IOS software is reading all eight bits, and the eighth bit is not needed for the **help** command.",
    "RelatedCmds": [
        {
            "cmd": " **default-value exec-character-bits** ",
            "description": " Globally defines the character width as 7-bit or 8-bit. "
        },
        {
            "cmd": " **special-character-bits** ",
            "description": " Configures the number of data bits per character for special characters such as software flow control characters and escape characters. "
        }
    ]
}