{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "time-period",
    "FuncDef": [
        "To set the time increment for automatically saving an archive file of the current running configuration in the Cisco IOS configuration archive, use the **time-period** command in archive configuration mode. To disable this function, use the **no** form of this command. "
    ],
    "CLIs": [
        "time-period <minutes>",
        "no time-period <minutes>"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *minutes* ",
            "Info": " Specifies how often, in minutes, to automatically save an archive file of the current running configuration in the Cisco IOS configuration archive. "
        }
    ],
    "Examples": [
        [
            "In the following example, a value of 20 <minutes> is set as the time increment for which to automatically save an archive file of the current running configuration in the Cisco IOS configuration archive:",
            "```",
            "Router# configure terminal",
            "```",
            "```",
            "!",
            "```",
            "```",
            "Router(config)# archive",
            "```",
            "```",
            "Router(config-archive)# path disk0:myconfig",
            "```",
            "```",
            "Router(config-archive)# time-period 20",
            "```",
            "```",
            "Router(config-archive)# end",
            "```"
        ]
    ],
    "ExtraInfo": "![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)Before using this command, you must configure the **path** command to specify the location and filename prefix for the files in the Cisco IOS configuration archive.---If this command is configured, an archive file of the current running configuration is automatically saved after the given time specified by the *minutes* argument. Archive files continue to be automatically saved at this given time increment until this function is disabled. Use the **maximum** command to set the maximum number of archive files of the running configuration to be saved.![](/c/dam/en/us/td/i/templates/note.gif)---**Note** ![](/c/dam/en/us/td/i/templates/blank.gif)This command saves the current running configuration to the configuration archive whether or not the running configuration has been modified since the last archive file was saved.---",
    "RelatedCmds": [
        {
            "cmd": " **archive config** ",
            "description": " Saves a copy of the current running configuration to the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **configure confirm** ",
            "description": " Confirms replacement of the current running configuration with a saved Cisco IOS configuration file. "
        },
        {
            "cmd": " **configure replace** ",
            "description": " Replaces the current running configuration with a saved Cisco IOS configuration file. "
        },
        {
            "cmd": " **maximum** ",
            "description": " Sets the maximum number of archive files of the running configuration to be saved in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **path** ",
            "description": " Specifies the location and filename prefix for the files in the Cisco IOS configuration archive. "
        },
        {
            "cmd": " **show archive** ",
            "description": " Displays information about the files saved in the Cisco IOS configuration archive. "
        }
    ]
}