{
    "PageTitle": "peer-address",
    "FuncDef": "The peer-address command configures an IP address, a port number, and a VPN instance for a destination group of a gRPC client.\nThe undo peer-address command deletes the IP address, port number, and VPN instance of a destination group of a gRPC client. The peer-address command configures an IP address, a port number, and a VPN instance for a destination group of a gRPC client. The undo peer-address command deletes the IP address, port number, and VPN instance of a destination group of a gRPC client. By default, no IP address, port number, or VPN instance is configured for a destination group of a gRPC client.",
    "CLIs": [
        "peer-address ipv4 <ip-address-ipv4> port <port-value> [ vpn-instance <vpn-name> ]",
        "peer-address ipv6 <ip-address-ipv6> port <port-value> [ vpn-instance <vpn-name> ]",
        "undo peer-address ipv4 <ip-address-ipv4> port <port-value> [ vpn-instance <vpn-name> ]",
        "undo peer-address ipv6 <ip-address-ipv6> port <port-value> [ vpn-instance <vpn-name> ]"
    ],
    "ParentView": [
        "grpc-client-destination-group view"
    ],
    "ParaDef": [
        {
            "Parameters": "port <port-value>",
            "Info": "Specifies the port number of the destination group.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "vpn-instance <vpn-name>",
            "Info": "Specifies the name of the VPN instance to which the destination group belongs.\nThe value is a string of 1 to 31 characters. The value must be the name of an existing VPN instance on the device."
        },
        {
            "Parameters": "ipv6 <ip-address-ipv6>",
            "Info": "Specifies the IPv6 address of the destination group.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "ipv4 <ip-address-ipv4>",
            "Info": "Specifies the IPv4 address of the destination group.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] grpc",
            "[~HUAWEI-grpc] grpc client",
            "[~HUAWEI-grpc-client] destination-group dest",
            "[*HUAWEI-grpc-client-destination-group-dest] peer-address ipv4 10.1.1.1 port 10001"
        ]
    ],
    "ExtraInfo": "After a destination group is created for a gRPC client, run this command to configure an IP address, a port number, and a VPN instance for the destination group."
}