{
    "PageTitle": "ssl-policy (GRPC client view)",
    "FuncDef": "The ssl-policy command enables a client to perform SSL verification on a server.\nThe undo ssl-verify command disables a client from performing SSL verification on a server. The ssl-policy command enables a client to perform SSL verification on a server. The undo ssl-verify command disables a client from performing SSL verification on a server. By default, no SSL policy is configured for a gRPC client.",
    "CLIs": [
        "ssl-policy <ssl-policy-name> [ verify-san <san> ]",
        "undo ssl-policy [ <ssl-policy-name> [ verify-san <san> ] ]"
    ],
    "ParentView": [
        "GRPC client view"
    ],
    "ParaDef": [
        {
            "Parameters": "verify-san <san>",
            "Info": "Specifies the SAN name of the certificate on the server.\nThe value is a string of 1 to 255 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "ssl-policy <ssl-policy-name>",
            "Info": "Specifies the name of an SSL policy.\nThe value is a string of 1 to 23 case-sensitive characters. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy policy2",
            "[*HUAWEI-ssl-policy-policy2] quit",
            "[*HUAWEI] grpc",
            "[*HUAWEI-grpc] grpc client",
            "[*HUAWEI-grpc-client] ssl-policy policy2"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy policy2",
            "[*HUAWEI-ssl-policy-policy2] pki-domain default",
            "Warning: A preset certificate is loaded to the specified PKI domain. The current operation has security risks. Continue? [Y/N]:y",
            "[*HUAWEI-ssl-policy-policy2] quit",
            "[*HUAWEI] grpc",
            "[*HUAWEI-grpc] grpc client",
            "[*HUAWEI-grpc-client] ssl-policy policy2",
            "Warning: A preset certificate is loaded to the PKI domain bound to the specified SSL policy. The current operation has security risks. Continue? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "When you create a gRPC-based static subscription, an insecure TCP connection is set up between the device functioning as a client and the collector functioning as a server. In this case, you can run the ssl-policy command to configure an SSL policy for the client to establish a secure SSL connection with the server.\nTo ensure device information security, you are advised to load the obtained certificate to the SSL policy. It is not recommended to use the initial certificate."
}