{
    "PageTitle": "ssl-policy (GRPC server view)",
    "FuncDef": "The ssl-policy command configures an SSL policy for the gRPC service.\nThe undo ssl-policy command deletes an SSL policy of the gRPC service. The ssl-policy command configures an SSL policy for the gRPC service. The undo ssl-policy command deletes an SSL policy of the gRPC service. By default, no SSL policy is configured for the gRPC service.",
    "CLIs": [
        "ssl-policy <ssl-policy-name>",
        "undo ssl-policy [ <ssl-policy-name> ]"
    ],
    "ParentView": [
        "GRPC server view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ssl-policy-name>",
            "Info": "Specifies the name of an SSL policy. The value must be the name of an existing SSL policy.\nThe value is a string of 1 to 23 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy policy1",
            "[*HUAWEI-ssl-policy-policy1] quit",
            "[*HUAWEI] grpc",
            "[*HUAWEI-grpc] grpc server",
            "[*HUAWEI-grpc-server] ssl-policy policy1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy policy2",
            "[*HUAWEI-ssl-policy-policy2] pki-domain default",
            "Warning: A preset certificate is loaded to the specified PKI domain. The current operation has security risks. Continue? [Y/N]:y",
            "[*HUAWEI-ssl-policy-policy2] quit",
            "[*HUAWEI] grpc",
            "[*HUAWEI-grpc] grpc server",
            "[*HUAWEI-grpc-server] ssl-policy policy2",
            "Warning: A preset certificate is loaded to the PKI domain bound to the specified SSL policy. The current operation has security risks. Continue? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "If a collector functioning as a client initiates a connection to a device functioning as a server, the data sampled is dynamically subscribed to. In this case, you can configure an SSL policy for the gRPC service. This ensures that a secure SSL connection can be established between the server and client.\nTo ensure device information security, you are advised to load the obtained certificate to the SSL policy. It is not recommended to use the initial certificate."
}