{
    "PageTitle": "bfd all-interfaces enable (OSPFv3 view)",
    "FuncDef": "The bfd all-interfaces incr-cost command enables an OSPFv3 process to adjust the cost based on BFD.\nThe undo bfd all-interfaces incr-cost command disables an OSPFv3 process from adjusting the cost based on BFD.\nThe bfd all-interfaces enable command enables BFD for OSPFv3.\nThe undo bfd all-interfaces enable command disables BFD for OSPFv3. The bfd all-interfaces incr-cost command enables an OSPFv3 process to adjust the cost based on BFD. The undo bfd all-interfaces incr-cost command disables an OSPFv3 process from adjusting the cost based on BFD. The bfd all-interfaces enable command enables BFD for OSPFv3. The undo bfd all-interfaces enable command disables BFD for OSPFv3. By default, an OSPFv3 process does not adjust the cost based on BFD.\n\n\nBy default, BFD is not enabled for OSPFv3. By default, an OSPFv3 process does not adjust the cost based on BFD. By default, BFD is not enabled for OSPFv3. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "bfd all-interfaces enable",
        "bfd all-interfaces incr-cost { <cost> | max-reachable }",
        "undo bfd all-interfaces enable",
        "undo bfd all-interfaces incr-cost [ <cost> | max-reachable ]"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "incr-cost <cost>",
            "Info": "Specifies a cost adjustment value.\nThe value is an integer that ranges from 1 to 65534 ."
        },
        {
            "Parameters": "max-reachable",
            "Info": "Adjusts the link cost of an OSPFv3 interface to the maximum link cost 65535.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 100",
            "[*HUAWEI-ospfv3-100] bfd all-interfaces enable",
            "[*HUAWEI-ospfv3-100] bfd all-interfaces incr-cost 5"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] bfd all-interfaces enable"
        ]
    ],
    "ExtraInfo": "Either a link fault or topology change on a network will cause routes to be re-calculated within an area. As such, speeding up the convergence of a routing protocol is critical to improving the network performance.\nAs link faults are inevitable, rapidly detecting these faults and notifying routing protocols is an effective way to quickly resolve such issues. This includes associating BFD with a routing protocol to speed up convergence of the routing protocol once a link fault occurs."
}