{
    "PageTitle": "default-route-advertise (OSPFv3 view)",
    "FuncDef": "The default-route-advertise command advertises the default route to a common OSPFv3 area.\nThe undo default-route-advertise command disables advertisement of default routes to a common OSPFv3 area. The default-route-advertise command advertises the default route to a common OSPFv3 area. The undo default-route-advertise command disables advertisement of default routes to a common OSPFv3 area. By default, the OSPFv3 devices in common OSPFv3 areas do not generate default routes. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "default-route-advertise [ [ always | permit-calculate-other ] | cost <cost> | type <type> | tag <tag> | distribute-delay <delay> | { route-policy <route-policy-name> } ]",
        "default-route-advertise [ permit-calculate-other | cost <cost> | type <type> | tag <tag> | distribute-delay <delay> | { route-policy <route-policy-name> } | permit-preference-less-than <preference-value> ]",
        "undo default-route-advertise"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "always",
            "Info": "Generates and advertises an LSA that describes a default route, regardless of whether the local device has active default routes from processes other than the local OSPFv3 process. The device that is configured with always does not calculate default routes of other devices. If this keyword is not specified, the LSA for a default route is generated only when the routing table of the local device has active default routes from processes other than the local OSPFv3 process.\n-"
        },
        {
            "Parameters": "permit-calculate-other",
            "Info": "Configures the device to calculate default Type 5 LSAs from other devices if this parameter is specified and the OSPFv3 process has advertised Type 5 LSAs that describe default routes. If this parameter is not specified, the OSPFv3 process does not calculate default Type 5 LSAs from other devices.\nIf an OSPFv3 process does not advertise Type 5 LSAs that describe a default route, the OSPFv3 process calculates the default Type 5 LSAs from other devices, regardless of whether this parameter is specified.\n-"
        },
        {
            "Parameters": "cost <cost>",
            "Info": "Specifies the cost of the external routes.\nThe cost of a Type 1 external route equals the cost of the route from the Router to the related ASBR plus the cost of the route from the ASBR to the destination.The cost of a Type 2 external route equals the cost of the route from the ASBR to the destination.\nThe value is an integer ranging from 0 to 16777214. The default value is 1."
        },
        {
            "Parameters": "type <type>",
            "Info": "Specifies the type of the external routes.\nThe value is 1 or 2.\n1: Type 1 external route2: Type 2 external route\nThe default value is 2."
        },
        {
            "Parameters": "tag <tag>",
            "Info": "Specifies the tag of the routes imported into VPN.\nThe value is an integer ranging from 0 to 4294967295. The default value is 1."
        },
        {
            "Parameters": "distribute-delay <delay>",
            "Info": "Specifies the delay timer for advertising the default route.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a route-policy. When a device's routing table contains matching default routes that are generated from processes other than the local OSPFv3 process, a device advertises the default routes based on the route-policy configuration.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "permit-preference-less-than <preference-value>",
            "Info": "Allows the device to import the default route whose preference value is smaller than the configured value.\nThe value is an integer ranging from 1 to 256."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] default-route-advertise always"
        ]
    ],
    "ExtraInfo": "The import-route (OSPFv3) command cannot import external default routes. To import the default routes generated by other protocols, you must run the default-route-advertise command on the ASBR to advertise the default routes to the entire common OSPFv3 areas.\nIf the ASBR already has a default route, running the default-route-advertise command will advertise the default route 0.0.0.0 in the entire OSPF areas.\nIf the ASBR does not have a default route, determine whether to specify always when running the default-route-advertise command."
}