{
    "PageTitle": "display ospfv3 abr-summary-list",
    "FuncDef": "The display ospfv3 abr-summary-list command displays information about OSPFv3 summary routes on an area border router (ABR).\nThe display ospfv3 asbr-summary command displays information about OSPFv3 summary routes on an AS boundary router (ASBR). The display ospfv3 abr-summary-list command displays information about OSPFv3 summary routes on an area border router (ABR). The display ospfv3 asbr-summary command displays information about OSPFv3 summary routes on an AS boundary router (ASBR). This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display ospfv3 [ <process-id> ] abr-summary-list [ <prefix> <prefix-length> ]",
        "display ospfv3 [ <process-id> ] asbr-summary [ <prefix> <prefix-length> ] [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<process-id>",
            "Info": "Displays information about summary routes in the specified OSPFv3 process.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "<prefix>",
            "Info": "Specifies the IPv6 address.\nThe value is a 32-digit hexadecimal number, in the format X:X::X:X."
        },
        {
            "Parameters": "<prefix-length>",
            "Info": "Specifies the prefix length of an IPv6 address.\nIt is an integer ranging from 0 to 128."
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about OSPFv3 summary routes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ospfv3 asbr-summary",
            "2001:DB8::                                 32           3 [Active]       Advertised"
        ],
        [
            "<HUAWEI> display ospfv3 abr-summary-list",
            "2001:DB8::                             32           1 [Active]       Advertised"
        ],
        [
            "<HUAWEI> display ospfv3 asbr-summary verbose"
        ]
    ],
    "ExtraInfo": ""
}