{
    "PageTitle": "filter (OSPFv3 area view)",
    "FuncDef": "The filter export command filters outgoing Type-3 LSAs (Inter-Area-Prefix-LSAs) of the local area.\nThe undo filter export command restores the default setting.\nThe filter import command filters the incoming Type-3 LSAs (Inter-Area-Prefix-LSAs) of the local area.\nThe undo filter import command restores the default setting. The filter export command filters outgoing Type-3 LSAs (Inter-Area-Prefix-LSAs) of the local area. The undo filter export command restores the default setting. The filter import command filters the incoming Type-3 LSAs (Inter-Area-Prefix-LSAs) of the local area. The undo filter import command restores the default setting. By default, outgoing Type-3 LSAs of the local area are not filtered.\n\n\nBy default, the incoming Type-3 LSAs are not filtered. By default, outgoing Type-3 LSAs of the local area are not filtered. By default, the incoming Type-3 LSAs are not filtered. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "filter { acl6-name <acl6-name> | ipv6-prefix <ipv6-prefix-name> | route-policy <route-policy-name> } export",
        "filter { acl6-name <acl6-name> | ipv6-prefix <ipv6-prefix-name> | route-policy <route-policy-name> } import",
        "filter <acl6-number> export",
        "filter <acl6-number> import",
        "undo filter [ acl6-name <acl6-name> | ipv6-prefix <ipv6-prefix-name> | route-policy <route-policy-name> | <acl6-number> ] export",
        "undo filter [ acl6-name <acl6-name> | ipv6-prefix <ipv6-prefix-name> | route-policy <route-policy-name> | <acl6-number> ] import"
    ],
    "ParentView": [
        "OSPFv3 area view"
    ],
    "ParaDef": [
        {
            "Parameters": "acl6-name <acl6-name>",
            "Info": "Specifies the name of a named basic ACL.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "ipv6-prefix <ipv6-prefix-name>",
            "Info": "Specifies the name of an IP prefix list.\nThe value is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a routing policy.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "<acl6-number>",
            "Info": "Specifies a basic ACL6 number.\nThe value is an integer ranging from 2000 to 2999."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 2000",
            "[*HUAWEI-acl6-basic-2000] quit",
            "[*HUAWEI] ospfv3 100",
            "[*HUAWEI-ospfv3-100] area 1",
            "[*HUAWEI-ospfv3-100-area-0.0.0.1] filter 2000 export"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ipv6-prefix my-prefix deny 2001:db8::1 64",
            "[*HUAWEI] ospfv3 100",
            "[*HUAWEI-ospfv3-100] area 1",
            "[*HUAWEI-ospfv3-100-area-0.0.0.1] filter ipv6-prefix my-prefix import"
        ]
    ],
    "ExtraInfo": "The filter export command can be used to filter out the LSAs that do not need to be sent to neighbors to reduce the size of the LSDB and speed up network convergence.\nThe filter import command can be used to filter out the unneeded LSAs learned from neighbors to reduce the size of the LSDB and speed up network convergence."
}