{
    "PageTitle": "ignore-receive-lsa advertise-router (OSPFv3 view)",
    "FuncDef": "The ignore-receive-lsa advertise-router command configures the device to discard LSAs of a specified type.\nThe undo ignore-receive-lsa advertise-router command cancels the configuration of discarding LSAs of a specified type. The ignore-receive-lsa advertise-router command configures the device to discard LSAs of a specified type. The undo ignore-receive-lsa advertise-router command cancels the configuration of discarding LSAs of a specified type. By default, the device is not configured to discard LSAs of a specified type. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ignore-receive-lsa advertise-router <adv-rtr-id> [ lsa-type <type-value> [ area { <area-id> | <area-idipv4> } ] | link-state-id <ls-id> ]",
        "undo ignore-receive-lsa advertise-router <adv-rtr-id> [ lsa-type <type-value> [ area { <area-id> | <area-idipv4> } ] | link-state-id <ls-id> ]"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "<adv-rtr-id>",
            "Info": "Specifies the router ID of the LSA advertising device.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "lsa-type <type-value>",
            "Info": "LSA type.\nThe value is in hexadecimal notation. The value ranges from 0 to ffff."
        },
        {
            "Parameters": "area <area-id>",
            "Info": "Specifies the area ID in decimal format.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "<area-idipv4>",
            "Info": "Specifies an area ID in IP address format.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "link-state-id <ls-id>",
            "Info": "Specifies the LSID of an LSA.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 100",
            "[*HUAWEI-ospfv3-100] ignore-receive-lsa advertise-router 2.2.2.2",
            "Warning: The operation will cause ospf lsdb not correct and can not recover ospf lsdb by undo command,need reset all neighbors to recover lsdb. Continue? [Y/N]:Y"
        ]
    ],
    "ExtraInfo": "When abnormal LSAs cause devices on the entire network to repeatedly restart and the LSA that causes protocol restarts is located, you can use this command as a last resort to prevent the devices from constantly restarting. However, incorrect configurations may cause loops."
}