{
    "PageTitle": "import-route (OSPFv3 view) (Non-IGP)",
    "FuncDef": "The import-route command imports external routes. Before the routes are imported, the OSPFv3 process of the route must be active.\nThe undo import-route command cancels the configuration. The import-route command imports external routes. Before the routes are imported, the OSPFv3 process of the route must be active. The undo import-route command cancels the configuration. By default, routes learned by other protocols are not imported. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "import-route { direct | static | bgp [ permit-ibgp ] } [ { cost <cost> | inherit-cost } | type <type> | tag <tag> | { route-policy <route-policy-name> } ]",
        "undo import-route { direct | static | bgp }"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "direct",
            "Info": "Imports direct routes.\n-"
        },
        {
            "Parameters": "static",
            "Info": "Imports static routes.\n-"
        },
        {
            "Parameters": "bgp",
            "Info": "Imports BGP routes.\nFor an OSPF process that is not bound to a VPN instance or is bound to a VPN instance but the vpn-instance-capability simple command is run, the parameter imports only EBGP routes.\n-"
        },
        {
            "Parameters": "permit-ibgp",
            "Info": "Imports IBGP routes.\nFor an OSPF process that is not bound to a VPN instance or is bound to a VPN instance but the vpn-instance-capability simple command is run, importing IBGP routes may cause routing loops. Therefore, exercise caution when using this parameter.\n-"
        },
        {
            "Parameters": "cost <cost>",
            "Info": "Specifies the cost of the imported route.\nThe value is an integer that ranges from 0 to 16777214."
        },
        {
            "Parameters": "inherit-cost",
            "Info": "Indicates that the imported route inherits the original cost.\n-"
        },
        {
            "Parameters": "type <type>",
            "Info": "Indicates the type of the imported route.\nThe value is 1 or 2.\n1: Type 1 external route2: Type 2 external route\nThe default value is 2."
        },
        {
            "Parameters": "tag <tag>",
            "Info": "Specifies the tag of the external LSA.\nThe value is an integer ranging from 0 to 4294967295. The default value is 1."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Imports only the route that matches the specified route-policy.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 100",
            "[*HUAWEI-ospfv3-100] import-route bgp"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] import-route static cost 10 type 1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] import-route direct cost 10 type 2"
        ]
    ],
    "ExtraInfo": "By importing routes of other routing protocols, you can expand OSPFv3 routing information.\nOSPFv3 uses four types of routes, which are listed in descending order of priority:"
}