{
    "PageTitle": "lsa-forwarding-address",
    "FuncDef": "The lsa-forwarding-address command enables the OSPFv3 forwarding address (FA) function.\nThe undo lsa-forwarding-address command disables the OSPFv3 FA function. The lsa-forwarding-address command enables the OSPFv3 forwarding address (FA) function. The undo lsa-forwarding-address command disables the OSPFv3 FA function. By default, the OSPFv3 FA function is disabled. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "lsa-forwarding-address { standard | zero-translate }",
        "undo lsa-forwarding-address"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "standard",
            "Info": "Indicates that the OSPFv3 FA function is compatible with OSPF NSSA RFC.\n-"
        },
        {
            "Parameters": "zero-translate",
            "Info": "Allows the Type 7 LSAs with the Propagate (P) bit set and without the FA to be translated to Type 5 LSAs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] lsa-forwarding-address standard"
        ]
    ],
    "ExtraInfo": "When external routes are imported to an OSPFv3 area, to calculate the optimal path based on the FA, run the lsa-forwarding-address command. If the lsa-forwarding-address standard command is run, NSSA-LSAs are converted to AS external LSAs only when the P-bit is set to 1 and the FA exists. If the lsa-forwarding-address zero-translate command is run, NSSA-LSAs in which the P-bit is set to 1 and the FA does not exist can be converted to AS external LSAs.The rules for setting the forwarding address of NSSA LSAs are as follows:"
}