{
    "PageTitle": "lsa-originate-interval (OSPFv3 view)",
    "FuncDef": "The lsa-originate-interval command sets the interval at which OSPFv3 LSAs are updated.\nThe undo lsa-originate-interval command restores the default setting. The lsa-originate-interval command sets the interval at which OSPFv3 LSAs are updated. The undo lsa-originate-interval command restores the default setting. By default, the intelligent timer is enabled; the maximum interval at which LSAs are updated is 5000 ms, the initial interval is 500 ms, and the holding interval is 1000 ms. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "lsa-originate-interval { 0 | intelligent-timer <max-interval> <start-interval> <hold-interval> [ other-type <interval> ] | other-type <interval> [ intelligent-timer <max-interval> <start-interval> <hold-interval> ] }",
        "undo lsa-originate-interval"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "0",
            "Info": "Set the interval at which OSPFv3 LSAs are updated to 0 ms.\n-"
        },
        {
            "Parameters": "intelligent-timer",
            "Info": "Sets the interval for updating OSPFv3 Type 1 LSAs (Router-LSAs), Type 2 LSAs (Network-LSAs), Type 5 LSAs (AS-external-LSAs), Type 7 LSAs (NSSA-LSAs), Type 8 LSAs (Link-LSAs), and Type 33 LSAs (E-Router-LSAs) through an intelligent timer.\n-"
        },
        {
            "Parameters": "<max-interval>",
            "Info": "Specifies the maximum interval at which OSPFv3 LSAs are updated.\nThe value is an integer ranging from 1 to 120000, in milliseconds."
        },
        {
            "Parameters": "<start-interval>",
            "Info": "Specifies the initial interval at which OSPFv3 LSAs are updated.\nThe value is an integer ranging from 0 to 60000, in milliseconds."
        },
        {
            "Parameters": "<hold-interval>",
            "Info": "Specifies the holding interval at which OSPFv3 LSAs are updated.\nThe value is an integer ranging from 1 to 60000 in milliseconds."
        },
        {
            "Parameters": "other-type <interval>",
            "Info": "Specifies the interval for OSPFv3 Type 3 LSAs (Inter-Area-Prefix-LSAs), Type 4 LSAs (Inter-Area-Router-LSAs), Type 9 LSAs (Intra-Area-Prefix-LSAs), Type 10 LSAs (Intra-Area-TE-LSAs), and Type 42 LSAs (SRv6 Locator LSAs).\nThe value is an integer ranging from 0 to 10, in seconds. The default value is 5."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] lsa-originate-interval intelligent-timer 10000 700 4000"
        ]
    ],
    "ExtraInfo": "To prevent excessive consumption of network bandwidth and device resources due to network connections or frequent route flapping on a stable network that requires fast route convergence, you can run the intelligent-timer command to set the interval for updating LSAs, in milliseconds. In this manner, topology or route changes can be immediately advertised to the network through LSAs, speeding up route convergence on the network.\nDue to the timer restriction, when the configured interval is less than 100 ms, the interval is updated based on 100 ms."
}