{
    "PageTitle": "nssa (OSPFv3 area view)",
    "FuncDef": "The nssa command configures an NSSA.\nThe undo nssa command restores an OSPFv3 NSSA to a common OSPFv3 area. The nssa command configures an NSSA. The undo nssa command restores an OSPFv3 NSSA to a common OSPFv3 area. By default, no OSPFv3 area is configured as an NSSA. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "nssa [ { default-route-advertise [ backbone-peer-ignore | cost <cost-value> | tag <tag-value> | type <type-value> ] } | no-import-route | no-summary | set-n-bit | translator-always | translator-interval <interval-value> | suppress-forwarding-address ]",
        "undo nssa"
    ],
    "ParentView": [
        "OSPFv3 area view"
    ],
    "ParaDef": [
        {
            "Parameters": "default-route-advertise",
            "Info": "Generates default Type-7 LSAs on the ASBR and then advertises them to the NSSA.\nThe ABR generates a default NSSA LSA (Type7 LSA) automatically and advertises it in the NSSA.\n-"
        },
        {
            "Parameters": "backbone-peer-ignore",
            "Info": "Prevents an ABR from checking the neighbor status in the backbone area. Specifically, the ABR generates default Type 7 LSAs and advertises them to the NSSA as long as an interface is up in the backbone area.\n-"
        },
        {
            "Parameters": "cost <cost-value>",
            "Info": "Specifies the default cost of Type 7 LSAs.\nThe value is an integer ranging from 0 to 16777214. The default value is 1."
        },
        {
            "Parameters": "tag <tag-value>",
            "Info": "Specifies the tag value of the OSPFv3 route imported to an NSSA.\nThe value is an integer ranging from 0 to 4294967295. The default value is 0."
        },
        {
            "Parameters": "type <type-value>",
            "Info": "Specifies the default type of Type 5 LSAs.\nThe value is 1 or 2.\n1: Type 1 external route2: Type 2 external route\nThe default value is 2."
        },
        {
            "Parameters": "no-import-route",
            "Info": "Indicates that no external routes are imported to NSSAs.\n-"
        },
        {
            "Parameters": "no-summary",
            "Info": "Disables ABRs from sending summary LSAs to NSSAs.\n-"
        },
        {
            "Parameters": "set-n-bit",
            "Info": "Indicates that the N-bit is set in DD packets.\n-"
        },
        {
            "Parameters": "translator-always",
            "Info": "Specifies the ABR in an NSSA as the translator. Multiple ABRs in an NSSA can be configured as translators.\n-"
        },
        {
            "Parameters": "translator-interval <interval-value>",
            "Info": "Specifies the timeout period of a translator.\nThe value is an integer ranging from 1 to 120, in seconds. The default value is 40 seconds."
        },
        {
            "Parameters": "suppress-forwarding-address",
            "Info": "Indicates that no forwarding address (FA) is set for Type 5 LSAs that are converted from Type 7 LSAs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] area 1",
            "[*HUAWEI-ospfv3-1-area-0.0.0.1] nssa"
        ]
    ],
    "ExtraInfo": "An NSSA is configured in the scenario where AS external routes are to be imported but not forwarded to save system resources. AS external routes can be imported to an NSSA and transmitted to the entire NSSA.\nAll devices in the NSSA must be configured with NSSA attributes using the nssa command. The nssa command is applicable to the following scenarios:"
}