{
    "PageTitle": "ospfv3 bfd",
    "FuncDef": "The ospfv3 bfd command enables BFD on an OSPFv3 interface and sets parameter values for a BFD session.\nThe undo ospfv3 bfd command disables BFD from an interface, or restores the default parameter values of a BFD session. The ospfv3 bfd command enables BFD on an OSPFv3 interface and sets parameter values for a BFD session. The undo ospfv3 bfd command disables BFD from an interface, or restores the default parameter values of a BFD session. By default, BFD is not enabled on an OSPFv3 interface. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ospfv3 bfd { min-transmit-interval <min-transmit-value> | min-receive-interval <min-receive-value> | detect-multiplier <detect-multiplier-value> | frr-binding } [ instance <instance-id> ]",
        "undo ospfv3 bfd { min-transmit-interval [ <min-transmit-value> ] | min-receive-interval [ <min-receive-value> ] | detect-multiplier [ <detect-multiplier-value> ] | frr-binding } [ instance <instance-id> ]"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,Tunnel interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "min-transmit-interval <min-transmit-value>",
            "Info": "Specifies the minimum interval at which BFD packets are sent to the remote device.\nThe value is an integer that ranges from 3 to 1000, in milliseconds."
        },
        {
            "Parameters": "min-receive-interval <min-receive-value>",
            "Info": "Specifies the minimum interval for receiving BFD messages from the peer.\nThe value is an integer that ranges from 3 to 1000, in milliseconds."
        },
        {
            "Parameters": "detect-multiplier <detect-multiplier-value>",
            "Info": "Specifies the local detect multiplier.\nThe value is an integer ranging from 3 to 50. The default value is 3."
        },
        {
            "Parameters": "frr-binding",
            "Info": "Associates the BFD session status with the link status on an interface.\n-"
        },
        {
            "Parameters": "instance <instance-id>",
            "Info": "Indicates the ID of the instance to which the interface belongs.\nThe value is an integer that ranges from 0 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] quit",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] ospfv3 1 area 0",
            "[*HUAWEI-100GE1/0/1] ospfv3 bfd enable",
            "[*HUAWEI-100GE1/0/1] ospfv3 bfd min-receive-interval 40 detect-multiplier 4"
        ]
    ],
    "ExtraInfo": "Either a link fault or topology change on a network will cause routes to be re-calculated within an area. As such, speeding up the convergence of a routing protocol is critical to improving the network performance.\nAs link faults are inevitable, rapidly detecting these faults and notifying routing protocols is an effective way to quickly mitigate them. This includes associating BFD with a routing protocol to speed up convergence of the routing protocol once a link fault occurs.\nDuring the configuration of OSPFv3 IP FRR, the lower layer can fast respond to the link change so that traffic can be rapidly switched to the backup link if the primary link fails. By setting frr-binding, you can associate the BFD session status with the link status of an interface (when the BFD session goes Down, the link status of the interface becomes Down) so that link faults can be rapidly detected."
}