{
    "PageTitle": "ospfv3 suppress-flapping peer (interface view)",
    "FuncDef": "The ospfv3 suppress-flapping peer command configures detection parameters for OSPFv3 neighbor relationship flapping suppression.\nThe undo ospfv3 suppress-flapping peer command restores the default detection parameters.\nThe ospfv3 suppress-flapping peer disable command disables OSPFv3 neighbor relationship flapping suppression from an interface.\nThe undo ospfv3 suppress-flapping peer disable command enables OSPFv3 neighbor relationship flapping suppression on an interface.\nThe ospfv3 suppress-flapping peer hold-down command configures the Hold-down mode and sets duration for this mode.\nThe undo ospfv3 suppress-flapping peer hold-down command cancels the Hold-down mode.\nThe ospfv3 suppress-flapping peer hold-max-cost disable command disables the Hold-max-cost mode.\nThe undo ospfv3 suppress-flapping peer hold-max-cost disable command enables the Hold-max-cost mode. The ospfv3 suppress-flapping peer command configures detection parameters for OSPFv3 neighbor relationship flapping suppression. The undo ospfv3 suppress-flapping peer command restores the default detection parameters. The ospfv3 suppress-flapping peer disable command disables OSPFv3 neighbor relationship flapping suppression from an interface. The undo ospfv3 suppress-flapping peer disable command enables OSPFv3 neighbor relationship flapping suppression on an interface. The ospfv3 suppress-flapping peer hold-down command configures the Hold-down mode and sets duration for this mode. The undo ospfv3 suppress-flapping peer hold-down command cancels the Hold-down mode. The ospfv3 suppress-flapping peer hold-max-cost disable command disables the Hold-max-cost mode. The undo ospfv3 suppress-flapping peer hold-max-cost disable command enables the Hold-max-cost mode. By default, the detection interval of OSPFv3 neighbor flapping suppression is 60s, the suppression threshold is 10, and the interval for exiting from suppression is 120s.\n\n\nBy default, OSPFv3 neighbor flapping suppression is enabled on all interfaces.\n\n\nBy default, the Hold-down mode is disabled and the Hold-max-cost mode is enabled. By default, the detection interval of OSPFv3 neighbor flapping suppression is 60s, the suppression threshold is 10, and the interval for exiting from suppression is 120s. By default, OSPFv3 neighbor flapping suppression is enabled on all interfaces. By default, the Hold-down mode is disabled and the Hold-max-cost mode is enabled. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ospfv3 suppress-flapping peer disable [ instance <instance-id> ]",
        "ospfv3 suppress-flapping peer hold-down <interval> [ instance <instance-id> ]",
        "ospfv3 suppress-flapping peer hold-max-cost disable [ instance <instance-id> ]",
        "ospfv3 suppress-flapping peer { detecting-interval <detecting-interval> | threshold <threshold> | resume-interval <resume-interval> } [ instance <instance-id> ]",
        "undo ospfv3 suppress-flapping peer disable [ instance <instance-id> ]",
        "undo ospfv3 suppress-flapping peer hold-down [ <interval> ] [ instance <instance-id> ]",
        "undo ospfv3 suppress-flapping peer hold-max-cost disable [ instance <instance-id> ]",
        "undo ospfv3 suppress-flapping peer { detecting-interval <detecting-interval> | threshold <threshold> | resume-interval <resume-interval> } [ instance <instance-id> ]"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance <instance-id>",
            "Info": "Specifies the interface instance ID.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "hold-down <interval>",
            "Info": "Specifies the duration of the Hold-down mode.\nThe value is an integer ranging from 1 to 86400, in seconds."
        },
        {
            "Parameters": "detecting-interval <detecting-interval>",
            "Info": "Specifies the detection interval of OSPFv3 neighbor relationship flapping suppression.\nEach OSPF interface on which OSPFv3 neighbor relationship flapping suppression is enabled starts a flapping counter. If the interval between two successive neighbor status changes from Full to a non-Full state is shorter than detecting-interval, a valid flapping_event is recorded, and the flapping_count increases by 1.\nThe value is an integer ranging from 1 to 300, in seconds. The default value is 60s."
        },
        {
            "Parameters": "threshold <threshold>",
            "Info": "Specifies the threshold of OSPF neighbor relationship flapping suppression.\nWhen the flapping_count reaches or exceeds threshold, flapping suppression takes effect.\nThe value is an integer ranging from 1 to 1000. The default value is 10."
        },
        {
            "Parameters": "resume-interval <resume-interval>",
            "Info": "Specifies a flapping detection clearance threshold for OSPFv3 neighbor flapping suppression.\nIf the interval between two successive neighbor status changes from Full to a non-Full state is greater than resume-interval, the flapping_count is cleared.\nIf OSPFv3 neighbor flapping suppression works in Hold-max-cost mode, resume-interval specifies the duration of the Hold-max-cost mode.\nThe value of resume-interval must be greater than that of detecting-interval.\nThe value is an integer ranging from 2 to 1000, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] quit",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] ospfv3 1 area 0",
            "[*HUAWEI-100GE1/0/1] ospfv3 suppress-flapping peer hold-down 200"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] quit",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] ospfv3 1 area 0",
            "[*HUAWEI-100GE1/0/1] ospfv3 suppress-flapping peer detecting-interval 5 threshold 40 resume-interval 20"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] quit",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] ospfv3 1 area 0",
            "[*HUAWEI-100GE1/0/1] ospfv3 suppress-flapping peer disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] quit",
            "[*HUAWEI] interface 100GE 1/0/1",
            "[*HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] ospfv3 1 area 0",
            "[*HUAWEI-100GE1/0/1] ospfv3 suppress-flapping peer hold-max-cost disable"
        ]
    ],
    "ExtraInfo": "To configure detection parameters for OSPFv3 neighbor relationship flapping suppression on an interface, run the ospfv3 suppress-flapping peer command. However, keeping the default configurations is recommended.\nBy default, OSPFv3 neighbor relationship flapping suppression is enabled on all interfaces in the same OSPFv3 process. To disable the function from one of the interfaces, run the ospfv3 suppress-flapping peer disable command.\nFlapping suppression works in either Hold-down or Hold-max-cost mode."
}