{
    "PageTitle": "prefix-priority (OSPFv3 view)",
    "FuncDef": "The prefix-priority command sets a convergence priority for OSPFv3 routes.\nThe undo prefix-priority command restores the default value. The prefix-priority command sets a convergence priority for OSPFv3 routes. The undo prefix-priority command restores the default value. By default, in an OSPFv3 routing table, the convergence priority of public 128-bit host routes and default routes is medium, and the convergence priority of other OSPFv3 routes is low. In the IP routing table, the convergence priority of OSPFv3 public 32-bit host routes and default routes is high, and the convergence priority of other OSPFv3 routes is medium. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "prefix-priority { critical | high | medium } ipv6-prefix <ipv6-prefix-name>",
        "undo prefix-priority { critical | high | medium }"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "critical",
            "Info": "Sets the convergence priority of OSPF routes to critical.\n-"
        },
        {
            "Parameters": "high",
            "Info": "Sets the convergence priority of OSPFv3 routes to high.\n-"
        },
        {
            "Parameters": "medium",
            "Info": "Sets the convergence priority of OSPFv3 routes to medium.\n-"
        },
        {
            "Parameters": "ipv6-prefix <ipv6-prefix-name>",
            "Info": "Specifies the name of an IPv6 prefix list.\nThe value is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ipv6-prefix critical-prefix index 10 permit 2001:DB8:1::1 64",
            "[*HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] prefix-priority critical ipv6-prefix critical-prefix"
        ]
    ],
    "ExtraInfo": "To set a convergence priority of OSPFv3 routes based on a specified IPv6 prefix list, run the prefix-priority command. The command takes effect on the public network only.\nAfter the prefix-priority command is used in the OSPFv3 view, OSPFv3 route calculation, link-state advertisement (LSA) flooding, and LSDB synchronization can be implemented according to the configured priority, which accelerates route convergence."
}