{
    "PageTitle": "route-tag",
    "FuncDef": "The route-tag command sets the VPN route tag for imported VPN routes.\nThe undo route-tag command restores the default setting. The route-tag command sets the VPN route tag for imported VPN routes. The undo route-tag command restores the default setting. By default, the first two bytes of a tag value are fixed at 0xD000, and the last two bytes are the local BGP AS number. For example, if the local BGP AS number is 100, the default tag value in decimal notation is 3489661028; if the BGP AS number is greater than 65535, the tag value is 0, and you can manually change the tag value. If BGP is not configured, the default tag value is 0. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "route-tag <tag-value>",
        "undo route-tag"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "<tag-value>",
            "Info": "Specifies the VPN route tag.\nThe value is an integer ranging from 0 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance huawei",
            "[*HUAWEI-vpn-instance-huawei] ipv6-family",
            "[*HUAWEI-vpn-instance-huawei-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-huawei] quit",
            "[*HUAWEI] ospfv3 100 vpn-instance huawei",
            "[*HUAWEI-ospfv3-100] route-tag 100"
        ]
    ],
    "ExtraInfo": "The route-tag command applies only to VPN scenarios. It is used as the tag value in Type 5 LSAs and Type 7 LSAs to prevent external loops when a CE is dual-homed to PEs. On a network where a CE is connected to two PEs, PE1 generates Type 5 LSAs and Type 7 LSAs based on imported BGP routes and sends them to the CE. The CE then sends the LSAs to PE2. Because OSPFv3 routes have a higher priority than BGP routes, PE2 replaces BGP routes with OSPFv3 routes, causing a routing loop. After the route-tag command is run, if the PE finds that the tag value of an LSA is the same as the local tag value, the PE ignores the LSA during route calculation to prevent routing loops.\nThe priorities of the tag set through the route-tag command and the tag set through other commands are as follows:"
}