{
    "PageTitle": "silent-interface (OSPFv3 view)",
    "FuncDef": "The silent-interface command disables an interface from receiving and sending OSPFv3 packets.\nThe undo silent-interface command restores the default setting. The silent-interface command disables an interface from receiving and sending OSPFv3 packets. The undo silent-interface command restores the default setting. By default, an interface can receive and send OSPFv3 packets. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "silent-interface { all | { <interface-name> | <interface-type> <interface-number> } }",
        "undo silent-interface { all | { <interface-name> | <interface-type> <interface-number> } }"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Indicates all interfaces in a specified process.\n-"
        },
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies an interface number.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] quit",
            "[*HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] silent-interface 100GE1/0/1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] silent-interface all"
        ]
    ],
    "ExtraInfo": "To prevent OSPFv3 routes from being received by other routers on the network and disable the local router from receiving updated routes, run the silent-interface command. After an interface is disabled from receiving and sending OSPFv3 packets, the interface can still advertise its routes but cannot exchange Hello packets with others. Therefore, no neighbor relationship can be established between the interface and others. This can enhance the networking adaptability of OSPFv3 and reduce system resource consumption.\nFor example, when no OSPFv3 neighbor relationship is required between a user-side interface and a user terminal, but routes of the interface still need to be advertised to implement user-and-network interworking, run this command.\nDisabling interfaces from receiving or sending OSPFv3 packets is a solution to routing loops."
}