{
    "PageTitle": "stub-router (OSPFv3 view)",
    "FuncDef": "The stub-router command configures a stub device.\nThe undo stub-router command restores the default configuration. The stub-router command configures a stub device. The undo stub-router command restores the default configuration. By default, a device is a non-stub device. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "stub-router [ [ on-startup [ <interval> ] ] | [ intra-area-prefix-lsa ] | [ external-lsa [ <externallsa-metric> ] ] | [ inter-area-prefix-lsa [ <interareaprefixlsa_metric> ] ] ]",
        "undo stub-router"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "on-startup <interval>",
            "Info": "Specifies an interval for the device to remain as a stub device after being restarted.\nThe value is an integer ranging from 5 to 65535, in seconds. The default value is 500 seconds."
        },
        {
            "Parameters": "intra-area-prefix-lsa",
            "Info": "Indicates that intra-area-prefix-LSAs with the cost 65535 are advertised.\n-"
        },
        {
            "Parameters": "external-lsa <externallsa-metric>",
            "Info": "Advertises external-LSAs with the configured or default maximum cost.\nThe value is an integer ranging from 1 to 16777215. The default value is 16711680."
        },
        {
            "Parameters": "inter-area-prefix-lsa <interareaprefixlsa_metric>",
            "Info": "Advertises inter-area-prefix-LSAs with the configured or default maximum cost.\nThe value is an integer ranging from 1 to 16777215. The default value is 16711680."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] stub-router on-startup 65535 intra-area-prefix-lsa external-lsa 16777214 inter-area-prefix-lsa 16777214"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] stub-router"
        ]
    ],
    "ExtraInfo": ""
}