{
    "From": " Cisco IOS Configuration Fundamentals Command Reference",
    "PageTitle": "undelete",
    "FuncDef": [
        "To recover a file marked \"deleted\" on a Class A Flash file system, use the **undelete** command in user EXEC or privileged EXEC mode. "
    ],
    "CLIs": [
        "undelete <index> [ <filesystem>: ]"
    ],
    "ParentView": [
        null
    ],
    "ParaDef": [
        {
            "Parameters": " *index* ",
            "Info": " A number that indexes the file in the **dir** command output. "
        },
        {
            "Parameters": " *filesystem*: ",
            "Info": " (Optional) A file system containing the file to undelete, followed by a colon. "
        }
    ],
    "Examples": [
        [
            "In the following example, the deleted file at <index> 1 is recovered:",
            "```",
            "Router# show flash",
            "```",
            "```",
            "```",
            "```",
            "System flash directory:",
            "```",
            "```",
            "File Length Name/status",
            "```",
            "```",
            "1 8972116 c7000-js56i-mz.121-5.T [ deleted ]",
            "```",
            "```",
            "2 6765916 c7000-ds-mz.CSCds70452",
            "```",
            "```",
            "[ 15738160 bytes used, 1039056 available, 16777216 total ]",
            "```",
            "```",
            "16384K bytes of processor board System flash (Read/Write)",
            "```",
            "```",
            "```",
            "```",
            "Router# undelete 1 flash:",
            "```",
            "```",
            "```"
        ]
    ],
    "ExtraInfo": "For Class A Flash file systems, when you delete a file, the Cisco IOS software simply marks the file as deleted, but it does not erase the file. This command allows you to recover a \"deleted\" file on a specified Flash memory device. You must undelete a file by its index because you could have multiple deleted files with the same name. For example, the \"deleted\" list could contain multiple configuration files with the name router-config. You undelete by index to indicate which of the many router-config files from the list to undelete. Use the **dir** command to learn the index number of the file you want to undelete.You cannot undelete a file if a valid (undeleted) file with the same name exists. Instead, you first delete the existing file and then undelete the file you want. For example, if you had an undeleted version of the router-config file and you wanted to use a previous, deleted version instead, you could not simply undelete the previous version by index. You would first delete the existing router-config file and then undelete the previous router-config file by index. You can delete and undelete a file up to 15 times.On Class A Flash file systems, if you try to recover the configuration file pointed to by the CONFIG\\_FILE environment variable, the system prompts you to confirm recovery of the file. This prompt reminds you that the CONFIG\\_FILE environment variable points to an undeleted file. To permanently delete all files marked \"deleted\" on a Flash memory device, use the **squeeze** EXEC command.For further information on Flash File System types (classes), see http://www.cisco.com/warp/public/63/pcmciamatrix.html.",
    "RelatedCmds": [
        {
            "cmd": " **delete** ",
            "description": " Deletes a file on a Flash memory device. "
        },
        {
            "cmd": " **dir** ",
            "description": " Displays a list of files on a file system. "
        },
        {
            "cmd": " **squeeze** ",
            "description": " Permanently deletes Flash files by squeezing a Class A Flash file system. "
        }
    ]
}