{
    "PageTitle": "arp direct-route enable",
    "FuncDef": "The arp direct-route enable command advertises ARP Vlink direct routes.\nThe undo arp direct-route enable command restores the default setting. The arp direct-route enable command advertises ARP Vlink direct routes. The undo arp direct-route enable command restores the default setting. By default, ARP Vlink direct routes are not advertised.",
    "CLIs": [
        "arp direct-route enable [ route-policy <name> ]",
        "undo arp direct-route enable"
    ],
    "ParentView": [
        "VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "route-policy <name>",
            "Info": "Specifies the name of a route-policy that is used to filter ARP Vlink direct routes.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 200",
            "[*HUAWEI-Vlan200] quit",
            "[*HUAWEI] interface vlanif 200",
            "[*HUAWEI-Vlanif200] arp direct-route enable route-policy rp1"
        ]
    ],
    "ExtraInfo": "By default, ARP Vlink direct routes are only used for packet forwarding in the same VLAN and cannot be imported to dynamic routing protocols. This is because importing Vlink direct routes to dynamic routing protocols will increase the number of routing entries and affect routing table stability. In some cases, some operations need to be performed based on Vlink direct routes of VLAN users. For example, different VLAN users use different route exporting policies to guide traffic from the remote device. In this scenario, ARP Vlink direct routes are needed to be imported by a dynamic routing protocol and advertised to the remote device. After advertisement of ARP Vlink direct routes is enabled, these direct routes can be imported by a dynamic routing protocol (IGP or BGP) and advertised to the remote device."
}