{
    "PageTitle": "direct-route track vrrp interface",
    "FuncDef": "The direct-route track vrrp interface command associates direct routes with a Virtual Router Redundancy Protocol (VRRP) backup group in the loopback interface view.\nThe undo direct-route track vrrp interface command deletes the association between direct routes and a VRRP group in the loopback interface view. The direct-route track vrrp interface command associates direct routes with a Virtual Router Redundancy Protocol (VRRP) backup group in the loopback interface view. The undo direct-route track vrrp interface command deletes the association between direct routes and a VRRP group in the loopback interface view. By default, direct routes are not associated with a VRRP group.",
    "CLIs": [
        "direct-route track vrrp interface { <interface-name> | <interface-type> <interface-number> } vrid <virtual-router-id> degrade-cost <cost-value>",
        "undo direct-route track vrrp [ interface { <interface-name> | <interface-type> <interface-number> } vrid <virtual-router-id> degrade-cost <cost-value> ]"
    ],
    "ParentView": [
        "Loopback interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-type>",
            "Info": "Specifies the type of the interface on which a VRRP group is configured.\n-"
        },
        {
            "Parameters": "<interface-number>",
            "Info": "Specifies the number of the interface on which a VRRP group is configured.\n-"
        },
        {
            "Parameters": "vrid <virtual-router-id>",
            "Info": "Specifies the ID of a VRRP group.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "degrade-cost <cost-value>",
            "Info": "Specifies a cost to be applied to IP direct routes when the associated VRRP group is in the Backup or Initialize state.\nThe value is an integer ranging from 1 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1",
            "[*HUAWEI-100GE1/0/1] quit",
            "[*HUAWEI] interface loopback 1",
            "[*HUAWEI-loopback1] vrrp vrid 1 peer-ip 1.1.1.1",
            "[*HUAWEI-loopback1] direct-route track vrrp interface 100GE1/0/1 vrid 1 degrade-cost 300"
        ]
    ],
    "ExtraInfo": "Two CloudEdge-GWs in equipment room run VRRP, which is deployed on Eth-Trunk interfaces. Packets are transparently transmitted through an AGG-SW. The priority of network segment routes on loopback interfaces is associated with the VRRP status, and the priority of network segment routes on loopback interfaces of the CloudEdge-GW in the Backup state is low."
}