{
    "PageTitle": "direct-route track vrrp",
    "FuncDef": "The direct-route track vrrp command associates direct routes with a Virtual Router Redundancy Protocol (VRRP) backup group.\nThe undo direct-route track vrrp command dissociates direct routes from a VRRP group. The direct-route track vrrp command associates direct routes with a Virtual Router Redundancy Protocol (VRRP) backup group. The undo direct-route track vrrp command dissociates direct routes from a VRRP group. By default, no direct routes are associated with a VRRP group.",
    "CLIs": [
        "direct-route track vrrp vrid <virtual-router-id> degrade-cost <cost-value>",
        "undo direct-route track vrrp"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,1200ge sub-interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "degrade-cost <cost-value>",
            "Info": "Specifies the cost of a direct route that the virtual IP network segment generates when the VRRP status is Backup or Initialize.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "vrid <virtual-router-id>",
            "Info": "Specifies the ID of a VRRP group.\nThe value is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] vrrp vrid 1",
            "[*HUAWEI-100GE1/0/1] direct-route track vrrp vrid 1 degrade-cost 300"
        ]
    ],
    "ExtraInfo": "If a VRRP group functions as a user gateway, user-to-network traffic and network-to-user traffic may travel through different paths. This case occurs because user-to-network traffic traverses the master device in the VRRP group, but network-to-user traffic is transmitted through a path that a dynamic routing protocol selects. When a firewall is configured for the VRRP  group to improve network security, path inconsistency causes the firewall to block both user-to-network and network-to-user traffic. Additionally, path inconsistency increases the difficulty and cost in traffic policing and accounting. To resolve problems caused by path inconsistency, run the direct-route track vrrp command to associate direct routes with a VRRP group. The association allows devices to modify their direct route costs based on the VRRP status. To change the path that a dynamic routing protocol selects based on the VRRP status, configure a dynamic routing protocol to import direct routes."
}