{
    "PageTitle": "display ip fib slot",
    "FuncDef": "The display ip fib slot command displays information about the FIB table on the specified interface board. The display ip fib slot command displays information about the FIB table on the specified interface board.",
    "CLIs": [
        "display ip fib slot <slot-id> cpuid <cpuid> [ vpn-instance <vpn-instance-name> ] [ <dest-ip> [ <dest-ip-mask-len> | <dest-ip-mask> ] ] [ verbose ]",
        "display ip fib slot <slot-id> [ vpn-instance <vpn-instance-name> ] [ <dest-ip> [ <dest-ip-mask-len> | <dest-ip-mask> ] ] [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<slot-id>",
            "Info": "Displays information about the FIB table in a specified slot ID.\nThe value is a string of 1 to 23  case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "<dest-ip>",
            "Info": "Displays information about the FIB table with the specified destination IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<dest-ip-mask-len>",
            "Info": "Specifies the mask length of the destination IP address.\nThe value is an integer in the range from 0 to 32."
        },
        {
            "Parameters": "<dest-ip-mask>",
            "Info": "Specifies the mask of the destination IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about the FIB table.\n-"
        },
        {
            "Parameters": "cpuid <cpuid>",
            "Info": "Displays information about the FIB table in a specified cpu ID.\n\n NOTE: This parameter is supported only on the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885-LL (low latency mode), CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a string of 1 to 23  case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Displays information about the FIB table of a specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. If the character string is quoted by double quotation marks, the character string can contain spaces.  \"_public_\" is reserved and cannot be used as a VPN instance name."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ip fib slot 1"
        ],
        [
            "<HUAWEI> display ip fib slot 1 127.0.0.1 verbose"
        ]
    ],
    "ExtraInfo": ""
}