{
    "PageTitle": "display ip routing-table route-number",
    "FuncDef": "The display ip routing-table route-number command displays the number of routes on a public network or in a VPN instance enabled with an IPv4 address family.\nThe display ip routing-table statistics command displays integrated route statistics of the IPv4 routing table. The display ip routing-table route-number command displays the number of routes on a public network or in a VPN instance enabled with an IPv4 address family. The display ip routing-table statistics command displays integrated route statistics of the IPv4 routing table.",
    "CLIs": [
        "display ip routing-table vpn-instance <vpn-instance-name> statistics",
        "display ip routing-table vpn-instance <vpn-instance-name> route-number",
        "display ip routing-table [ table-namemsr ] route-number",
        "display ip routing-table [ table-namemsr ] statistics"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "table-name",
            "Info": "Specifies a table of a producer.\n-"
        },
        {
            "Parameters": "statistics",
            "Info": "Routing statistics.\n-"
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Displays information about the routing table of an IPv4 address family-enabled VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "msr",
            "Info": "Displays integrated route statistics of the multicast static routing table.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] display ip routing-table statistics"
        ]
    ],
    "ExtraInfo": "The display ip routing-table route-number command is used to view the number of routes on a public network or in a VPN instance enabled with an IPv4 address family.\nIntegrated route statistics include:"
}