{
    "PageTitle": "display ip routing-table protocol direct sub-protocol",
    "FuncDef": "The display ip routing-table protocol direct sub-protocol command displays the information about sub-protocol routes of direct routes. The display ip routing-table protocol direct sub-protocol command displays the information about sub-protocol routes of direct routes.",
    "CLIs": [
        "display ip routing-table [ vpn-instance <vpn-instance-name> ] protocoldirectsub-protocol { vlink | vlink-trm } [ verbose | inactive ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Displays information about the routing table of an IPv4 address family-enabled VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "protocol",
            "Info": "Displays routes of a specified protocol.\n-"
        },
        {
            "Parameters": "direct",
            "Info": "Displays direct routes.\n-"
        },
        {
            "Parameters": "sub-protocol",
            "Info": "Displays the information about sub-protocol routes of direct routes.\n-"
        },
        {
            "Parameters": "vlink",
            "Info": "Displays the information about Vlink direct routes.\n-"
        },
        {
            "Parameters": "vlink-trm",
            "Info": "Displays the information about Vlink-TRM direct routes.\n-"
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about active and inactive routes.\n-"
        },
        {
            "Parameters": "inactive",
            "Info": "Displays the summary of inactive routes only.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ip routing-table protocol direct sub-protocol vlink"
        ]
    ],
    "ExtraInfo": "In the command output, each line indicates a route. The contents include the destination address, mask length, protocol, priority, route cost, route flag, next hop, and outbound interface.\nThis command without verbose specified displays the preferred routes only."
}