{
    "PageTitle": "display ip routing-table",
    "FuncDef": "The display ip routing-table command displays the summary of an IPv4 routing table. The display ip routing-table command displays the summary of an IPv4 routing table.",
    "CLIs": [
        "display ip routing-table [ table-namemsr ] <prefix> { <mask> | <masklength> } <prefix> { <mask> | <masklength> } [ verbose ]",
        "display mrt routing-table [ vpn-instance <vpn-instance-name> ] [ <prefix> [ [ <mask> ] | [ <masklength> ] ] [ longer-match ] ] [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "table-name",
            "Info": "Specifies a table of a producer.\n-"
        },
        {
            "Parameters": "msr",
            "Info": "Indicates a multicast static routing table. (When topology topology-name is specified, the multicast static routing table cannot be displayed.).\n-"
        },
        {
            "Parameters": "<prefix>",
            "Info": "Displays information about a route to a specified IP destination address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<mask>",
            "Info": "Specifies the mask of a destination address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<masklength>",
            "Info": "Specifies a mask length. The 1s in each 32-bit mask must be consecutive. Therefore, a mask in dotted decimal notation can be presented by a mask length.\nThe value is an integer ranging from 0 to 32."
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about all the routes in the routing table, including active and inactive routes. If this parameter is not specified, only brief information about active routes is displayed.\n-"
        },
        {
            "Parameters": "mrt",
            "Info": "Indicates a MRT routing table.\n-"
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters. It cannot contain spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "longer-match",
            "Info": "Displays the routes matching the specified network or mask.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ip routing-table 1.0.0.0 8 4.0.0.0 24"
        ]
    ],
    "ExtraInfo": ""
}