{
    "PageTitle": "ipv6 route recursive-lookup default-route protocol",
    "FuncDef": "The ipv6 route recursive-lookup default-route protocol command enables IPv6 static route recursion to the default route.\nThe undo ipv6 route recursive-lookup default-route protocol command disables IPv6 static route recursion to the default route. The ipv6 route recursive-lookup default-route protocol command enables IPv6 static route recursion to the default route. The undo ipv6 route recursive-lookup default-route protocol command disables IPv6 static route recursion to the default route. By default, IPv6 static route recursion to the default route is not enabled. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 route recursive-lookup default-route protocol { static | msr }",
        "undo ipv6 route recursive-lookup default-route protocol { static | msr }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "static",
            "Info": "Allows IPv6 static routes to recurse to the default route.\n-"
        },
        {
            "Parameters": "msr",
            "Info": "Indicates the multicast static route.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 route recursive-lookup default-route protocol msr"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 route recursive-lookup default-route protocol static"
        ]
    ],
    "ExtraInfo": "The next hop of an IPv6 static route may not be directly reachable. In this case, route recursion is required. During route recursion, you can run the ipv6 route recursive-lookup default-route protocol command to control whether to allow IPv6 static routes to be recursed to the default route."
}