{
    "PageTitle": "ipv6 prefix-limit system threshold-alarm",
    "FuncDef": "The ipv6 prefix-limit system threshold-alarm command configures thresholds (one alarm threshold and one clear alarm threshold) for the number of IPv6 route prefixes on a device.\nThe undo ipv6 prefix-limit system threshold-alarm command restores the default configuration. The ipv6 prefix-limit system threshold-alarm command configures thresholds (one alarm threshold and one clear alarm threshold) for the number of IPv6 route prefixes on a device. The undo ipv6 prefix-limit system threshold-alarm command restores the default configuration. By default, the alarm threshold for IPv6 route prefixes is 80%, and the clear alarm threshold for IPv6 route prefixes is 70%. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 prefix-limit system threshold-alarm upper-limit <upper-limit-value> lower-limit <lower-limit-value>",
        "undo ipv6 prefix-limit system threshold-alarm"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "lower-limit <lower-limit-value>",
            "Info": "Specifies the clear alarm threshold for the number of IPv6 route prefixes.\nThe value is a percent integer ranging from 1 to 100.\nlowerlimit-percent must be less than upperlimit-percent. Set lowerlimit-percent to a value at least 10 less than upperlimit-percent to prevent alarms from being frequently generated and cleared due to route flapping."
        },
        {
            "Parameters": "upper-limit <upper-limit-value>",
            "Info": "Specifies the alarm threshold for the number of IPv6 route prefixes.\nThe value is a percent integer ranging from 1 to 100.\nSet a value less than or equal to 95 for upperlimit-percent."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 prefix-limit system threshold-alarm upper-limit 85 lower-limit 65"
        ]
    ],
    "ExtraInfo": "The number of IPv6 route prefixes that can be added to a routing table is limited. If the number exceeds the limit, new prefixes cannot be added to the routing table, which may interrupt services. To address this problem, configure an alarm threshold for the number of IPv6 route prefixes.\nYou can run the ipv6 prefix-limit system threshold-alarm command to configure the two thresholds based on the requirements of services."
}