{
    "PageTitle": "ipv6 nd direct-route enable (Interface view)",
    "FuncDef": "The ipv6 nd direct-route enable command configures IPv6 NDP Vlink direct route advertisement.\nThe undo ipv6 nd direct-route enable command disables IPv6 NDP Vlink direct route advertisement. The ipv6 nd direct-route enable command configures IPv6 NDP Vlink direct route advertisement. The undo ipv6 nd direct-route enable command disables IPv6 NDP Vlink direct route advertisement. By default, IPv6 NDP Vlink direct routes are not advertised. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 nd direct-route enable [ route-policy <name> ]",
        "undo ipv6 nd direct-route enable"
    ],
    "ParentView": [
        "100ge sub-interface view,10GE sub-interface view,200GE sub-interface view,25GE sub-interface view,400GE sub-interface view,50GE sub-interface view,Eth-Trunk sub-interface view,VLAN range view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "route-policy <name>",
            "Info": "Specifies a route-policy for filtering IPv6 NDP Vlink direct routes.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 100",
            "[*HUAWEI-vlan100] quit",
            "[*HUAWEI] interface vlanif 100",
            "[*HUAWEI-Vlanif100] ipv6 enable",
            "[*HUAWEI-Vlanif100] ipv6 nd direct-route enable"
        ]
    ],
    "ExtraInfo": "The device connects to two IPv6 sites (Site 1 and Site 2). The device and its peer run a dynamic routing protocol. To allow its peer to learn routes destined for Site 1 and Site 2, run the ipv6 nd direct-route enable command on the device to configure interfaces to advertise IPv6 NDP Vlink direct routes, and then configure a dynamic routing protocol to import the direct routes."
}