{
    "PageTitle": "pads route record rm",
    "FuncDef": "The pads route record rm command configures the percentage of the maximum number of BGP prefix records that can be recorded for PADS. The pads route record rm command configures the percentage of the maximum number of BGP prefix records that can be recorded for PADS. By default, the percentage of the maximum number of prefixes recorded by BGP is 100%.",
    "CLIs": [
        "pads route record rm { ipv4 | ipv6 } protocolbgppercent <percent-number>",
        "undo pads route record rm { ipv4 | ipv6 } protocolbgppercent [ <percent-number> ]",
        "pads route record rm ipv4 protocol bgp percent <percent-number>",
        "undo pads route record rm ipv4 protocol bgp percent [ <percent-number> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4",
            "Info": "Configures an IPv4 address family.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Configures an IPv6 address family.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "protocol",
            "Info": "Configures a specific routing protocol.\n-"
        },
        {
            "Parameters": "bgp",
            "Info": "Configures BGP.\n-"
        },
        {
            "Parameters": "percent <percent-number>",
            "Info": "Specifies the percentage of the maximum number of prefix records recorded by BGP.\nThe value is an integer ranging from 1 to 99, in percentage. The default value is 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pads route record rm ipv4 protocol bgp percent 80"
        ]
    ],
    "ExtraInfo": "The pads diagnose route record rm command displays the route change track recorded by PADS, which helps locate routing loops, check the source of abnormal routes, and determine the correct service path. You can run the pads route record rm command to set the percentage of the maximum number of BGP prefix records recorded by PADS."
}