{
    "PageTitle": "display ipv6 nd security timestamp",
    "FuncDef": "The display ipv6 nd security timestamp command displays the time stamp value of the last received and accepted SEND message (RDlast) and the local time at which the last SEND message for this peer is accepted (TSlast). The receiver records the two time values after receiving an SEND message. The display ipv6 nd security timestamp command displays the time stamp value of the last received and accepted SEND message (RDlast) and the local time at which the last SEND message for this peer is accepted (TSlast). The receiver records the two time values after receiving an SEND message. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display ipv6 nd security timestamp { <interface-name> | <interface-type> <interface-num> }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "<interface-name>",
            "Info": "Specifies the name of an interface. That is, the RDlast and the TSlast values of the SEND message on the specified interface is displayed.\n-"
        },
        {
            "Parameters": "<interface-type> <interface-num>",
            "Info": "Specifies the type and the number of an interface. That is, the RDlast and the TSlast values of the SEND message on the specified interface is displayed.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ipv6 nd security timestamp 100ge 1/0/1"
        ]
    ],
    "ExtraInfo": "You can run the display ipv6 nd security timestamp command to view the RDlast and the TSlast values of an SEND message on an interface. Then, you can determine whether the difference between the receive time and the send time of the SEND message is out of the allowed time range based on the following formula."
}