{
    "PageTitle": "display ipv6 neighbors statistics",
    "FuncDef": "The display ipv6 neighbors statistics command displays statistics about ND entries. The display ipv6 neighbors statistics command displays statistics about ND entries. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "display ipv6 neighbors statistics static",
        "display ipv6 neighbors statistics all",
        "display ipv6 neighbors statistics interface { <interface-name> | <interface-type> <interface-num> }",
        "display ipv6 neighbors statistics slot <slot-num>",
        "display ipv6 neighbors statistics slot all"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Displays statistics about all ND entries on a device.\n-"
        },
        {
            "Parameters": "interface <interface-name>",
            "Info": "Displays statistics about ND entries on the interface with a specified name.\nThe value is a string of 1 to 63 case-insensitive characters without spaces."
        },
        {
            "Parameters": "interface <interface-type> <interface-num>",
            "Info": "Displays statistics about ND entries on the interface with a specified type and number.\n-"
        },
        {
            "Parameters": "slot <slot-num>",
            "Info": "Displays statistics about ND entries in a specified slot.\nThe value is a string of 1 to 23 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "static",
            "Info": "Displays the maximum number of static ND entries on a device and the current number of static ND entries.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ipv6 neighbors statistics all"
        ],
        [
            "<HUAWEI> display ipv6 neighbors statistics slot 1"
        ],
        [
            "<HUAWEI> display ipv6 neighbors statistics static"
        ]
    ],
    "ExtraInfo": "To check statistics about ND entries, run the display ipv6 neighbors statistics command. Based on the command output, you can obtain the overall status of ND entries and check whether the number of ND entries reaches the upper limit."
}