{
    "PageTitle": "ipv6 nd ra",
    "FuncDef": "The ipv6 nd ra command sets the interval for sending RA messages.\nThe undo ipv6 nd ra command restores the default setting. The ipv6 nd ra command sets the interval for sending RA messages. The undo ipv6 nd ra command restores the default setting. By default, The maximum interval is 600s. For the minimum interval, if the maximum interval for advertising RA packets is 9s or greater, it is 1/3 of the maximum interval. In other cases, the default minimum interval is the same as the maximum interval for advertising RA packets. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 nd ra { max-interval <maximum-interval> | min-interval <minimum-interval> }",
        "undo ipv6 nd ra { max-interval | min-interval }"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "max-interval <maximum-interval>",
            "Info": "Specifies the maximum interval for the device to advertise RA messages.\nThe value is an integer ranging from 4 to 1800, in seconds. The maximum interval cannot be shorter than 4/3 of the minimum interval."
        },
        {
            "Parameters": "min-interval <minimum-interval>",
            "Info": "Specifies the minimum interval for the device to send RA messages.\nThe value is an integer ranging from 3 to 1350, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] ipv6 nd ra min-interval 300"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1] ipv6 nd ra max-interval 1000"
        ]
    ],
    "ExtraInfo": "A Router periodically sends RA messages. An RA message carries both the IP address prefix and the flag of stateful address autoconfiguration.\nYou can run the ipv6 nd ra command to change the interval for sending RA messages."
}