{
    "PageTitle": "ipv6 nd proxy inner-access-vlan enable",
    "FuncDef": "The ipv6 nd proxy inner-access-vlan enable command enables the intra-VLAN proxy ND function.\nThe undo ipv6 nd proxy inner-access-vlan enable command disables the intra-VLAN proxy ND function. The ipv6 nd proxy inner-access-vlan enable command enables the intra-VLAN proxy ND function. The undo ipv6 nd proxy inner-access-vlan enable command disables the intra-VLAN proxy ND function. By default, the intra-VLAN proxy ND function is not enabled. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 nd proxy inner-access-vlan enable",
        "undo ipv6 nd proxy inner-access-vlan enable"
    ],
    "ParentView": [
        "100ge sub-interface view,10GE sub-interface view,200GE sub-interface view,25GE sub-interface view,400GE sub-interface view,50GE sub-interface view,Eth-Trunk sub-interface view,VLANIF interface view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1.1",
            "[~HUAWEI-100GE1/0/1.1] undo portswitch",
            "[*HUAWEI-100GE1/0/1.1] ipv6 enable",
            "[*HUAWEI-100GE1/0/1.1] ipv6 nd proxy inner-access-vlan enable"
        ]
    ],
    "ExtraInfo": "If two hosts are on the same network segment and belong to the same VLAN but user isolation has been configured on interfaces in the VLAN, the hosts cannot communicate with each other. To address this problem, run the ipv6 nd proxy inner-access-vlan enable command to enable the intra-VLAN proxy ND function on the gateway connecting the two hosts. After the command is run, the gateway uses its own MAC address and the IPv6 address of the destination host to send the source host an NA packet as a reply. Specifically, the gateway takes the place of the destination host to reply with an NA packet. In this manner, the hosts in a VLAN where user isolation has been configured can properly communicate with each other."
}