{
    "PageTitle": "ipv6 nd neighbor-limit vlan",
    "FuncDef": "The ipv6 nd neighbor-limit vlan command configures the maximum number of dynamic ND entries related to a Layer 2 interface that the VLANIF interface corresponding to the Layer 2 interface can learn.\nThe undo ipv6 nd neighbor-limit vlan command restores the default configuration. The ipv6 nd neighbor-limit vlan command configures the maximum number of dynamic ND entries related to a Layer 2 interface that the VLANIF interface corresponding to the Layer 2 interface can learn. The undo ipv6 nd neighbor-limit vlan command restores the default configuration. By default, if a VLANIF interface contains only one Layer 2 interface, it can learn a maximum of 16384 dynamic ND entries related to the Layer 2 interface; if a VLANIF interface contains multiple Layer 2 interfaces, it can learn a maximum of 16384 or less dynamic ND entries related to each Layer 2 interface. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 nd neighbor-limit vlan <vlanBegValue> [ to <vlanEndValue> ] maximum <limit-number>",
        "undo ipv6 nd neighbor-limit vlan <vlanBegValue> [ to <vlanEndValue> ] maximum <limit-number>",
        "undo ipv6 nd neighbor-limit vlan <vlanBegValue> [ to <vlanEndValue> ]"
    ],
    "ParentView": [
        "Layer 2 100GE interface view,Layer 2 10GE interface view,Layer 2 200GE interface view,25GE-L2 view,400GE-L2 view,Layer 2 50GE interface view,Layer 2 Eth-Trunk interface view,Layer 2 GE interface view,Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "to <vlanEndValue>",
            "Info": "Specifies an end VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "maximum <limit-number>",
            "Info": "Specifies the maximum number of each dynamic ND entry related to a Layer 2 interface that the VLANIF interface corresponding to the Layer 2 interface can learn.\nThe value is an integer ranging from 0 to 16384."
        },
        {
            "Parameters": "vlan <vlanBegValue>",
            "Info": "Specifies a start VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 1",
            "[*HUAWEI-Eth-Trunk1] portswitch",
            "[*HUAWEI-Eth-Trunk1] ipv6 nd neighbor-limit vlan 10 to 20 maximum 30"
        ]
    ],
    "ExtraInfo": "When an attacker sends a large number of ND messages to a Layer 2 interface, the VLANIF interface corresponding to the Layer 2 interface learns dynamic ND entries. If the number of dynamic ND entries learned by the VLANIF interface reaches the allowed maximum value, the VLANIF interface cannot learn dynamic ND entries related to the other Layer 2 interfaces in it, affecting authorized users' access to the network. To resolve this issue, run the ipv6 nd neighbor-limit command to configure the maximum number of dynamic ND entries related to a Layer 2 interface that the VLANIF interface corresponding to the Layer 2 interface can learn."
}