{
    "PageTitle": "ipv6 security rsakey-pair",
    "FuncDef": "The ipv6 security rsakey-pair command binds an RSA key pair to an interface.\nThe undo ipv6 security rsakey-pair command unbinds an RSA key pair from an interface. The ipv6 security rsakey-pair command binds an RSA key pair to an interface. The undo ipv6 security rsakey-pair command unbinds an RSA key pair from an interface. By default no modifier is configured, an RSA key pair is not bound to any interface. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 security rsakey-pair <key-label>",
        "undo ipv6 security rsakey-pair <key-label>"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE sub-interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,VBDIF interface view,VLANIF interface view,Management interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<key-label>",
            "Info": "Specifies the name of the RSA key pair.\nThe value is a string of 1 to 35 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rsa key-pair label huawei modulus 2048",
            "[*HUAWEI] interface Eth-Trunk 1",
            "[*HUAWEI-Eth-Trunk1] ipv6 enable",
            "[*HUAWEI-Eth-Trunk1] ipv6 security rsakey-pair huawei",
            "[*HUAWEI-Eth-Trunk1] ipv6 security modifier sec-level 1",
            "[*HUAWEI-Eth-Trunk1] ipv6 address 2001:db8:1::1/64 cga"
        ]
    ],
    "ExtraInfo": "An RSA key pair can be used to generate a modifier value and a CGA address on an interface only after the ipv6 security rsakey-pair command is run to bind the RSA key pair to the interface.\nAfter a CGA address is configured for an interface, the ND messages sent by the interface are protected against attacks."
}