{
    "PageTitle": "ipv6 nd anti-attack rate-limit source-ip (System view)",
    "FuncDef": "The ipv6 nd anti-attack rate-limit source-ip command sets the rate limit value for ND packets based on the source IP.\nThe undo ipv6 nd anti-attack rate-limit source-ip command deletes the rate limit value for ND packets based on the source IP. The ipv6 nd anti-attack rate-limit source-ip command sets the rate limit value for ND packets based on the source IP. The undo ipv6 nd anti-attack rate-limit source-ip command deletes the rate limit value for ND packets based on the source IP. By default, the ND source IP rate anti-attack function is disabled. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 nd { ns | na | rs | ra } anti-attackrate-limitsource-ip <ipv6-address> maximum <max-value>",
        "undo ipv6 nd { ns | na | rs | ra } anti-attackrate-limitsource-ip <ipv6-address> maximum <max-value>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ns",
            "Info": "Indicates the rate at which NS messages are sent.\n-"
        },
        {
            "Parameters": "na",
            "Info": "Indicates the rate at which NA messages are sent.\n-"
        },
        {
            "Parameters": "rs",
            "Info": "Indicates the rate at which RS messages are sent.\n-"
        },
        {
            "Parameters": "ra",
            "Info": "Indicates the rate at which RA messages are sent.\n-"
        },
        {
            "Parameters": "source-ip <ipv6-address>",
            "Info": "Specifies a source IP address.\nThe address is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "maximum <max-value>",
            "Info": "Specifies a rate limit for sending ND messages to the CPU based on a specified source IP address.\nThe value is an integer ranging from 0 to 5000, in pps."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 nd ra anti-attack rate-limit source-ip 2001:db8:1::1 maximum 550"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 nd rs anti-attack rate-limit source-ip 2001:db8:1::1 maximum 550"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 nd na anti-attack rate-limit source-ip 2001:db8:1::1 maximum 550"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 nd ns anti-attack rate-limit source-ip 2001:db8:1::1 maximum 550"
        ]
    ],
    "ExtraInfo": "If a device is attacked, it receives a large number of ND packets within a short period. As a result, the device consumes many CPU resources to learn and respond to ND entries, affecting the processing of other services. To resolve this issue, configure a rate limit for sending ND packets to the CPU based on any source IP address. After the configuration is complete, the device counts the number of ND packets received per period based on any source IP address. If the number of ND packets exceeds the configured limit, the device does not process excess ND packets."
}