{
    "PageTitle": "ipv6 nd multicast-suppress",
    "FuncDef": "The ipv6 nd multicast-suppress command configures the R flag for NA messages.\nThe undo ipv6 nd multicast-suppress command restores the default configuration. The ipv6 nd multicast-suppress command configures the R flag for NA messages. The undo ipv6 nd multicast-suppress command restores the default configuration. By default, the R flag carried in an NA message is a router flag. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 nd multicast-suppress { host | router }",
        "undo ipv6 nd multicast-suppress { host | router }"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "host",
            "Info": "Indicates that the R flag carried in an NA message is a host flag.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        },
        {
            "Parameters": "router",
            "Info": "Indicates that the R flag carried in an NA message is a router flag.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] ipv6 nd multicast-suppress proxy-reply enable",
            "[*HUAWEI-bd10] ipv6 nd multicast-suppress host"
        ]
    ],
    "ExtraInfo": "NS multicast suppression can be enabled to reduce or suppress packet flooding occurred during address resolution. With NS multicast suppression enabled, upon receipt of an NS message, a device checks whether the NS message contains information about the end user. If so, the device simply implements proxy ND or converts multicast streams to unicast streams. If not, the device forwards the NS message based on the original process. During interconnection with a third-party device, if the proxy ND entries that a peer device synchronizes with the local device through EVPN routes do not carry the R flag, the local device cannot determine whether the device that replies with an NA message is a router or a host. To configure the R flag for NA messages, run the ipv6 nd multicast-suppress command."
}