{
    "PageTitle": "ipv6 nd anti-attack rate-limit source-mac",
    "FuncDef": "The ipv6 nd anti-attack rate-limit source-mac command configures a rate limit for sending ND messages to the CPU based on a specified source MAC address, that is, the number of ND messages that can be processed per second based on a specified source MAC address.\nThe undo ipv6 nd anti-attack rate-limit source-mac command restores the default configuration. The ipv6 nd anti-attack rate-limit source-mac command configures a rate limit for sending ND messages to the CPU based on a specified source MAC address, that is, the number of ND messages that can be processed per second based on a specified source MAC address. The undo ipv6 nd anti-attack rate-limit source-mac command restores the default configuration. By default, no rate limit for sending ND messages to the CPU based on a specified source MAC address is configured. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ipv6 nd { ns | na | rs | ra } anti-attackrate-limitsource-mac <mac-address> maximum <max-value>",
        "undo ipv6 nd { ns | na | rs | ra } anti-attackrate-limitsource-mac <mac-address> maximum <max-value>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ns",
            "Info": "Indicates the rate at which NS messages are sent.\n-"
        },
        {
            "Parameters": "na",
            "Info": "Indicates the rate at which NA messages are sent.\n-"
        },
        {
            "Parameters": "rs",
            "Info": "Indicates the rate at which RS messages are sent.\n-"
        },
        {
            "Parameters": "ra",
            "Info": "Indicates the rate at which RA messages are sent.\n-"
        },
        {
            "Parameters": "source-mac <mac-address>",
            "Info": "Specifies a source MAC address.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. For example, the MAC address is 00e0-fc12-3456."
        },
        {
            "Parameters": "maximum <max-value>",
            "Info": "Specifies a rate limit for sending ND messages to the CPU based on a specified source MAC address.\nThe value is an integer ranging from 0 to 5000, in pps."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 nd na anti-attack rate-limit source-mac 00e0-fc12-3456 maximum 550"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 nd ra anti-attack rate-limit source-mac 00e0-fc12-3456 maximum 550"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 nd rs anti-attack rate-limit source-mac 00e0-fc12-3456 maximum 550"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 nd ns anti-attack rate-limit source-mac 00e0-fc12-3456 maximum 550"
        ]
    ],
    "ExtraInfo": "If a device is attacked, it receives a large number of ND messages within a short period. As a result, the device consumes many CPU resources to learn and respond to peer entries, affecting processing of other services. To resolve this issue, configure a rate limit for sending ND messages to the CPU based on a specified source MAC address. After the configuration is complete, the device counts the number of ND messages received per period based on a specified source MAC address. If the number of ND messages exceeds the configured limit, the device does not process excess ND messages."
}