{
    "PageTitle": "abr-summary",
    "FuncDef": "The abr-summary command configures route summarization on an area border router (ABR).\nThe undo abr-summary command disables route summarization from an ABR. The abr-summary command configures route summarization on an area border router (ABR). The undo abr-summary command disables route summarization from an ABR. By default, route summarization is not configured on ABRs.",
    "CLIs": [
        "abr-summary <ip-address> <mask> [ [ advertise | [ cost { <cost-value> | inherit-minimum } ] | [ generate-null0-route ] ] | [ not-advertise | [ cost { <cost-value> | inherit-minimum } ] ] | [ generate-null0-route | [ advertise ] | [ cost { <cost-value> | inherit-minimum } ] ] ]",
        "undo abr-summary <ip-address> <mask>"
    ],
    "ParentView": [
        "OSPF area view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ip-address>",
            "Info": "Specifies the IP address of a summary route.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "<mask>",
            "Info": "Specifies the IP address mask of the summary route.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "advertise",
            "Info": "Advertises the summary route.\nBy default, the summary route is advertised.\n-"
        },
        {
            "Parameters": "cost <cost-value>",
            "Info": "Specifies the cost of the summary route.\nThe value is an integer ranging from 0 to 16777214.\nBy default, the largest cost of the specific routes for summarization is used as the cost of the summary route."
        },
        {
            "Parameters": "inherit-minimum",
            "Info": "Indicates that the smallest cost of the specific routes for summarization is used as the cost of the summary route.\n-"
        },
        {
            "Parameters": "generate-null0-route",
            "Info": "Generates a blackhole route to prevent routing loops. After this parameter is specified, if the local device has advertised the summary LSA, the device ignores the routes within the same prefix mask range advertised by other devices.\n-"
        },
        {
            "Parameters": "not-advertise",
            "Info": "Prevents the summary route from being advertised.\nBy default, the summary route is advertised.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 100",
            "[*HUAWEI-ospf-100] area 1",
            "[*HUAWEI-ospf-100-area-0.0.0.1] network 10.42.10.0 0.0.0.255",
            "[*HUAWEI-ospf-100-area-0.0.0.1] network 10.42.110.0 0.0.0.255",
            "[*HUAWEI-ospf-100-area-0.0.0.1] abr-summary 10.42.0.0 255.255.0.0"
        ]
    ],
    "ExtraInfo": "When a large-scale OSPF network is deployed, the route search speed may be slowed down because the size of the OSPF routing table is too large. To solve this problem, you can configure route summarization to reduce the size of the routing table and simplify management.\nRoute summarization allows multiple routes with the same IP prefix to be summarized into one route. If a link within the summary IP address range frequently alternates between Up and Down, the change is not advertised to the devices beyond the summary IP address range. This prevents route flapping on the network and improves network stability. The abr-summary command configures route summarization on an ABR. When sending routing information to other areas, an ABR generates Type-3 LSA (Link Status Advertisement) based on network segments and ignores Type 3 LSAs received from other areas. If consecutive network segments (routes with the same prefix) exist in an area, you can run the abr-summary command to summarize these network segments into one network segment. The ABR then sends only one summary LSA. LSAs of the specified summary network segment are not sent separately. In this manner, the size of the routing table is reduced and the performance of the device is improved."
}