{
    "PageTitle": "default-route-advertise (OSPF view)",
    "FuncDef": "The default-route-advertise command advertises default routes to a common OSPF area.\nThe undo default-route-advertise command disables advertisement of default routes to a common OSPF area. The default-route-advertise command advertises default routes to a common OSPF area. The undo default-route-advertise command disables advertisement of default routes to a common OSPF area. By default, default routes are not advertised to a common OSPF area.",
    "CLIs": [
        "default-route-advertise [ [ always | permit-calculate-other ] | cost <costvalue> | type <typevalue> | { route-policy <route-policy-name> } | distribute-delay <delaytimer> | tag <tagvalue> ]",
        "default-route-advertise summary cost <costvalue>",
        "default-route-advertise [ permit-calculate-other | cost <costvalue> | type <typevalue> | { route-policy <route-policy-name> } | distribute-delay <delaytimer> | permit-ibgp | tag <tagvalue> | permit-preference-less-than <preference-val> ]",
        "undo default-route-advertise"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": [
        {
            "Parameters": "always",
            "Info": "Generates and advertises an LSA that describes a default route, regardless of whether the local device has active default routes from processes other than the local OSPF process.\n-"
        },
        {
            "Parameters": "permit-calculate-other",
            "Info": "Configures the device to calculate default Type 5 LSAs from other devices if this parameter is specified and the OSPF process has advertised Type 5 LSAs that describe a default route. If this parameter is not specified, the OSPF process does not calculate default Type 5 LSAs from other devices.\nIf an OSPF process does not advertise Type 5 LSAs that describe a default route, the OSPF process calculates the default Type 5 LSAs from other devices, regardless of whether this parameter is specified.\n-"
        },
        {
            "Parameters": "cost <costvalue>",
            "Info": "Specifies the cost of external routes.\nCost of a Type 1 external route = Cost of the route from the Router to the related ASBR + Cost of the route from the ASBR to the destination.Cost of a Type 2 external route = Cost of the route from the ASBR to the destination.\nThe value is an integer ranging from 0 to 16777214. The default value is 1."
        },
        {
            "Parameters": "type <typevalue>",
            "Info": "Specifies the type of the external routes.\nThe value is 1 or 2.\n1: Type 1 external route2: Type 2 external route\nThe default value is 2."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a route-policy. When a device's routing table contains matching default routes that are generated from processes other than the local OSPF process, a device advertises the default routes based on the route-policy configuration.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "distribute-delay <delaytimer>",
            "Info": "Specifies the delay timer for advertising the default route.\nThe value is an integer ranging from 1 to 65535, in seconds."
        },
        {
            "Parameters": "tag <tagvalue>",
            "Info": "Specifies the tag of the routes imported into VPN.\nThe value is an integer ranging from 0 to 4294967295. The default value is 1."
        },
        {
            "Parameters": "summary",
            "Info": "Advertises the Type 3 summary LSA of the specified default route. Before specifying this parameter, ensure that VPN is enabled. Otherwise, routes cannot be advertised.\n-"
        },
        {
            "Parameters": "permit-ibgp",
            "Info": "Imports IBGP routes.\n-"
        },
        {
            "Parameters": "permit-preference-less-than <preference-val>",
            "Info": "Allows the device to import the default route whose preference value is smaller than the configured value.\nThe value is an integer ranging from 1 to 256."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 1",
            "[*HUAWEI-ospf-1] default-route-advertise always"
        ]
    ],
    "ExtraInfo": "The import-route (OSPF) command cannot be used to import external default routes. To import the default route generated by other protocols, you must run the default-route-advertise command on the ASBR to advertise the default route to the entire common OSPF area.\nIf the ASBR already has a default route, running the default-route-advertise command will advertise the default route 0.0.0.0 in the entire OSPF area.\nIf the ASBR does not have a default route, run the default-route-advertise command with always specified."
}