{
    "PageTitle": "filter-policy import (OSPF view)",
    "FuncDef": "The filter-policy import command configures the device to filter the routes calculated by OSPF according to a filtering policy. Only the routes that pass the filtering can be added to the RIB.\nThe undo filter-policy import command disables OSPF from filtering received routes. The filter-policy import command configures the device to filter the routes calculated by OSPF according to a filtering policy. Only the routes that pass the filtering can be added to the RIB. The undo filter-policy import command disables OSPF from filtering received routes. By default, OSPF does not filter received routes.",
    "CLIs": [
        "filter-policy <acl-number> import",
        "filter-policy { acl-name <acl-name> | ip-prefix <ip-prefix-name> | { route-policy <route-policy-name> } [ secondary ] } import",
        "undo filter-policy [ <acl-number> | acl-name <acl-name> | ip-prefix <ip-prefix-name> | { route-policy <route-policy-name> } [ secondary ] ] import"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": [
        {
            "Parameters": "<acl-number>",
            "Info": "Specifies the basic ACL number.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "acl-name <acl-name>",
            "Info": "Specifies the name of a named basic ACL.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "ip-prefix <ip-prefix-name>",
            "Info": "Specifies the name of an IP prefix list.\nThe value is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a routing policy.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "secondary",
            "Info": "Indicates the suboptimal route.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix prefix1 permit 1.1.1.1 24",
            "[*HUAWEI] ospf 100",
            "[*HUAWEI-ospf-100] filter-policy ip-prefix prefix1 import"
        ]
    ],
    "ExtraInfo": "You can run the filter-policy import command to set a filtering policy for the received routes. Only the routes that pass the filtering are added to the RIB. OSPF is a link-state dynamic routing protocol, with routing information carried in the link-state database (LSDB). Therefore, the filter-policy import command cannot be used to filter the advertised or received LSAs. Actually, this command is used to filter the routes calculated by OSPF."
}