{
    "PageTitle": "filter (OSPF area view)",
    "FuncDef": "The filter export command filters the outgoing Type-3 LSAs of the local area.\nThe undo filter export command restores the default setting.\nThe filter import command filters incoming Type-3 LSAs of the local area.\nThe undo filter import command restores the default setting. The filter export command filters the outgoing Type-3 LSAs of the local area. The undo filter export command restores the default setting. The filter import command filters incoming Type-3 LSAs of the local area. The undo filter import command restores the default setting. By default, outgoing Type-3 LSAs of the local area are not filtered.\n\n\nBy default, the incoming Type-3 LSAs are not filtered. By default, outgoing Type-3 LSAs of the local area are not filtered. By default, the incoming Type-3 LSAs are not filtered.",
    "CLIs": [
        "filter { acl-name <acl-name> | ip-prefix <ip-prefix-name> | route-policy <route-policy-name> } export",
        "filter { acl-name <acl-name> | ip-prefix <ip-prefix-name> | route-policy <route-policy-name> } import [ include-abr-summary ]",
        "filter <acl-number> export",
        "filter <acl-number> import [ include-abr-summary ]",
        "undo filter [ acl-name <acl-name> | ip-prefix <ip-prefix-name> | route-policy <route-policy-name> | <acl-number> ] export",
        "undo filter [ acl-name <acl-name> | ip-prefix <ip-prefix-name> | route-policy <route-policy-name> | <acl-number> ] import"
    ],
    "ParentView": [
        "OSPF area view"
    ],
    "ParaDef": [
        {
            "Parameters": "acl-name <acl-name>",
            "Info": "Specifies the name of a named basic ACL.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "ip-prefix <ip-prefix-name>",
            "Info": "Specifies the name of an IP prefix list.\nThe value is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a routing policy.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "include-abr-summary",
            "Info": "Specifies a route-policy for the summarized route on the ABR.\n-"
        },
        {
            "Parameters": "<acl-number>",
            "Info": "Specifies the basic ACL number.\nThe value is an integer ranging from 2000 to 2999."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix prefix1 permit 1.1.1.1 24",
            "[*HUAWEI] ospf 1",
            "[*HUAWEI-ospf-1] area 1",
            "[*HUAWEI-ospf-1-area-0.0.0.1] filter ip-prefix prefix1 export"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix prefix1 permit 1.1.1.1 24",
            "[*HUAWEI] ospf 100",
            "[*HUAWEI-ospf-100] area 1",
            "[*HUAWEI-ospf-100-area-0.0.0.1] filter ip-prefix prefix1 import"
        ]
    ],
    "ExtraInfo": "You can run the filter export command to filter LSAs in an area to prevent useless LSAs from being sent to other areas. This reduces the size of the LSDB and speeds up network convergence. You can run this command in the local area to set filtering conditions for the Type 3 LSAs to be advertised.\nYou can run the filter import command to filter LSAs in an area to prevent unnecessary LSAs from being accepted from other areas. This reduces the size of the LSDB and speeds up network convergence. You can run this command in the local area to set filtering conditions for the incoming Type 3 LSAs."
}