{
    "PageTitle": "import-rib vpn-instance protocol",
    "FuncDef": "The ip import-rib vpn-instance protocol command imports routes in a VPN instance routing table to the public network routing table.\nThe undo ip import-rib vpn-instance protocol command restores the default configuration.\nThe ipv6 import-rib vpn-instance protocol command enables a device to import IPv6 routes from a VPN instance to the public network instance's IPv6 routing table.\nThe undo ipv6 import-rib vpn-instance protocol command disables a device from importing IPv6 routes from a VPN instance to the public network instance's IPv6 routing table. The ip import-rib vpn-instance protocol command imports routes in a VPN instance routing table to the public network routing table. The undo ip import-rib vpn-instance protocol command restores the default configuration. The ipv6 import-rib vpn-instance protocol command enables a device to import IPv6 routes from a VPN instance to the public network instance's IPv6 routing table. The undo ipv6 import-rib vpn-instance protocol command disables a device from importing IPv6 routes from a VPN instance to the public network instance's IPv6 routing table. By default, routes in VPN instance routing tables are not imported to the public network routing table.\n\n\nBy default, a device does not import IPv6 routes from a VPN instance to the public network instance's IPv6 routing table. By default, routes in VPN instance routing tables are not imported to the public network routing table. By default, a device does not import IPv6 routes from a VPN instance to the public network instance's IPv6 routing table.",
    "CLIs": [
        "ip import-rib vpn-instance <vpn-instance-name> protocolospf <process-id> [ valid-route ] [ route-policy <route-policy-name> ]",
        "undo ip import-rib vpn-instance <vpn-instance-name> protocolospf <process-id> [ valid-route ] [ route-policy <route-policy-name> ]",
        "ipv6 import-rib vpn-instance <vpn-instance-name> protocolospfv3 <process-id> [ valid-route ] [ route-policy <route-policy-name> ]",
        "undo ipv6 import-rib vpn-instance <vpn-instance-name> protocolospfv3 <process-id> [ valid-route ] [ route-policy <route-policy-name> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "<vpn-instance-name>",
            "Info": "Specifies a VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters, which do not contain spaces. The VPN instance name cannot be _public_. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "protocol",
            "Info": "Specifies the type of routes to be imported.\n-"
        },
        {
            "Parameters": "ospf <process-id>",
            "Info": "Imports OSPF routes from the specified process (process-id).\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "valid-route",
            "Info": "Imports valid routes of the corresponding route type.\n-"
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a route-policy.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "ospfv3 <process-id>",
            "Info": "Imports OSPFv3 routes. process-id specifies the ID of an OSPFv3 process.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is an integer ranging from 1 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv4-family",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vrf1] quit",
            "[*HUAWEI] ip import-rib vpn-instance vrf1 protocol ospf 1 valid-route"
        ]
    ],
    "ExtraInfo": "In a VPN scenario, one VPN can communicate with another VPN if they have matching VPN targets, but VPNs cannot communicate with the public network. To enable a VPN to communicate with the public network, you have to ensure that the VPN and public network can obtain routes to each other. To import the VPN instance routes to public network, run the ip import-rib vpn-instance command.\nIn an intelligent traffic control scenario, traffic of different users are distributed to different VPNs. To enable public-network traffic to reach the VPNs, run the ip import-rib vpn-instance command to import routes in each VPN instance routing table to the public network routing table.\nTraffic forwarding relies on direct routes (Vlink direct routes) generated based on user entries. When VLAN tag termination sub-interfaces are used for route import between VPN and public network, Vlink direct routes cannot be imported. As a result, traffic forwarding is interrupted. To solve this problem, route import between VPN and public network newly supports import of Vlink direct routes."
}