{
    "PageTitle": "import-rib protocol ospf",
    "FuncDef": "The import-rib protocol ospf command imports public network or other VPN instance routes to a VPN instance routing table.\nThe undo import-rib protocol ospf command restores the default configuration. The import-rib protocol ospf command imports public network or other VPN instance routes to a VPN instance routing table. The undo import-rib protocol ospf command restores the default configuration. By default, public network or other VPN instance routes are not imported to VPN instance routing tables.",
    "CLIs": [
        "import-rib vpn-instance <vpn-instance-name> protocolospf <process-id> [ valid-route ] [ route-policy <route-policy-name> ]",
        "import-rib public protocol ospf <process-id> [ valid-route ] [ route-policy <route-policy-name> ]",
        "undo import-rib vpn-instance <vpn-instance-name> protocolospf <process-id> [ valid-route ] [ route-policy <route-policy-name> ]",
        "undo import-rib public protocol ospf <process-id> [ valid-route ] [ route-policy <route-policy-name> ]"
    ],
    "ParentView": [
        "VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ospf <process-id>",
            "Info": "Imports OSPF routes from the specified process (process-id).\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "valid-route",
            "Info": "Imports valid routes of the corresponding route type.\n-"
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of a route-policy.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. The VPN instance name cannot be _public_. If the character string is quoted by double quotation marks, the character string can contain spaces."
        },
        {
            "Parameters": "public",
            "Info": "Imports routes from the public network BGP routing table.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv4-family",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] import-rib public protocol ospf 1 valid-route"
        ]
    ],
    "ExtraInfo": "In VPN networking, users in a VPN instance can communicate with users in another VPN instance only if the two VPN instances have matching VPN targets, but cannot communicate with public network users. To enable a VPN to communicate with the public network, you have to ensure that the VPN and public network users can obtain routes to each other. To import public network routes to a VPN instance, run the import-rib public command.\nIn VPN networking, users of a VPN instance can communicate with users of another VPN instance only if the two VPN instances have matching VPN targets. To enable users in different VPN instances to communicate with each other, ensure that users in different VPN instances can obtain routes from each other. To import routes from another VPN instance to a specified VPN instance, run the import-rib vpn-instance command.\nIn an intelligent traffic control scenario, traffic of different users are distributed to different VPNs. To enable the traffic to reach the public network, run the import-rib public command to import public network routes to each VPN instance routing table.\nWhen VLAN tag termination sub-interfaces are used to import routes between VPN and public network instances, traffic forwarding depends on direct routes (Vlink direct routes) generated based on user entries. However, the direct routes imported between VPN and public network instances do not contain Vlink direct routes. As a result, traffic fails to be forwarded. To solve this problem, route import between VPN and public network instances newly supports import of Vlink direct routes."
}