{
    "PageTitle": "lsa-originate-interval",
    "FuncDef": "The lsa-originate-interval command sets the interval at which LSAs are updated.\nThe undo lsa-originate-interval command restores the default configuration. The lsa-originate-interval command sets the interval at which LSAs are updated. The undo lsa-originate-interval command restores the default configuration. By default, the intelligent timer is enabled; the maximum interval at which LSAs are updated is 5000 ms, the initial interval is 500 ms, and the Holdtime interval is 1000 ms.For Type-3,Type-4 and Type-10 LSAs, the default interval is 5s.",
    "CLIs": [
        "lsa-originate-interval { 0 | intelligent-timer <max-interval> <start-interval> <hold-interval> [ other-type <interval> ] | other-type <interval> [ intelligent-timer <max-interval> <start-interval> <hold-interval> ] }",
        "undo lsa-originate-interval"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": [
        {
            "Parameters": "0",
            "Info": "Sets the interval at which LSAs are updated to 0 ms, that is, deletes the initial interval (5s) for updating LSAs.\n-"
        },
        {
            "Parameters": "intelligent-timer",
            "Info": "Uses an intelligent timer to set the interval for updating OSPF Type 1 LSAs (Router-LSAs), Type 2 LSAs (Network-LSAs), Type 5 LSAs (AS-External-LSAs), Type 7 LSAs (NSSA-LSAs), and some Type 10 LSAs (only Extended Link Opaque LSAs).\n-"
        },
        {
            "Parameters": "<max-interval>",
            "Info": "Specifies the maximum interval at which LSAs are updated.\nThe value ranges from 1 to 300000, in milliseconds."
        },
        {
            "Parameters": "<start-interval>",
            "Info": "Specifies the initial interval at which LSAs are updated.\nThe value ranges from 0 to 60000, in milliseconds."
        },
        {
            "Parameters": "<hold-interval>",
            "Info": "Specifies the Holdtime interval at which LSAs are updated.\nThe value is an integer ranging from 1 to 60000 in milliseconds."
        },
        {
            "Parameters": "other-type <interval>",
            "Info": "Sets the interval for updating OSPF Type 3 LSAs (Network-Summary-LSAs), Type 4 LSAs (ASBR-Summary-LSAs), and some Type 10 LSAs (except Extended Link Opaque LSAs).\nThe value is an integer ranging from 0 to 10, in seconds. The default value is 5."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 1",
            "[*HUAWEI-ospf-1] lsa-originate-interval 0"
        ]
    ],
    "ExtraInfo": "OSPF sets a 5-second update interval for LSAs. This prevents network connections or frequent route flapping from consuming excessive network bandwidth or device resources. On a stable network that requires fast route convergence, you can alter the interval to 0 seconds. In this manner, LSAs indicating topology or route changes can be advertised immediately, which speeds up route convergence. When the network is unstable, route calculation may be performed frequently, which consumes a large number of CPU resources. In addition, LSAs that describe the unstable topology are generated and transmitted on the unstable network. Frequently processing such LSAs affects the rapid and stable operation of the entire network. You can configure an intelligent timer so that the device can dynamically adjust the interval based on the user configuration and the frequency of triggering events (such as route calculation) to quickly stabilize the network.\nIf there is no special requirement for the network, using the default value is recommended.\nDue to the timer restriction, when the configured interval is less than 100 ms, the interval is updated based on 100 ms."
}