{
    "PageTitle": "lsdb-overflow-limit",
    "FuncDef": "The lsdb-overflow-limit command configures a maximum number of external routes supported by the OSPF LSDB.\nThe undo lsdb-overflow-limit command deletes the configured maximum number of external routes supported by the OSPF LSDB. The lsdb-overflow-limit command configures a maximum number of external routes supported by the OSPF LSDB. The undo lsdb-overflow-limit command deletes the configured maximum number of external routes supported by the OSPF LSDB. By default, the maximum number of external routes supported by the OSPF LSDB is not set.",
    "CLIs": [
        "lsdb-overflow-limit <number>",
        "undo lsdb-overflow-limit [ <number> ]"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": [
        {
            "Parameters": "<number>",
            "Info": "Specifies the maximum number of external routes supported by the OSPF LSDB.\nThe value is an integer ranging from 1 to 1000000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 100",
            "[*HUAWEI-ospf-100] lsdb-overflow-limit 400000"
        ]
    ],
    "ExtraInfo": "If OSPF incorrectly imports a large number of external routes on a network, the device may fail to process the routes due to resource limitations.\nTo address this problem, run the lsdb-overflow-limit command to set the maximum number of external routes in the OSPF LSDB. If the number of external routes imported by OSPF exceeds the maximum number allowed by the LSDB, the device deletes the non-default external routes generated by itself and maintains normal forwarding of other external routes imported by OSPF.\nThe OSPF is in LSDB overflow status field in the display ospf brief command output indicates that the current OSPF process is in the overload state. OSPF LSDB is approaching overflow limit: indicates that the number of external routes in the OSPF LSDB reaches 90% of the maximum number.\nAlarms about the number of external routes in the OSPF LSDB are described as follows:"
}