{
    "PageTitle": "nssa (OSPF area view)",
    "FuncDef": "The nssa command configures an NSSA.\nThe undo nssa command cancels the configuration of an NSSA. The nssa command configures an NSSA. The undo nssa command cancels the configuration of an NSSA. By default, an OSPF area is not configured as an NSSA.",
    "CLIs": [
        "nssa [ { default-route-advertise [ backbone-peer-ignore ] } | no-import-route | no-summary | set-n-bit | suppress-forwarding-address | translator-always | translator-interval <interval-value> | zero-address-forwarding ]",
        "undo nssa"
    ],
    "ParentView": [
        "OSPF area view"
    ],
    "ParaDef": [
        {
            "Parameters": "default-route-advertise",
            "Info": "Configure the ABR or ASBR to generate default Type 7 LSAs and advertise them to the NSSA.\n-"
        },
        {
            "Parameters": "backbone-peer-ignore",
            "Info": "Prevents the ABR from checking the neighbor status when the ABR generates default Type 7 LSAs and advertises them to the NSSA. Specifically, the ABR generates default Type 7 LSAs and advertises them to the NSSA as long as an interface that is Up exist in the backbone area.\n-"
        },
        {
            "Parameters": "no-import-route",
            "Info": "Indicates that no external route is imported to an NSSA.\n-"
        },
        {
            "Parameters": "no-summary",
            "Info": "Indicates that an ABR is prevented from sending summary LSAs to the NSSA.\n-"
        },
        {
            "Parameters": "set-n-bit",
            "Info": "Indicates that the N-bit is set in DD packets.\n-"
        },
        {
            "Parameters": "suppress-forwarding-address",
            "Info": "Sets the forwarding address (FA) of the Type 5 LSA translated by the NSSA ABR to 0.0.0.0.\n-"
        },
        {
            "Parameters": "translator-always",
            "Info": "Indicates an ABR in an NSSA as an all-the-time translator. Multiple ABRs in an NSSA can be configured as translators.\n-"
        },
        {
            "Parameters": "translator-interval <interval-value>",
            "Info": "Specifies the timeout period of a translator.\nThe value is an integer ranging from 1 to 120, in seconds. The default value is 40 seconds."
        },
        {
            "Parameters": "zero-address-forwarding",
            "Info": "Sets the FA of the generated NSSA LSAs to 0.0.0.0 when external routes are imported by the ABR in an NSSA.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 1",
            "[*HUAWEI-ospf-1] area 1",
            "[*HUAWEI-ospf-1-area-0.0.0.1] nssa"
        ]
    ],
    "ExtraInfo": "If you need to import AS external routes to an area and prevent these routes from consuming resources, you can configure the area as an NSSA. The NSSA imports AS external routes and transmits them to the entire OSPF AS.\nNSSA attributes must be configured on all devices in the NSSA using the nssa command. The application scenarios of the parameters are as follows:"
}