{
    "PageTitle": "ospf bfd",
    "FuncDef": "The ospf bfd command enables bidirectional forwarding detection (BFD) on an OSPF interface, or sets parameter values for a BFD session.\nThe undo ospf bfd command disables BFD from an interface, or restores the default parameter values of a BFD session. The ospf bfd command enables bidirectional forwarding detection (BFD) on an OSPF interface, or sets parameter values for a BFD session. The undo ospf bfd command disables BFD from an interface, or restores the default parameter values of a BFD session. By default, BFD is not enabled in the OSPF interface view.",
    "CLIs": [
        "ospf bfd { min-tx-interval <transmit-interval> | min-rx-interval <receive-interval> | detect-multiplier <multiplier-value> | frr-binding }",
        "undo ospf bfd { min-tx-interval [ <transmit-interval> ] | min-rx-interval [ <receive-interval> ] | detect-multiplier [ <multiplier-value> ] | frr-binding }"
    ],
    "ParentView": [
        "100ge sub-interface view,100GE interface view,10GE sub-interface view,10GE interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE sub-interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk sub-interface view,Eth-Trunk interface view,Tunnel interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "min-tx-interval <transmit-interval>",
            "Info": "Specifies the minimum interval at which BFD packets are sent to the remote device.\nThe value is an integer ranging from 3 to 1000, in milliseconds."
        },
        {
            "Parameters": "min-rx-interval <receive-interval>",
            "Info": "Specifies the minimum interval for receiving BFD messages from the peer.\nThe value is an integer ranging from 3 to 1000, in milliseconds."
        },
        {
            "Parameters": "detect-multiplier <multiplier-value>",
            "Info": "Specifies the local detect multiplier.\nThe value is an integer ranging from 3 to 50. The default value is 3."
        },
        {
            "Parameters": "frr-binding",
            "Info": "Binds the BFD session status to OSPF IP FRR. When BFD detects a link fault on an interface, the BFD session goes Down and triggers FRR to switch traffic from the faulty link to the backup link.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ospf bfd enable",
            "[*HUAWEI-100GE1/0/1] ospf bfd min-rx-interval 40 detect-multiplier 4"
        ]
    ],
    "ExtraInfo": "A link fault or topology change on a network causes route recalculation in an area. Shortening the convergence time of routing protocols is important to improve network performance.\nLink faults cannot be completely avoided. Therefore, it is feasible to speed up fault detection and notify routing protocols of the faults. BFD is associated with routing protocols. Once a link fails, BFD can speed up the convergence of routing protocols.\nWhen configuring OSPF IP FRR, you can configure the frr-binding parameter so that the lower layer can rapidly respond to link changes and switch traffic to the backup link."
}