{
    "PageTitle": "ospf suppress-flapping peer",
    "FuncDef": "The ospf suppress-flapping peer command configures detection parameters for OSPF neighbor relationship flapping suppression.\nThe undo ospf suppress-flapping peer command restores the default detection parameters.\nThe ospf suppress-flapping peer disable command disables OSPF neighbor relationship flapping suppression from an interface.\nThe undo ospf suppress-flapping peer disable command enables OSPF neighbor relationship flapping suppression on an interface.\nThe ospf suppress-flapping peer hold-down command configures the Hold-down mode and sets duration for this mode.\nThe undo ospf suppress-flapping peer hold-down command cancels the Hold-down mode.\nThe ospf suppress-flapping peer hold-max-cost disable command disables the Hold-max-cost mode.\nThe undo ospf suppress-flapping peer hold-max-cost disable command enables the Hold-max-cost mode. The ospf suppress-flapping peer command configures detection parameters for OSPF neighbor relationship flapping suppression. The undo ospf suppress-flapping peer command restores the default detection parameters. The ospf suppress-flapping peer disable command disables OSPF neighbor relationship flapping suppression from an interface. The undo ospf suppress-flapping peer disable command enables OSPF neighbor relationship flapping suppression on an interface. The ospf suppress-flapping peer hold-down command configures the Hold-down mode and sets duration for this mode. The undo ospf suppress-flapping peer hold-down command cancels the Hold-down mode. The ospf suppress-flapping peer hold-max-cost disable command disables the Hold-max-cost mode. The undo ospf suppress-flapping peer hold-max-cost disable command enables the Hold-max-cost mode. By default, the detection interval of OSPF neighbor flapping suppression is 60s, the suppression threshold is 10, and the interval for exiting from suppression is 120s.\n\n\nBy default, OSPF neighbor flapping suppression is enabled on all interfaces.\n\n\nBy default, the Hold-down mode is disabled and the Hold-max-cost mode is enabled. By default, the detection interval of OSPF neighbor flapping suppression is 60s, the suppression threshold is 10, and the interval for exiting from suppression is 120s. By default, OSPF neighbor flapping suppression is enabled on all interfaces. By default, the Hold-down mode is disabled and the Hold-max-cost mode is enabled.",
    "CLIs": [
        "ospf suppress-flapping peer disable",
        "ospf suppress-flapping peer hold-down <interval>",
        "ospf suppress-flapping peer hold-max-cost disable",
        "ospf suppress-flapping peer { detecting-interval <detecting-interval> | threshold <threshold> | resume-interval <resume-interval> }",
        "undo ospf suppress-flapping peer disable",
        "undo ospf suppress-flapping peer hold-down [ <interval> ]",
        "undo ospf suppress-flapping peer hold-max-cost disable",
        "undo ospf suppress-flapping peer { detecting-interval <detecting-interval> | threshold <threshold> | resume-interval <resume-interval> }"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk interface view,Tunnel interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "hold-down <interval>",
            "Info": "Specifies the duration of the Hold-down mode.\nThe value is an integer ranging from 1 to 86400, in seconds."
        },
        {
            "Parameters": "detecting-interval <detecting-interval>",
            "Info": "Specifies the detection interval of OSPF neighbor relationship flapping suppression.\nEach OSPF interface on which OSPF neighbor relationship flapping suppression is enabled starts a flapping counter. If the interval between two successive neighbor status changes from Full to a non-Full state is shorter than detecting-interval, a valid flapping_event is recorded, and the flapping_count increases by 1.\nThe value is an integer ranging from 1 to 300, in seconds. The default value is 60s."
        },
        {
            "Parameters": "threshold <threshold>",
            "Info": "Specifies the threshold of OSPF neighbor relationship flapping suppression.\nWhen the flapping_count reaches or exceeds threshold, flapping suppression takes effect.\nThe value is an integer ranging from 1 to 1000. The default value is 10."
        },
        {
            "Parameters": "resume-interval <resume-interval>",
            "Info": "Specifies a flapping detection clearance threshold for OSPF neighbor flapping suppression.\nIf the interval between two successive neighbor status changes from Full to a non-Full state is greater than resume-interval, the flapping_count is cleared.\nIf OSPF neighbor flapping suppression works in Hold-max-cost mode, resume-interval specifies the duration of the Hold-max-cost mode.\nThe value of resume-interval must be greater than that of detecting-interval.\nThe value is an integer ranging from 2 to 1000, in seconds. The default value is 120s."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ospf suppress-flapping peer hold-down 200"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ospf suppress-flapping peer disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ospf suppress-flapping peer detecting-interval 5 threshold 40 resume-interval 20"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ospf suppress-flapping peer hold-max-cost disable"
        ]
    ],
    "ExtraInfo": "You can set detection parameters for OSPF neighbor flapping suppression on a specified interface according to the actual situation of the network. The default values are recommended.\nBy default, OSPF neighbor flapping suppression is enabled globally. That is, OSPF neighbor flapping suppression is enabled on all interfaces in a process. To disable OSPF neighbor flapping suppression on a specified interface, run the ospf suppress-flapping peer disable command.\nAfter an interface enters the flapping suppression state, all neighbors connected to the interface enter the flapping suppression state.\nOSPF neighbor flapping suppression has two modes: Hold-down and Hold-max-cost."
}