{
    "PageTitle": "ospf source sub-address",
    "FuncDef": "The ospf source sub-address command specifies a secondary IP address as the source IP address on a broadcast network.\nThe undo ospf source sub-address command cancels the configuration. The ospf source sub-address command specifies a secondary IP address as the source IP address on a broadcast network. The undo ospf source sub-address command cancels the configuration. By default, a primary IP address is used as the source IP address to establish an OSPF neighbor relationship on a broadcast network. This command is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "ospf source sub-address <ipv4-address>",
        "undo ospf source sub-address [ <ipv4-address> ]"
    ],
    "ParentView": [
        "VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<ipv4-address>",
            "Info": "Specifies a secondary IP address as the source IP address.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Vlanif 1",
            "[*HUAWEI-Vlanif1] ospf source sub-address 1.1.1.1"
        ]
    ],
    "ExtraInfo": "To specify a secondary IP address as the source IP address on a broadcast network, run the ospf source sub-address command. After the configuration, the secondary IP address will be used to establish OSPF neighbor relationships.\nIn an M-LAG scenario, VLANIF interfaces of M-LAG devices have the same primary IP address. To establish OSPF neighbor relationships between M-LAG devices and between M-LAG devices and user-side access devices, you need to configure different secondary IP addresses for the master and backup M-LAG devices and specify the secondary IP addresses as the source IP addresses, this address is used to establish an OSPF neighbor relationship."
}