{
    "PageTitle": "ospf timer retransmit",
    "FuncDef": "The ospf timer retransmit command sets the interval at which LSAs are retransmitted on an interface.\nThe undo ospf timer retransmit command restores the default value. The ospf timer retransmit command sets the interval at which LSAs are retransmitted on an interface. The undo ospf timer retransmit command restores the default value. The default interval is 5 seconds.",
    "CLIs": [
        "ospf timer retransmit <interval>",
        "undo ospf timer retransmit"
    ],
    "ParentView": [
        "100GE interface view,10GE interface view,200GE interface view,25GE sub-interface view,25GE interface view,400GE interface view,50GE sub-interface view,50GE interface view,Eth-Trunk interface view,Tunnel interface view,VBDIF interface view,VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interval>",
            "Info": "Specifies an interval at which LSAs are retransmitted on an interface.\nThe value is an integer ranging from 1 to 3600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE1/0/1",
            "[~HUAWEI-100GE1/0/1] undo portswitch",
            "[*HUAWEI-100GE1/0/1] ospf timer retransmit 8"
        ]
    ],
    "ExtraInfo": "After sending an LSA to its neighbor, a device needs to wait for the LSAck packet from the neighbor. If the user does not receive the LSAck packet from the neighbor within the nth retransmission interval, the user retransmits the LSA to the neighbor. In the preceding information,\nInterval at which LSAs are retransmitted for the first time = Configured interval at which LSAs are retransmitted,\nInterval at which LSAs are retransmitted for the second time = Configured interval at which LSAs are retransmitted,\nInterval at which LSAs are retransmitted for the third time = Configured interval at which LSAs are retransmitted,\nInterval for retransmitting LSAs for the fourth time = Configured interval for retransmitting LSAs x 2,\nInterval at which LSAs are retransmitted for the fifth time = Configured interval at which LSAs are retransmitted x 2^2,\n...\nInterval for retransmitting LSAs for the nth time = Configured interval for retransmitting LSAs, that is, interval x 2^(n-3)\nIf interval x 2^(n-3) is greater than 30, the interval for retransmitting LSAs for the nth time is 30.\nIf the configured interval for retransmitting LSAs is greater than 30s, the interval for retransmitting LSAs for the nth time is equal to the configured interval.\nThe interval for retransmitting LSAs between neighboring devices should not be set too small. Otherwise, LSAs are retransmitted unnecessarily."
}