{
    "PageTitle": "preference (OSPF view)",
    "FuncDef": "The preference command sets a priority for OSPF routes.\nThe undo preference command restores the default value. The preference command sets a priority for OSPF routes. The undo preference command restores the default value. By default, the priority of OSPF routes is 10. When ASE is specified, the default value is 150.",
    "CLIs": [
        "preference { <preferencevalue> | { route-policy <route-policy-name> } }",
        "preference { ase | intra | inter } { <preferencevalue> | { route-policy <route-policy-name> } }",
        "undo preference",
        "undo preference { ase | intra | inter }"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": [
        {
            "Parameters": "<preferencevalue>",
            "Info": "Specifies a priority of OSPF routes.\nThe smaller the priority value, the higher the priority.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "route-policy <route-policy-name>",
            "Info": "Specifies the name of the route-policy.\nThe value is a string of 1 to 200 case-sensitive characters without spaces. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "ase",
            "Info": "Sets a priority for AS external routes.\n-"
        },
        {
            "Parameters": "intra",
            "Info": "Sets a priority for intra-area routes.\n-"
        },
        {
            "Parameters": "inter",
            "Info": "Sets a priority for inter-area routes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 200",
            "[*HUAWEI-ospf-200] preference ase 130"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 100",
            "[*HUAWEI-ospf-100] preference 150"
        ]
    ],
    "ExtraInfo": "If a device runs multiple dynamic routing protocols at the same time, routing information may be shared and selected among the routing protocols. The system sets a default preference for each routing protocol. If different protocols have routes to the same destination, the route with a higher priority is selected. To set a preference for an OSPF route, run this command.\nWhen configuring the route-policy parameter, you can set the preference for matched routes by using the routing policy."
}