{
    "PageTitle": "prefix-priority (OSPF view)",
    "FuncDef": "The prefix-priority command sets a convergence priority for OSPF routes.\nThe undo prefix-priority command restores the default value. The prefix-priority command sets a convergence priority for OSPF routes. The undo prefix-priority command restores the default value. By default, in the OSPF routing table, the convergence priority of public 32-bit host routes and default routes is medium, and the convergence priority of other OSPF routes is low. In the IP routing table, the convergence priority of OSPF public 32-bit host routes and default routes is high, and the convergence priority of other OSPF routes is medium.",
    "CLIs": [
        "prefix-priority { critical | high | medium } ip-prefix <ip-prefix-name>",
        "undo prefix-priority { critical | high | medium }"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": [
        {
            "Parameters": "critical",
            "Info": "Sets the convergence priority of OSPF routes to critical.\n-"
        },
        {
            "Parameters": "high",
            "Info": "Sets the convergence priority of OSPFv3 routes to high.\n-"
        },
        {
            "Parameters": "medium",
            "Info": "Sets the convergence priority of OSPFv3 routes to medium.\n-"
        },
        {
            "Parameters": "ip-prefix <ip-prefix-name>",
            "Info": "Specifies the prefix list name.\nThe value is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix critical-prefix index 10 permit 10.0.0.0 8",
            "[*HUAWEI] ospf 1",
            "[*HUAWEI-ospf-1] prefix-priority critical ip-prefix critical-prefix"
        ]
    ],
    "ExtraInfo": "To set the convergence priority of OSPF routes based on a specified IP prefix list, run the prefix-priority command. The command takes effect on the public network only.\nAfter the prefix-priority command is used in the OSPF view, OSPF route calculation, link-state advertisement (LSA) flooding, and LSDB synchronization can be implemented according to the configured priority. Therefore, route convergence can be controlled."
}