{
    "PageTitle": "rfc1583 compatible different-area-path prefer lower-cost",
    "FuncDef": "The rfc1583 compatible different-area-path prefer lower-cost command changes the route selection rule in RFC 1583-compatible mode to be the same as the default route selection rule on the ASBR. That is, if the area IDs of intra and inter routes are different, the route with the smaller cost is preferred; if the area IDs of intra and inter routes are the same, the route with the larger area ID is preferred.\nThe undo rfc1583 compatible different-area-path prefer lower-cost command restores the default route selection rule in RFC 1583 compatible mode.\nThe rfc1583 non-compatible backbone-area-path prefer intra command changes the route selection rule in RFC 1583-incompatible mode to be the same as the default route selection rule on the ASBR. That is, when the area IDs of the intra and inter paths are the same and both areas are backbone areas, the intra-ASBR path is preferred.\nThe undo rfc1583 non-compatible backbone-area-path prefer intra command restores the route selection rule in RFC 1583 incompatible mode to the default rule. The rfc1583 compatible different-area-path prefer lower-cost command changes the route selection rule in RFC 1583-compatible mode to be the same as the default route selection rule on the ASBR. That is, if the area IDs of intra and inter routes are different, the route with the smaller cost is preferred; if the area IDs of intra and inter routes are the same, the route with the larger area ID is preferred. The undo rfc1583 compatible different-area-path prefer lower-cost command restores the default route selection rule in RFC 1583 compatible mode. The rfc1583 non-compatible backbone-area-path prefer intra command changes the route selection rule in RFC 1583-incompatible mode to be the same as the default route selection rule on the ASBR. That is, when the area IDs of the intra and inter paths are the same and both areas are backbone areas, the intra-ASBR path is preferred. The undo rfc1583 non-compatible backbone-area-path prefer intra command restores the route selection rule in RFC 1583 incompatible mode to the default rule. By default, OSPF route selection rules are not configured.",
    "CLIs": [
        "rfc1583 compatible different-area-path prefer lower-cost",
        "rfc1583 non-compatible backbone-area-path prefer intra",
        "undo rfc1583 compatible different-area-path prefer lower-cost",
        "undo rfc1583 non-compatible backbone-area-path prefer intra"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 1",
            "[*HUAWEI-ospf-1] undo rfc1583 compatible",
            "[*HUAWEI-ospf-1] rfc1583 non-compatible backbone-area-path prefer intra"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 1",
            "[*HUAWEI-ospf-1] rfc1583 compatible",
            "[*HUAWEI-ospf-1] rfc1583 compatible different-area-path prefer lower-cost"
        ]
    ],
    "ExtraInfo": ""
}