{
    "PageTitle": "route loop-detect ospf enable",
    "FuncDef": "The route loop-detect ospf enable command enables OSPF to detect loops of imported OSPF, IS-IS, and BGP routes.\nThe undo route loop-detect ospf enable command disables OSPF from detecting loops of imported OSPF, IS-IS, and BGP routes.\nThe route loop-detect ospf import-ospf enable command enables OSPF to detect loops of imported OSPF routes.\nThe undo route loop-detect ospf import-ospf enable command disables OSPF from detecting loops of imported OSPF routes. The route loop-detect ospf enable command enables OSPF to detect loops of imported OSPF, IS-IS, and BGP routes. The undo route loop-detect ospf enable command disables OSPF from detecting loops of imported OSPF, IS-IS, and BGP routes. The route loop-detect ospf import-ospf enable command enables OSPF to detect loops of imported OSPF routes. The undo route loop-detect ospf import-ospf enable command disables OSPF from detecting loops of imported OSPF routes. By default, loop detection is disabled for routes imported into OSPF.",
    "CLIs": [
        "route loop-detect ospf enable",
        "route loop-detect ospf import-ospf enable",
        "undo route loop-detect ospf enable",
        "undo route loop-detect ospf import-ospf enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route loop-detect ospf import-ospf enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route loop-detect ospf enable"
        ]
    ],
    "ExtraInfo": "When an OSPF process imports routes, routing loops are likely to occur. You can run the route loop-detect ospf [import-ospf] enable command to enable loop detection for imported OSPF routes. When a device detects that it has imported a route advertised by itself, the device advertises a large link cost for the route so that other devices can preferentially select another path after learning the route. This prevents routing loops."
}