{
    "PageTitle": "spf-schedule-interval",
    "FuncDef": "The spf-schedule-interval command sets the interval for OSPF to calculate routes.\nThe undo spf-schedule-interval command restores the default setting. The spf-schedule-interval command sets the interval for OSPF to calculate routes. The undo spf-schedule-interval command restores the default setting. By default, the intelligent timer is enabled. The maximum interval for the SPF calculation is 5000 ms, the initial interval is 50 ms, and the Holdtime interval is 200 ms.",
    "CLIs": [
        "spf-schedule-interval <interval1>",
        "spf-schedule-interval intelligent-timer <max-interval> <start-interval> <hold-interval> [ conservative ]",
        "spf-schedule-interval millisecond <interval2>",
        "undo spf-schedule-interval"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": [
        {
            "Parameters": "<interval1>",
            "Info": "Specifies the interval for OSPF to perform the SPF calculation.\nThe value is an integer that ranges from 1 to 10, in seconds."
        },
        {
            "Parameters": "intelligent-timer",
            "Info": "Sets the interval for the SPF calculation of OSPF through an intelligent timer.\n-"
        },
        {
            "Parameters": "<max-interval>",
            "Info": "Specifies the maximum interval for OSPF to perform the SPF calculation.\nThe value ranges from 1 to 300000, in milliseconds."
        },
        {
            "Parameters": "<start-interval>",
            "Info": "Specifies the initial interval for OSPF to perform the SPF calculation.\nThe value is an integer ranging from 1 to 60000, in milliseconds."
        },
        {
            "Parameters": "<hold-interval>",
            "Info": "Specifies the Holdtime interval for OSPF to perform the SPF calculation.\nThe value is an integer ranging from 1 to 60000, in milliseconds."
        },
        {
            "Parameters": "conservative",
            "Info": "Enables conservative mode for OSPF to perform the SPF calculation.\n-"
        },
        {
            "Parameters": "millisecond <interval2>",
            "Info": "Specifies the interval for OSPF to perform the SPF calculation.\nThe value ranges from 1 to 10000, in milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 100",
            "[*HUAWEI-ospf-100] spf-schedule-interval 6"
        ]
    ],
    "ExtraInfo": ""
}