{
    "PageTitle": "latency threshold",
    "FuncDef": "The latency threshold command configures the latency threshold for latency visualization.\nThe undo latency threshold command cancels the latency threshold configuration for latency visualization. The latency threshold command configures the latency threshold for latency visualization. The undo latency threshold command cancels the latency threshold configuration for latency visualization. By default, no latency threshold is configured for latency visualization. This command is supported only on the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.",
    "CLIs": [
        "latency threshold <threshold-value>",
        "undo latency threshold [ <threshold-value> ]"
    ],
    "ParentView": [
        "packet-event-monitor-latency-event view"
    ],
    "ParaDef": [
        {
            "Parameters": "<threshold-value>",
            "Info": "Specifies a latency threshold for latency visualization.\nFor the CE6855-48XS8CQ, CE6885-SAN, CE8855, CE8851-32CQ4BQ, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ:The value is an integer in the range from 768 to 1000000, in ns. The value must be 768 + 64n (n = 0, 1, 2...).\nFor the CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE8850-SAN, CE8851K, CE8851-32CQ8DQ-P and CE8850-HAM:The value is an integer in the range from 800 to 1000000, in ns. The value must be 800 + 32n (n = 0, 1, 2...)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] packet event monitor",
            "[*HUAWEI-packet-event-monitor] capture latency-event",
            "[*HUAWEI-packet-event-monitor-latency-event] latency threshold 800"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] packet event monitor",
            "[*HUAWEI-packet-event-monitor] capture latency-event",
            "[*HUAWEI-packet-event-monitor-latency-event] latency threshold 768"
        ]
    ],
    "ExtraInfo": ""
}