{
    "PageTitle": "source export host",
    "FuncDef": "The source export host command configures an analyzer address in the collector view.\nThe undo source export host command cancels the configuration of an analyzer address in the collector view. The source export host command configures an analyzer address in the collector view. The undo source export host command cancels the configuration of an analyzer address in the collector view. By default, no analyzer address is configured in the collector view.",
    "CLIs": [
        "source { ip <ip-address> | ipv6 <ipv6-address> } exporthost { ip <ip-address> | ipv6 <ipv6-address> } udp-port <port-number> [ vpn-instance <vpn-instance-name> ]",
        "undo source { ip <ip-address> | ipv6 <ipv6-address> } exporthost { ip <ip-address> | ipv6 <ipv6-address> } udp-port <port-number> [ vpn-instance <vpn-instance-name> ]",
        "source { ip <ip-address> } exporthost { ip <ip-address> } udp-port <port-number> [ vpn-instance <vpn-instance-name> ]",
        "undo source { ip <ip-address> } exporthost { ip <ip-address> } udp-port <port-number> [ vpn-instance <vpn-instance-name> ]"
    ],
    "ParentView": [
        "collector view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip <ip-address>",
            "Info": "Specify the source / destination IPv4 address of the output packet.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6 <ipv6-address>",
            "Info": "Specify the source / destination IPv6 address of the output packet.\n\n NOTE: This parameter is supported only on the CE6863H, CE6863H-K, CE6860-SAN, CE6866K, CE6866, CE6860-HAM, CE6855-48XS8CQ, CE6885-SAN, CE8850-SAN, CE8855, CE8851-32CQ4BQ, CE8851K, CE8851-32CQ8DQ-P, CE8850-HAM, CE6881H, CE6881H-K, CE6820H, CE6820H-K, CE6820S, CE6885, CE6885-T, CE6885-LL (standard forwarding mode) and CE6863E-48S8CQ.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "udp-port <port-number>",
            "Info": "Specify the destination UDP port number of the output packet.\nThe value is an integer that ranges from 1 to 65535."
        },
        {
            "Parameters": "vpn-instance <vpn-instance-name>",
            "Info": "Specify the VPN instance name of the output packet.\nThe value is a string of 1 to 31 case-sensitive characters. The VPN instance name cannot be _public_. The character string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI] commit",
            "[~HUAWEI] collector collect 1",
            "[~HUAWEI-collect-1] source ip 192.168.1.2 export host ip 10.0.0.2 udp-port 100 vpn-instance vpn1"
        ]
    ],
    "ExtraInfo": "After the analyzer is configured in the system view, you need to specify the source address, destination address, and UDP port number of the analyzer."
}